[{"heading":" Boy, was I surprised!","review":"Okay, I am not from India, not even close. I am from Scandinavia. Before Lagaan I had never watched any Hindi movies of any kind. I know about 3 words from the hindi language. And I don't like musicals much. I viewed the movie on a DVD of rather poor quality compared to the state of the art DVDs I am used to. And I was told the movie lasted close to 4(!) hours... I figured this would be a complete waste of time... BOY was I wrong! This movie is completely the opposite! It is just amazing! Mr. Gowariker has selected an incredible cast with Aamir Khan in the lead. He makes an stunning performance as the village rebel, Bhuvan. He tries to unite the village in a struggle for life against the greedy Britons. The Britons exploit the villages by collecting lagaan (tax). This means that most of the harvest surplus is gone and there is just enough left for food for the farmers themselves. It's a classic war between \"David\", the native villagers of India, and \"Goliath\", the powerful and greedy Britons. But what makes it really interesting is that this war is fought in a Cricket arena. This is a challenge from the Britons, who are well known with Cricket, against the village, where most people have never laid eyes upon a cricket bat. If the villagers win, there will be no lagaan at all, for three years! And if the Britons win, they will collect triple lagaan, which will mean the end of the village.  The stakes could not be higher!!I can't remember a movie being this thrilling and having so much life in it. And the music has a huge impact thanks to the great voices of Udit Narayan, Lata Mangeshkar etc. And the dancing is a chapter in itself! Few or none will leave this movie not remembering the song \"Mitwa, sun Mitwa\". It is a must see for everyone, inside and outside of India. And this movies has been totally righteously nominated for an Oscar too, and I wouldn't be surprised if it goes all the way to the top. It has my vote! It gets 10 out of 10 from me. Excellent!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" As a sports movie, \"Lagaan\" is dramatized with great élan and suspense","review":"The setting is historical The year is 1893 The British Raj imposes heavy taxes on the poor villagers despite all the problems droughts have caused on their income An arrogant army captainunknown to him that his sister has fallen in love with a sensitive idealisticconfident in his countrymen's ability, offers the people relief if they can beat the fearsome British team at a game of cricket Despite its closeness to the conventions, \"Lagaan\" proved to be a break-out film Besides the graceful and enchanting attractions of the song-and-dance sequences, it has a plot carefully fashioned to a special kind of audienceaudience who likes sports movies They are minor characters compared to the captain's pretty sister (Rachel Shelley), who not only upholds the British tradition of fair play but also loses her heart to the handsome Indian hero","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Only Indian film in Channel 4's 50 Films to See Before you Die. No 55 in Empire magazines 100 Best Films of World Cinema. Time magazine's The All-TIME 25 Best Sports Movies","review":"I still remember the long queue for the advanve booking of this film. Saw this 3 times in theatre. Then so many times on channel that I lost the count of it. What a lavish n enormous entertainment man. It is more than 3 hours long but doesn't bore u for even a minute. Awesome direction. Awesome screenplay. Awesome editing. Awesome cinematography. Awesome acting by all. Aamir khan was too good man. What an amazing performance of his as teams captain Bhuvan. This movie is more than just a sports movie. This is a great sports movie and even if you don't like sports, it is still a great movie. I highly recommend this movie to everyone. It is a movie that you should definitely see if you're down because it is a movie about hope. It is also about victory. Lovely songs n awesome music.In 2010, the film was ranked No. 55 in Empire magazines \"The 100 Best Films of World Cinema\". In 2011, it was listed in Time magazine's special \"The All-TIME 25 Best Sports Movies\". Lagaan was listed as number 14 on Channel 4's \"50 Films to See Before you Die\" and was the only Indian film to be listed.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Magnificent and Overwhelming Fairytale – An Oscar Deserving","review":"In 1893, India was a colony of England. The starving native farmers had to pay an imposed tax to the British soldiers for the protection of their lands, delivering most of their harvest to the British Queen. In those years, the lands were very dry due to the lack of rain, and the inhabitants of Champaner decide to request to their Rajah Puran Singh (Kulbhushan Kharbanda) to waive the taxes. While waiting for the Rajah, Bhuvan (Aamir Khan), the beloved friend of Gauri (Gracy Singh), comments that the silly game of cricket was a stupid game, comparable to the Indian child game 'gilli-danda'. The nasty and arrogant Captain Andrew Russell (Paul Blackthorne), who had had a previous discussion with Bhuvan, listens to his comment and challenges Bhuvan to play a match against the British team, imposing the following condition: if the natives win the game, they would not need to pay Lagaan for the next three years. Otherwise, they would triplicate their payment in that year. Bhuvan accepts the bet despite of the opinion of his people. The sister of Captain Russell, Elizabeth Russell (Rachel Shelley), finds the competition unfair to the Indians and decides to help Bhuvan and his friends, teaching them how to play cricket. This movie is a magnificent and overwhelming fairytale. It really deserved an Oscar nomination! The nice and well-directed story has wonderful songs and interpretations, romance, treason, dispute, drama, beautiful messages, outstanding choreography, being a stunning film indicated as family entertainment. The expensive Brazilian DVD is a shame, showing a total lack of respect of the 'Columbia Tristar Home Video' with the Brazilian costumers: the important songs do not have subtitles in Portuguese. I changed the option in the 'Menu' to 'English', and there were subtitles in English. At least in the opinion of the ridiculous Columbia representatives, Brazilians shall learn English first to understand the wonderful lyrics sang in Hindi. I feel really sorry for those who cannot understand English, since they will miss the meaning of these songs. It is amazing how 225 minutes running time passes so fast when you see such a marvelous movie. My vote is ten.Title (Brazil): 'Lagaan – A Coragem de Um Povo' ('Lagaan – The Courage of a People')","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Lagaan Once Upon A Time In India","review":"This  movie not only opened my eyes to the beatuies of india but also the hearts of India. I fell in love with this movie at once and I feel very close to all of the characters I know them and feel for them. The dancing and singing made my heart pound and my heart overwhelmed by the matchless beauty and I was imagining myself following along with Gauri. I love this story and I could watch it daily and never tire of the beauty it holds. I have always loved indian people and the culture which they live, I am American and have never visited India,soon I will visit in person and dreams of going there will no longer tug at me . I hope to one day perform the dances as well as those in the movie.   I really loved that in the movie the characters were faced with such hardship but somehow they were of cheer and sang together and lifted one anothers spirits.I love this movie some may tire of its length but I wish it would continue forever. I want to be a part of it.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Just One Word: Wow!","review":"LAGAAN (4+ outta 5 stars) Years of subjugation and unfair taxation by the British Empire come to a head and the inhabitants of a small Indian farming community face off against their evil oppressors... in a cricket match??? This may seem like a ridiculous idea for a movie (and I won't even mention the fact that it's a musical) but this was the most exciting and wonderful movie I've seen in quite some time. Yes, it all comes down to a cricket match between the upper class British twits and the neophyte Indian farmers... and the movie is almost FOUR HOURS long... but, wow... what a movie this is! The slow building of trust and community among the usually-bickering villagers as they prepare for their ultimate battle is both fascinating and inspiring. It's like watching The Magnificent Seven or The Wild Bunch gathering together for a big showdown... only instead of shooting and killing... there's cricket! A cocky British Captain (Paul Blackthorne) makes a deal with the proud, young Bhuvan (Aamir Khan): he will give the entire region three years of no taxes if they can defeat the British cricket team... but if they lose they have to pay triple tax this year. Since there has been no rain all season and they can't even pay their regular taxes... this becomes a tense, do-or-die situation. Aamir Khan is terrific in the lead (he resembles a cross between Tony Curtis, Peter Sellers and Al Pacino). He is always believable, whether trying to inspire his fellow villagers or facing his English enemies in stony silence or wooing his the lovely Gauri (Gracy Singh) with song and dance. Great story! Great music! Don't miss this one!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Perfect First Time Bollywood Treat","review":"This was my first full-fledged trip into Bollywood and I couldn't have asked for a better entry. While there were some inconsistencies in sound, overall I loved the picture. Some of the songs and dances were breathtaking and emotionally charged. In particular the number where Bhuvan and the young boy are sitting on a hill and they're shrugging their shoulders, soon getting the village into the act. The other number where Bhuvan and Gauri re-enact the love of Krishna and Radha in exquisite dancing. Also there were many moments of stunning, breathtaking images, including the women of the village seated in the temple praying for salvation. Absolutely stunning. While I feel some judicious pruning could have trimmed the nearly 4 hour long version I watched (the DVD of which included an additional 17 minutes cut from this version) the picture did not seem nearly as long as it really was. Aamir Khan is such an instantly likable presence and Gracy Singh is simply irresistible as Gauri. Paul Blackthorne was a hilarious, old-school villain right out of a penny dreadful melodrama  and I mean this as a compliment. Rachel Shelley's Elizabeth was a perfect blend of Victorian reserved beauty and free spirit and noble in her heartbreak. So many other performances ran the gamut from old school \"b\" stereotypical characters to some original ideas.The blending of melodrama (in its purest sense) true comedic moments (the hen keeper), self and enlightenment culminated in the scene where Bhuvan shocks the village by touching an untouchable; his stirring, heartfelt speech about brotherhood and putting away castes shaming the village into enlightenment.Some of the criticism leveled at Lagaan is (I believe) unduly harsh. This is a charming movie and a perfect introduction into the joys of Bollywood.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A must see for all Indian cricket fans!","review":"Initially I was warned about the length of the movie-3hrs and 50 mins.But believe me, its worth it.There is a refreshing Indian-ness about the movie,which is welcome after a recent bout of Hollywood remakes in Hindi that have become such an eye-sore.The emotion that Indians share about cricket is effectively taken advantage of(the cricket match played between villagers of Champaner and the British officers which forms the climax ,extends to about an hour and a half).The best part of the movie is the characterization of the eleven players (villagers).Aamir Khan is at his best in this movie and Gracie Singh lives the role of Gauri.The acting talents of the British actors esp. that of the officer Captain Russel(played by Paul Blackthorne) is notable.There was never a boring moment in the film, the dialogues and songs' lyrics are very meaningful.And lastly I must appreciate the work behind the entire cricket sequence as it covers most of the aspects of the game and not to mention - match fixing,sledging,body line bowling ,making it gripping till the last ball! A must see for Indian cricket fans!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" The Best Indian Movie of the Year 2001","review":"I initially gave this movie a miss after I was totally disappointed by \"Asoka\". The latter was hugely advertised but I don't find it good at all.I finally saw \"Lagaan\" after a friend told me that this movie was actually good. And she was right. I borrowed the DVD from the library and had to see the movie in 2 sessions due to it's almost 4-hour-long running time. But it was worth it!The cricket game was captivating. I didn't know anything about cricket but before the movie ended, I felt that I almost understand the game!I'm not Indian and I seldom see Indian movie even though I love foreign movies, especially Japanese. But \"Lagaan\" is truly the best Indian movie I've ever seen, or at least the best of the year 2001.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A cinematic masterpiece that will take your breath away...","review":"Sony Entertainment's Lagaan is more an experience than a movie.Indian actor Aamir Khan's home production is a cinematic experience which highlights Indian cinema to the hilt, while weaving a tale set in Champaner during the time of the British Empire's presence which deals with Lagaan (the tax of the land) and a village's upheaval against its oppressors.The film revolves mainly around three characters namely Bhuvan (Aamir Khan), Gauri (debutante Gracey Singh) and Elizabeth (British actress Rachel Shelley), and deals with Bhuvan's spirited fight to defend what is his birthright, as he embroils the entire village into a magnitude of problems which inadvertently ends up being their only escape from the tyranny under which they reside. Gauri is the simple village girl who loyally stands behind the man she loves yet cannot profess her love to, while Elizabeth is the beautiful sister of the British Lieutenant and the complication who aids the village in their fight against injustice.The first half sets the scene beautifully, explaining what Lagaan is, introducing the characters and gradually pulling the audience into this period and place, literally taking the viewer into Champaner through cinematography which highlights the locales and sets which establish the standard of living. It makes you feel for the characters, believe in the villagers and draws you into the celluloid created world, while the second presents to you their turmoil, dawns on you what is at stake and whisks you away in a tornado of emotions and rising spirits.The opening scenes are more congruent to joining a conversation midway, as from the moment you are thrust into 1893's India, you gain footing and a sense of atmosphere, feeling at ease as the camera pans across its setting for the movie, drifting into the journey that will hold your attention for the duration of the film. Apart from familiarising the viewer with its characters, the first half also takes you back with its breathtakingly beautiful cinematography and fitting background score. The characters are established, the situation presented and relationships etched, with each scene rhythmically flowing from one to the other in a continuos motion.The second half is less involved in justifying its characters and aims more towards culminating the scene which has been set in the first. By this time you are already a part of this world and your emotions have already been stirred, now they are put to the test as the events which will determine the entire crux of the film begin and get the viewer involved.The romantic triangle between Bhuvan, Gauri and Elizabeth is expertly handled. The beauty of its predicament is that no one feels a loss by the end of the film, and director Ashutosh Gowariker beautifully justifies eternal love (but not necessarily requitted love) through drawing a comparison with the spiritual romance of the Hindu god Krishna and Radha. A delightfully delicately handled scene and situation gives birth to the foundation which will resolve the triangle in a manner leaving warmth in the viewer's heart.Aamir Khan is a revelation. His acting is superb and be it the conviction and fire in his eyes, the way he draws breaths from the air of the abode he calls home or even gulps at the atrocities he witnesses, he has become Bhuvan completely. His portrayal is such that it puts you inside Bhuvan's psyche and enables the viewer to understand the character from his demeanour alone. His piercing eyes stare sharply like razor blades, cutting through the camera and leave a haunting impression on an unsuspecting audience, drawing them more and more deeper into his world.Gracey Singh performs ably and is also an extremely graceful dancer, as particularly evident in the Radha Kaise Na Jale song. She acts with her eyes, eyebrows, nose, mouth, all of her and gives to the role of Gauri completely, giving a debut performance of high calibre.Rachel Shelley makes her presence felt like an ethereal spirit. Apart from looking stunning she adds to whichever frame she is in with panache and style. Her crossover to Indian cinema, or indeed to this film, is delicately handled and a feat to be applauded. To light a face like Shelley's in the same frame as the villagers without making one or the other look considerably darker or awkwardly paler, is a difficult task in itself. But the cinematography, the lighting and make up is such that the characters come alive as physical presences which complement each other, as do Aamir Khan and Rachel Shelley. Her interactions with Bhuvan and the villagers are intricately handled and executed wonderfully, and her inclusion in the O Rey Chori song is poetry on screen. To make a Western character dance in Indian cinema without causing a giggle from the audience or without it appearing unnatural is also something which needs to be handled with careful thought and the result is such that this song picturisation alone will invoke discussion on how beautifully it has been shot.Andrew Russell's boisterous character is brought to life by Paul Blackthorne, as he slides perfectly under the skin of a character that should reflect British pride and be menacing and hostile. He performs well and bounces off the supporting cast with utmost ease. The entire ensemble of supporting cast are deserved of mention, and particularly Raghuveer Yadav, who dynamically brings the character of Bhura across effectively and convincingly with edge.A R Rahman is the composer who has scored for many Indian and South Indian films, and this time too he does not betray his reputation of being a modern day Mozart. He literally teases then grabs you with his music, first resonating your veins, then breaths and finally allowing it to explode and burst through your body like an energy force, flowing in sync with your heartbeat. It's lilting melody, fresh sound and courageous allegros mesmerise and reflect the movie's emotions and spirit of hope. The songs are very well picturised and choreography is excellent, particularly Ghanan Ghanan, O Mitwa and O Rey Chori. The bhajan O Paalanhaare is bewitchingly lit and shot, injecting a spiritual vibe as candles' flickering flames hypnotise every viewer whose eyes dance to its command.The film belongs to Aamir and Ashutosh Gowariker all the way. Direction is superb and results in what is a true mark on Indian cinema, held together by Aamir's awe-inspiring performance.Lagaan is about hope, courage, fighting against injustice, the human spirit and about Indians. You enter the cinema to be entertained, and leave with a piece of cinematic history being firmly etched in your heart.Fuad Omar.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" the theatre cheered","review":"This is actually the first ever film I have seen where the audience clapped cheered and booed effectively as if they were a part of the actual proceedings in the film. I heard someone say that they felt that they were really at a cricket match. I loved the movie even though admittedly at the time (surprising for an Indian) I didn't know cricket at all...I learned while watching it with the help of a friend but also found I didn't need to! It certainly renewed my interest and made mea cricket fan soon enough, the next match that year I watched with grave interest.About the fikm, the acting was good. Rachel Shelly and Paul Blackthorne were impressive and unlike in other Hindi films where they are usually clichéd versions of foreign characters, they were very drawn out believable characters. Aamir Khan was definitely the star attraction (obviously) as in any case it was 'his movie' but honestly he was very good, one of hsi best performances i'd personally say. Gauri was given very little to do in the movie but she did stand out in her own way. The supporting cast were all excellent in each of their roles, although some characters were a bit too starkly depicted. The British cast on the other hand had precious little to do except look foreboding.The setting in the Gujrati village and country was beautiful. The sets were historically accurate I've been told and the backdrop just right for the match and one would it imagine it fit into the time frame suggested. The costumes were also appropriate. I especially liked that scene where Elisabeth imagines Aamir in a suit, it worked because being who she is of course shed see him like that.)Some historians might nitpick on small points, but they were so minor that the rest of the story overshadowed these errors. At first I wondered whether foreign viewers would understand it what the unusual concept of musical numbers, but most seem to have understood the game of cricket (non cricket playing countries I mean) and the historical context as well and seem to have also taken the musical numbers in their stride.The only thing that got to me was the length of the movie. I really wish that they had done some serious editing, it just ran too long and the cricket match was too dragged out. It should have either focused more on the cricket match for the majority of the film, or reduced the footage of the rest of the film to balance it out. I saw many scenes that could have been edited out and were totally unnecessary.The songs were enjoyable and only one or two were unnecessary and could have been cut down or deleted entirely, like the 'Radha Kaise Na Jale' and the song where both girls sing. Honestly this movie was one Hindi movie that did not require many songs at all if at all. A background score maybe but not 6 songs. It got tedious and it gets on the nerves especially when you've been sitting in the theatre for 2 hours and you know that there is 1 more hour to go. Luckily people with DVDs will be able to fast forward!Although Predictable in places with characters being over-drawn or under-drawn and everyone knew the ending that was inevitable, ending, (it isn't much of a long shot at all) but we watched it for the thrill of it anyway.The overall effect the movie was so good that I fully believe that it deserved a nomination and I never say that about most Hindi movies. Even though it did not win I'm very proud of this movie.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Great Art Movie !","review":"It is seldom in this modern era of IT generation that a long movie surpassing three hours of running time and without a show of synthetic acting, vulgarity and cheap comedy, captivates the audience to stick to their seats. WELL DONE Gowarikar ...... WELL DONE Amir Khan ....... Mr. Gowarikar, please note that if this sublime film had been directed by a British or American director like Danny Boyle or Richard Attenborough .... the Oscars would have definitely flown into the laps of the director and the protagonist actor. This is not to say that your directorial skills lack the excellence to win the coveted Academy Awards, but it is to mention the inherent bias and prejudice which prevails among the jury of the Oscar Award Committee towards directors, producers and actors of the Sub-Continent namely India. Mother India (1957) met the same fate from the then jury of Academy Awards committee who simply rejected its nomination for the Oscars on the grounds that it is laden with too much songs, formulaic in nature. Besides, the excellent performance of Amir Khan as an aggressive and challenging native youth 'Bhavan'; Rachael Shelley has put up a remarkable and evocatively strong performance as the suave young British lady Elizabeth Russell, who aspires to help out the hapless villagers from the cunning guile of his brother, Captain Russel. Now what can one say if the members of the Oscar awarding committee do not understand the meanings of wordings of the emotionally focused songs (due to language and culture difference). It is a handicap with them and not with the local Indian movie making team. Keeping aside this injustice, the movie characterizes pure and pristine feelings, emotions, struggle and fighting spirit of a raw and unskilled cricket team of illiterate Indian villagers who capitalized the opportunity to get waived the odious land revenue tax, with exacting standards of will power and perseverance.After a long time, there is an Indian movie bred with the contents found in the Indian films of yester years.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Very entertaining film","review":"1893.  In a small farming community in India stands a British cantonment commanded by the cruel Captain Russell.  When the Raja refuses to bow to his demands to eat meat he doubles the tax that the community must pay  even though the lack of rain means the community can barely pay the normal rate. When the villagers beg for mercy Russell challenges them to a cricket match  to win means the tax is waived, to lose means it is trebled.  One man in the village, Bhuvan takes up the bet and must rally the village to learn the game and win at all costs.I was given this to watch because I had told someone at work that Bollywood movies are essentially a love story where the parents disapprove but it all gets sorted in a big dance number.  So she gave me this to widen my knowledge.  At first read of the plot I thought to myself `this is the air up there' with cricket'  then I saw the 3½ hour running time!  But I said I'd watch it out of courtesy.However let me tell you that the time flew by really quickly.  It only dragged occasionally but for most of the time I was really entertained by the plot and in some cases gripped by the drama.  First of all  I'm not a fan of cricket but this could really be any sport as that is not important to the story.  The plot may be the old `underdog' chestnut but it is still very well done with lots of energy and lots of nice touches that take the chestnut and add just enough difference to it to make it seem fresh.This main plot also has various stories underneath.  The main one being the romance between Bhuvan and Gauri which is complicated by the arrival of Elizabeth, who also falls for Bhuvan.  This is well handled and is very involving  although I don't really like Bollywood song and dance numbers very much, so these slowed proceedings a little for me.  Although many of the songs are comic but also very well choreographed.The film is really helped by the constant interweaving of comedy in the form of the villagers' characters  they fight, they fall down they argue etc  but it is still amusing if not roaringly funny.  However the focus on their plight is never lost  the drama is kept running just below the surface at all times and the final hour is tense.  Tense!  A cricket match!  I didn't expect it to be exciting but at times you are on the edge of your seat  and it isn't as cliched a game as I'd expected it to be!It does have some flaws of course  the film is a little heavy handed at first in making sure we know the British are bad, it is done too early and too quickly  couldn't we have been led to that conclusion rather than pushed straight away?  The songs I found to sound very similar to oneanother  but this may be the fact I don't like them.  To add to this the sound quality between the songs and the dialogue was very different  the songs all had a very studio feel when heard beside the dialogue.  Also the plot is a little cliched  although I after watching it I did think that it was well done and like I said, had nice touches (which I won't tell) that upped the drama  even if you THINK you know how it'll end.But over an almost 4 hr running time, minor flaws can be forgiven.  Khan is a good Bollywood lead but the film helps him by not making him invincible  rather it does show him making mistakes etc.  Singh is good as Gauri even if she is a standard `wide eyes' Bollywood starlet!  Surprisingly good was `Holby City' actor Paul Blackthorne who not only manages to give a really mean performance but does it in both Hindi and English.  He also looks a bit like Sean Connery  or at least he did to me!Overall this manages to make the long running time fly by quite easily  a rare feat for a movie these days.  It is exciting, romantic and comic.  It may have it's flaws but on the whole it is a very entertaining film in many ways.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Just saw it for the nth time (n > 25)","review":"This is one of the best entertainers from Bollywood. It has a moving story, excellent music, amazing performances and great dances. All the ingredients are perfectly balanced, resulting in a true masterpiece.To the detractors of this movie(esp the American ones). Granted, on the average, your Hollywood movies are way better than bollywood ones. But your best movies are not even close to the good ones of Bollywood. The reason you may not be able to appreciate good movies like this is that in the US, your life is one dimensional and you don't have the different experiences that people who grow up in India have. For you guys (americans), the world starts from California on the west and ends at NY on the east. Movies are to be enjoyed and not analyzed. If you are of the thinking type, there are lot of other things which you can analyze (proof of Fermat's last theorem for example). Don't apply your analytical skills to movies.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A game of honour, a game of the lifetime","review":"It's my sixth Bollywood film, and I have fallen in love with this one as much as with the others. It's not as warm and colorful as K3G or as funny as Main Hoon Na, but the story is so involving that I spent almost four hours anxiously following the main characters' efforts to win the game. I almost started to bite my nails at the end, keeping thumbs up for Bhuvan and his friends! The strength of the film lies in the fact that it shows how important cooperation, faith and effort are if you want to achieve something in your life. And although I, as a Pole, have no idea whatsoever about the rules of the game of cricket, I was not bored for a second during the second part of the movie - thanks to the director's ability to introduce tension at the right moments. I liked the songs a lot and I think they've been nicely choreographed. The camera work is good, emphasizing the dryness of the land and the hopelessness of the people anxiously waiting for the rain. To sum up, it's a good film with an interesting plot, some catchy music and nice acting. A must-see for a Bollywood fan.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Once Upon A Time In India!","review":"You can add the name of Ashutosh Gowatrikar to the list of the new generation of Indian Film Directors. An amazing list with the likes of Aditya Chopra (Mohabbatein, Dilwale Dulhania Le Jayenge), Farhan Akhtar (Dil Chahta Hai, Lakshya), Karan Johar (Kabhi Khushi Kabhie Gham, Kuch Kuch Hota Hai), Sooraj Barjatya (Maine Pyar Kiya, Hum Aapke Hain Kaun, Hum Saath Saath Hain), Sanjay Leela Bhansali (Khamoshi, Hum Dil De Chuke Sanam). And Now Ashutosh Gowatrikar (Lagaan).When I went to see Lagaan in the theater, I had certain expectations of what the story was going to be like. But as I watched the film I realized that it was nothing like what I thought. The story was totally unexpected. It was quite a surprise. Never before has a film done that, usually the trailers, promos or songs of an Indian film give the story away and you get an idea of what the film is going to be like, but Lagaan was a total surprise.The story is very well told and each character is well etched. Aamir Khan gives one of his best performances in the film. New find Gracy Singh gives an excellent performance. The Direction and Story of Ashutosh Gowatrikar are beyond words. After watching the film, it is very easy to see why this film was sent to the Oscars for the Best Foreign Film category.A great movie, definitely worth watching at least 10 or 12 times.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Bollywood operatic Epic : A must watch for movie lovers","review":"First things first.its runtime is nearly 3 1/2 - 4 hours.i watched 4 hour movies before,like Sergio Leone's Once Upon a time in the West and Coppola's Apocalypse Now (special editions).even though its lengthy,i never felt bored.in fact i would love to watch it one more time.its really an Epic film in terms of its grand operatic melodramatic emotions and its musical songs.Like Titanic,the first half is about love story & how he formed the team and second half is about exciting emotional scenes.the climax is really nail biting and adrenaline pumping.the lead actor Aamir khan who looks like Tom Hanks,is fantastic.A must watch for the movie lovers.Don't miss it","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" the play goes on","review":"I saw this in a Paris cinema on a Sunday afternoon. The French audience loved it, as did I. They clapped at the intermission and they clapped to the music while the credits were running. I thought the song and dance routines were great, providing the perfect bridge to a semi-mythologised narrative. The audience sometimes laughed at the exaggeration and coincidence of the plot, especially at the end -- the rain, the Englishwoman who never married. Astonishingly they even got the joke about 'this country will be the future of this game'. It seems that lack of knowledge of cricket and subtitles with words like 'runs', 'overs' and 'no ball' were not a handicap. Of course the pillorying of the British didn't go down badly here. I especially liked the representation of the Raj, not as a moderrnising influence, but as straight agrarian civilisation, extraction of the food from peasants' mouths.I was on the edge of tears throughout. Why? Because this was the first Indian production that to my knowledge has won a world audience. And it provided a new sentimental bridge to the world for my own trajectory. I could see how Bollywood is the only film-making centre that actually could do what Hollywood does, but in its own distinctive way, with a much more universal human interest. And the music of course. The plot and characters were caricatured, but that made it all that more accessible and touching, like a medieval passion play. I loved the symbolic roles contrived for the Muslim, the Untouchable, the Sikh, the collaborator, the headman, the intellectual etc.Above all, the plot of learning the game and beating the masters was perfect. It was CLR James to the tee. Beyond a Boundary indeed , with society in the shape of the crowd as much of the action as the players. And the idea of the bet! Play comes from an Old English word whose first meaning is to wager. The idea of life as a game of negotiated risks is very widespread among hunter-gatherers, where people have to be trained to respond instantly to the flash of white tail in the bush. Obviously it sometimes pays for peasants (and citydwellers) to pick up these skills. The play goes on.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Spectacular and overlong Indian musical film","review":"The movie is nice but a little boring because of its runtime is three hours and some and it tires until the person most patient. The yarn concerns about inhabitants of a village whose leader (Aamir Khan got his ears pierced so that he could actually wear earrings) asks the English deputies for the exemption a tax called Lagaan . Officer at command (Paul Blackthorne) will free them for three years if they earn a cricket match . The officer's sister (Rachel Shelley) will teach them to play cricket game .The film has an excellent musical scenario , the choreography is fantastic , the songs are enjoyable . The movie was shot in villages of Bhuj (Gujarat); Bhuj was destroyed in an earthquake on 26th January 2001, six months after the movie was shot . The first Bollywood production to use synchronized sound , most Indian films are dubbed entirely in the studio in the process . Bollywood has got a lot of experience in this kind of movies . The Bollywood center is located in Bombay , where has been shot hundreds of films .The flick mingles comedy , songs, music , cricket sport, a love story , joy and a lot of fun . The movie is an India/British production though mostly produced by the first country and specially by the main starring : Aamir Khan , a true idol in India with millions of fans. The film will appeal to the musical genre buffs and cricket lovers. Rating: 6'5/10 good . Better than average , well worth watching.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Had 10- to 13- year old kids cheering","review":"I have a school club where I've forbidden all English Language films, so we watch French, German, Korean films, what have you. We never fail to see this one every year and the reaction is always the same, they love it despite the four hour running time. It's a tribute to the movie's appeal, the actors' talent and the movie-maker's storytelling skills. Another wonderful thing about the movie is that the mysterious sport called cricket becomes clearer to the puzzled Filipino. I may have one minor complaint, the musical numbers are full of energy and enthusiasm, but when the British Lady sings it becomes a parody of a Western musical. Otherwise, every Filipino I know who's seen it, young or old, loves it.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" I loved this movie!","review":"I did not even know what the term Bollywood meant. I had to look it up just now. So I am not gonna try to judge it based on where it was made. I will just tell you what I thought of it as a movie.I have been sick and was ready to head back to bed when my brother said that this movie that just started seems pretty good. I figured I would watch a few minutes and then lay down for my well needed rest. Well, almost 4 hours later, I'm looking up the movie on IMDb.I don't understand the game of cricket at all and, honestly, could care less. I was captivated by the characters and their plight. I was rooting for the underdog The songs were so touching and spiritual. The dance scenes, especially the love dance one, were beautiful.I have read many comments on here that the movie was badly lip sang. I disagree. Until I read it here I hadn't noticed it at all.Overall, I cheered, I laughed at a few of the zanier characters, and I also found myself streaming tears for the young boy. I found myself experiencing the same emotions the English woman was showing during the game.I think they tied everything together well in the end. I ended the movie feeling like I wanted to recommend it to others.So see the movie!! OK. I am finally off to bed.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the best Hindi movies I have ever seen!","review":"Lagaan rates as one of my top three favorite Hindi movies, along with Devdas and Mohabbatein. Though I am a Caucasian American, my Kutchi wife has evangelized me with scores of Hindi movies in the almost six years of our marriage. While many of them are wonderful (Pardes, DDLJ, Phir Bi Dil Hai Hindustani, Umrao Jaan, Dil Se, Hum Dil De Chuke Sanam, Sholay, Don, Dev, 1942, Roja, Hey Ram, Bombay, Mere Naam Joker, and many, many more), but few stand out as wonderfully written, directed, acted, choreographed, filmed and translated as Lagaan. I heartily recommend it to anyone curious about Hindi films.Aamir Khan's attention to detail is fantastic, as is his energetic portrayal of a young man fed up with the status quo and willing to risk all for a chance to cast the burdensome yoke of British taxation off his village. Revolution without significant bloodshed, beautiful cinematography and choreography, excellent costuming, an intriguing love triangle, and a captivating story line ... all this and an edge-of-your-seat cricket match! Who could ask for more?!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Once upon a time in India ....","review":"Lagaan is a tale from India in the times were the Indian people had to pay high taxes to the British rulers, since India was considered to be a ''piece'' of the British Empire. In one village where Bhuvan, Gauri and other friends live, they asked for the British rulers to not pay the taxes of that year, since the rains didn't come. The British decides to challenge the guys of that village to play cricket with them: if the Indians win, their wish will become true; if it doesn't, they will have to pay even bigger taxes to the British officers. I think 'Lagaan'is a masterpiece and it was one of the first Indian movies I watched in my life. The costumes and scenarios are beautiful as the musics sang.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Nutshell Review: Lagaan","review":"Having won multiple awards and gotten itself nominated in the 2002 Academy Awards in the Best Foreign Language Film category, my interest in Lagaan was actually in wanting to discover more of writer-director Ashutosh Gowariker's works, having seen his latest movie Jodha Akbar, and having bought Swades: We, the People starring Shah Rukh Khan, still unwatched.I've never been a fan of cricket and have never understood the rules, but I suppose after the time you're through with Lagaan, you'll learn at least the basics enough to enjoy the game. No doubt my interest in this sport has been piqued, and non-fans shouldn't steer away from the movie, because knowledge of the sport is not a pre-requisite for you to enjoy this wonderful gem of a sports movie running close to a whopping 3.5 hours (and I heard in the collector's edition, it runs to 4?)Set in British India, we learn that Lagaan is a form of taxation that the villagers have to pay to their Rajas, who in turn pay the British for protection against, erm, invading forces and rivals from other Rajas. In fact, the British were double crossing everyone during their occupation of the country, and bad weather makes the lives of the villagers even more hard pressed since they have zero crops to sell. Every village needs a folk hero, and herein lies Bhuvan (Aamir Khan) who decides to step into the shoes of one, not because of bravado, but because of the atrocities dished out by the British against his fellow countrymen, especially when taxes for the year have been doubled.So the stakes are raised in a game of cricket. Defeat the British, led by Captain Andrew Russell (Paul Blackthorne) and have a tax waver of 3 years for the entire province, or if they lose, then their Lagaan will be tripled. And you don't need a rocket scientist to tell you that when the impoverished have their backs against the corner, they have little choice but to fight back. However, after years of being oppressed and cowering in the face of hardship, you'll need that bright spark or two to shake things up and bring everyone to their senses that Hope is something they have which they can turn into reality if they work at it.The storyline might seem cliché as per the usual sports movies, where our hero Bhuvan has to assemble a team of good men each with their own special farming background which can be incorporated into the game, and recruitment always is a challenge when nobody believes you, and thinks you're the troublemaker who started it all. There are leaders, and there are followers, and some good time is invested to develop this challenge, as well as to explore the plight of the villagers in more detail. The villains of the movie, those pompous Brits personified by Captain Russell with his nose perpetually in the air all the time, are put in very bad light with their looking down of the natives as slaves.But even amongst themselves, the Indians too have their infamous caste system, and this was touched upon when Bhuvan chooses to adopt the more meritocratic route in player selection, and this message undoubtedly stands out. I can't comment much on these themes that Gowariker touch upon in his films, such as that of religious tolerance in Jodha Akbar, but it seems likely that he had incorporated these knowing that his films do appeal to the masses, and therefore serve as a reminder to everyone.While the last 1.5 hours get devoted to the game, where two proud man go head to head against each other with their team, and team members having their own personal vendettas worked out during the matches, it never for a minute played out in a boring manner. In fact, it was entertaining to watch them go through the paces of the game in 101 terms, and from there, those unfamiliar with cricket will likely be able to pick up the basics. Even if the sport is not your cup of tea, its delivery will still appeal to you, as do the usual Bollywood staple of dance and song, as composed by renowned A.R. Rahman - I particularly liked the segment where any self-respective sports movie will have - the training montage, and with a love triangle of sorts fused between Bhuvan, his childhood sweetheart Gauri (Gracy Singh) and Englishwoman Elizabeth Russell (Rachel Shelley), sister of the villagers' enemy but one who decides to teach them the game so that they can get on equal terms with her countrymen.Despite its clichés, Lagaan is wonderful entertainment, and you will not realize the movie's running length, as you'll be engrossed in what transpires, and will find yourself rooting for the clear underdogs as they go about trying to battle oppression in unfamiliar terms. Colourful songs and charismatic folk characters, Lagaan unquestionably reinforces my love for Bollywood!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" It was totally an uplifting and an inspiring film...","review":"I'm not an Indian myself, I'm a Filipina and this is actually the first Indian film I've ever seen but I was automatically enthralled as the film starts playingI have to admit I became engrossed with the film already when the first scenes was where Aamir Khan was. Later on, as Gracie Singh performs superbly with all the musical performances, I decided from then on that I already love this movie! Even though I only have to watch thru the subtitles, it's certainly fine with me. This film was only introduced to me by my cousins during Christmas last year. From then on, I've looked everywhere for this movie in every video stores. Luckily, I got one 2weeks ago and I became so fascinated that I download pictures & wallpapers alreadyall about Lagaan!!! I wouldn't be posting a comment here if I didn't have the Lagaan fever!!! =p The story started in a small village of Champaner , where Bhuvan (Aamir Khan) and Gauri (Gracie Singh) are in a community of poor and innocent farmers who are happily plowing, sowing, praying for the rains and reaping their harvest. Inspite of such unwanted circumstances, they are still full of hope.But then, a British captain, Captain Andrew (Paul Blackthorne), challenges the farmers to a cricket match. He is a capricious character that wants to burden the villagers with a land tax (Lagaan). He waived that there'll be no Lagaan for the next three years and that he'll be the one to pay it from his own pocket. Worst, if they lose, they will pay triple Lagaan for that year. He knows that the villagers are ignorant of the game and its rules. So he's pretty confident that he'll win the game What he didn't know was that his younger sister, Elizabeth (Rachel Shelley) is completely against his outrageous ideas Elizabeth's first meeting with Bhuvan already got her attracted to him Unsuspectingly, all of the villagers knows that she helps them purely out of sympathywell, I guess it was that way but she fells in love with Bhuvan later onit just pains me to see that Elizabeth's love for Bhuvan is an unrequited oneshe remained Bhuvan's Radha The cricket match between Indians and British was really superb and very uplifting. Nevertheless, their wit and determination never let go unnoticed. Even the British officers cheered for their victory! It's really a heartwarming storyof Purity in Spirit, Sacrificial Love and that good still prevails..Aamir Khan has absolutely a god-given talentsimply amazinghe dances like any other talented men I know who perform. He was very good in the rolehe looks very appealing especially when Elizabeth imagined him in a princely suit! Gracie Singh looks convincing as Gauri who loves Bhuvan with all her heart. She looks bubbly and cute to me! She displays an excellent facial expression that she can shift from one emotion to another without any difficulty, I guess They are really perfect for each other On the other hand, Elizabeth may have love Bhuvan with the same intensity as with Gauri's but I guess, they weren't really meant to be with each otherthe rest of the men in Bhuvan's team were also fit for their rolesthey never failed to uplift, share their sentiments and inspire methe British officials showcased a role of fairnessthey sympathized and cheered with the villager's victory.For an overall view, the movie was really amazing and I never will get tired watching it all over again. The songs were enjoyable. I can even depict it in my mindsometimes I would hum it 'coz I cannot recite the proper lyricsmoreover, even if this film didn't win in the Oscarsit's all worth it","imdb_rating":8,"our_rating":0,"algo_label":0}]