[{"heading":" Do not watch this work of crap.","review":"This was by far one of the worst movies of 2004, and THE worst movie starring Akshay Kumar. You will get nauseus while watching this movie. Weird thing is, Akshay is unusually thin and much younger looking here, which made me doubt whether this movie was made many years ago and released this year.even his do is the old one. Sridevi's overacting is cloying as well as the the terribly role given to anupam kher, with his buck teeth looking as real as his tropical forest wig. Worst part is that just when u think movies in India are surely on their way up, one like this makes u want to swear off bollywood forever. The plot is as clichéd as the Kiran Kumar's role as the corrupt commissioner. Looking at yr own faeces will give you a better experiences.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Decayed","review":"For some reason the film which was launched in 1994 was delayed and shelved and finally released in 2004. The film marks a comeback of Sridevi though it's a delayed one, the film seems stuck in 1970s, The story seems done to death and due to the delay in making, it looks outdated naturally. It's a pain to see Akshay and Sridevi in their 90s self,Sridevi's voice too is dubbedDirection is bad Music is outdatedAkshay Kumar had play cop roles a lot in that year, and worst it's a delayed film so he looks straight out of Mohra Sridevi is good in her role though at times gets to the nerves Also her dubbing by someone else is odd Kiran Kumar, Anupam Kher, Laxmikant Berde.etc all look younger and are okay.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" There's one problem with delayed movies - they're outdated!","review":"After being under production for what must be over a decade, Meri Biwi Ka Jawab Nahin finally release in 2004. Unfortunately for this movie, the 10 years or so that were spent under production were the years of societal revolution in India, and this movie attempts to be a \"feminist\" movie from 1990 or something. Indian women have come a long way since when the story for this movie originated, and this movie is plain out outdated. It tries to show a woman having power by being able to beat up big guys--sounds pretty lame to me. In other words, a woman needs physical strength to be equal in society. It may have been okay then, but Sridevi seems too old to come opposite Akshay Kumar now. The songs are awful except the \"Pyaari Pyaari Ankhiyaan.\"","imdb_rating":2,"our_rating":0,"algo_label":0}]