[{"heading":" Stunning","review":"I was lucky enough to see this in the theater in the United States when it first came out. I had seen a few Shahrukh Khan films on tape (thanks to a friend), and when I noticed \"Devdas\" in the online movie listings, I decided to go have a look at what would be my first Hindi film in a theater. I was the only Anglo in a packed house and I aroused as much curiosity as I felt.I was completely blown away by Devdas, from the first moment of the opening credits to the last bitter tear on Paro's cheek. Every shot, every frame of this film is like an artist's canvas. Aishwarya Rai is breathtakingly gorgeous, Madhuri Dixit's quiet beauty increases with each scene, and Shahrukh has never looked so good. All the supporting actors are incredible, particularly Jackie Shroff as Chuni-babu and Kiron Kher as Paro's mother.The sets and the costumes are fabulously opulent...almost too fabulous, in fact, and at times threaten to overwhelm the story. But I was far too enthralled in the theater to do anything but gasp in open-mouthed wonder, and enjoy.The story of Devdas, a famous Indian novel written in the 1920's by Saratchandra Chattopadhyay, has been made into film numerous times by Bollywood. It is about the spoiled son of a wealthy man, who is loved by Paro, his lower caste neighbor and childhood playmate. Devdas is a weak, aimless sort who is blown about by destiny, never taking action until it is too late. He is unable to recognize his love for Paro until she has been married off to an older man and is lost to him forever. He then turns to the bottle, and to the prostitute Chandramukhi, for comfort and forgetfulness.This story will probably be hard for westerners to relate to...there is no corresponding literature of the west that I can think of...perhaps Romeo & Juliet is closest. Bhansali's version differs in many respects from previous versions, and from the book, in that Devdas is a more forceful presence who declares his love for Paro, only to be kept apart by scheming family members. In the novel, however, it is Devdas' own flawed character that keep the lovers apart. He is simply too weak and indecisive to know what he wants until it is taken away forever.Having seen the earlier Dilip Kumar/Bimal Roy version, and read the novel, I can say that Shahrukh Khan truly made the character his own and breathed a new life into Devdas, making him more lovable, and more a victim of fate than of his own tragic weakness. In the novel, and in the earlier Bimal Roy film, Devdas has almost no personality at all...he moves through the story like a mere shadow, and we only see his character reflected in the love of the two women who worship him.Much attention has been given to Aishwarya Rai for her performance, which I agree was outstanding. She is almost inhumanly beautiful in this film. When I saw this in the theater I was in half love with her myself.But it was Chandramukhi who haunted me after the film was over. Madhuri Dixit deserves much, much more attention than she has received for her wonderful performance, which has been relegated to a \"supporting\" role, when actually her role is every bit equal in importance to that of Paro. Chandramukhi is the only character in the film who is completely unselfish in her love...her love is the purest of the three, because she loves with no expectation of being loved in return. While Devdas and Paro are busy destroying each other's chances for happiness, Chandramukhi's love is always uplifting and positive.Besides the award-winning performances (Devdas swept all the Bollywood popular awards in 2003) and the fabulous sets and costumes, Dedas has one of the best music scores I've ever heard, and dance numbers to match. I wished the opening number, Mere Piyar (performed by Rai), could have gone on forever, and toward the end Dola Re Dola (performed by Dixit and Rai) is a treat. Some viewers felt that the up-beat drinking song Chalak Chalak (performed by Khan, Shroff and Dixit) was out of place in such a dramatic story, but it is my favorite number in the movie.There are so many things to recommend this film, I could go on, but I will just call it a masterpiece of Indian cinema and leave it at that.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" lavish and dazzling, another classic","review":"I have not seen the other previous versions of Devdas, but as far as this Devdas goes, I can say that it is really difficult to transform such an old and popular story into such an amazing film without being boring, and the director has successfully managed this task.\nThe set decorators, choreographers and the costume designers must be lauded very very highly. It is truly amazing and a real pleasure to just even observe these three elements. Of course, Aishwarya Rai (Parvati) is so incredibly beautiful, the camera loves her, and she sparkles like a diamond. Still, (also credited above Aishwarya) Madhuri Dixit (Chandramukhi) is the real acting talent.\nI had great pleasure watching this lyric melodrama, although it lasted about three hours, it deserves all kinds of appraisal.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A Bittersweet Classic","review":"Gloriously excessive Bollywood epic starring former Miss World Aishwarya Rai. Set in the 30s and sumptuously shot, it follows a lovelorn suitor's slide into alcoholism and despair Bhansali's film boasts the biggest budget for an Indian film ever and boy, does it show. An extravagant tale of love, loss and serious drinking, it operates on a scale previously unseen in Bollywood. Essentially a tragic love triangle, the story follows tortured Devdas (Khan) as he mucks things up with childhood sweetheart Paro (Rai), meets courtesan Chandramukhi (Dixit) and then drinks himself to death. A spirited anti-hero, in India his name his synonymous with a sort of heroic failure.\nEverything about the film - costumes, sets, songs and sentiments - is larger than life and the sheer spectacle demands respect. The musical numbers cast Devdas and Paro as the mythical lovers Krishna and Radha. Cheeky, sexy and dizzyingly complex, the dancers display astonishing energy and precision, whole sequences shot from above to resemble the shifting patterns of a kaleidoscope. Certainly there are moments of daftness. A half-cut Devdas resolves a financial dispute by setting fire to a sofa, for example, and nobody tries to stop him. But there's also humour, style and a conclusion that's plenty teary. As Western directors continue to look to Bollywood for inspiration this is a shining example how it should be done. Intoxicating.\nVerdict Starts big, gets a whole lot bigger then gets twice as big after that, this is Bollywood at its most flamboyant. The song and dance numbers alone are worth the price of entry and whether you're familiar with the genre or not this is irresistible from start to finish.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Greatest love story of all","review":"I have to admit that as great as Devdas is, I can't watch it too often as it is far too depressing but it is ultimately the most spectacular movie I have seen in a long time. Aside from its theme, the film making process was awesome including the costumes, the cinematography, the direction, camera angles. Imagine the number of hours the extras worked their *beep* off to dance in sync. Even the soundtrack was perfectly tuned to help set the mood of the movie and hearing Paro (Aiswarya Rai's character) sing for her love lost for Devdas (Shahrukh Khan) on her wedding day was enough to make you burst into tears.The actors chosen were perfect for their roles as they portrayed it with such heart wrenching gut, you could almost feel their sorrow along with them. I was particularly surprised how Aishwarya Rai pulled off her biggest acting role to-date, thereby quashing any doubts on her previous beauty queen title. Shahrukh Khan once again proves why he is the reigning king of Bollywood playing a heartbroken alcoholic pining for the love of his life who's been married off to another man. Madhuri Dixit was equally wonderful as the beautiful courtesan who played her role with such empathy that I couldn't help but feel sorry for her and wished Devdas would eventually reciprocate her feelings for him. Jackie Shroff has never disappointed and was excellent in his supporting role as Devdas 'brothel' companion. All in all, the cast ensemble of this movie is one of the best in cinema history.This movie is also a perfect (and spectacular) introduction to first timers of Bollywood movies into the lives and culture of Indian/Asian people in general. How, in this modern and civilised world, old traditions and values still hold dear in certain communities and whilst it is not the most favourable of beliefs, it is the age old cultural practices that makes one culture unique to the other.Yes, no movie is perfect but Devdas almost does it so watch it with an open mind. Being Asian myself, I dare be bold and say this is better than 'Gone With The Wind'.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Devine!","review":"I had never seen a Bollywood film before (being a white girl who only knows a few swear words in Punjabi) so Devdas was a new experience for me. I thought it was simply wonderful, rich, vibrant and full of colour. I couldn't recommend it enough for someone who wants to see what all the fuss is about Bollywood. The story is Romantic and timeless, a spin on Romeo and Juliette if you will. The story unfolds through song and dance sequences that feature beautiful women who do not need to expose themselves to be erotic. The humour in the film for me came when Devdas started speaking like an English gent in the middle of an argument with his father...very amusing view on the Western world! Anyway, as I said, I would encourage anyone with an open mind to have a look at this film.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" DEVDAS recalls the Hollywood musicals of a long-ago era","review":"DEVDAS (2002) is a beautifully mounted romantic melodrama based on a popular Indian novel published in 1917. When I first read about the film and its enthusiastic reception at Cannes, I had high hopes that this might become the first Bollywood film to cross over to arthouse audiences in the U.S. While watching it, however, it became clear that the class-conflict narrative would be a tough sell these days with its supremely overwrought tale of parental disapproval, family honor, unrequited love, and two beautiful women's complete and utter devotion to an irredeemably dissipated man who is left with nothing. It's also more deeply rooted in Hindi culture than the other Bollywood movies I've seen and would most benefit a viewer who had more than a passing knowledge of it. In comparing DEVDAS to MOHABBATEIN (2000) and TAAL (1999), the other Bollywood musicals I've seen, I would cite a few Hollywood parallels. DEVDAS is like a Jeanette MacDonald-Nelson Eddy MGM musical of the 1930s (e.g. MAYTIME, 1937, with which it shares some surprising similarities) to MOHABBATEIN's SEVEN BRIDES FOR SEVEN BROTHERS or TAAL's BYE BYE BIRDIE. (When I saw MOHABBATEIN I also thought of WEST SIDE STORY and GREASE.)\nI enjoyed MOHABBATEIN and TAAL much more, but I was still gripped by DEVDAS and its high romantic expression of love through song, dance, and incredibly rich, poetic dialogue. It's a powerfully old-fashioned film, which is not necessarily a bad thing.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Most Tragic Film Ever Made In Bollywood","review":"Background: This film is based on Sarat Chandra Chattopadhyaya's novel 'Devdas'. Sanjay Leela Bhansali has perfectly altered some parts of novel to suit the film.The movie continuously keeps on drooping till it ends.Its a perfect anticlimax kind of movie. Brief Story: Initial part of first half of the film shows immense bonding between childhood playmates Devdas(Shahrukh Khan) and Paro(Aishwarya Rai) and the reactions of all other characters to there relationship.Later part of the first half shows how circumstances result in the separation of these 2 lovers. Second Half shows the impact of separation which drives Devdas to stunning courtesan Chandramukhi(Madhuri Dixit).Devdas drains himself into excessive drinking in an attempt to get Paro out of his mind and also to prevent Chandramukhi from entering into his mind.Ultimately Devdas drinks himself to death, loosing both women.(One whom he could never stop loving and One whom he could never love).Salient Features of the movie : 1)Combining three biggest stars and extracting there acting to maximum possible extent by unbelievably talented filmmaker Sanjay Leela Bhansali. 2)The film perfectly depicts its timeline(Pre Independence Era)through its strikingly attractive and huge sets,through richness of costumes etc. 3)Another striking feature is the dialogues.One hardly finds these kind of precise and sentimental dialogues in present day Bollywood films.If you really want to know what a tragedy is ,then Devdas is best the example!! Just go for it !!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Sanjay leela bhansali : A magician","review":"SLB is a god gifted director to bollywood and i am again spellbound by his work. He is the only director who can remake a super hit 1960s movie in 2002 with the same essence. This movie was marvelously made with a powerful star cast with mesmerizing scenes, dialogues and music at the same time.Aishwarya rai has done her best and Madhuri was the same refreshing as 8 years ago. Shahrukh khan to put his best and this makes this movies unforgettable.I consider this movie as one of the best movies made in India. I recommend this movie to everyone because even after the end, this movie won't get out of your mind.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Don't settle for English version!!!!!","review":"What can I say, Devdas is a spectacular classic on par with Gone With the Wind and Cecil B. DeMille. At first I was pleased that there was an English version, and I would not have to read subtitles BUT - IT'S CUT!!! The final song is missing, and parts of most of the other songs are snipped. Whole scenes are missing!!!! Luckily I watched the Hindi version first. It is far superior in that it is complete, plus it looks better. I did need the English version to iron out some of the plot - although a couple of the scenes that I needed translated had been cut. In future, if they are not going to English version the whole movie, subtitles are better. Dola Re is the best song/dance number ever!!!!!!!!!!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Lush, lavish, lovely - but ....","review":"I owned this film for 8 months but did not see it because of all the negative hype on the board. Then I took the plunge. First off let me say that I was not a great Saratchandra admirer. His stories (except SWAMI) mostly portrayed women as weak minded, subservient (maybe true to the time, but not to be admired), and men as weak and mostly well bred but not well educated. I had no real recollection of the story as written. And, not being a great Dilip Kumar fan, I never watched the old version. So, I have no comparisons to draw, no plot line differences to talk about.I came away moved by the tragic love story that unfolded. It was not flawless, most Bollywood movies are not.Negatives - the sets were beautiful but over the top, ditto for the costumes. The duo dance was a great way to compare Aish vs Madhuri dancing skills (both were pretty even matched for me) but in the story line it was quite silly and should not have been there. There was no real need for the the two to meet, but this was Mr, Bhansali's directorial license. Chandramukhi's kotha and environs were lifted straight from Pakeezah, which was a very stylized movie and not authentic.Positives: Shahrukh Khan gave a very restrained performance, the silent tears accompanied with an anguish that only his eyes portrayed was a real departure from the screwed-up face crying. He was very very good in the drunk bits, very good in the anguished bits. It is remarkable how much this actor is accused of being typecast when every other year he pulls out an amazing performance - Dil Se (1998), Asoka (2001) and Devdas (2002) are all departures from his usual typecast romantic hero image. Recent roles in Swades and KANK are even more varied. The detractors will keep saying he overacted, or he portrayed no emotions, for me this was a truly great role as an anguished lover. Mr. Khan - your best actor award for this role in Devdas was well deserved.Madhuri - what can one say about this truly great icon? She was amazing, you felt her pain, her caring, her selfless love, the moments between her and Shahrukh sizzled. And her dancing was brilliant.Aish - was a bit wooden at times, but not always. She had a chemistry with Shahrukh that was understated until she was beyond his reach, but come on - the woman looks amazing, is there any doubt that a hundred Devdas types are dying for her?? She was better as the movie progressed to the more serious part.The movie went into an emotional downward spiral a third of the way in and I sat there moved and almost crying for these tortured souls the rest of the two hours.The movie was eye candy in the sets and costumes department. The two leading ladies were stunning, Shahrukh was easy on the eye, yet there was something that did detract from this being a great film. Upon much thinking I have come to the conclusion that it was the over the top beauty of everything that really made everything a little unreal for me. How could such perfect people have such imperfect lives? In essence the little black mark on the lip was missing and that left me a little dissatisfied.If Mr. Bhansali had stated that this was an adaptation from the original novel, people would forgive him the fact that Devdas in his version is a mature man and knows his mind (although fails to act decisively on it), and the fact that an aristocratic lady visits a courtesan's establishment and the two dance together.If you do not compare with what did or did not come before, this was an intense emotional experience, anchored by great performances from Shahrukh, Madhuri and yes, even Aish.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A gigantic wonderful steamroller of a movie","review":"Having just seen Devdas, I wondered how it had been received by other viewers.I am a 'Westerner' who has had a growing interest in 'Bollywood' movies and music over the last few years (and found it a very difficult genre to explore - since it's poorly represented in shops, except those in \"Asian\" areas of major cities in the UK).I've seen enough to realise that Devdas was going to be a huge visual feast - almost too much to take. Heck... I was blown away by the trailer! I found it gripping and intense and extremely 'stylish'. Thundercracks, wailing children, whip cracks, stunningly lit glimpses of the more attractive cast members and wild swirling colours! What else could you want?My colleagues and I were aware of the overly melodramatic content. I can see characters from Victorian plays and themes that are covered in a lot of films from around the world - mainly the 'Romeo and Juliet' idea of love being thwarted by families, traditions, prejudices and missed opportunities.But Devdas is like a wonderful steamroller. It drives straight over you and leaves you breathless. I don't think I have ever seen anything quite so visually wild and exciting.Early Hollywood epics had 'spectacle', but all on a grand scale - vast buildings, arenas, crowds. Devdas packs all this into a much smaller space, turns up the colour to maximum and then lights the whole thing up like a firework display. The dance sequences are stunning, Paro's flight through the house as she runs to the dying Devdas is stunning - the whole film is stunning.Hang the historical accuracy... this movie is an unforgettable experience.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Forget the haters! This is an awesome film!","review":"Coming off a film like 'Albela', it was very important for Aishwarya Rai to do a film like this! A lot of people had been speculating about her beauty, charm, acting and dancing skills etc. etc. and I think this was the film that shut them all up. I can't imagine that so many people think this film is crap, yet there are 92 reviews and comments before mine. I think that's saying something. Anyhow, in this Epic of Titanic proportions, Aishwarya Rai plays Paro, a lovely young woman coming of age, whose sole purpose in life is to worship her childhood friendship and friend Devdas (played by Shah Rukh Khan), just one look at her and you can tell that Paro/Pavrati is one half of a two part series of star-crossed lovers. It's Romeo and Juliet meets Titanic meet Tuck everlasting meets every colourful bollywood picture you have ever seen all rolled into one magnificent masterpiece! While they are preteens, Devdas is sent away by his family to go study in England and this devastates Paro who is chastised by her mother for over-reacting during the boy's departure. As she blossoms into a teenager, Paro's love for Devdas only grows and one day she is told that Devdas is to return home to India. Naturally, she is beyond overjoyed and prepares herself for his arrival, only to develop an inexplicable fright when he finally comes to her house to see her. A game of cat and mouse ensues but the two would-be lovers finally come face to face and find that their attraction has grown. Enter the evil conniving family feuds, the caste systems and surely you know that all this takes a toll on this everlasting friendship. Somehow, Paro's love eludes Devdas and he winds up with a gypsy's curse looming over his head until the final moment of the film when Paro's husband executes his own curse on his wife, while Devdas's curse finally catches up with him. A devastating and earth shattering blow that ends their friendship and love forever! This of course, is only part of the story, there are lots of twists and turns and while it is a remake of the 1950s classic of the same name, this version is a unique must see of its own. Don't miss the show-stopping song and dance numbers especially 'Sisila ye' and 'Dola re Dola' which teams up the dancing queens (Ash and Madhuri Dixit) in a dance-floor showdown! A+","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" This is how US movies should be","review":"Note: This review pertains only to the subtitled version.A gorgeous epic about a timeless love, Devdas broke box office records in its home country of India and garnered critical acclaim at the Cannes film festival in 2002. The story follows a man's downfall into depression, alcoholism, and his ultimate self-destruction when his childhood sweetheart marries a man she does not love because of a thoughtless mistake on his part. While Devdas Mukherjee (Khan) struggles to overcome his grief at losing Paro (Rai), the one woman he loves, he meets Chandramukhi (Dixit), a courtesan who falls in love with him at first sight. Running slightly over three hours (subtitled version), Devdas is, at heart, a basic story of boy loves girl, boy loses girl, another girl loves boy, and a tragic end for one or all of them. Although typical in Bollywood (Hindi cinema), the plot is very engaging and simple, but later made complex due to the marvelous performances by Khan, Rai, and Dixit.At first, the focus of the viewer is solely on Devdas and Paro's relationship, but when Chandramukhi enters the scene, the viewer is conflicted by who he/she wishes to see Devdas end up with. While Paro is beautiful, innocent, and pure in her love for Devdas, Chandramukhi is sensual and elegant. The latter also gives off an air of sadness and loneliness that seems to stem from her life as a courtesan, which endears her all the more to the viewer.With his previous hit Hum Dil de Chuke Sanam (Straight from the Heart, 1999), Bhansali delivers another visually stunning film with Devdas. The songs are exquisite and very catchy, and the dance scenes were a wonder to behold. Elaborate costumes and striking sets only added to the beauty and mystique that was the world of Devdas.The only things I could make negative comments on would be the picture quality, the subtitles, and Shahrukh's acting. The quality of the picture was often grainy and did not seem as clear as it should have been. There were a few instances when the subtitles either went by too fast or needed to be read more than once in order to understand the meaning; some of them were very weirdly worded. Shahrukh did appear to struggle a bit in his performance and overact in some scenes, but overall he did a nice job.A film that can be enjoyed by families and viewers of any age and nationality, Devdas is what most Americans expect to come from India: gorgeous, breathtaking, and having the ability to take a simple love story and turn it into a complicated plot line that will have almost anyone become a romantic (even a secret one).","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" OMG, I loved this movie!","review":"I watched this movie more than once. Each time it gets better and better. I still cry at the end. I still have hope for the two star-crossed lovers. I love Shak Rukh Khan. He's very easy on the eyes, and one of the best actors I have ever seen. He can act, sing, and dance. He is very stylish. The songs in the movie were AWESOME! I bought the CD! Aishwarya Rai was completely breathtaking in this movie. Her acting skills are immense. Her voice is beautiful. You can feel her love for Devdas through the TV screen so much that you fall for him. UGH! WATCH THIS MOVIE! You will not be disappointed. If this is your first go on Bollywood films, then this a great first choice. This was my first film that got me hooked onto Bollywood movies. Now, I find Bollywood movies better than Hollywood movies. They have action, drama, romance, song/dance, and comedy ALL IN ONE! It's great. Now, I am collector of Shah Rukh Khan movies! See more of his movies...you will NOT be disappointed. Sorry ladies, but he is married! Yea, I know I was disappointed at that as well. I AM HIS BIGGEST American FAN!!!!!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" an overproduced elitist film","review":"Devdas, to my understanding, was written as an insight into a tortured soul. It was also a parable of class and almost feudal divisions- something which the Indian subcontinent is still struggling to get over.This is where the production values of Devdas destroyed the essence the story- for some reason, perhaps because he had a budget that was unprecedented in Indian cinema, director Bhansali decided to go opulent in every facet of the the production. Paro's family, who in the text is a working class family, lives is a mansion on their own right in the film. I found it hard to empathize/ sympathize with any of the character's logic about \"lower class\" versus \"upper class\" because the production made them all more wealthy than 99.9% of the population of India! It puts an elitist spin on the entire film, and I really didn't appreciate it.Devdas is not a story that deserves opulence- it is a dark, personal tale. It's spaces are small and internalized, almost claustrophobic. The character of Devdas is continually drawn inward, and he brings everyone he loves down with him into his abyss. What we are given instead is a wide open canvas, something more fitting for an epic battle between nations, not hearts.Some might argue that Devdas is an exercise in escapism, but what the novel was about was escapism in an entirely different spectrum. Alcoholism is indeed escapism, but in the worst possible way. So is class discrimination. If Bhansali really wanted to create an opulent epic worthy of his budget and production team, he should have chosen a subject such as the Taj Mahal or the life of the Nizam. What he's given us is a high gloss finish on a rough and tormented subject- a very ill fit indeed.And on a side note, I found it funny that the entirety of Chandramukhi's village was lit by 10,000,000 candles. Women with saris take extreme caution.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Magical !!","review":"Devdas- 2002 Director: Sanjay Leela BhansaliSanjay Leela Bhansali's labour of love Devdas is a larger-than-life, poignant and spectacular interpretation. Clearly Devdas is a work of art and heart. Ismail Darbar's rich compositions are mostly situation-based and aid the narrative. Thankfully, the music plays in the background and Devdas and Paro are not shown lip-syncing sweet nothings. Pandit Birju Maharaj and Saroj Khan storm the screen with some sensational choreography. Madhuri Dixit's dances are breath-taking. Binod Pradhan's eye for detail cannot be missed as he romances the camera with imaginative angles and lighting. The good thing is that before the viewer gets too caught up in admiring Aishwarya's exotic hair clip, the shot switches to the sorrow in her eyes.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" The most lavish Indian movie ever","review":"The most lavish Indian movie ever.Sanjay Leela Bhansali creates a visual master piece.Every thing looks stunning.Visuals are simply stunning and breath taking.Personally,i have never seen such a beautiful and a colorful movie like this one.There are colors every where and the sets compliment the color a lot.They are simply stunning.Camera work compliments the film a lot capturing the best shoots.Costumes are simply amazing.Every part is decorated very well.Technically,the movie is amazingActing was excellent.Shah Rukh breathes life into his country and has given a very moving performance as the heart broken and alcholic Devdas.He impresses in the drunk scenes.Aishwarya looks completely stunning and has done an excellent job.Her dance Silsila is a treat to watch.Madhuri too is excellent too in a short role.Her dances Kaahe Cheed Mohe and Maar Daala are a treat to watch.She and Aishs Dola Re is a treat to watch.Kirron Kher is first rate and so is Smita Jaykar.The most weirdest thing i say is,Kirrons dance in Morey Piya is a treat to watch.Jackie Sheroff hams and is passable.Music by Ismail Darbar compliments the film a lot.Direction by Bhansali is never the less excellent.After making the excellent Hum Dil De.He has made another wonderful flick.Go watch it.you will not be disappointed","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Devdas 2002","review":"The film Devdas raises a few questions ? How much liberty a film maker can be allowed ? Is it fair to change locale ? A few incidents in the film are not mentioned in the book should such incidents be allowed to be included in the film.The  attributes of the charactars of story are different from one the origianal author  - is it fair to to him ? Devdas of Sharadbabu id different from that of Sanjay's.Can a film maker make such substatial changes in the plot of film. Say a character is shown to be dead at the end of the story , can a filmaker show him living at the end or if A marries B in ther story can a film maker show him marrying C ?There should be some limit. To me it seems Sanjay has crossed those limits.(Maybe its my opinion ).","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Classic Bollywood Cheese","review":"I will start off by stating my bias....that I generally hate Bollywood movies because of their excesses, and their general lack of realism.In that light, Devdas is classic Bollywood. The cinematography is nice, the costumes...superb, the actors ...look great, the drama....overly dramatic. And the story has been thoroughly North Indianized. For a Bengali like me, the selective use of Bengali in silly accents was useless, it should have simply not been there, because by being there it insults us. There are plenty of people who can do better Bengali with a little bit of coaching. And if the story is to be told in Hindi, keep it ALL Hindi.But it's the palace and the costumes that make this movie even weirder. Set in the early 20th Century, but seems almost like a movie about feuds between two royal households. Is Parvati supposed to have that gorgeous house she has? Can we actually see any semblance of colonial India in the movie?\nIn sum, the movie is \"pretty\", a dressed up and showy theatrical piece that fails to translate anything from Chatterjee's novel (metaphorically, forget the Bengali). It's the perfect piece of saffronized Indian export that, no doubt, many international critics will love because they can almost smell the incense. It reminds me of Mira Nair's costume drama called Kama Sutra, which unfortunately, was just as comparably bad (considering the audience it catered to). It fails to build empathy for the characters, and for us to understand Devdas. Characters seem to choose madness and make life a deliberate disaster for themselves for the heck of it. Devdas could have been compared to Hamlet, but this movie makes that comparison unworthy. There is nothing groundbreaking in this movie (other than its expenditure) to deserve the attention it is getting. It continues the Bollywood tradition of one-dimensional characters.THE GOOD STUFF: the pretty faces of Aishwarya and Madhuri. Both respectable. It was entertaining to see Jackie Shroff succumb to stupid roles. And there were a few good songs (and dances) that wasn't the usual pelvic thrusting soft-core dance acts.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" judging from a vacuum","review":"A lot of people who have seen the older Devadas and/or read the Bengali novel have taken to criticizing this movie by saying it deviates from these original works. A closer examination of their complaints however, reveal that the grandeur of the set, the extravagance of the costumes and of course the disregard for attention to detail vis-a-vis adapting the authentic 'bengaliness' is cause for much of their consternation. I will respond to this in a moment.Before that, let me address another misplaced notion. I have seen unthoughtful comments on the actors' performance. From the perspective of someone who hasn't been exposed to precedents of the performers, these criticisms are meaningless. They are obviously from people who have returned often to watch Shahrukh and Aishwarya in various roles, that they are implicitly acknowledging the versatility of these actors. Sharukh however, has a more serious allegation made against him. He has been charged with carrying over a virtually identical persona into every film he makes to the brink that he is accused of playing himself and not the character he is supposed to bring to life. to critics who allege thus, I say, give it a break. many people, unfamiliar with Sharukh's works, would like to see Devdas from a clean perspective. The focus of movie criticism, for this particular piece of art, must not shift significantly from the movie to the performer. If criticizing performers are of primary interest, then such critics would do well to seek out a Sharukh/Aishwarya forum to post their comments.As for the other criticism, the quality of a derivative work compared to the original; how many of the people who have read J.R.R. Tolkien's other classic work, The Hobbit, were inspired by the popularity of the Lord Of The Rings trilogy? A derivative work is mostly created in deference to the original. It may recast the scenes or narrative in a context that is not contemporaneous with the original. That by itself should not be grounds for criticism, not should it be basis for judgment.Thus, from within a vacuum untouched by these factors, the movie is brilliant in virtually all aspects. If you can overlook minor annoyances as the lighting and length of the movie, or a seemingly innate tendency of the characters to break out into a song and dance routine without warning, you have got an entertaining 3 hour trip into Devdas' world.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" lavish","review":"The word which best describes this film is Lavish. The acting, choreography, camerawork, cinematography, art direction, costumes, make-up and music were all top-notch.Unfortunately, the story sucked like a Dyson Twin Cyclone.The first twenty minutes were enchanting; the remaining 160 minutes bored me to tears. During the last hour I was just praying for it to end as soon as possible. I have no idea why the film-makers felt the need to make this film 3 hours long, because they could have chopped half of it out and been left with a fun romantic musical.This film suffered from the same flaws as Moulin Rouge, however in this case, if you were to tip all the reels of film out onto the floor, finding the good bits would be like finding a needle in a celluloid haystack.Avoid.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Devdas is full of glamour- THAT DOES NOT PROVE A MOVIE'S GREATNESS!","review":"This new version of Devdas is the most degrading, horrible piece of junk I have seen in my entire life. And I say this because I have watched Bimal Roy's version and it is one of my favourite Hindi movies of all time. I agree that this Devdas had brilliant colour, cinematography and this aesthetic glamour- but does this make a movie great? NO!!! This new version showed nothing but glamorous sets, costumes and props and that is why it is the most expensive Indian movie ever made. BIG DEAL! I think the money used here could have been used to make a story about kings and palaces, where its feature would have been more realistic.There was nothing that caught my attention in this movie. I found loads of flaws...right from the beginning and I can ensure that Bhansali did NOT do his research on the Bengal of that time. I believe he is confused with the time...very confused. If one thinks of it, Zamindars in Bengali villages did not have enough money in those days to send their sons to universities in Britain (the real Devdas went to Calcutta). If you see the sets, the houses, furniture, all the props are English- style, not Indian. In fact, his house looks like a Roman mansion and not to forget that elaborate- looking binocular was also very western. We must admit that those days, Zamindar families did not have soo much money to waste to get every single prop from western exporters. So that is probably the biggest flaw: these anachronistic additions.Another thing is, did anyone notice Paro's house? I don't know what her mother was saying about them having a small, humble house. Both mansions look like palaces. I even doubt that Zamindars in Calcutta had such elaborate houses in those days...and Zamindars in villages???? PLEASE...I even wonder whether Kings had palaces like that. Chandramukhi's 'Kotha' was also like a palace, and Chandramukhi herself was dressed like a queen. There was no space in Calcutta for such large kothas!Costumes were Indian, but altogether too elaborate and not Bengali...and props were soooo western. How the hell do those two things complement each other? Okay, now let me move on to the acting. I though Shahrukh was his usual. His crying style was the same (with his typical stammering) and I thought all the other good actors were very melodramatic in their approach to the story. Nobody acted well...and Jackie Shroff just made my blood boil when he constantly said \"Bondhu\". There were some Bengali additions in the dialogues and they looked so fake.And the dialogues were excessively corny. In Bimal Roy's Devdas, Dilip Kumar says this wonderful dialogue when he lies in Chandramukhi's kotha, soaking in alcohol; 'Kaun kambakth peeta hai bardash karne ke liye, mein to peeta hoon ke bas saans le sakoon' (Which fool drinks to endure pain? I drink just so that I may breathe) and in Bhansali's Devdas, this dialogue has been transformed into a corny, humorous issue; 'Kaun kambakth peeta hai bardaash karne ke liye, mein to peeta hoon ki yahan beith sakoon'(which fool drinks to endure pain? I drink just so that I may sit here). Whatever emotional weight dialogues possibly could have contained despite of the pathetic acting, Devdas (2002) lacks this entirely.Perhaps some of you are asking how I can state that Bengal was not like what when and that everything is anachronistic but I am Oriya and I come from a village. We Oriyas and Bengalis have the same dresses and houses and villages are alike. Oriyas and Bengalis are very similar and watching Roy's Devdas, I could see the similarities. Everything was portrayed so realistically and I didn't have to question how reliable everything was. However, this new Devdas is shrouded with glamour and glitz and doesn't even consider it important to understand the humility of things in rural Bengal.Paro's marriage was shocking in the new movie. She marries in a Maharashtran style with 'paan patte'! And she seems so shrewd and backbiting after she gets married. Did anyone also consider that how shameful it was for a respectable woman to visit a 'kotha'? And the new Paro walks into Chandramukhi's sparkling kotha and Chandramuki touches her feet...OH PLEASE! The worst is when they dance together. Paro and Chandramukhi had never met in their lives in the original tale. It is impossible that at that time, women in their in- law's houses were allowed to do dances in front of a large crowd, let alone in front of their family. Even to speak of such things was out of the question.There was nothing at all that was nice about the new version of Devdas. I think it humiliating that India even considered sending this for Oscar consideration and I salute the Academy for shunning such a crappy movie. At least there are some award givers who know quality movies when they see them.Let's face the hard reality. Around 40 years ago, India had the best directors ever; Raj Kapoor, Bimal Roy, Guru Dutt, Satyajit Ray etc etc and they also made brilliant movies such as Devdas (1955), Saraswati Chandra, Jis Desh Mein Ganga Behti Hai, Jaagte Raho, Mother India, Baiju Bawra etc. Now we are losing that respect we once had. All the current Bollywood movies are crap and so I don't waste my time watching them. Even Hollywood had fallen into a time in which Bollywood is now, but Hollywood is catching up nowadays and has got some real good movies (such as the LOTR Trilogy). Bollywood has the same cliched stories about love at first sight and the obstacles in getting a happy ending (such as parent problems or other stuff). There are no social issues addressed or dealt with. Everything shown on the screen is this glamour which has really destroyed people's minds. A friendly chat with an unknown stranger proves how influenced young people are by Bollywood movies nowadays. The first question they will ask you is how old you are or if you have a boyfriend/girlfriend. And this is only a small indication of how destructive Indian cinema has been for the past few years.The new Devdas has no tacit feelings between Paro and Devdas or Chandramukhi and Devdas. Their love is physical- that's obvious. And the people complaining that there was no chemistry between them should re-think. Devdas and Paro, or Chandramukhi and Devdas had a lot of emotions and feeling unexpressed in the original story. The love the three possessed was spiritual and not physical. That is why Paro loved Devdas for so many years without having seen him. Roy's Devdas was so excellent in portraying these tacit moments. There was not a moment when Devdas even held Paro's hand, let alone kiss her forehead as shown in the new Devdas, no matter how much he loved her. There was always that spiritual respect between the characters. And Chandramukhi was no less. She gave up her life in the kotha because she had been influenced by Devdas's love. I see no change in the Chandramukhi in Bhansali's Devdas. Paro, in the original gave all her jewellry to her step daughter and lived modestly, wearing only what she needed. Her husband even asked her why she roamed around like a 'sadhu' (saint). However, in the new Devdas, Paro is dressed with as many jewels as her body can hold; as though the camera would have hated her without them. She shows no signs of a modest living, let alone being helpful to the poor.I think the movie was an all together crappy piece of rubbish. There was no emotion, no tacit feelings and no story (Bhansali moved so far from the original) and the director just let the glamour dominate the film. Unfortunately, most of the youth of nowadays find that appealing and therefore whatever movie is new and has lots of glamour seems to be the best movie for them. However, if you analyse this movie, there is nothing to find except for miles and miles of junk. Shahrukh in no respect even came an inch close to Dilip Kumar's acting. No wonder Dilip Kumar is called the 'Tragedy King'. The 1955 Devdas had an excellent cast, an irreplaceable ensemble of brilliant actors. If I had been the casting manager for the new Devdas and had all the actors who acted as the possible final choices, I would have considered the project 'dead'. And it is dead. Bhansali had no chance of making a better movie than the 1955 one, so he shouldn't have attempted to waste so much money to make another crappy movie. 11 Filmfare awards is unbelievably high for this piece of junk but I know why it was given so many; just because Bollywood has no good movies anymore so they have no other nominees anyway.Indian cinema needs to change and revive itself. It will die otherwise. Glamour is not what films should project on the screen. There should be a story that can be related to, that can be called real and believable. We don't have that anymore. To the people who love this movie- I think you should watch Bimal Roy's Devdas. I know it is old and is in Black and White but movies should never be judged by those standards otherwise films such as 'Citizen Kane' and 'Casablanca (though it is not a great favourite of mine)' would never be called irreplaceable classics. The new Devdas has nothing more to offer than glamour that is not possible to achieve in the real world. It is a put on image that spoils minds and makes one dream of everything that is full of money. I know this quote is cliched but it may be the perfect time to put it in use; 'All that is gold does not glitter'. Unfortunately, people's minds have been ignorant to this quote. The truth has become 'Everything that is gold or more beautiful always glitters, whether it is attainable in real life or not'. But if there are proper movie critics left in this world, they will surely know what makes a good movie- and Devdas (2002) is not even close to one.My overall rating for this movie...1/10. (I have to give it credit for the cinematography and a small credit for the music and songs).","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" totally Jatrapati","review":"one of the most disgusting adaptations of devdas!the director was never able to identify the character only. Devdas is not only about drinking. its about the repentance of a man in not understanding what he wanted in the right time. it was about the repentance of a man in not accepting his love .when he understood his mistake it was too late!!! absolute disgraceful!totally destroyed a masterpiece of a novel by late Saratchandra Chattopadhay!!! Paro was a poor girl . how the hell was she living in a house of glass!!! where did that Bahu Devar conflict come into being. Mr Bhansali u r making a feature film based on one of the greatest novels of all times not a Sass Bahu soap!!!direction was totally abysmal!!!Paro was not known to do dance!! she never met Chandramukhi!!!what was more outrageous u made them dance together!! excuse me she was the daughter-in-law of a Hindu conservative family ,which would have never allowed her to dance with a Baiji!! u never did any research b4 doing the film , isn't it?if u would have done that u would have known all that i am telling u. the total look of the film was disgusting!! i am a Bengali and we all know Bengali are known for their simplicity and u made the wear so many jewelries and heavy garments it was like watching a ad film commercial on saris and jewelry!! if u want to impress Ur distributors please make a film on topics like that!!but don't ever destroy a novel like that!! now the acting part !totally overacting !crap!absolutely crap! from Srk to ash to Madhuri! totally disgraceful!!! everything was overdone!! people read the novel understand it and then comment it Shud necessarily not be same to same as the novel but from the point of view of a film also it was disgusting!!! only good part was the music and the dance so that 1 otherwise it deserves less than zero!!!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Excruciatingly painful","review":"This movie is enough to make Sarat Chandra Chatterjee turn in his grave. First of all, if you like the usual bollywood stuff, this movie will fit right in. I am writing this review to dispel the perception that somehow this movie follows the greats of the order of Satyajit Ray or even Tarachand Badjatya.This is a very mediocre movie, where it seems, the producer had so much money, that he did'nt know what to do with it. This of course ended up making the entire movie glitter with opulent vulgarity which had nothing to do with the works and times of Sarat Babu.Coming to the specifics, The dresses, the dances and the backdrops, everything was incorrect. The director (Sanjay Leela Bhansali) it seems had no sense of Indian history, or even literary honesty while he made this movie. The sensibility of the classes was wildly off the mark in the movie. The music was loud and mediocre. Aishwarya Roy was the only consolation in the entire film. But I am sorry, that three hours of even Aishwarya are too much to bear in this movie's context.Overall a D","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" One of the Best Hindi Movies I Have Watched","review":"This classic is really well re-made.One can not say more of the story-line as this has been remade so many times. I was surprised that the first version was made in 1925. The setting and costumes are really classical and the acting by all three lead actors tugs on one's emotional strings. The two mothers also had their share of fine performance.The dancing in this movie is one of the best. The solo classical dancing of Chandramukthi is exquisite; every movement of her body down to the fingers and eye movements tells something. Ash really look beautiful here. The coupled dancing by Ash and her later on was also very well done and enjoyable. No wonder MJ went to India to learn dancing! He really had a thing or two to learn from India.","imdb_rating":9,"our_rating":0,"algo_label":0}]