[{"heading":" A remake of the 1986 American film \"Ruthless People\".","review":"It was only after getting half-way through this movie (the point where Kamini was kidnapped) that I realised that it was a remake of \"Ruthless People\". Even though they copied a lot of props and ideas straight from \"Ruthless People\", I still found this to be a very entertaining movie. I've watched a few Hindi movies and I really like Naseeruddin Shah's acting - He was terrific in \"Monsoon Wedding\". I found the song and dance numbers quite entertaining, as well. I just wish that I didn't have to use the subtitles... I must miss a bit of the movie keeping up with them.Overall, I give this film three stars out of five. \"Ruthless People\", I give the full five stars.If you don't want to 'waste' money renting foreign videos, I suggest you look into what your local library system has available. There are quite a lot of gems out there waiting to be found.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" The Nutty Proffesor of Bollywood. Rekha is hillarious. American People would love this.","review":"***SLIGHT SPOILERS*** I didn't think I'd like this movie. But since I just love Rekha, I couldn't skip this. I loved this movie. The movie is basicly about an overweight woman who inherited her father's riches. Her husband wants her dead so that he can have the money. Many twists and turns take place where eventually, Rekha is kidnapped. You have to see the rest to know what happens. It was nice to see Rekha in a funny role instead of a serious one. The music video to Nach Meri Jaan Nach was great. Its nice to see Rekha still dancing after so many years. By the way, her character does lose the weight when she's dancing in the music video. I think People in the United States would love this movie if they saw it with its subtitles. I give it two thumbs up.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A remake but brilliant comedy!","review":"this was released back in '01 without much fanfare and any big cast to boast, rekha gone old, and nasrudin not any bigwig. I really enjoy his style, be it anything and he comes too good, leaving aside shaking a leg eh! lol. Cranky Nass at his best believe you me. Arshad Warsi is a totally underrated comedian. Watch his other movies to witness. Anyhoo, copied bit by bit and a complete rehash of the 86 holly movie 'ruthless people', this movie does not disappoint. I got hold of it once on TV, and it engrossed me and left me in splits till the end. No vulgarity, and no lame humor. Does not slow up, keeps the tempo throughout. I should admit that back then, i wasn't aware of the original movie. And it was because of this version that I was forced to see the original. But still, I would recommend this to every one. Watch it at least for the comedy and the expressions. Just one of those movies you see, laugh your guts, forget the clock, appreciate the climax, and loosen up!!","imdb_rating":8,"our_rating":0,"algo_label":0}]