[{"heading":" A movie to watch again and again","review":"Tum bin is one of the best movies ever made. It depicts true feeling and true love in such an immaculate way that can not be ignored. This movie can be an eye opener to all who correlate or define love in terms of bodily pleasure. Every one who has ever loved anyone will surely like this movie. A broken heart will enjoy it even more. All songs of this movie are incredibly good. The songs \" Tum bin jiya jaye kase\" and \"koi faryaad\" are amazing. The actress (Sandali Sinha) looks really great. I have almost fall in love with this movie. I have watched this movie more than 20 times. If you haven't watched this movie, then you are a big looser.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the best love stories","review":"One of the best and clean love story. Story is about Shekhar who in a road accident kills a person. When he comes to know about that person's family, his fiancé, he goes to help them but instead falls in love and tries to run away...For conclusion watch the movie! Songs are one of the best in Hindi cinema. A legendary film.All the actors have done great job. It's sad none of the actors made it big even after such great performances..Watch out Great Jagjit Singh Ghazals through out the movie in background. Simply superb words, Superb Music.It's hard to believe that after such a start, director Anubhav Sinha has given pitiful films like Cash, Tathastu etc. Wish he had made more such films.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Complete Entertainment","review":"Tum Bin is an excellent movie in all respects. The story, screenplay, dialogs, direction, cinematography, acting and music all are excellent and that is why I think it was a hit movie of 2001. All the movie is shot in Canada. The scenery was out standing. All the leading cast was unexperienced but all of them have done a great job. A complete entertainment I would say. Although it is a lovestory, but there is also some humor and that is also very good. The songs are fabulous. Especially the song \" Chhoti Chhoti Raatein\" was very nice. The ghazal \"Koi Faryad\" also touches your heart. Sandali Sinha looks quite beautiful.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Lie back and feel the merry of Indian movie,","review":"It is one of the great movies which you would like to lie back and see after a tough week or after you are done with your exams. this movie has all the charm and all the good in it. you will not find any villain , its all a feel good movie.you feel good thats for sure. The making fascinates you about Canada. This is a lovely movie with charm, music. All the stars in the movie were beginners and none looked as they were doing their first movie. It also shows the sentiments of Indian family though in India or abroad. it touches you.This movie reminds me about great happy days of my college days. its all in all a movie worth watching and songs can be played in your car for a long time.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A masterpiece by Anubhav Sinha","review":"You need to watch this move to understand it. I would say this is the best masterpiece made by Anubhav Sinha. He may not be able to make any movie better or equivalent to this on.Imagine, making a movie with all debut actor/actress with such a great script/music/lyrics/emotions & what not!!!The best parts are wherever Shekhar is looking into Piya's eyes & they both know that they love each other but again both are holding themselves due to their own pains...The song \"Koi Fariyaad\" by \"Jagjit Singh\" speared many hearts even today...If you didn't see it, you've missed something worth in your life to hold on...","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Wicked Movie","review":"This movie is definatly one of the best this year. It has really cool songs. It probably won't win any awards or anything, but it is really good entertaining film. I recommend that whoever likes love stories definatly goes and sees this one!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A normal descent movie... Simply masterpiece","review":"A normal descent movie... Simply masterpieceI saw this movie first time in 2005. Since then, I have seen this movie many times. The movie is a simple love story. Indian movies are full of overacting but this movie way different. In fact, there is no fight,no adulteration things, nothing.All the actors have done a nice job. The movie is very descent. A must watch for all the age people. I guess the way the movie has been presented has to awarded.My best wishes to all the actors of this movie and specially the director for keeping the things simple and understandable.simply the best !","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Pleasant surprise","review":"A movie devoid of any superstar cast can have good results is illustrated by this movie. Like any other Hindi movie however this movie has a melange of emotions that is bound to appeal to any demographic- including Canadians...just because its set in Canada.Humor is the type that stimulates the brain and not the johnny-lever slapstick. Good strong performances that stay clear of tear jerking. The movie began with a car accident which was probably the weakest scene...don't return the DVD at this moment ;) I switched the channel it was playing on and returned to a comedy scene and I regretted having missed the parts before that.Support this movie...this should set the trend.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" best movie!!","review":"Tum Bin is one of the best movies of Bollywood. It has awesome songs. It has won six awards for its excellent sound tracks and story; which explains why you should watch it! It is a really nice movie for a family to watch. Although it is a love story, but there is also has some humor. There aren't any well known actors performing in this movie, but it still rocks!! Those guys did a great job, and the movie's director also wrote a awesome story. All of the songs in this movie are great, especially, \"Tum Bin\" and \"Pyar Hamko Hone Laga\". It's a must watch movie ! :) Sandali Sinha, and Priyanshu Chatterjee, did a great role in this movie !","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A movie that gives you tears","review":"This is one rare movie that made me cry, and I cried like anything. Everyone has spoken about the love and stuff, and that has to be the primary thing in the movie. But, another important aspect was the relationship between a brother (Amar and Shekhar) and sister (Mili). Their sweet bonding, a sister's love for her brother and the sadness when the brother leaves has been depicted wonderfully in the movie. Besides, the relationship between Piya and Shekhar, the transition of Piya from loving Amar to falling for Shekhar, the guilt and trying to restrict herself...wonderful.The movie was released in 2001, and I am writing this review in 2016, more than 15 years later, because I watch this movie almost every month, my personal diary is full of quotes from this movie, and I shed a few tears along with the movie for love...","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" 18 Years Later (2019)","review":"This film was released 18 years ago. This seems like a lot of time but Tum Bin brings out emotions in such an honest way that it is still refreshing to see this after so many years. And time and time again I see this film because it is just so pure.\nThe story might be simple and ordinary but the earnestness that the characters show while portraying them makes them appealing (looking at you Priyanshu Chatterjee). I do admit that some of the actors (Sandali Sinha, Himanshu) looked quite wooden in their scenes, but I can let it go because the film and the ambience it creates makes me forget the flaws of the film.\nAlso this film gave us Koi Faryaad in Jagjit Singh's melodious voice and honestly, I can't complain now. This song is still in my playlist for times that are bittersweet.Not the most amazing movie, granted but an honest and a pure movie for sure.\n:)","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Nice to watch. This movie stood out amidst a rush of masala movies...","review":"This movie is nice to watch. In 2001, when there was a truckload of masala / baseless movies coming out in Hindi cinema, this movie stood out.You won't find sensitive or masterful expressions on the faces of the actors in this movie, mainly because it was a debut movie for all the leads. However, the story keeps you interested. It's a no-nonsense storyline, with some obvious tricks of trade from Bollywood, but what really captivates you is the honest-guy thinking cap that Shekhar (Priyanshu's character in the movie) wears. There are no super-hero scenes, nor any item numbers - which make it a pleasant movie to watch.The music is a delight to listen to.Definitely recommended.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Overall an entertaining movie.","review":"Warning: May contain a spoilerSYNOPSIS: Shekar (Priyanshu) is a sought after something or other in the business world of Mumbai. At some social gathering, he meets Amar(Rakesh) who is the owner of Shah Industries in Canada. Amar tries to recruit Shekar for his company but is unsuccessful. On the way home a tragedy occurs as Shekar's car hits and kills Amar. Shekar's friend manages to pull him away from the scene as the police arrive.Shekar's conscience keeps bugging him and doesn't let him live in peace. In the end he decides to go to Canada, to find Amar's family, apologize to them and leave his punishment up to them. Shekar's strength fails him and keeps his past a secret as he applies for a job at the now sinking Shah Industries which is now managed by Amar's broken-hearted fiancée, Pia (Sandali Sinha).Shekar then manages to bring Shah Industries back from the slums. He also fills the gap Amar left within his family and with Pia. Shekar falls in love with her. A twist in plot comes in the form of Business tycoon Abhigyan (Himanshu) who in the process of helping Shah Industries, falls for Pia. The rest of the story deals with Pia's complicated love life and how Shekar finally reveals his dark secret.REVIEW: The story although familiar, shows originality at points. Scenery is awesome. Canada never looked so appealing. Credit goes to Anubhav Sinha for picking a place besides the Swiss Alps. The cinematography is excellent especially in the songs which are picturized really well. Also the music by Nikhil-Vinay is a pleasant surprise turning out to be the strongest point of the film. Anubhav Sinha being the second strongest. Even if you don't watch the film, make sure to get a hold of the songs. Most notable among them being Koi Fariyaad and Zoom Bumbura.I did not expect much from the lead actors, this being their first film. Sandali Sinha aside from being a pretty face, was below average in the acting department. Also her voice started to hurt my ears. Himanshu as Abhigyan is the worst of the lot. He has a lot of trouble delivering his lines. He seems to be reading the script for the first time. And seems to be in pain while trying to relay emotion. Rakesh, who doesn't have a very big part is pretty decent seeming very natural. Priyanshu by far has the best role and also does better than any of the other players. He is the only one that I would like to see more of.BOTTOM LINE: Tum Bin is an entertaining film, a good way to pass a few hours. Don't expect too much but it is by far the best of the projects coming out nowadays with all those newcomers. Hopefully Anubhav Sinha will get a chance with a bigger unit and better actors. Watch Tum Bin for the music and scenery.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Best slow touching romantic movie of all time!","review":"A romantic marvel touches heart in every second. It is a movie for viewers with a different taste. The storyline of the movie scores above all. Shekhar's character in the movie demands a lot of maturity and depiction of multiple layers of emotion which is immensely justified by Priyangshu. Sandali Sinha looks sweet and played her character pretty well. The songs are perfectly placed to make the slow but steady pace going on. The director has given much thought about characterization. The comedy reliefs are little unconventional but come in regular intervals to balance viewer's emotion. This film can be watched multiply times yet the film is never boring.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Best Indian movie in romance genre","review":"Its been 15 years and now that they are releasing a sequel I am trying to recall the number of times I have seen the original. Today I can say its the best romantic genre movie from India. Half of bollywood movies are on love genre and so it was hard to say Tum Bin as best, after all we have had 'Hum Dil De Chuke Sanam', 'Kabhi Haan Kabhi Naa', 'Rehnaa Hai Terre Dil Mein', 'Baato Baato Mein' etc. However Tum Bin is distinct for its simplicity, you see broken characters and you feel equally helpless. Someone who has seen 'The Hunt' will get my point. Music is still refreshing , if you understand Hindi you will appreciate beauty of Jagjeet Singh's lyrics. Tum Bin has no subplots, story is linear, characters come in and out, no fancy edits, just pure story telling making you root for lead pair. By the end I felt I saw some good, not great movie, but today I feel it has grown on me.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Heart-Touching romantic movie","review":"I have watched this movie almost 5 times in last 10 years. Every time I find it more special than the last one . The most intriguing aspect of the movie is its love story - simple, clean yet touching . Music is just awesome as well as story and direction. Actors lack little in acting, though I find the acting quite reasonable. The acting of lead female actress was decent but for her voice and little unprofessional behavior in the beginning. Nonetheless, the movie stands out to be one of my favorites which Bollywood movies seldom are due to being unrealistic and so much drama and disgusting item songs.If nothing else, you would fall in love with Canada after watching this movie","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Loved it","review":"Awesome movie... Loved all the actors and music is outstanding...","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the best movie","review":"'Tum bin'is one of the best movie I have ever seen. Very nice story, dialogues and songs. It reflects emotions very well. One of good example of care, love and understanding. It fills your heart with love. The song' Koi Fariyad' is really heart touching. Main thing the movie has no romance scene but still brings an example of love. It teaches how to heal someone. It gives a message how honesy and truthfulness and caring nature is great. No more words to say. Morover, this movie gives a progress of growing love. Apart from that a message of optimism also comes from the movie. A wonderful movie without any bigger actors solely based on story and good acting.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A real feel-good fare","review":"Can Bollywood make a good movie without a glamorous starcast? The answer is delivered through a movie that makes you review your relationships and Perhaps make you feel the essence of love. Tum Bin doesn't break any new grounds of sort in terms of film-making but it clearly shows a good story and script doesn't need the superstars to sell it.Tum Bin tells the journey of Shekhar(Priyangshu) from Mumbai to Canada in search of redemption and there he meets Pia(Sandali). The plot then carries on showing the internal turmoils of these two characters as both try to seek their love and search for their destination in life.The acting of its leads are not Phenomenal, maybe because all its star-cast are new and on debut. Priyangshu gets a good role and does a decent job but is often too woody in the emotional scenes. Sandali looks good but thats it, her voice really lets her down in many scenes. Himangshu should look for his career as a model, acting doesn't look his forte. Rakesh Bapat gets too less of screen-space to make his presence felt. But overall the refreshness of the cast along with the supporting actors bring a breezy feeling to the film which lifts it above the average fare. The cinematography is the strong point of the film as it is shot beautifully in and around Canada. And some masterpiece music by Nikhil-Vinay will liven you no doubt, listen to the heart-wrenching \"Koi fariyaad\" by Jagjit Singh and \"Tum Bin\" by Chitra. Thank you Mr. Anurag Basu for a feel-good movie, quite different from the average masala fares of typical Bollywood","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Best Movie Romantic ever","review":"Film india terkeren yg pernah aku tonton and Priyanshu, you look so honest when you said your dialog in this movie,, I love you and All the best!!!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A wonderful touching romance, all time favorite","review":"Without having a single intimate scene or even a kiss, this is the beauty of romance. How wonderfully it has been presented, the emotions, the acting, all new actors worked very satisfactorily. My all time favorite, and the numbers are soothingly awesome for all time. Though the actors could not get another good chance in movies, they gave their best in this movie. If you are a fan of 'Love Story' by Erich Segal, if you love pure romance, you would love the movie. Priyanshu has justified the role of a marketing guy, his confidence make us believe that he is an MBA and has been handling such kind of projects in real life. Even the little girl, Mili, did her part, I loved her acts.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Newcomers shine in this penitence cum love saga","review":"A Bollywood movie made with newcomer actors is successful only when either the newcomers are from high profile Bollywood families and the movie is released with a lot of hype and pre-release publicity or when the movie is indeed very well made and truly deserves success and applause. Tum Bin (2001) falls into the second category.The story of Tum Bin (sans you) revolves around the character of Piya (Sandali Sinha) who is all set to marry her beau Amar (Raakesh Baapat) when he dies in a car accident which involves Shekhar (Priyanshu Chatterjee). Out of his guilty-conscience and a desire for penitence, Shekhar joins the concern of Amar which is now run by Piya and facing acute financial problems. Shekhar, with his hard work, not only brings the company out of troubles and make turn it into a viable one but also renders emotional support to Piya so that she could get out of her grief. In this process, he happens to fall in love with Piya. One rich businessman Abhigyaan (Himanshu Mallik) proposes Piya to take over her company as well as marry her. Now Piya who appreciates Shekhar's efforts made for her company and also feels within her that perhaps Shekhar loves her, is in a fix. In such a situation, this truth is revealed to her that Shekhar only was responsible for the death of her beau Amar. The movie ends on a positive note after a tense emotional drama.The story of a man's accidentally killing someone and then falling in love with his woman has been presented on the screen on quite a few occasions in Bollywood. I don't know where the original inspiration comes from but this theme was used by Gulzaar quite beautifully to make Kinaara (1977) taking Jeetendra, Hema Maalini and Dharmendra in lead roles. With my due respect to the legendary filmmaker Gulzaar, I express my personal opinion that Tum Bin is more interesting than the star-studded and slow-paced Kinaara. The script is very well written and director Anubhav Sinha has maintained the flow of the narrative quite skilfully without allowing the audience to get bored at any point.Kinaara was made by Gulzaar with the top stars of Hindi cinema whereas Anubhav Sinha has made this movie with newcomers and to his great credit, he has extracted brilliant performances from all the four newcomers out of which three are purely debutantes despite the fact that this is his debut also as a film director. Priyanshu Chatterjee is the best performer followed by Sandali. Raakesh Baapat and Himanshu Mallik alongwith the supporting cast also have done well. Good performances have helped the director in making the movie an impressive one.Shot completely in Canada, Tum Bin is a visual treat. It's a eye-soothing and heart-soothing colourful celluloid trip to Canada. The cinematographer deserves a lot of applause for his work. The movie is technically sound though the length should have been less.Nikhil-Vinay's music is another big plus point of Tum Bin. The title track, Chhoti Chhoti Raatein Lambi Ho Jaati Hain, Tumhaare Siva Kuchh Na Chhhat Karenge, Koi Fariyaad Tere Dil Mein Dabi Ho Jaise, Pyar Humko Hone Laga etc. are quite melodious. Faiz Anwar's lyrics written for them are meaningful and touching. The songs of Tum Bin have a long life and they are fondly listened to by the music lovers even after so many years.This theme was again used barely one and a half years later in Dil Ka Rishta (2003) in which Arjun Raampaal and Aishwarya Rai played the lead roles and interestingly, it's Priyanshu Chatterjee who played the role of the dying man. However Dil Ka Rishta could not become as impressive as Tum Bin.The message of this story is - move ahead in life, leaving the past behind and forgiving someone if he is truly repenting upon whatever negative got done by him. Philosophically talking, love and hatred are two sides of the same coin. The way sometimes excess love for someone takes the shape of hatred, the same way we may happen to love someone we have hated a lot. Life never stops. It keeps on moving. Hence we also should move on and allow the wounds of the past to be healed.I recommend this beautiful movie to all who like love stories and emotional dramas.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Melodramatic entertainer","review":"Tum Bin is a melodramatic love story film that can be watched for over 2 and a half hours. The music score of the film is noteworthy,perhaps the best thing about it. The storyline is good. Priyanshu has done well but unfortunately he's not too famous as an actor. Sandali's good too in this movie. 90% is shot in Canada, so the locales are a delight to watch. It is however not a fast moving film,so one must have the patience to sit through the whole thing. The film basically describes how people go through tough times in life and emotional battles,especially when their loved ones are involved.Watch it if you are looking for something sober to spend a lazy afternoon or a quiet evening with a loved one.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" beautiful!","review":"this movie released back in 2001..when i was 10 years old..i still remember i loved this movie and its soundtracks ever since then....then as time passed by..i slowly forgot about this movie few days back.i was watching TV n suddenly i stopped at a channel showing this movie....i was totally delighted that they were telecasting this movie again after such a long time...i watched it again..n it was as fresh n as good as it was when i first saw it.... though the acting was overdone(female lead)..at some occasions the movie is worth watching more than 100000000000000 times....story 9/10 ,acting 6/10,direction 8/10, music 10/10 overall 8/10 REAL DEAL!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Surprise","review":"Anubhav Sinha who made craps like DUS, TATHASTU, CASH recently started with a nice romantic film TUM BIN which was a debut of Priyanshu, Himanshu and Rakesh too and also Sandali SinhaWhat can we expect from this film?The film however surprises you with a nice brilliant take on romance and emotions and also the music helps the filmThe film starts off very well and the Priyanshu- Sandali scenes are well handled and also the Himanshu- Sandali portions though clichéd at places The film is nicely handled and does make us to fell for the characters The film has some flaws like it's pacing which is too slow at times, also the climatic portions do drag Direction by Anubhav Sinha is commendable Music is good by Nikhil Vinay, all songs are fabCamera-work is topnotchAmongst actors Priyanshu excels in his debut, this actor has great talent sadly he is not much seen nowdays His expressions in emotional scenes were fab though he was a bit stiff in some scenes Rakesh is too good too Himanshu is average Sandali too was little bad in voice modulation and diction but she is still good Amongst rest Navneet Nishan is good, Amrita Prakash as Sandali's sister is nice Late Dina Pathak is good too Vikram Gokhale leaves a mark,","imdb_rating":7,"our_rating":0,"algo_label":0}]