[{"heading":" An excellent flick on Shri Sai Baba","review":"I am very surprised over it's rating on IMDb. This movie is well made with a lot of devotion to the Shri Sai Baba. If you're a follower then you must see this film. The stories in this film is realistic and filmed very nicely. According to me, the film has good actors according to the characters and direction is excellent. The film contains the real accounts of Shri Sai Baba's life and also includes the realistic stories of their followers. I am also a devotee of Shri Sai Baba and I found this movie very much interesting. The movie script is well written and the actors also performed well. If you're looking for a good documentary on Shri Sai Baba then I would suggest you this flick.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Best movie on Shirdi Sai Baba","review":"This movie \"Shirdi Sai Baba\" was released in 2001 and has been my favorite most movie. I have seen this devotional film atleast 100 times. The cast, music etc has been portrayed brilliantly. Aushim Khetarpal as Arjun has acted brilliantly as an atheist. All the stories of Baba has been shown nicely as mentioned in the Satcharitra. The music by Pandurang Dixit is brilliant. The best song is Reham Nazar Karo sung by Sonu Nigam. This song makes me weep due to the excellent lyrics and soothing voice. Everything was shown the best in this movie. This film was a huge hit at the BO due to its storyline, cast, music etc. I request all Sai devotees to watch this movie and feel the bliss.Jai Sai Ram!!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great Movie on Avatar Sai Baba!!","review":"I had this movie in my collection and only watched it recently. I was very happy. This is a great movie on Avatar Sai Baba. It has good photography. Look at the Shirdi village photographs, especially on the temple steps. There are great songs too, even modern type songs. For guest artistes, watch for Suresh Oberoi, Alok Nath, Vikram Gokhale and Shammi Kapoor!! The story starts from modern America where there are immigrants, one very devotional, one a Nastik (non-believer). There is a rock and roll song there on Sai Baba. The story then goes back to Shirdi in the days of the young Sai Baba. Shradda and Saburi is evident in the making of the movie. Jai Sai Nath Avatar!!","imdb_rating":10,"our_rating":0,"algo_label":0}]