[{"heading":" Zubeidaa, the rebellious princess","review":"In 2000, Khalid Mohammed, a famous film critic, directed a movie called Fiza. Fiza is one of my favourite films, and I particularly loved the great performance of its leading lady, Karisma Kapoor. In this film, Khalid Mohammed assumes a part as a writer. The one who directs this movie is none other than Shyam Benegal, one of India's all-time best filmmakers, and the one who plays the title role is Karisma Kapoor. This is the third movie in the unofficial trilogy of Benegal movies scripted by Mohammed, all of which are partly fictionalised true stories centred around Indian Muslim women who made a lasting impact on Mohammed's life. The first movie in the trilogy is the brilliant Mammo, which was based on Mohammed's beloved grandaunt, and the second is Sardari Begum, titled after a popular Thumari singer of his mother's era. Both characters actually appear in this movie. But here Mohammed tells the story of Zubeidaa Begum, who was his real mother.Zubeidaa Begum was the daughter of a famous filmmaker and an aspiring actress. When her father, who disapproved of her dreams to pursue an acting career, found out she was acting secretly in films, he arranged her marriage to Mehboob Alam. However, right after Zubeidaa gave birth to a baby boy, they divorced. Zubeidaa was a charming, high-spirited, incredibly honest and rebellious woman who refused to live her life according to traditional mores and was constantly in search of happiness. One such opportunity presents itself in the form of Maharaja Vijayendra Singh, the prince of Fatehpur, who is already married to a much older Mandira Devi. Vijayendra instantly falls for Zubeidaa, and she leaves everything behind her, including her little son whom her father does not allow to take, to enter his house as his second wife. The story relates Zubeidaa's trials and tribulations in the big house, her loneliness and yearning for her son and for her husband, who has very little time for her.The story of Zubeidaa is convincingly narrated and is efficiently presented through flashbacks as told to the character of Riyaz, Zubeidaa's elder son who is now a journalist trying to find some documentation of who his mother was. He is surprised to hear that she was a charismatic woman who lived life to the fullest, and the movie is authentic enough to make the viewer feel a connection to the story and to its main protagonist. Unsurprisingly, Shyam Benegal's direction is excellent and he unusually accepts many of the ingredients of mainstream Hindi cinema, which certainly sets this movie apart from his previous directorial efforts. He is aided by Mohammed's script, Javed Siddiqui's fantastic dialogues, the terrific sound design, the wonderful cinematography, and of course the art direction; the sets, the costumes and the props all successfully capture the atmosphere of the 1950s. One cannot go without mentioning A.R Rahman's music which gives life to the film. \"So Gaye Hain\" is the finest song in the soundtrack and its melody is really calm, haunting and melancholic.The one who is most responsible for making Zubeidaa the movie that it is and the character so memorable is unquestionably Karisma Kapoor. After delivering an all-time great performance as the main protagonist in Khalid Mohammed's Fiza, she is now cast in the role of his mother to deliver another performance of equally high standards. Shyam Benegal once frankly stated that he actually had not seen a single movie of hers before, and therefore he directed her with utmost guidance. Kapoor's portrayal is indeed heartfelt, real and powerful, and she displays Zubeidaa's feisty nature, determination, yearning, anger and frustration with energy, depth and conviction that make her really easy to relate to. Manoj Bajpai is very fine as Zubeidaa's loving husband. Rekha is superb as Mandira. She is amazingly restrained and graceful and is mysterious enough to make one wonder what her real take was. The supporting cast includes Amrish Puri, Surekha Sikri, Rajit Kapoor and Lillete Dubey, and all of them manage to leave a mark.Zubeidaa's ending is really poignant, but its melancholic and bittersweet feel actually explains why Zubeidaa Begum will be remembered. It's great that Mohammed decided to immortalise his mother even though he sadly did not even know her that much in her life and her portrait existed in his mind only from stories he had heard from those who knew her. Anyway, kudos to Mohammed, Benegal and Karisma Kapoor for making Zubeidaa the entertaining and moving picture that it is.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" The Greatest of Movies! A must see!","review":"This is by far one of the best Indian movies I have ever seen.  One really gets a sense of the life in the early 1950's in India.  The plot is very rich.  Full of life.  Full of characters, nuances.  There are so many stories in the background: partition, status of Muslims in India, Indian cenima, fate of Indian principalties.  The dialogue is just awesome. But, of course, the focus and center of the movie is the story of Zubedaa.  Khaled Mohammed's script -- based on the life of is mother -- is simply amazing. In general, I do not like Karishma Kapoor's movies -- but she gives a phenomenol performance here, even better than her performance in Fiza.  I hope she will continue do serious roles in the future.  In fact, everyone in the movie is great.  There are no \"mistakes\" in the movie.  What starts out as very simple story builds up to something very powerful.  There is no naive sentimentality here.  This is art! High art! And no this is not one of those aesthetic pieces that are out of touch with reality.  I just cannot say enough about the movie.  Perfect, perfect, perfect.Of course, this movie is only for serious viewers.  If you are looking for action or laughs, look else where.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Rich And Resonant Historical Romance, Though It Ends Up Feeling Incomplete","review":"Shyam Benegal is an international award winning film director who made his name in the 1970's with films, such as Anker (1974), that focus on controversial subjects involving the examination of fraught, complex social and cultural relationships. These films tend to concentrate on the lower rungs of Indian society. Zubeidaa is a refreshing update in this mode of film-making, as Benegal transfers his name-making qualities to a subject at the higher end of society.It is the story of a young man, Riyaz, who goes on a journey to discover what has happened to his mysterious mother, absent for as long as he can remember. What he discovers is reenacted in scenes set not long after independence, as the naïve but headstrong young Zubeidaa is scandalised by her romance, and subsequent marriage to Prince Vijayendra Singh of Fatehpur, head of a grand Hindu ruling royal family. As a middle class Muslim divorcée with a child by another man, her relationship with the Prince is naturally complicated by socio-political and religious factors.But not only does she become entangled in the politics of the royal circle around the Prince, particularly in her relationship with the Prince's first wife, Mandira Devi, she also gets caught up in the larger politics of India. The film is set during a time not long after Independence, a time of change and uncertainty for the traditional ruling class of India, which still laid claim to about a third of the country.Though it is clear that this film is much more than royal watching, having such a subject naturally supports a lavish treatment, which Benegal ably supplies, as well as making the film's content rich in nuance and resonance, handling its mature romantic storyline gracefully, and skilfully embedding it into its larger historical context.The characters are generally very well developed with empathy and without judgement or cliché. The acting matches this. Karisma Kapoor captures the strength and naivety of Zubeidaa with aplomb, and Rekha is authoritative and understated as the enigmatic Mandira Devi.The only problem I have with the film is Zubeidaa's grown son, Riyaz. Riyaz is imperative to the film, since the viewer follows him on his journey of discovery. Seeing great characters through the eyes of other characters is a useful fictional device, most successfully utilised in Scott Fitzgerald's novel, The Great Gatsby. Nick Carraway's character is revealed by his journey in discovering Gatsby. However, in Zubeidaa, Riyaz stays enigmatic while discovering his mother, and even, at times, comes across as anodyne, feeling more like a biographer looking into an interesting episode in history, not a son trying to find his mother. Rajat Kapoor, playing Riyaz, does not manage to rise above his character's failings. And so, unfortunately, the film ends up feeling incomplete.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Zubeidaa haunts you....","review":"Shyam Benegal is not generally associated with opulent cinema. So when, I saw the trailers of this movie, which boasted of Shyam Benegal's direction, Khalid Mohammad's story, A.R.Rahman's music & Karishma Kapoor's acting, I was quite intrigued. Little did I know that the memory of Zubeidaa would haunt me in the years to come.... Zubeidaa, without a doubt, is one of the finest Indian films I've ever seen. Why??? Well, here are 10 reasons:1) Zubeidaa was like a breath of fresh air in 2001 when the landscape of Bollywood was pathetically repetitive. A beautiful and a poignant story with an equally brilliant screenplay is the backbone of the film.2) Shyam Benegal is able to re-create the magic of the 50s & the 60s. Right from the minutest detail in the frame till the most trivial gestures of the actors...it all oozes the rich sophistication of the bygone era.3) The sets, the costumes, the props.... You cant help but notice the ocean green eyes of Karishma, the luscious red sarees, the whole mood was jussssst right! 4) A.R.Rahman's haunting music paired with Javed Akhtar's lyrics give you some very unforgettable moments in the movie.5) Beautiful characters.... The patriarch Amrish Puri, the meek Sulekha Sikri, the suave Vajpayee, the very elegant Rekha. But the limelight is on Karishma Kapoor, whose complex character haunts you.... In the name of good cinema, please watch Zubeidaa!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Zubeidaa: a Vision of Female","review":"A vision of female follies & desires SHYAM Benegal spearheaded the parallel cinema movement in the 70s and the 80s with movies like Nishant and Manthan whereby making icons of Shabana Azmi, Naseeruddin Shah and Smita Patil. His genuine concern with womens' issues is evident in movies like Mammo and Sardari Begum (both scripted by Khalid Mohammad) with their women-oriented themes. His latest film Zubeidaa offers perspective vignettes and explores the female psyche and interaction in different environments. Benegal has a kindly vision of female follies and characters, their motivations, desperation's and desires.Starring Karisma Kapur, Rekha and Manoj Bajpai, the film has strong a backup in Surekha Sikri and Lillette Dubey, supported by his favorites Amrish Puri and Rajit Kapur, Shyam Benegal calls his film a \"lyrical romance\" and it is one, but that is not all that his film offers. The film, a period romance set in the 1950s, is the story of a young Muslim girl from an affluent family. When her father discovers that his daughter has signed a film, he forces her into a marriage which ends in a divorce and a baby. Zubeidaa meets her true love, a Rajasthani prince (Manoj Bajpai) but the trouble is that he is already married. However, she consents to becoming his Chhoti Rani.Basically there are four strongly etched characters in the film. Surekha Sikri is the Muslim wife in an urban, educated setting who abides by the laws set down by the husband and accepts his tyranny as a traditional male domain, \"you know sahib always has his way. You'll have to do what he says in the end\". Her contemporary is Lillette Dubey who plays Miss Rose Davenport, a dancer in the moviesand she's utterly irrepressible! Out to have a good time, she interacts on a superficial level with everyone connected to her. Still she has a kind heart and when she decides that Zubeidaa has had enough of moping around after her divorce, she promptly introduces her to the dashing prince and shamelessly abets the romance. Her statement, \"men and horses are more my style my dear\", (said with a mischievous wink) is completely her! The interesting thing is that the same fact, when examined by her and by Sikri, portrays diametrically different views of the truth making one realize that truth is never absolute! These two utterly different women, belonging to the same generation, remain true to type till their old age.Karisma Kapoor and Rekha in Zubeidaa Benegal is never judgmental and nor does he allow the audience to become holier-than-thou. So human are both the women and so sympathetically has the director dealt with his characters that one simply accepts them and likes them.The main character, that of Zubeidaa, superbly portrayed by Karisma Kapur, has overlapping shades to it. Zubeidaa has fiery feminist instincts and is rebellious and tempestuous until the end. At the same time she's feminine, vulnerable and very young. She chooses to live her life the way she wants to. After giving into paternal authority once in her first marriage, she isn't willing to throw away her chance for happiness the second time. Fully aware of the prince's previous marriage and family, she's ready to accept a strange environment and a different religion for the sake of love. She makes her choices and sacrifices willingly and knowingly. Karisma has surpassed herself as the passionate, defiant, willful and troubled Zubeidaa, the truly modern woman.In direct contrast to her is Mandira Devi, the Patrani of the prince. Graceful, mature and traditional, she upholds the role and duties of the Rajasthani princess, yet surprises Zubeidaa by saying, \"call me Mandy\". She treats Zubeidaa with resigned, amused affection, never losing her savor-fare while she instructs Zubeidaa in her expected role.The most important facet that Benegal has been able to bring out through the film is the fact of female bonding. Whether it is Lillette with Karisma or Karisma with Surekha or Karisma with Rekha, females in the film interact, react, exist and equate with each other, despite the parameters set by males. They understand and accept each others' drives and emotions. Rekha and Karisma, in fact, have a frank discussion about their respective relationships with the prince. Both accept that they have a different role to play in his lifebut in the final analysis, that role is assigned by the male. So if the prince says of his senior wife, \"woh eek ache Rajput bah ha\", he says to Karisma, \"sada ha seen bane Rana Ur Dill belling\", leaving no ambiguity in the respective role expectation.The plot of the story moves fast from scene to scenefrom the 50s to the 80s (the film is in a series of flash-backs) without losing track of the story. It is also not so 'period' that one cannot relate to it. There are traces of the British upper class manners,egg. The meals and decor in Karisma's house is very Anglicized, people speak English comfortably, on the stereo a Dean Martin song is playing, in a party is a live band with the saxophone, trumpet and drums playing a waltz. There are puff sleeves, shingled hair and net depots, there is talk of the newly-formed Pakistan, the Privy-purses being withdrawn is a burning issue and many details like these to make the setting completely authentic. Back home in Fatehpur too, the true Rajasthani setting has been portrayed with attention to minute detail.In the final analysis, Benegal has made a film which is a milestone as far as women-oriented movies are concerned. The theme, characterization and issues that the film examines are fair to women and have been examined without any searing criticism to mar the tone of the picture.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" As real as the Film itself","review":"Zubeida, is a classic film. In fact one of the best films to come out of the Hindi Film industry in recent times. All the aspects of the film, whether be it the taut and intelligent Direction (vintage Benegal ji), the music (the re-incarnation of R.D.Burman as modern age A.R. Rehman giving very popular and ever lasting amazing numbers, the haunting lyrics, the very original storyline, the entire canvass, was a cinematic treat. Of course the histrionic talents of Surekha Sikri, Amrish Puri, MAnoj Bajpai, Rajat Kapoor, Lillette Dubey amongst others combined with the deadly combination duo of my all time favourite actresses REkha and KArisma KApoor was deadly! In fact i can't thank Mr. Benegal enough for bringing these two great actresses in the same canvas and the result was there for everyone to see. KArisma, i would say, excelled is a low word, she just was as good as Smita Patil or Shabana Azmi would have been in the same role. The kind of Depth, the look, the innocence, the beauty, the charisma, the fear, the strength, the naivety, the revolt, the love - all these expressions and more that she displayed in this film were worth a NAtional Award at least if not the Oscar! Well, the Filmfare critics award made up for it. All in all a collector's item, a great always-to-be-remembered film.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" REALLY good movie. Worth seeing. Painstakingly made.","review":"I saw this movie with minimal expectations. Except that Shyam Benegal is known to make 'art' movies.I left with a most wonderful feeling. Shyam Benegal has bridged the gap between serious movies and the pot boilers produced by Bollywood. I don't expect this movie to be a hit. But here are the things I found fascination in the movie (in no particular order):i) The character of Zubeida as played by Karisma Kapoor was perfect! If it was the intention of the director to show her as a very happy-go-lucky girl that does not want to be confined by anyone or anything - she has portrayed it superbly. Of course, she DOES come across as being selfish, as not being willing to share the limelight (or her love for that matter) with another. But - that is what she IS!ii) The story was very melancholic. Interspersed with moments of laughter. But the melancholy prevails thru till the last frame.iii) Cinematography has a dream like quality (when in flashback mode) along with a matter of fact presence today. I especially liked the sepia tones of yester year juxtaposed with the more real life tones of the present day.iv) The direction itself is (as usual) flawless. I thought there was a mistake once or twice - but upon rewinding I saw (to my relief) that I was very much mistaken. The only part not so convincing is the plane crash itself. If only Indian movie makers would not mind doing the real thing :-) In particular, I feel the reason Karisma seems to be so perfect in this role, is the director. That is NOT to detract from her performancs! But just having Shyam Benegal as a director raises you to the next level - that you probably never knew existed.v) The camera work is poetic. Whether in the past or in the present, it seems to caress each of the central characters. Whether it is Amrish Puri or Rose in the past or Rajit Kapur and the palace in the present, the camera seems to linger longingly on each of them. Especially in the present, when the camera seems to wish the place back to life the way it was.vi) Manoj Bajpai's casting (Victor). This, as expected, is one of the most controversial castings ever done. Manoj's portrayals in movies so far have been anything BUT regal. However, it is MY feeling that he did a commendable job of airing royalty. I thought he was cast perfectly. However, his younger brother seems to be more regal than him. In the one scene in the present, he does look like a former maharaja.vii) Rekha as the Queen (Mandira Devi). Now THIS was a big no-no in my view. She looked so much older than him! However, if history has to be portrayed correctly, what other choice do we have?viii) Lilette Dubey (Rose). This is ONE woman you can see as having done her role complete justice. She floats thru it and you are left wondering whether you should be loving her or hating her.ix) Karisma Kapoor (Zubeidaa). I don't mean to belittle her by talking about her so late in the review. She was perfect for the role. She has done the role perfectly. You love to love the vivacious girl in her. You struggle along with her as she tries to adjust to being a queen - failing miserably. You want to dance with her - when she commits the crime of dancing along with the visiting commoners. You fall in love along with her. She deserves to win the Filmfare award for best actress for 2001. She has proved that she is not a mere bimbette (as Dimple has ably demonstrated the transition from bikini clad gal to fine actress) and is probably the only one of the current Kapoor generation worthy of her great grandfather's name.I rate this movie a 9 out of 10.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Enjoyable","review":"Zubeidaa was a real person. Shyam Benegal has tried to portray her story through the movie. When Indian films graduated from the silent era to the talkies, Zubeida starred in the first Indian talkie - Alam Ara. She was a divorcee who fell in love with the then maharaja of Jodhpur. They got married but Zubeida never earned the status of a queen. She always remained the 'other woman'. Zubaida married the late Maharaja of Jodhpur Hanwant Singh, a high- flier who fell for her beauty. Both the Maharaja and Zubaida were killed in an air crash near Jodhpur 48 years ago. Their son, Hukum Singh, popularly known as Tutu Bana, was murdered fifteen years ago under mysterious circumstances at Jodhpur. Well known film journalist Khalid Mohammed, Zubaida's son from her first marriage, wrote a story on her late mother. Originally, it is a love story, but for the film version, little changes have been made. Now the film - Karishma Kapoor has matured as an actress. She was known as Govinda's heroine. Now with movies like Fiza and Zubeidaa, Karishma has shown that she can act. Rekha is wonderful in her short but important role as the King's elder wife, Mandira Devi. The only flaw I found was casting of Manoj Bajpai as the king. The Rajput kings were really majestic looking - tall and fair and very cultured. Manoj Bajpai did not have that in his personality though he made for it by his acting talent. This is not a typical Shyam Benegal film. People expecting a serious thought provoking movie would be disappointed. This is Shyam Benegal's first attempt to bridge the gap between Commercial cinema and the 'art' cinema.The movie is a love story of a journalist talking to people trying to find out all he can about a mother he never knew. He meets people and through them Zubeidaa's story unfolds. I enjoyed the movie and give it 7 out of 10.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Good, but not great cinema!","review":"Shyam Benegal continues to carve out a niche as one of the leaders & promoters of indian parallel cinema. this film is based on a true story, set in last days of British rule in India. the acting is good all around, although no fireworks here. Karisma is as good here as she was in FIZA. it is a fairly straight forward biography, and although it was nicely done, i found it rather luke-warm as compared to Benegal's other films. in any case, it is a much needed break for viewers who are tired of watching typical Indian masala potboilers.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" An Amazing Film","review":"I saw this movie today and I really enjoyed it - which is a bit surprising because I don't usually like Bollywood movies. I thought all the actors did really well, especially Karisma Kapoor (who played Zubeidaa.) Playing the part couldn't have been easy for her since the character is incredibly complex and she pretty much carries the entire film on her own. So Kapoor certainly deserves plenty of kudos for her performance.What I really liked about the film was that the characters had so many layers to them. For example, even though Zubeidaa is a fearless romantic, the filmmakers also take care to show that she can be incredibly petty and insecure - especially when it comes to Mandira Devi's relationship with Victor. \"I want a necklace just like that!\" she insists when Victor buys a strand of diamonds for the senior queen. Touches like these really help make the characters come alive for the audience. These aren't stock characters; in contrast, they're real human beings with their own failings and inconsistencies.The only real problem I had with the film was that we don't get enough insight into Zubeidaa's relationship with Victor. The producers hint at the fact that Victor thinks of her as a \"toy\" whose job it is to amuse him. But is this really the case? The filmmakers never make this very clear, which I think is something of a pity. I feel that this relationship in particular could have been developed more.Nonetheless, I do think that Zubeidaa is an excellent film - and, as another reviewer here at IMDb pointed out, it's an excellent step up from the \"masala pot boilers\" that the Indian film industry seems to be churning out these days. If you're looking for a Bollywood period piece (set in the 1950's,) that has good music, acting, and cinematography, then Zubeidaa is it.P.S. If you've got the time, I would suggest watching Aamir Khan's Oscar-nominated 2001 film Lagaan along with this one. Both films deal with the subject of Indian independence and play very nicely off one another.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Amazing Film","review":"An Awesome film , it was really sad that the tragedy struck zubeidaa aka Vidya Rani and her husband at a young age!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Majestic","review":"Zubeidaa is the third of an unofficial trilogy of films created by Shyam Benegal in collaboration with writer Khalid Mohamed, but this colourful two and a half-hour film is a remarkable epic in its own right, worthy of being compared to Visconti at his finest and most extravagant.The story of Zubeidaa commences with the flamboyant flourish of her red scarf falling out of the heavens onto her grave at her burial in 1982, and the remainder of the story of her life being told in flashback as it is uncovered by the son of her first marriage Riyad Masud (Rajit Kapoor), now a film journalist. The principal object of the search that will reveal much to him is a missing reel of 1952 film that Zubeidaa (Karisma Kapoor) completed before her father refused to let her undertake a career in the movies, physically removing her from the set. Her father has other ideas for his daughter, arranging a marriage to the son of a Pakistani businessman in order to form a closer alliance between the two families.When the marriage eventually fails, despite the birth of a son, Zubeidaa's rather more free and outgoing friend Rose introduces Zubeidaa to a wealthy Raja Vijendra Singh, known as Victor, who falls madly in love with her beauty. Despite already being married to the more exotic and refined Mandira Devi (Rekha), and despite being a Muslim while Victor is a Hindu, Zubeidaa agrees to become the Maharaja's Junior Wife. The arrangement is inevitably not without difficulties, Zubeidaa feeling threatened by Victor's brother and increasingly marginalised as Victor embarks upon an election campaign to retain authority and represent the best interests of the people of his region, taking Mandy Didi (as she is known to Zubeidaa) along with him, the whole affair ultimately resulting in tragedy.Zubeidaa is a vast and epic movie, colourfully filmed in widescreen with an eye for the opulence of the period, appropriately almost taking on the appearance of a near-fairytale for Zubeidaa's marriage to a wealthy Maharaja, breaking into lively song and dance arrangements with an impressive score by A.R. Rahman (Slumdog Millionaire). There is much more to the film however than it being a beautifully photographed fantasy, the story dealing with Benegal's characteristic treatment of the diversity of Indian culture, politics, religion and tradition, showing where it clashes and complements in all its infinite variety and beauty.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A story of a Princess","review":"I enjoyed watching Zubeidaa. The acting was great, and history and Rajhastani culture were portrayed beautifully. The only thing I hated about the movie was the character of Zubeidaa. It was always about, 'I, Me, Mine' with her, and to me she seemed like a spoiled and childish brat. Karishma Kapoor looked very pretty and her acting was wonderful, despite a stinky character she portrayed. Rekha looked beautiful and young as always.If you can help not hitting the screen every time Zubeidaa wallows in self pity, I recommend you to watch the movie. If nothing else, it can give one a pretty good idea of the lifestyle of Maharajas in that time era!","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" A melody of a film.","review":"The first thing that strikes you is the haunting back-ground melody of A.R. Rahman which repeats itself with the fabric falling from the sky, and the beauty of the period that is well photographed. This movie reminds me of Merchant-Ivory production with all blossoming English Countryside. Shyam Benegal is an ace director who has produced some classic Art-House films and \"Zubeida \"is one of them. Amrish Puri is his usual talented self. Karisma Kapoor has given her trademark acting but she will never reach the intensity of acting as in \"Rishtey\". Manoj Bajpai is a good actor who does justice to any character he plays. This is a movie that leaves you the feeling that you have just read beautiful poetry and you want to read it over and over again.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" A stupid character made to play by Karishma","review":"Zubeidaa is one of the worst Films of that year. It is apparently based on a real life princess. I don't understand, why make a movie about a person that nobody knows at all. If the person had an interesting life like Bhagat Singh, then it is acceptable. Zubeidaa'c character is Completely boring and has no common sense. Its either Zubeidaa was one hell of a immature person or Karishma did a disastrous job. Karishma Kapoor has either given us Flops or has acted Immature in at least one scene in all her films in her entire career. This is more of an art movie, that many people hardly like watching. I'm so glad she did not receive Best Actress for this movie. Her family is known for rigging awards so it can be fixed under their family winning many of the awards.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" chasing shadows","review":"Some may say she is immature....for some she is naive...and for most it is difficult to understand her, she is just a person who wants to lead HER life on her rules, she has many dreams..which she chases...but every time these dreams fall down..like a dried leaf from the green tree.Deeep down within she is unhappy, and this unhappiness begins to widen more and more with every moment in her life, no one tries to understand her, its only judging throughout, but at last with the crash of the plane, her dreams crash and she is set free...free from the society, free from everybody!!! superb shyam benegal movie...excellent acting by all cast, gr8 story..a must watch!!!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" missing actors","review":"I think this movie did a good job of portraying life at that time in India,...but I think they should have given credit to all the actors,...e.g. what's Firoza's real name? Does anyone know?As for the movie,...I think it was made well and the people in it did a wonderful job. The plot was good, and I enjoyed being a part of the movie. So if anyone know's Firoza's real name I would really like to know it,...or anyone else that wasn't mentioned.Also,...I was wondering if you think Zubeidaa made that plane crash so she could be with the one she loves forever?","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" yaaaawn....","review":"this movie is pretty yawn friendly...the rather insipid screenplay by khalid mohamed does no justice do the movie which is better than average in almost all other aspects. the dialogue, once again by khalid is pretty good, but the narrative leaves much to be desired. the music by a r rehman is, once again, mind-blowing stuff. so gaye hain is probably one of the best songs in its genre ever. kudos to rehman and benegal for the great music. karisma kapoor comes up with a good performance, but it is in no way great. yes...karisma has come of age from the days of jhatkas and matkas... but she still has a long way to go before she can match up to bollywood actors like amitabh bachchan, tabu, kajol, shahrukh .. and yes, amir. as for the rest of this movie... keep it for a lonely afternoon.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" what did the critics see in this?","review":"i am not a great fan of indian movies, but i was genuinely excited to watch this film. the concept seemed new for an indian movie, and the previews made it look as if this is going to be a powerful story about a woman torn between love and duty. i was immensely disappointed with the film.i'll have to admit that i admire the intentions of shyam benegal. he wanted to create a love story of immense power that no rule could not stop it. he wanted zubeida to be portrayed as a beautiful and confused woman who is torn between relationships. but karisma kapoor's acting is so hackneyed and cliched, that the whole essence of the character disappeared! and the script was terrible... i twitched in pain every time the characters say lines such as \"roses for auntie rose\" or \"aap mujhse jalti hain?\" the characters were not well-developed, and most of the roles were stereotypical one-dimensional characters.but the biggest problems is probably the character of zubeida herself! instead of coming off as an admirable and strong-willed woman, zubeida was nothing more than a selfish, greedy, jealous, cold b*tch!the story has already been done before, and it has been done better.. don't waste your time at this feeble attempt to be an art film!","imdb_rating":6,"our_rating":0,"algo_label":0}]