[{"heading":" Very nice movie","review":"What impressed me most about the movie is the tightness of the script. Events unfold one after the other. Neither too fast, nor too slow. Keeps you gripped. The events are coherent. Something you rarely see in Indian movies is people referring to events that have happened in the beginning of the movie. More often than not, the scripts are improvised on the sets and to maintain continuity the dialogues are abstract in nature so that the different parts gel in. To make a movie with cross references to subtle events needs you to have a script very firmly in place.Second good thing about the movie was the experimentation with Visuals. Though at some points I felt that they have just indulged into special effects without the need for it (they should use effects only where needed), but honestly I was very impressed by the efforts taken to meet quality standards.What has put off many people about the movie is the songs and dance and the unrealistic fights and some silly extremisms. Well the songs really don't have much bearing on the movie. And they have experimented with a very rustic style of entertainment which won't get wasted on everyone. As far as the fights and 'silly extremisms' go, I feel they tried to retain the HERO flavour which would really appeal to a large aspect of the masses.The movie has very innovative ideas and also dares to be different - thougt most of that part should be attributed to its South Indian Counterpart.I would say please go and see the movie. Its a nice experience. Appreciate it for its professionalism and technical expertise. Appreciate it for amazing dialogues and great performances by Paresh Rawal and Anil Kapoor both. It is a thought provoking film - something I feel the movie really set out to be. So its purpose is served.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Inspirational","review":"The director has done a good job with this movie. It is thought-provoking and inspirational. The plot is along the lines of \"What if I were the President or the Prime Minister of the country for a day\" essays that we have all written in our school days. Not only does it expose corruption in various aspects of life (which is not really new) but it also offers genuine solutions in tackling those problems. There are enough twists in the plot to keep you glued to your seat. I was disappointed with Rani Mukherjee's role which is insignificant and restricted to singing songs with the \"Hero\". Unfortunately, the songs aren't great. If I could edit the movie to delete the songs and the long fights, I would. But overall, if it inspires even one good soul to enter politics, that would be great. Three cheers to the director!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Excellent","review":"This is a remake of Shankar's own south film Madhalvan in Hindi. The south Whizz kid director has made an awesome spectacle of a film with Nayak.It is a definite must see. Rahman's music is superb, 'shaka laka baby!' to say the least. This film contains superior special effects and CGI for it's time, unlike others who have no sense of using CGI effectively and non garishly, Shankar has created beautiful sequences for the songs. The cinematography is breathtaking, a joy to the eye. The South influence is very imminent, that is what makes this film so good along with a bravura performance from Anil Kapoor and the sensuous Rani Mukerjee although underused only adds to the films beauty.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Nayak - Absolutely Magnificent!!","review":"Nayak - The Real Movie. A Great movie. A thoughtful process.Nayak has it all. It's no family drama with some crying trash thrown in. It's a thoughtful and a gripping story with exhilarating performances. Rahman's music is excellent. His typical Western Classical beats mixed with traditional Indian music with some Marathi influence. Picturization is brilliant especially in the song, Saiyaan. South Influence is not very imminent here unlike my friend who thinks it is, and believe me influence cannot make a movie good. It's the great story that grips the audience and Shankar's brilliance. I urge Shankar to make more movies or Hindi directors to remake some of his movies so we don't have to tolerate Aditya Chopra trash anymore.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" breath taking","review":"This film is the best ive ever seen sooo far. the music is wicked. the acting that anil kapoor did was really good. i personally think this film should win an award. rani acted brilliantly as well. i think its about time she and anil kapoor got an award. i love watching indian films. but this one is the best.so who ever reads this please watch this film you do not know what you are missing.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A dream for the future of India","review":"Nayak is a movie about India's current condition and a way out. Anil Kapoor is superb as the reporter who through his good heart and job gets dragged into politics. In one day he is able to clean Maharashtra through his hard work, dedication, and determination. Yet Baldev Chauhan played by the always excellent Amrish Puri, is not willing to let this go, especially as Rao's work leads to a vote of no confidence. In attacking Rao as well as the popular outpouring of support for Rao as CM Rao is forced to take the position of CM. The additional foil is a love story. Rao is in love with Manjari (played by Rani Mukherji) a village belle whose father does not want her to marry a politician. The movie is an excellent commentary on politics and the power of one man. The powerful idealism is wonderful, yet for some it detracts from the movie. The love story is touching as well. Rani Mukherjee, Paresh Rawal, and Anil Kapoor excell in their roles and add a great deal of emotion.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Well addressed thriller, on being an ideal social servant!","review":"Tone, Script & Story: The movie is how a press reporter is challenged to be a C.M for one day and continues to be in the long run as well. The tone of corrupt by many official's as well as being an ideal social servant by other few official's is portrayed well. The script is tight and it keeps you in your seat till end.It is sad how on thebasis of factors like caste, category and formed groups, formulate such violence. People belonging to such faction possess low I.Q and thus formulate violence even without knowing whole truth. It's a shame, that they can't act wisely.Direction, Screenplay, Cinematography: Direction of S. Shankar is good. Screenplay and cinematography is good as well, except for the part where I dint like animated serpents. Music: Music is good too. Acting: Acting from all leads is good as well.Final Verdict: Well addressed thriller on being a true social servant. Worth adding to your collection.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Nayak Review: This one is a Mahanayak!","review":"Movie: Nayak Rating: 4.5/5Very rarely it happens that you come across a film which is brave in terms of content. If you haven't seen one yet, Shankar's Nayak is one of them. Although I haven't seen the original film Mudhalvan yet, I can still say that Director Shankar's film has managed to hit the right notes, and that too at the right time.Right from the beginning, you realize that a heavily intense drama would follow you till the end. It's true. The best thing is that the producers have left no stone unturned to make this film look at par with mega budget movies. The action scenes are perhaps the best ones ever seen in an Anil Kapoor film. Happy to see good special effects and excellent cinematography.Coming to the story, there's no doubt that it's the real 'Nayak' of the film. The story doesn't give you even a chance to blink, and whatever happens is true to life. Not even a single scene gives you the feel as if you are watching a wrong Movie. Anil Kapoor is in his original form. Rest others have done their respective parts well.However, the only thing that one may not like at all would be the excess number of songs, and that too placed at the time when the film gets serious. But, since they are pleasant, one wouldn't mind watching the songs as well.On the whole, if you are a true Cinema lover, who can watch the film without thinking how much better it could have been, go for Nayak. You will surely love it. This film is a blockbuster indeed!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" The real truth of Indian politics","review":"Amazing movie!!\nGood reflection of Indian politics","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great concepts","review":"I gave 8 to this movie only because of the awesome concept of the film. That seeing the problems in India a news reporter became chief minister for the whole 1 day and tends to change the people and their thoughts and cause development in the country. The movie contains many of the fake scenes and other small as well as some big mistakes.thus i can say according to the concept the movie is must watch but not more than. 1 time","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" We need ministers like Nayak","review":"One of the movies which can be watched over and over again in between some days gap and you won't get bored.I recommend it to all.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Bright and brash","review":"A very silly, bright and brash comic book of a film that highlights Indias significant corruption problems but still entertains. Despite starring the old and hairy Anil Kapoor and the awful Johnny Lever in an irritating first ten minutes this film is bursting with vibrant colour, grand song sequences and energy. Rani is as stunning as ever in her occasional appearances as the love interest and sports a rare (but very welcome!) cute village girl look.Old Anil does surprisingly well as the journalist who turns Ramboesque Chief Minister for a day. He immediately sets about sorting out India single-handed saving dying kids, cutting out corruption, kicking ass and defusing bombs. The highlight being a cheeky Matrix influenced fight scene! The lowpoint being Rani kissing his fat hairy stomach.. gross! The plot is simple, far stretched and a bit of boys superhero fantasy. It won't trouble any brain cells but the three hours whizz by.. a real old school entertainer.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Don't grumble over the credibility in the storyline or else different cinema would not come in our way","review":"Firstly don't grumble over the credibility in the storyline or else different cinema would not come in our way. Moreover director Shankar has much conviction in his direction to make the overall product fairly digestible.So we have a journalist Mr. Shivaji Rao (Anil Kapoor) who in an interview with the CM (Amrish Puri), is challenged to work as a CM for 24 hours. Accepting the challenge he does everything in those 24 hours from clearing JHOPDI'S to suspending corrupt KHOPDI'S. In the second half, by public demand he is elected as the permanent CM , but ironically in this half he spends more time romancing with a village girl (Rani Mukherjee).A well written script and a fast pace screenplay, successfully grab's the audiences attention. Rehman's music is not much hot this time but the song picturizations do have an artistic visual appeal. Lacks of bucks spent on those huge sunflowers , tall bhuttas, fat pumpkins and a thousand matkas ( though do not make much sense, but) are surely different than those usual running around trees or dancing in foreign locations.Some scenes have been very well presented, like the conflict between the bus driver and the students, the interview with the CM and the assassination of the CM at the end. But the MUDDY MATRIX oriented fight sequence was overdone and could have been avoided. In terms of performance, Anil Kapoor is extremely convincing and adds life to the portrayal of his character. Rani is charming. Amrish returns to a sensible negative role. Paresh Rawal lends excellent support.Finally if you think hundreds of movies have been made on corrupt system theme, then this one is no new but a good example of old wine in the latest bottle.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Mudhalvan downgraded","review":"Even though Nayak is no where near as good the original Tamil version ie Mudhalvan, this movie is still good because most of it is a frame by frame remake of Mudhalvan. Despite its weaknesses one must commend Shankar for trying to bring this concept to the Hindi-speaking audience although the political situation in north Indian cities is'nt as bad as the situation as the southern ones which Mudhalvan originally portrayed realistically.The north Indian audience may thus have trouble digesting some of the events in this movie which south Indians in contrast, will find as common evils within their city and society. Anil Kapoor doesn't act as well as Arjun did, nor do the other actors such Paresh rawal touch or even approach Manivannan's or Vadivelu's hilarity and performances. Even the great Amrish Puri is no where as good as Raguvaran. Although any non tamil speaker will not be able to fully appreciate the mudhalvan story, Nayak does make a genuine attempt to get them to understand it.The music has been downgraded as well. The songs are nothing like the original Mudhalvan and mostly sound bad. Nayak is a decent remake but no way as good as the original. The comedy in particular, is quite botched up and there's no \"Poda Panni!\"","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" A mismash but some good moments and a good msg","review":"What you call a film like NAYAK?It has a message, it has a good topic but it's handling is a mishmashIt sometimes is like a social drama and sometimes veers into a surreal modeIt's like a south film, not surprising directed by Shankar a south Indian directorThe film starts rather painfully with a bad joke by Johny and Razzak Khan and they are many of such incidentsThe turn of events like the riot is ruined by melodramatic and exxegarrated picturisationThe interview too is too contrived to take seriously, also Anil made an interviewer from a cameraman is also sillyBut the things Anil does to change the state of affairs is well handled though it's too contrived to believe that it can be done in 1 day Also the film has too many stupid scenes like Anil getting into disguises and fighting with a goon over a truck Paresh's outburst forcing Anil to join politics again is well handled and also the finale Direction by Shankar is good in parts Music is okayAnil Kapoor looks his best here and he dons the role perfectly his formal clothes, his natural acting and his common man type look suits the role Rani annoys as his girlfriend doing all the nonsense she mostly does in most films Amongst rest Pooja Bhatra is okay, Johny Lever hams it up as usual and irritates Amrish Puri is good in his part though a bit too much Saurabh Shukla is funny Paresh is a highlight, he is a natural hope to watch him in such roles now. His outburst is perfect Amongst rest Shivaji Satham is okay Vikram Gokhale has done dubbing for Anil's father while Neena Kulkarni is as usual","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" The real hero","review":"Shivajirao a TV reporter for QTV takes the interview of Balraj Chuahan, Chief Minister of the State. He asked him questions which humiliate him a lot. Infuriated, he challenged him to become Chief Minister for a day. Shivaji accepts the challenge and becomes the Chief Minister. He is assisted by the cunning assistant Bansal played by Paresh Rawal.After taking over, he suspends more than thousands of babus on charges of corruption. He tours the city, the surrounding areas to find out the various problems. He closes his day with arrest of 12 ministers and the Chief Minister himself. This makes him the target of those peoples once in power. Once his day as the Chief Minister is over, Shivaji tries to get back to his normal life but he won't be allowed to. He finds that being the Chief Minister for one day has changed his life altogether. Suddenly he is being expected by any and everyone to do something. He is being expected by various political parties to represent them for elections. Now he has got two choices. Either he leaves for some distant land where no one would recognize him and he can lead a normal life OR he would jump to the bandwagon that is called Politics and rise to become a honest politician.Anil Kapoor as Shivaji has played a exceptional role in the movie. Action scenes picturized on him are good. Rani Mukherji plays his love interest. Amrish Puri as the corrupt Chief Minister is remarkable. So as Pooja Batra and Johny Lever in there short roles.","imdb_rating":7,"our_rating":0,"algo_label":0}]