[{"heading":" Long Delayed film","review":"Delayed films are usually horrible as they lose their touch over the time. When I saw the cover of this film, I expected this film to be another Sunil Shetty done to death movie with no story and lots of over acting and boy was I surprised. This was one unexpected film that turned out to be a good film even for bein a long delayed film. Officer started around late 1994 and released in 2001 and yes that is a huge delay. The best part is that this movie isn't a typical action film with lots of nonsense comedy, it is a good thriller film with suspense. However, it is still nowhere close to being the perfect Indian thriller film as it does contain its share of flaws.Officer has a good story for being an action thriller, sadly this isn't as good as other thrillers from the time of its release. Officer tells the story of Special Forces Officer Sagar Chauhan(Sunil Shetty). His is an honest and diligent officer. He has never failed to save people who are in trouble or are the victims of a conspiracy. The introduction is awesome showing a smart and awesome Sunil Shetty protecting a judge who is threatened to be killed by some random villains. These villains attack but fail as Sagar is not the one who fails to protect when he takes a case on his hands. The intro scene is superb and the court scene is awesme too. He takes a case of some rich dude Pratap Rai(Danny)'s private case. After much reluctance, he is ready to take the case. He has to watch over and make sure Pratap's wife Mrs. Meenal Rai(Raveena Tandon) doesn't harm herself as she has a mental problem of attemeptiing to suicide. After some time, both become friends but Meenal falls for Sagar. Sagar doesn't allow this and because he says no to Meenal when she asks her do you love me, she goes to this random construction building and jumps off. Sagar couldn't save her as he is afraid of heights and has this small disease after an accident in his childhood. A devasted and upset Sagar is sent for sick leave out of the city and it is after this part the story becomes thrilling. He meets a look alike of Meenal called Pari(Raveena Tandon) and after some moments she is forced to reveal that she was the Meenal Sagar had met. Jabbar(Shaabaz Khan) and Mangal(the villain who Sunil arrests at the very beginning) were behind this conspiracy of changing Pari's hairstyle and making her Mrs. Pratap Rai for some time. When they find out she falls in love with him, she is instructed to continue to act mad and go towards the same construction building. Over here, she is chased by Jabbar and has goons, she has a narrow escape. She finds out that the girl who fell from the building and died was another person and she was a pawn in this conspiracy. However, the main question now is why would someone do this? Then Jabbar and all his men including Gopal(a mole in the agency) get killed by some dude in a mask. Who is the dude in the mask? Why is murdering the villains? Is there another villain in this story? To find out, watch is good thriller from 2001.Direction by Naem Shah is good for the most part. The movie is well handled even if it drags in the romantic portions. However, the forced comedy by Lobo(Sagar's handler and guardian) is funny but forced and doesn't fit well with the tempo of the film. The direction is good but it is patchy and at the last point the climax isn't hard hitting. However, the reveal of the whole scheme and the real villain identifyed is well shown and the whole plot and narration is superb. The climax is mainly good for its superb action. However, the editing could've been better as several scenes tend to drag and if the editing was better there wouldn't have even been any drag issues.Sunil Shetty is awesome and he doesn't ham like in his Balwaan days in 1992-1994 till Gopi Kishan which was one of his best movies with hardly any hamming. Before that his films were good but he hammed quite a lot and irritated. However, his hair style keeps on changing from the 1994 Sunil Shetty to the 1995-1997 Sunil Shetty to the most recent 2000 Sunil Shetty. Raveena Tandon is cute as the innocent heroine but she hams as Pari in parts. Danny is superb(watch the ending, he isn't any ordinary character, he more than just Pratap Rai). Shabaaz Khan is ordinary and typical and the same goes for the other set of villains. Sadashiv Amrapukar as Lobo is funny and Tej Sapru as Pradhan is average.Music is good, the best song is Pholon Ke Rang Se Dariya Ko and the Kaisa Sama song is also good. The other songs are fillers and time consumers.Action is good and is actually limited, there isn't any over the top nonsense action like nowadays.On the whole, Officer is a good film with some drag which makes fails it from becoming a brillian thriller.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Delayed","review":"The film was started after MOHRA success in 1994 and released in 2001 So we have scenes with Suneil Shetty having long hair, cut to scenes with short hair, in fact throughout the film the looks of the stars keep changing. The film is a remake of VERTIGO and had potential but due to the delay it's impact is reduced. The film starts off well, Suneil Shetty being called to escort Raveena till her death is well handled However the filmmaker falls prey to commercial ingredients and adds lot of action scenes and the end too is predictableDirection by Naeem Shah(assistant of Rajiv Rai) is okay Music is good, Phoolo Ke Rang is a superb song, Kaisa Sama too is good and also the Pari numberSuneil Shetty's looks and performance are inconsistent throughout, in several scenes he wears the 95-97 look while in some he has the 94 expressionless look, Suneil was never a good actor in his earlier days and learnt a lot which shows in this film, yet must say he does a good job in most places and doesn't ham much Raveena Tandon too is inconsistent yet quite good Danny Danzongpa is as usual, Shehzad Khan is okay, Sadashiv Amrapurkar is loud rest are okay","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Could've been better","review":"After the super success of Mohra(1994), Rajiv Rai and his lead assistant director Naeem Shah started working on a another action packed thriller. Unfortunately, Rajiv Rai had to opt out of this project causing a delay. The film was scripted, Sunil Shetty and Raveena Tandon had shot some scenes in the film in late 1994, most of the supporting actors had done their parts and the film was expected to release in 1996. However, several post production problems and the lack of distributors caused a further delay, the expected release date was then 1999. However, there were still some scenes that needed to be re shot and this caused a delay till 2001. The result is a completely outdated action thriller that should've been released in the mid 90s. Officer released in 2001 when the times had changed, these kind of jaded films with half baked plots weren't expected. At the end of the day, Officer got indifferent reviews and it flopped at the box office.Officer(2001) had many things going for it despite being a delayed film with a jaded look. The film had Sunil Shetty in one of his good performances as a special cop. This is probably one of his best acts from his early days when his acting was weak. Another thing was the action scenes which were constantly repeated in the promos, they looked promising. Another great thing was the director was from Rajiv Rai's group of assistants. Rajiv Rai was good at making action thrillers and Naeem Shah assisted Rai in his films so the expectations were high. Sadly, the only thing that impressed in the film were the performances.Officer is the story of a special cop who only takes private cases but one such day, he takes a different kind of private case which he was always reluctant to approach from the start. He has to look after a influential person's wife who is a bit abnormal. As time passes, the wife and our Officer start to fall in love and the obvious thing happens. Mr. Officer can't fall in love with the girl he is protecting because it is not possible. This makes her attempt to suicide like she had tried before and tis time, Officer fails to save the girl. He takes sick leave and he is also demoted for his failure. The movie shifts to Goa and this is where he meets a lookalike of the same girl. A lot of twists and turns happen and the whole mystery is solved, actions scenes pop up, villains get murdered by this random guy in a mask, and the ending is predictable.Direction by Naeem Shah is decent but he fails to handle the film like his mentor, Rajiv Rai. The film starts with promise and the successful trip to the court making Sunil's first case a success is a good way to start the film. Everything from Sunil's reluctance to the explanations of the case. However, the film starts going downhill when Sunil and Raveena fall in love. The film has too many boring dialogs and the events where Sagar gets to know and understand Meenal's pain are well handled but boring. The film picks up after Meenal's suicide from the construction building. The second half is good and the murders are well handled. The identity of the villain is successfully hidden and the suspense is revealed at the right time. However, there are some unnecessary sequences which spoil the second half to an extent. The scenes before the climax where the fake nurse kills the head of Sunil's company and the rest of the staff wasn't required and just adds more bloodshed. The climax is prolonged and typical, the end is stretched and there are typical clichés.Sunil Shetty does a brilliant job as the cop, he is in form and successfully portrays the role of Sagar Chauhan. However, his hair style keeps changing,his acting had improved since 1994 and this was probably one of his good 90s films he signed, if only this released during that time(to become a hit at the box office). Raveena Tandon is good but she overacts whenever she has to cry or shout. Danny is good but his character and the ending is predictable. The others provide decent support.Music is good as well but most of the songs are outdated for the 2001 period. The song that became a hit was the Naa Jaane Kyun song. However, the Phoolon Se Rang Dariya Se Mauj is the best song, Kumar Sanu's voice is simply superb. Action is good but there should've been more of it and the climax could've been better.On the whole, Officer is a decent film but there is room for improvement. It fails to be as good as Rajiv Rai's suspense and action films. The film is still watchable because of the well handled action, the melodious music, and the superb performance of Sunil Shetty.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Could have been a perfect thriller","review":"Sunil Shetty is one of Bollywood's best action hero's, he acted in more than 50 films in the 90s decade. However, some of his films too have been a victim of long term shooting. Some of his long delayed films like Khanjar started in 1993 and didn't release until 2003. Other films like Kala Samrajya started in 1992 and didn't release till 1999. Both these films were horrible in terms of everything, the jaded look, the clichéd performances, and the awful background score.Officer is another one of Sunil Shetty's long delayed films. The film was started by veteran filmmaker Rajiv Rai but his assistant Naeem Shah was the one who did 94% of the work as Rajiv Rai had to leave India for some important reason. Officer was started right after super hit action thriller Mohra(1994) but it was delayed and didn't see a release till 2001. However, some of the scenes look like they have been shot in early 1994 or late 1993 based on the look of the actors. However, Officer is different from most of Shetty's delayed films, it contained a good plot and worked in parts.Officer is about hardworking and diligent Sagar Chauhan who's career is solving cases, he is part of some CIA type department and he is one of the company's best officers. Sagar's career drowns when he fails to rescue Meenal who was going to suicide. What's worse is he fell in love with Meenal. A devastated Sagar leaves Mumbai on sick leave and it is there he meets Meenal's lookalike Pari. Soon, he meets many people who don't seem to be who they are. His close friend Gopal, enemies he arrested in the beginning Jabbar, Dhanraj all try to murder him but fail to do so. It is then Sagar finds out that Pari's life is in danger. However, Sagar is angry at her because she was the Meenal he fell for, she betrayed him. She was changed into Mrs. Pratap Rai based on Jabbar's orders. As the story progresses, Sagar and his assistant Lobo find out they are the victim's of a major conspiracy. Pratap Rai is not who he seems to be, there is some random guy in a white mask who murders all the people who Sagar is about to interrogate after an action scene. After Sagar gets back on the case, the case seems to be confusing, all the suspected individuals end up dying. However, Sagar learns of the conspiracy and there is an action packed climax.In general, the film is not bad because of the brilliant storyline it presents. However, the handling is not up to mark. The thrill factor is definitely missing. After so many murders in the second half you tend to get annoyed as you will want to find out who the guy in the mask is. Everyone linked to Pratap Rai looks suspicious but at the end, it is Pratap Rai who is the villain. Everyone of those who look suspicious end up dead and suddenly the villain reveals his identity. The film has a decent start, the entry by Sunil is awesome. The meeting with Rai, the case handed to Sagar, the action scene where Jabbar tries to murder Sagar but Pratap Rai get's hit all are well handled. However, the movie slows down and drags because of the forced romance between the lead actors. It is unconvincing how Meenal falls for Sagar after a few meetings, the friendship they share however is convincing. The suicidal of Meenal and the twist of the real Mrs. Pratap Rai's death during the building scene is well handled. However, the film drags again when Pari enters and the post interval portion is boring. The film catches up again when Pari's identity is revealed. The rest of the movie is how Sagar solves the mystery and unmasks the culprit which is decent. However, the climax is stretched and it is quite lame. The pre-climax portions where Sagar saves Lobo from the evil doctor is good but the end is too stretched.Direction by Naeem Shah is good but he should have put more effort into the comic and romantic scenes in the movie. They are good to watch but the post interval portion of the film really is boring, it is a pain to watch and any viewer would wish that those scenes would finish fast. However, for a long delayed movie this a quite decent. Naeem Shah proves he is decent but his direction is nowhere as good as Rajiv Rai's. If Rajiv Rai would have directed the film it would have been much better. However, the movie is still decent.Sunil Shetty is awesome, but in every frame he looks different. Sometimes he looks like he's from 1994 or 1995. In the other portions, he looks like he's from 1997 or 1998 and in a few scenes, it looks like he is from 2000. His look changes but surprisingly, his acting is up to the mark. He doesn't ham like he did in most of his earlier films. Raveena Tandon is good as the heroine, her crying is a bit annoying though. Danny is good, he is decent as the villain. Sadashiv Amrapukar is hilarious but his act is forced. The rest are typecast.Music is good, the Pholo song is beautifully sung and the tune is awesome, the other songs like Kaisa Sama are good to.On the whole, Officer is a decent movie but it could have been tad better. The performances are decent, the songs are good, but the storyline drags in parts making it good instead of great.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Waste of time!","review":"This film is full of goofs ,goofs and only goofs! I could make a whole list of them but I don't think it is worth watching all over again.Only 2 things are worth noting-The concept which is not bad actually,and the first song \"Phoolon ke sang\" which is melodious. Everything else is Absolute Bakwaas.Like I said,the idea or concept is OK,about the officer who comes across people who are not what they seem and whose intentions are not what he thinks,but the way the film has been directed is not good.It is full of mistakes, overacting and unimpressive dialogs and songs.Don't bother to watch it.You'll be wasting your time.","imdb_rating":3,"our_rating":0,"algo_label":0}]