[{"heading":" What is this?","review":"Love Ke Liye Kuch Be Karega While I was roaming around at the video store, I happened to find this in the new releases section. I first took a look at the cast list and was quite impressed with the star list. With names like Sonali Bendre, Aftab, Fardeen Khan, Saif Ali Khan, Twinkle Khanna, and Dilip Tahil, I was amazed to see a multistarrer of such proportions. What really excited me, however, was the director. E. Niwas who had directed the flawless Shool a year and half ago was also directing this film. I immediately rented this one out with high expectations. And, to say the least, I'm not really disappointed, though it could've been better. Story: Love Ke Liye Kuch Bhi Karega sums up the entire story line. Starting out with hilarious narration by Paresh Rawal, we learn the problems of the main protaginists and their stories. Sapna (Sonali Bendre) is a really bad artist, but Prakash (Saif Ali Khan) has fallen in love with her for the money. They wed and Prakash gets everything he wants, except respect from his baoji (Dilip Tahil), Rajiv Kapoor, a wealthy industrialist. He plans a new website, but is unable to get funding from Rajiv. Meanwhile, Rahul (Fardeen Khan) is already in love with Anjali (Twinkle Khanna), but is unable to hold onto a steady job, and thus is unable to pay the rent for his apartment, owned by Anjali's Tamil-speaking father. Rahul lives with Harry (Aftab), a lazy man who wants to become rich without working. And so begins the story. Somehow, fate conspires and brings Rahul and Harry to Prakash, where Prakash devises a plan to get money. It involves kidnapping Sapna, and holding her ransom to get money from Rajiv. Each have their own uses for the money. Prakash to start a new business and earn respect. Rahul to get a job (one which requires a bribe) and to pay off the landlord. Harry to travel the world and pay off Aslam Bhai (Johnny Lever), the local chor, who wants to become an actor some day.The story is quite interesting and compelling, but inside all the pretty wrappings, it comes down to a \"man wants to marry woman, but father disagrees\" story. Still, the story is pretty interesting and makes the movie fun to watch, with a bunch of twists thrown in for good measure. Rating: 7/10Acting: LKLKBK comes out quite well in this department. With a multistarrer cast, one would expect it to excell, however. Twinkle Khanna is given almost nothing to do, other than look pretty. Sonali Bendre is ok, but all she does is whine and cry (and look pretty). Saif surprised me. I usually dislike his acting, but his comic timing in this movie was great. He was especially memorable in the scene where he tries to fake sadness and anguish. Fardeen Khan is pretty good, playing the part of a man in need of a job convincingly. Aftab, however, is the big surprise of the movie. After seeing him in Kasoor, I couldn't expect a good comic performance from him. How wrong I was. Aftab is extremely funny in this movie, with a more subtle humor than one would expect in a typical film. And Aftab along with Fardeen make an extremely funny team throughout the movie. Johnny Lever is also funny in his parts, especially his acting scenes and his meetings with Aaj Kapoor. Dilip is, of course, great as the objectional father, and is funny at times. Rating: 9/10Direction/Technical editing The direction is excellent, with scenes flowing extremely well. E. Niwas has proved his excellence as a solo director, ready to take on the previous greats of Bollywood. However, the editing is a little weak. Some of Johnny Lever's scenes are a tad longer than required, and other scenes are a tad short. Rating: 9/10Songs: If LKLKBK has a weak point, this is it. The songs, composed by Vishal Bhardwaj are boring, and most are worth skipping. The picturization for a few songs are good, but nothing new. The only song worth watching is Aslam Bhai, both for its picturization, and its fun lyrics. Rating: 5/10Favorite Scenes This movie has several great scenes, but three really stick out as the most hilarious: The Sonali kidnapping scene, the Saif crying scene, and the Aslam Bhai \"acting mechanics\" scene. Also, for some reason, the scenes where the landlord keeps switching between Hindi and Tamil (between Fardeen and his family) is fun to watch. Rating: 10/10DVD review This is where the film (not necessarily the movie) truly faultors. The DVD is pure BS. Sure, it has the standard Hindi movie features of song and chapter menus and subtitles, along with an extremely fun-loving \"Making of...\" feature, but Video Sound needs to learn how to make DVDs that people will enjoy. You see, the problem is that when you start the DVD up, you have to sit through ads. 10 minutes of ads! And, to make it worse, they're all the same. Half are ads for Tum Bin, and the other half for Yeh Raaste Hain Pyaar Ka. They're not even midly entertaining to watch once, and watching them everytime you start the movie is absolutely rediculous. They're impossible to skip over, even after trying all possible tricks to get p a s s e d it. Thus, I can only recommend this DVD for a rent, and nothing close to a purchase (unless you have that much patience). Rating: 2/10Overall: This is a great movie to watch a few times. It's extremely funny with more intelligent humor than your average movie (similar to Hera Pheri in that aspect). Not a movie to be missed, but I would recommend leaving this in the store due to the horrendous DVD. Rating of movie (not an average): 8.3 Rating of movie with DVD (not an average): 7.1","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Sucks..ripped off Fargo","review":"the movie sucks and is unoriginal... copied off Fargospoilers in the movie Fargo, the wife dies and everything falls apart in the Indian version, everything ends up swellthe basic premise of a man who needs money marrying a woman with a rich father and hiring kidnappers to \"kidnap\" his wife is the same...when will Bollywood realize that it cannot copy American movies and get away with it?? This movie is worth skipping and definitely not worth watching. There are better Indian movies such as Baazigar and Hum Hain Rahi Pyar Ke.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Funny and ahead at it's times","review":"In 2001, Bollywood mostly had comedies which were slapstick and overacting, This film however had a subtle type of comedy meant for multiplex audiences something which could work today. The film did reasonably well perhaps but could be better in today's times. The film had a not so appealing cast for that time too The film is a remake of Money(1993) Telugu film. It starts off quite slowly but picks up well, the introduction by Paresh Rawal(who played the lead in the original too) is well handled, Characters are well fleshed out mostly though the girls get hardly much to do. Johny's comedy track is superb, though his track does lengthen too much in the second half. The film also gets lengthy at times but yet it's a funny film to watchDirection E Niwas after SHOOl is superb Music is okay, Aslam Bhai being the best song rest are okay though too many songs at timesAmongst actors The show belongs to Johny Lever, he plays Aslam Bhai superbly, thankfully no overacting, sadly which he does mostly Aftab Shivdasani in his first comic act perhaps is good in his role His scenes with Johny are good Fardeen Khan is decent, those days he was quite raw in emotions Saif Ali Khan is superb in comedy, especially in the mirror scene His next film was DIL CHAHTA HAI which changed it all Sonali Bendre and Twinkle Khanna get less scope and are okay Dalip Tahil,Sharat Saxena are good rest are okay Snehal Dabii as Aaj Kapoor is hilarious though","imdb_rating":6,"our_rating":0,"algo_label":0}]