[{"heading":" Decent action flick!","review":"Farz is definitely a good action-packed cop thriller worth watching. Sunny Deol fits the cop role, which is obviously tailor made for him. This movie has tons of mind-blowing action and thrills. The action is superb! His introduction and the climax are very well-done like everything else. Jackie Shroff is superb and tough as the suave villain. Sunny Deol's shear machismo is just awesome, and for that, he is truly the Action King. The climax was explosive, although it would have been perfect had Sunny used big machine guns. Om Puri's role as the good and honest cop reminds you of Ghayal. Johnny Lever provides comic relief, although it was shocking to see his character killed in the movie. Sunny Deol's cop role is similar to that of Champion, but this role is substantially more action-packed. Enjoy!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Outdated","review":"Sunny Deol has done several thousand films wherein he played a muscle flexing cop, Is that new? Raj Kanwar the same director who gave him JEET gives him a stale film, I agree Raj Kanwar's films hardly had new stories but there had some substance as well. This film was perhaps stuck for 4 years in cans The film released few months after Raj Kanwar's superhit Har Dil Jo Pyaar Karega which released in 2000. Farz is a mix of Lethal Weapon and Richochet and several other Hollywood films, there is nothing new we haven't watched before. The film follows the same action template done to death thousand times, Also we have a weird cameo by Johny Lever who reaches at the right place at the right time and that too with different getups. There is a reason given but not justifiable.Direction by Raj Kanwar is not that great, due to the stale plot Music also is staleSunny Deol repeats himself and does the same act he has done before, Preity Zinta with a dubbed voice doesn't get much scope, Jackie Shroff is superb as the villain, strangely his last release before this was Mission Kashmir where too he played a villain. Mukesh Tiwari tends to overdo it, Johny Lever tries hard to be funny, Om Puri and Farida Jalal are okay,","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Very good movie","review":"Farz very good movie with action and the Sunny deol is in a Brillant honest cop & preity zints was a average & the villan of the movie Jackie shroff played Villan after Mission Kashmir(2000) but the film was a Average","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" watch it and don't take it too seriously","review":"This was the first Bollywood movie I ever saw and it was incredible - I have to say first that all songs blew me away, action is fun, the dancing is wonderful and Sunny Deol has a lot of sex appeal. His acting is not that good, and he can't really dance, but you keep expecting he'll take off his shirt (which doesn't happen). After all, he's a serious cop. Who gets set up by a terrorist. The story is rather simple, but if you don't take it too seriously (how could I, I laugh at Stallone/Segal/Van Damme/the Rock movies) it's quite enjoyable. I thought of it as a caricature of a Hollywood movie, and you know what? In that sense, movies like Farz are far superior to those produced in Hollywood.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A lousy \"remake\" of Lethal Weapon","review":"Well, the subject says it all. Acting is bad, and the plot is not very appealing. Preity Zinta, I must admit, is worth seeing in this one. In addition, the main theme song is quite remarkable.","imdb_rating":3,"our_rating":0,"algo_label":0}]