[{"heading":" Doesn't live up to expectations.","review":"I have to admit that I was really looking forward to Grahan's release. The basic plot sounds good enough. Parvati (Manisha Koirala) is raped by some Chief Minister's son. He doesn't let her go until all her wounds are healed. When she does get away, she lodges a report against him, only to have his lawyer (Jackie Shroff) accuse her of being a whore. The CM's son gets away scot free while she's rejected by her fiance's family. What happens to her next is what form the basis of this film. This film had the potential to be a hit, but it focused too much on Manisha's \"madness\", thus neglecting her actual trauma. Her behaviour is unlike that of a rape victim. I wish the makers of this film had actually done some research before venturing to make this film. The songs really seem out of place and they're highly mediocre. Tamil films' Raghuravan is utterly waster in the role as Jackie's brother. This guy is too good an actor. They should have given his role more depth. Come to think of it, none of the characters are developed enough for the audience to relate to. I couldn't even sympathise with Parvati.Grahan is a \"could-have-been\" kind of film. Watch it only for Manisha's acting.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" It's all about Manisha","review":"Many films have been made and focused on rape victims. To say that this one is special would be like to say this one is the best of its kind. In fact, Grahan is heavily flawed and sadly enough, badly made. The film had been delayed for five years (!) until it finally saw the light of day. Even if it had been released at time, it would have been considered outdated. The film adds nothing new to its main issue. It tackles nothing. The main conflict of the film is a bit unrelated and not really wise: the lawyer is actually a relative of the rapist. The script is poor, and the scene in which the main protagonist gets revenge is almost pathetic. The ending too is, though quite a relieving catharsis, very unbelievable.I appreciate the attempt though. I think Manisha Koirala tried her best in a role that is seemingly good. The rape scene (the film's first scene) is superbly acted by her. But her acting can't save a film like this and she ends up being unimpressive and at times unconvincing because of the poor script. Jackie also does his best, and he partly succeeds in portraying a man who is torn between family and professional responsibility. It's a sad film that comes to a surprising solution. I don't regret watching it, but I certainly won't watch it again.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" A bad movie with a decade old theme","review":"'Grahan' is eventually released after a delay of more than one year and sadly it disappoints. 'Grahan' is the story of a rape victim Parvati (Manisha Koirala) who quests for justice after being declared a prostitute at the court by an established lawyer, Jaggu (Jackie Shroff) and humiliated in public. The film fails on all accounts. Be it editing, cinematography, music, lighting, choreography and last but not the least, direction. Manisha Koirala appears confused as the rape victim. She doesn't do much till the end to get out of her miseries. Jackie Shroff is mundane. Anupama Verma was strictly okay. Prasad Purandhare doesn't appear as menacing as he should be. Avoid!","imdb_rating":1,"our_rating":0,"algo_label":0}]