[{"heading":" Good Movie Wrongly Rated.","review":"A rating of below 4 is an insult to the hard work and dedication of movie makers in the caliber of Subash Ghai. It's an insult to the actors, artists and technical talent. Yes, Ghai, has made few stinkers (\"Kisna\"), but overhaul this man is an asset to the Indian Film Industry. Why this movie is rated so low? From what I surmise, the main lead casting of Jackie Shroff was a mistake. Ideal casting would have been Bachchan or Rishi Kapoor. Shroff cannot reach the depth or range that this role calls for. Just because he has been acting for over 30 years has no bearing on his acting prowess. That said, the movie is too long and the story too twisted. Here is a movie about family values, fatherly love, friendship and sentiments and they were all thrown down the drain in the very public Corporate Stockholders meeting. Who came up with that ending to a story? That scene was ugly. The endorsement for dot.com and cola was in poor taste. Great lyrics and good music. The song/dance number at the Jaipur palace, was one of the best aesthetically choreographed numbers in Hindi Films. Two or three of the dance numbers (How many men in throes of a breakup resort to a wild dance? Hithik is a good actor, specially the scene where is doing mime in front of the bill board. This move is for the majority of the Indian audience who like good family-value movies, but the minority who have no taste or class will like \"Dabaang\" \"Tees Maar Khan\" and \"Three Idiots\" It's obvious this movie is not meant for them.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Biggest Disappointment of the year.","review":"Though I am not a Hrithik fan, I went to see the movie because of Subhash Ghai. After all he has given some excellent movies to Indian Film Industry. And I had a lot of expectation from this movie too. But unfortunately I'll have to say this was one of the worst movies I saw in recent times. Right from the first scene it seemed like a drowning ship. Throughout the movie audience kept on expecting that now the ship will get itself floating. But with every minute it kept on going down. Audience were laughing in serious moments of the movie. But it seemed like it was trying to save itself (specially during song sequences, dance by Hrithik is only little good thing about the movie). After two hours of movie the movie ship is already drowned. And then it seems the whole crew gives a last attempt of salvage, without understanding that its already underwater. In last half an hour of the movie Jackie has given a credible performance. But at the end it was the biggest disappointment of the year. Sorry to the Hrithik fans.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Three hours of Coca Cola ads and an empty soul","review":"How depressing. I look forward to Subhash Ghai films every two years, I really do. I loved PARDES (3.5/4), and I appreciated parts of TAAL (3/4), so the expectations for his next film YAADEIN were naturally sky high. When TAAL released in the summer of 1999, one would have thought that Subhash Ghai would have taken the critics' reviews seriously. Overall, the film was well-liked, but it was in general agreement that the storyline of the film was poor and lacked originality. Therefore, I thought that by now, Ghai would be able to craft a perfect film, as I heard the pre-buzz about the film to be good. I thought the storyline of the film was interesting, not as original as I had hoped. But the film had names attached to it that could not be ignored. Firstly, Jackie Shroff has slowly become one of my favorite actors now that he had embraced his maturity and given up trashy roles; watch MISSION KASHMIR (3.5/4) and tell me if I'm wrong. Secondly, Hritik Roshan and Kareena Kapoor - enough said. And finally, Anu Malik had claimed to have given the best score of the year. When the soundtrack released, I found the flak it received quite unfair, as I like the score, but I definitely did not think it was great. A few songs are good, many are average and only one is truly great - of course, the well loved title track.Well, none of the hype lived upto the film. The storyline goes something like this. Shroff is left with three young girls to raise and marry off when his wife suddenly is killed in a police chase. The girls find love through different ways, but the last daughter (Kareena Kapoor) encounters the biggest problem when her lover (Hritik Roshan) is engaged (conveniently by force) to someone else. Well-crafted film bites much more than it can chew, leaving only moments of brilliance. Ghai's script, though dialogue heavy, is much too predictable and overlong, concluding with a less than satisfying tie-up. Roshan is excellent; Shroff does very well with a poorly defined role. Look out for the blatantly disgusting Coca Cola and other brand name advertisements placed throughout the film; it heavily cheapens the integrity of the film.OVERALL RATING: * 1/2 out of four (poor, passable)","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" What was the purpose of this movie?","review":"I was disappointed by this movie because of its heavy recycling of the same old plot with new speeches.  From the trailers it looked like it would be a good movie, but like other reviewers at IMDB I feel that this movie was an utter disappointment.  The only thing that might save the movie are the cinematography, songs and the music, and _maybe_ the acting of Hrithik Roshan and Kareena Kapoor.  By the way, this review was sponsored by Coca Cola (sorry, I just couldn't resist ;-) )","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Yaadein...Just Entertaining Moments","review":"I had great expectation from this film but it bombed on the box office but yet i liked the movie.Yaadein is a very different film and is entertaining movie.Subhash ghai has once again proved that he is one of the best director.Music of the film is excellent. Hrithik and Kareena have given very good performances.There is nothing to criticize about this film except for a very few.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Yet another Masterstroke by Subhash Ghai","review":"The hero of Yaadein is its excellent story line. The emotional scenes are par excellence. Hrithik Roshan justifies his star status and does well in romantic scenes. Kareena Kapoor may not look glamorous but her acting touches the heart. And above all Jackie Shroff as a father of three young daughters is outstanding. The debutants Avni Vasa, Hemani and Kiran Rathod are average. However, Overall Great performances by the three main characters, heart rending music, good story line makes Yaadein a \"must see\".","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" I think the movie is far better than the low overall score that it has received","review":"Let's look at why I feel that \"Yaadein\" is a nice, entertaining movie (and justifies a score much higher than the 4.5/10 awarded to it:1. The songs are really terrific.2. Everyone has acted quite well when compared to the acting levels that one generally sees in Hindi cinema.3. The story is credible.4. The director is very well known.So why has this movie got such a low score?My personal belief is that Hindi movies get wild, inconsistent ratings from fans who have not thought the matter sufficiently through. How else can one justify a rating of 9.2/10 for \"Dil Chahta Hai\" and just 6.0/10 for \"Asoka\"? Is \"Dil Chahta Hai\" a better movie than, say,  \"Shawshank Redemption\" which was rated 9.0/10?\"Dil Chata Hai\" is good. But 9.2/10? I don't think so. And does \"Asoka\" deserve the low rating of 6.0/10? I don't think so.It appears that very few people rate Hindi movies compared to the numbers of reviews that English movies get (45 people rated \"Yaadein\"; 75,837 people rates \"Shawshank Redemption\"). This causes distortion in the average especially when the \"swing\" (as seen in the case of \"Yaddein\") is so large.I belive that \"Yaadein\" should be rated 6.0/10. It's a nice entertaining movie and not the sinking ship that it has been likened to.See it and decide for yourself.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" forgettable (koi yaadein nahi rahengi)","review":"Subhash ghai attempts to make a love story which falls flat on its face. This is probably one of those movies which really test your perseverance..(of staying in the hall). I am yet to leave a movie in the middle but if there is one movie which could have broken my unblemished record, yaadein has to be it. The movie is a story of a father trying to become a dost of his three grown-up daughters who have been brought up in London. Now obviously, the father is Indian to the core and there are enough dialogues in the movie about sanskriti etc.The father(played by Jackie shroff) wobbles between the two extreme views about mohabbat(whether it is good or bad) and there are a lot of sub-plots none of which is allowed to develop. The romance between Hrithik and kareena is pathetic with all the usual fundas thrown in(viz saving the heroine, puppy love etc). Hrithik may have a great following but (this is my personal opinion only)he has yet to show any subtelty in his acting. He tries very hard to show his love which translates to shouting and making faces (a.l.a shahrukh) instead of letting his eyes do the talking. There are twists:) like rich boy-poor girl, love is good/bad, another girl, a dead sweetheart always dressed in white, sacrifice to show gratitude etc which are just ghai's attempts to borrow from the breed of directors who are adept at making love-stories. Ovreall, a forgettable movie.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Total Bilge!","review":"Yaadein - Something you would remember for all the wrong reasons. The actors behave like mannequins than people with flesh and blood, the delivery is staccato, and the plot is stilted. Of course H. Roshan's acting and dancing is good as always, but unfortunately it is not enough of a saving grace to sit down and be tortured for 3+ hours.The movie can be described as one big advertising arena - for products ranging from Coke to Hero bicycles. If you are part of the unlucky lot that have bought a ticket to be entertained, make a game of counting the number of products that are being plugged in the various scenes. You are likely to derive more satisfaction than from the storyline.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" The less said the better","review":"With \"Yaadein\" Hrithik Roshan delivers his first flop, commercially and artistically. Let's be fair. It's not his fault. On the contrary. If there is anything enjoyable in this film it's some scenes where his talent and screen presence rise above the material and give you an idea how powerful this film could have been in other hands than Mr. Ghai's. Some of his dancing is also quite spectacular as before. To be fair it should also be said that Kareena Kapoor has potential. She and Hrithik waste their talents here. Apart from that the lesser said the better. \"Yaadein\" is the kind of film everybody involved probably wants to leave behind and forget, despite its title.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Hrithik's best performance to date","review":"I don't think that this movie should come under such harsh criticism.\nThe hype has probably killed the movie.I don't think that the movie was that bad. It was a good movie but the first half was quite inadequate. And had some really absurd cliches. The second half was quite engrossing.Hrithik's performance was his best to date. He really showed his histronics in this movie. He is a very capable actor apart from a good looker and a fantastic dancer. Kareena also showed that she is star material. Jackie also played his role well.I think in all the hype killed the movie which is otherwise quite an entertaining movie.Forget the hype and go see it as a non-hyped movie and you may come out of the cinema quite pleased.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Yaadein deals with the emotion ties between families and the corruption greed can bring into the lives of one's family and friends.","review":"Yaadein is a really great movie, I know there are a couple of terrible things about the movie, like the dresses and some of the unnecessary detours from the plot, but overall I really enjoyed this movie. I know people don't seem to understand why Ronit was hesitant to make his own choices, but thats a part of being truly Indian. Even though I was born in the United States, it has been drilled into me, since birth, that one does not rebel against their parents, disrespect is not tolerated. It would be highly unreasonable for someone to go against nearly 20+ years of teaching just for the sake of a sudden love interest. Isha is the same way, her sisters' ruined marriages, and her promise to her father isn't something to be taken lightly. She doesn't want to hurt her father, who has lovingly raised her and always done what is best for her. Another thing many people don't seem to grasps is why the Puris aren't good enough. Yes they may have to great homes, but that DOES NOT put them on the same social and economical standings as that Malhotras. And in Indian culture it is frowned upon to marry someone of lower social and monetary standings. But overall no matter how many times I watch Yaadein it still brings tears to my eyes, because I UNDERSTAND what Subhash Ghai was trying to portray with this movie. For anyone, especially someone looking for a movie that is more sentimental then violent, this is an excellent movie to watch.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Kareena,Hrithik,Anu Malik Save Yaadein","review":"I went to see Yaadein on opening night at a theatre in Diamond Bar.There was an unprecedented crowd at the box-office for a Bollywood movie. Despite my best effort I could not get a ticket and had to return home. This was a first for me in my 22 years in America that I had  returned home without seeing a Bollywood movie on its opening night. I finally saw the movie on Sunday at the 5 p.m. show.It was a disappointment in the sense that I expected a lot more from Subhash Ghai. Subhash Ghai has certainly let down his fans and admirers. But to suggest that it is a failure at the box-office would be totally wrong. Kareena Kapoor and Hrithik Roshan are brilliant. Anu Malik's score, despite poor lyrics by Anand Bakshi, is one of his best in recent times. At least four songs - the title number and three others - are going to be big hits.Another asset of the movie is its outstanding photography by Kabir Lal.The movie has hit the top ten list in U.K. and is 19th in the US.Just in 3 days it has grossed approximately $645,000 from 59 theatres giving it one of the highest per theatre average. This is no mean achievement. To the best of my knowledge no other movie from Bollywood has reached this level of business in the US.However, from this Ghai should not conclude that his critics are wrong and he is right.In future he should shun those product placements. And he should never, never write.Is it not enough that he is a great director? Why should he try to be a screenwriter and editor as well.This is arrogance of the worst kind and will prove to be his undoing if he persists in it. In Hollywood all great directors from Capra to Hitchcock to Spielberg have based their best work on solid scripts written by others. But I want to give Ghai example from India itself. Did Raj Kapoor ever write his scripts(It was always K.A.Abbas or one of the other established writers)? Did Guru Dutt ever write his scripts(It was always Abrar Alvi), Did the great Mehboob(It was Ali Raza or Wajahat Mirza or Agha Jani Kashmiri). In the all-time classic Mughal-E-Azam, Asif used as many as four writers - Kamal Amrohi, Wajahat Mirza,Aman and Ehsaan Rizvi.So there you are Mr. Ghai. To be a movie director is a great thing in itself. You don't need any other titles.Besides, the Bombay film industry has great writers even today. Salim-Javed may not be writing scripts any more, but there is Javed Siddiqui who is equally good and with whom Mr.Ghai has collaborated very successfully in the past and can do so with greater success in the future.Finally, as moviegoers we should all go to see Yaadein and enjoy the great performances of Kareena and Hrithik and the intoxicating music of Anu Malik.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Could have a really good movie................","review":"Yaadien was one of the most anticipated films of 2001 in India, because not only was it a big film, but it was a film directed by showman Subhash Ghai, at the time considered the finest filmmaker in Hindi Cinema, it was also a film with chartbuster music, it was also a movie featuring two talented promising young actors/actresses Hrithik Roshan and Kareena Kapoor, and it was a movie also starring veteran actor Jackie Shroff. But this movie bombed critically and commercially BIG TIME, I tell you why.......This movie. I have to say from the film cover, looked pretty promising. I felt this movie will be golden, and it starred Hrithik Roshan, one of the best actors of Hindi Cinema, and my favorite actor, so I watched this movie, and man was I disappointed. Fifteen minutes into this movie, I felt forwarding it, because it was such a slow movie. It was very boring and dull until the song title song Yaadien, but pretty much after that it was downhill.I have to say this is one terrible written movie, its stereotypical, clichéd.......you get the picture, very typical. The direction was LAME, i mean come on, a man who directed Pardes and Taal, directs this bore crap. This film's biggest flaw was its direction. Second acting, unlike the screenplay and direction, acting was better. Hrithik is a talented performer, thats why he was a able to pull of this undeveloped character, but he was unconsistent and offbeat, because of the bland and lame screenplay and direction. Kareena Kapoor, who back then was known to be a very over expressive actress, did a wonderful job, in this movie. Hrithik and Kareena's chemistry set the screen on fire. Jackie did an alright job. And as far of the rest of the cast, they acted well according to their characters. I have to say, the actors tried really hard and it shows, What saves the movie from becoming a total disaster, are the musical numbers. Watch it only if you are a Kareena or Hrithik fan, DO NOT WATCH IT, THINKING ITS A SUBASH GHAI MOVIE, by the way, after this movie, Mr. Subash Ghai entered a career slump, and pretty much his career was over. Thankyou!","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" What I learned from Yaadein(Memories)","review":"1. Police in London carry guns and they have random shoot outs in the middle of busy the streets where Indian women run helter-skelter and get hit by random cars.2. Black people are always criminals 3. Shamelessly promote coca cola whenever you can 4. When trapped on Tuba Island, Malaysia, remove your shirt and throw it at an approaching crocodile and hope your romeo comes and saves you.5. All Indians abroad live in Palaces and Mansions.6. If you can't call him Rohit (because he has used the name to death in other films) call him Ronit.7. A coca cola solves everything in Subhash Ghai films 8. To prove that there is a love story, we must indulge 3 hours of torture.9. Rich people always treat they friends like crap.10. It is possible to have great songs in a film yet still tank at the box office.11. A dragged out ending will ruin your so-called masterpiece film. 12. Rich people pimp their kids for financial gain.UGH!","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" An o.k. movie","review":"Yaadein is an o.k. movie but someone instead of Kareena Kapoor like Priety Zinta would have been much much much more better than Kareena Kapoor because shes not good enough for the role.Hrithick Roshan was fantastic though and so was Jackie Shroff. Amrish Puri was good as well and so was everyone.Kareena Kapoor is just too much of a show off but she should know that shes boring.The songs were good and the director is a well known director but he can make more kinds of better films.Hrithick Rochan was better in Koi mil gaya,Lakshya and Kaho na pyar hai but he was still good in this film too.I do like this film but it can improve.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A Subhash Ghai film","review":"This movie tells you why Subhash Ghai's movies are different from others in the same genre (say, love stories?). His thoughts/ideas are presented tenderly with very strong effect instead of melodrama that other schools of romantic film making in the Hindi film industry resorts to. The following are the strong points of the movie 1. Music by Anu Malik. Watch out for Udit Narayan's version of the title song \"naghme hain, shikwein hain...\" Credit goes to the director the way he used Udit's voice to great effect in this piece and Hariharan's voice for the other one. This song is also used in the background score heavily, differently for different situations.2. Anand Bakshi's lyrics.3. The story and the casting. Jackie Shroff seems to be favourible choice for the role of Raj Puri.4. Photography is excellent.5. This film's DVD has good subtitles in English, French. So, movie lovers not knowing Hindi should not miss this film.I watched this movie for the 4th time on DVD; but try to watch it on the biggest screen possible.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A movie only few can relate to.","review":"The thing about 'Yaadein' that people don't seem to like is that it clearly does NOT relate to them. Hindi movie-goers want a sheer love story that is mysterious, and only breathes within your head, and your heart.'Yaadein' tells you that love can be extreme fickle. Because of this, it probably disappointed many people who expected Hrithik Roshan to TOTALLY score with Kareena Kapoor. It took a lot of doing and understanding, especially from the parents' side. This film gives the movie-goer a good message: That abandoning family for business changes you, and it weakens your heritage and tradition. Even if it keeps the tradition in the family, some things still wont end up all perfect and wonderful. Money, business, and wealth kill tradition.One further point of concern: Most Hindi film titles contain the world \"Dil,\" \"Prem\" (sometimes), \"Ishq,\" \"Hai,\" or even the infamous \"Mohabbatein.\" This is 'Yaadein.' MEMORIES. Try to cherish them, because love is not exploited in this film, like they are in others.\nRating (out of 10): 8.5","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Never expected this from Subhash Ghai!!!","review":"Its really an awful movie. How a director like Mr Ghai can ever do this? That too with a star cast of Hrithik & Kareena. And on the top a good actor like Jakie Shroff as well. Although Jackie's performance in the movie was good. But the whole storyline & plot is sickening, does not makes much sense.Two people are in love and there parents are friend as well but they can't marry. They are not sure of there love as well. In a family only one daughter tries to be father's good girl. Rest try to create as much problems. And people expect some senseless values for an Indian bride (questions Jackie asks Hrithik's would be wife). And on the verge is the climax where like any typical movie, everything is taken care of and everyone's happy.How could he get such a bad performance from actors like Kareena and Hrithik? The songs of the movie are still okay. But the movie does not even have moments to enjoy. Starting from the beginning till climax, movie really bores you. On the whole a very slow paced movie which is not worth even watching!!!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Weak film needed aggressive editing","review":"Rating3/10Dull and shoddy film making from Ghai. Very long film with cliched plot. Some scenes are unintentionally funny. The film needed aggressive editing. Cast is generally weak though Hrithik and Kareena make an effort.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Good enough to watch","review":"I don't know what is wrong in it. Through it doesn't match Ghai's masterpiece like Karz Pradesh taal etc.... But it was very good movie.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" you will laugh your arse off","review":"The question remains whether subhash ghai was high on weed or just paid off by coke, pass-pass & hero cycles to make this master flop.f/all screenplay, mediocre acting and proper misdirection.but still worth watching if you want to laugh your arse off.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" sloooow, contrived ... yet interesting","review":"I have to say that Hrithik Roshan is one 'beeeyootiful' man who knows it, or maybe thats just the way he was directed. I just find the slow, posed facial expressions very OTT when compared with all the other cast members who are just ever so slightly less contrived. But this is very much a common gripe I have about this particular genre and we can over rule this for the time being.The movie started off really slowly with the long winded wind up to the events that lead to Raj Puri's return to India (this felt like it took hours). In the scene where his wife is dying, her life support machines are switched off and she lifts her head, flutters her eyelashes a bit and gives a speech about the daughters whereupon she dies. Oh how tragic. This scene seemed to go on for an awfully long time when compared with a later scene where Isha gets caught on Tuba Island and is chased by rabid crocodiles until she collapses in a heap in a tree and has to be rescued by the posing hero who just immediately locates a blow up boat, goes to the precise location where she is stuck in an island on a tree and then flexing his muscles, he swims a passed out / unconscious Isha across the sea back to mainland Malaysia.We are never told how or why she passed out in a tree and why she didn't wake up when being swum across the ocean. Was she bitten, unconscious from a head trauma or abducted by aliens? I guess its up to the viewer to make up a story of sorts and hope it fits in with the thinner than water plot line.What I liked, The music was beautiful, specifically the song, 'Aye Dil...Dil Ki Duniya Mein' which was very well done. I enjoyed the way that the movie seemed to be a montage of events which fitted well with the title Yaadein (Memories), Raj Puri had a lot more depth than most characters in this genre of movie and I found him very likable and very human in many ways. The message, well I read the previous comment and I didn't get that message at all. I got the message that if children are traded like commodities then there is no hope of a better future for Indian people. I also found that the message about Love was very interesting, that it is indeed all around us and sometimes arranged marriages work, sometimes marrying for love doesn't work but ultimately love conquers all and that Love is the central theme for all of our happiest memories.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" Cheesy but...","review":"It's a Bollywood movie with all the jazz, and it's entertaining. Enjoy it for what it is and not try to criticize the cheesiness.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" A film that could be great","review":"Subhash Ghai lost his head post PARDES, his most films were bashing NRIS(even PARDES but it was a good film) but TAAL though a hit was nothing great, YAADEIN could've been a great film. The film was initially supposed to be a story of Jackie and his daughters but after Hrithik's popularity Subhash Ghai changed the script increasing his role. The worst thing of the film is the shift in focus from father-daughter relationship which does have it's moments to Hrithik and Kareena portions,worst being the shameless ad placements which gets to the nerves. Also the clichés and stereotypes and predictability irritatesDirection by Subhash Ghai is okay but he seems confused Music by Anu Malik is decent, some songs are hummableJackie Shroff as always gives his best in Ghai films and he is good though at times he goes overboard, Kareena Kapoor in her 3rd film was decent, Hrithik Roshan too does well though he overdoes at times Rati Agnihotri is okay in a cameo, Amrish Puri and the entire family seem straight from PARDES and TAAL. rest are okay","imdb_rating":1,"our_rating":0,"algo_label":0}]