[{"heading":" Wow!","review":"Ram Gopal Varma's latest offering 'Company' is probably one of the best Indian gangster films ever made (after Nayakan and Satya). This film is so well done that the viewers feel like they are watching real-life events. And people living in India will know that some of the events are actually inspired by real-life incidents, although the film does not admit it.\nCompany is the story of two friends - Malik (Ajay Devgan) and Chandu (Vivek Oberoi) - how they build up the 'Company' - Bombay underworld on a global scale and thus establish their supremacy. A small misunderstanding between them turns into a large scale mafia war. The cast in this film is great, a special mention must be made of Vivek Oberoi. The son of Suresh Oberoi (former Bollywood star) is talented and seems to have put in a lot of effort for his first film. I only hope he doesn't get type-casted in the future after such a hard-hitting role on debut. Ajay Devgan fits very well into the role of Malik, a cold blooded don who always means business. Manisha Koirala enacts the role of Malik's girlfriend pretty well and is refreshing. However, the biggest surprise of this film was Antara Mali. She has done a great job as Chandu's wife, and it only goes to show that there is no dearth of talent in the country.The narrative is well paced, and the viewer never gets bored. Some people might find the absence of songs in the film annoying, but their presence would only hamper the pace of the film. The script is well written, and some of the dialogues are really memorable - for example, when Malik says \"To forgive a friend's mistake is an even bigger mistake in the 'Company'\". The background music by Sandeep Chowta really complements the plot and he certainly deserves some credit. But more than anything, it is Ram Gopal Varma's direction that needs to be appreciated. He has proved once again that with a good story, an excellent cast and a lot of determination, one can make a memorable film and defy some of Bollywood's age old norms. A special mention must also be made of Mohanlal. He is certainly one of the best Indian actors of all time and although his Hindi dialogue-delivery in Company is quite sloppy, he deserves a lot of praise for making a good effort. His portrayal of an honest, determined cop trying to eradicate crime in Bombay (loosely based on Sivanandan, Joint Commissioner of Police, Mumbai) is very well executed.The film gives us an in-depth view into the dark world of Bombay Mafia, where only the fittest survive, and how their operations have spread on a global scale. One thing I found intriguing about this film was the role that mobile phones play, how everything can be controlled efficiently by just making one phone call, and how business deals and murders can be executed with, quite literally, just one push of a button.Bottomline:  This film is a must-watch. A landmark in Indian film-making, all thanks to Ram Gopal Varma. An easy 9 out of 10.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Another intelligent and incisive look at the gangster life from Ram Gopal Varma","review":"Ram Gopal Varma's SATYA is one of my very favourite Hindi movies, though rather an anomaly in the Hindi movies that I've seen. Much darker in tone than Bollywood usually offers, it's also one of the most intelligent movies about gangsters ever made in my opinion. RGV returns to similar themes with his latest movie, Company, but this time brings a whole new style to his direction that makes the movie stand out even more from the Bollywood crowd. The movie still has a grittiness and realism in its examination of the underworld, but this time it is filtered through post-MTV-post-Wong Kar-Wai sensibilities. I've always found Indian movies to have some of the best cinematography in the world, but never seen one that looks like this.  Wide angle lenses, cameras half obscured behind the scenery, bright contrast, quick fire staccato editing... all very modern cinematic tricks, and very well done here.The Company is in fact an organised crime syndicate, which our hero Chandu (Vivek Oberoi) joins at the start of the film. Chandu is the young leader of a small time gang looking to make it big. He earns the respect and trust of company head Malik and quickly rises to be his right hand man. When Malik makes a bid for power, the two of them have to handle the fallout from the quakes it makes through the criminal infrastructure.Chandu is a similar character to Satya (who is one of my favourite movie characters, and not just because he has the best beard in film), but a leaner meaner more ambitious kind of career criminal. Nowhere near as mean or as hardened as the seemingly imperturbable Malik, however. Malik takes his business very seriously.The rise to power of a young gangster is a theme that has been handled on many occasions before, and Company is not vastly different to its predecessors... although it is a good reminder of what hopelessly romanticised popcorn fodder the YOUNG & DANGEROUS series are. With almost no song and dance routines, the run time is kept down to a lean 145 minutes, but this is still plenty of time to build and explore the characters and their situations very thoroughly. Company is quite a subtle movie, the pacing not too hurried and the situations mostly underplayed. This, coupled with the depth of the script and the very stylish camerawork and editing, gives the movie a very sharp feel. Another intelligent movie about gangsters, and an unmistakably cool one too.Sadly, the movie is let down terribly on one front - the soundtrack. Not all the time, but quite often the music is conspicuously inappropriate. Most irritating is the over use of Mussorgski's Night On Bear Mountain at completely the wrong times, but there are other problems too.Ultimately, I don't think I enjoyed COMPANY quite as much as I enjoyed SATYA. Perhaps this is because this time my expectation and anticipation was higher, but mostly I think it's that Chandu isn't as sympathetic a character as Satya was. Oberoi plays the character quite well, with mountains of cool but a certain amount of depth... but he doesn't command the screen in the same way that J.D. Chakravarti did. This is probably because his beard isn't as cool.I did enjoy the movie a lot though... the 2.5 hours pretty much flew by, and the script kept me interested all the way through, never becoming too predictable. There aren't a whole lot of laughs in the movie, or even smiles... this isn't the kind of gangster movie that has you rooting for the heroes as they gun down armies of cops (which, incidentally, the heroes here never do... the violence is mostly contained within the criminal underworld). It's a movie that explores what it really means to be a gangster, and the position of crime and criminals within society. Chandu and Malik are certainly presented as the 'heroes' of the movie, but it never glosses over what they actually have to do to get their power.India is a poor country, and it's a fact that a lot of the movies produced in Mumbai are targetted at an audience with a pretty low literacy rate. Bollywood movies don't tend to be too challenging to watch, or if they do wish to explore a more serious point it is usually done with very little subtlety. I am curious as to how successful Ram Gopal Varma is in India, as the two movies of his that I've seen have been challenging in a very subtle way. He's obviously quite a box office draw as Company is clearly a big budget production. Filming 2.5 hours of that kind of camerawork/editing isn't an overnight task, and extensive sections of the film are shot on location in Hong Kong, Africa and... Switzerland I think. Well, I have no doubt that enough of the Indian population are perfectly well educated and will have no problem appreciating the finer points of the movie - but I imagine that the overseas market must have been in his sights as well.Company is a movie that I'd like to see get pushed in the US, as it's a nice reminder that the TRAFFICs and co of the world are not exclusive Hollywood property. Sadly, American studios have frequently demonstrated that its not in their interest to promote this fact, so I expect it will be left with this semi-decent DVD release and word of mouth to spread itself around. My word of mouth is a strong recommendation that people seek that DVD out.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" one of the best underworld movies of Indian cinema","review":"This has to be one of the best underworld movies ever made in India. After the disappointment of jungle and mast Ram gopal varma has bounced back to deliver one of his best works. It rivals his own earlier work Satya. Though based on the underworld both films are completely different as his own words put it company is above the underworld unlike satya.the direction, camera and background score are superb. the cast consisting of Ajay Devgan, Mohanlal and newcomer vivek oberoi perform exceedingly well. After having seen oberoi's later works this performance is easily his best. while Ajay Devgan lives the role to perfection, the Malayalam super star Mohanlal brings a breathe of fresh air by enacting the coolest and most realistic cop Hindi cinema has ever seen. the screenplay written by jaideep sahni is of highest quality. superb dialogues are well delivered especially by Ajay devgan and mohanlal. on the whole a different movie with artistic and technical perfection.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Interesting....","review":"Ram Gopal Varma pulled off a very beautiful film, full with suspense and action, what every avid film fan secretly desires.Complete with actual facts and thrill it was a fun movie and could probably be compare to Godfather being the marvel that it was. Based ON the Bombay underworld the actors had done justice to the roles given to them. My favorite was Ajay Devgan because of his realistic was of portraying the characters and he was basically the life of the film in my view...I can't help but repeat myself but It was that much of a splendid movieOf you want to go for a fun filled ride watch it..","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" King Lear with mobile phones","review":"Like any great tragedy, this series of human catastrophes hinges on an objective contradiction, the one Max Weber identified with patrimonial bureaucracy. The origins of impersonal rule lie in the king's use of palace organization to assert his independence from the feudal barons who control the bulk of the people in the countryside. He needs a staff and recruits them as individuals who owe allegiance solely to him. But there is always the problem of distance, since local officials are pulled towards asserting their own independence of him. Beyond that he can't afford to let any of his henchmen get too big in case they go for him. Relatively stable forms of patrimonial bureaucracy depend on working out institutional rules for checking this tendency, such as moving officials around so that they can't develop local attachments or hiving off part of the job as a way of undermining a potential rival. It is this structural contradiction that launches a series of cumulative disasters whose instruments are the personal actors.The best dramatic example of Weber's principle in action is Eisenstein's Ivan the Terrible part 1. But Company is a pretty good instance too, as are most of Shakespear's history plays and tragedies. Etymological note: company means people who eat (bread) together, referring to how commensality is intrinsic to the solidarity of a group of soldiers. Note also that 'don' means both a mafioso and an academic, suggesting by analogy that intellectuals are killers which of course they are, since detachment requires them to dehumanize themselves and others.So the crux of the tragedy is that Mallik, having plucked Chandu from nowhere (C says \"no-one can make it to the top the right way\"), becomes too dependent on him and decides to limit his power by giving some of it to Krishnan. This leads to his killing Chandu's friend who can't stand the resulting friction. Then Chandu thinks the politician he eventually kills, Raote, is \"not a proper guy\" (a remark that one of the weaker soldiers thinks is funny, since it reveals that C believes there is honour among thieves). This partly leads him to baulk at killing the children of the minister. He calls off the contract unilaterally. \"If the company can do without me, I can do without the company.\" And that is that, as far as Mallik is concerned, indeed as far as the logic of patrimonial bureaucracy is concerned. Towards the end of the movie, someone says, in response to the blame being put on Mallik for what everyone eventually realises was a mistake, \"whatever's happening is the fault of the business, not one man\". But of course, the business can only operate with one big boss or it fragments into impotence (petty feudalism), as in this case. This is why Shakespeare's cumulative exploration of the personal and impersonal contradictions of one man rule ends with the madness and civil war of King Lear.Morality is always personal and the war of criminal enterprise is impersonal. (One of the theme tunes at key moments is Mars from Holst's the Planets). Chandu embodies the contradiction more than the rest. He is a classic individualist of American westerns and gangster comic strips (Dick Tracy), the loner who doesn't believe in justice unless he does it himself. He legitimates his path because official society is just as corrupt but less honest and in any case the game is stitched up to exclude him. The state can produce a clever and basically decent policeman like Sreenivasan, but he knows that the police can't be effective if they always stay within the law. (S is a great successor to the detective Porphyry who undoes Raskolnikov in Crime and Punishment. Indeed he retires to be head of a police training college and is said to be writing a novel based on his experiences with the underworld, called Company...).Mallik is a political realist (\"Friendship lasts as long as it lasts\") who understands what he takes to be human universals better than most people who prefer not to recognize them. Saroja, his girlfriend, says \"You're really a Satan\" and he says \"There's a Satan in everyone.\" Previously, \"Sometimes I think there's a monster hidden in you\". \"There's a monster in every human being. It's just that some people are scared of confronting it.\" The struggle between individual morality and political realism embodied in Chandu and Mallik leads to the crisis. After its terrible denouement, Chandu hands himself over to the state and tries to make it up with Mallik. \"I am about to do what I think is right. if you suffer any losses, don't take it personally.\" Shades of \"Don't take this personal; it's just business\" in The Godfather. The hit-man's dilemma is between morality and politics. The law just doesn't measure up, but it is all we have if we are not to be subject to rule by the mob.\"The Company stands on one thing. That's fear.\" It was built with \"three weapons -- murder, money and compromise\". One recurrent jingle says \"Yes, it stinks, but it's business.\" Throughout the movie face-to-face encounters are mediated by conversations at distance using cell phones. If the railway locomotive was the symbol of 19th century industrial capitalism, the symbol of virtual capitalism in our day is the mobile phone. The Company goes international largely through use of this new technology: \"The telephone became the biggest weapon in the underworld.\" A dazzling scene consists of a rapid montage of city landscapes with a soundtrack of phones ringing. This is indeed Shakespeare with mobile phones.A final point. As in King Lear, we should not forget the women. They play a central role in the unfolding of the tragedy as the contradiction between one man rule and the personal morality of his chief henchman descends into bloody civil war and mutual destruction.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" One of the best ever movies on Bombay underworld!!","review":"Terrific performances from Mohanlal, Ajay Devgan and Vivek Oberoi and a slick, stylish picture about the underworld make this movie a must see. Hats off to Ram Gopal Verma. The direction, story line, cinematography - every aspect is brilliant and the movie on a whole is very gripping and fast paced. My personal favorite character in the movie is Mohanlal who plays a commissioner and I guess he is one of the coolest cops ever shown on Indian screen.I give Company 10 out of 10.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" an achieved gangster movie by Ram Gopal Varma","review":"Where Satya was moving but not very original, Company mixes HK, US and indian influences to look like something unique. The dancing scenes are better integrated than in Satya, the movie is short for an indian movie but more efficient, the story is well written although the idea of mafia as a business has been seen many times, acting is wonderful. But the best thing here is Varma's masterful visual style combining a dirty photography, an editing influenced by Hong Kong cinema, a documentary like visual style to create his own unique style and giving the movie a hot, heavy, dark, dirty atmosphere. It might be edited like an MTV video sometimes, being sometimes too long but although Varma is not (yet?) a director of the scale of Tarantino or Ferrara this movie brings something new in gangster movie. Highly recommended.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" One of the best hindi movies i have ever seen","review":"This is a stunning film, awesome story, acting and music makes this one of the most enjoyable movies i have ever seen - hindi or english. The performances are excellent, with special mention to the new actors- Vivek Oberoi and Antara Mali, who played their parts with such expertise and conviction.Highly recomended","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Easily in the TOP 5 movies of ALL TIME","review":"Company is far and away the absolute best non-traditional plot Hindi movie ever. I think it is even better than Sholey. It ranks up there with Scarface... no, I take it back, Company is BETTER than Scarface. I am a big gangster/mafia movie fan, and there a lot of great ones out there -- both Hindi and American -- The Godfather, Scarface, Goodfellas, Heat, Sathiya, Gangster, Khattay... but Company takes the friggin cake.Gripping plot, phenomenal acting, engaging soundtrack... this movie will have you enthralled from the moment you hit play till the closing credits, after which time you will think about the movie for hours. Vivek Oberoi is masterful, Ajay Devgan is flawless. Based on a true story, this is THE Indian movie of the decade. Ram Gopal Varma hits a home run with this masterpiece.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" realistic, slick, gritty, stylish, dark, frightening...it all stinks but it's business!","review":"'Company' opens with Malik's haunting introductory monologue about the underworld and this is followed by Urmila Matondkar's bloodthirsty sadistic number, the tune of which will echo throughout the film. The song sequence itself, 'Aaja re Mere Gale Lag ja' describes the underworld. 'Company' ranks among one of Ram Gopal Verma's best and one of the best crime films of Indian cinema. A fellow commenter has wonderfully made comparisons with Shakespeare's King Lear. Sahni's writing is of high quality and it just keeps one's eyes glued towards the screen.There are several words that can describe the film-making. A few that pop up include: realism, slick, gritty, stylish without being over the top, and fine editing. Cinematography deserves special mention as the camera acts as an eye. Use of lighting is remarkable as this gives the city and crime-world a darkly raw look and use of sound effects e.g. the ringing mobile phones is skillfully done.The songs are thankfully relegated to the background except for one, 'Khallas'. All the songs add to the narration and 'Khallas' is a situational song that takes place in a nightclub, the lyrics of which cleverly describe the events.Verma also displays the relationships between the characters in a very concise manner. Even though, the main focus is the relationship between Chandu and Malik, with just a few scenes who shows us the significance of the connections between the other characters. For example, just that one scene where Saroja is in bed telling Malik about her mother's wish for them to get married is enough of an indication of their bond.Ajay Devgan formidably underplays his part. He could safely add 'Company' at the top of his list of achievements. Vivek Oberoi delivers a knockout debut performance. The actor has shown tremendous potential and like Devgan, he too can add this to the top of his list. Mohanlal is adequate. However, I don't quite understand this respect he has for Malik. The guy's a cold-blooded killer (well he has other's to do the dirty work) and Sreenivasan is shown as a good cop so what's the basis of this mutual respect? Manisha Koirala again does what she's best at doing. She gives a subtle but enigmatic performance. Seema Biswas is likable and she naturally gets under the skin of her part. Antara Mali is mind-blowing, and like the men, she too can include 'Company' at the top of her list.Finally, 'Company' is Verma's masterpiece. He's the one who brought it all together to make the film and tell the dark story of the underworld. One of the best films of the genre.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Sets a target to be achieved by Indian films","review":"Ram Gopal Varma made the critically acclaimed and surprisingly commercially successful film that boosted and launched the careers of the actors, writers and music composers – Satya. After four years, he came back with another hard hitting take on the Mumbai underworld by the name of Company. Company is one of the best films made in India and will stay alive for eons to come. Although it portrays the underworld, it has its underlying message loud and clear over every frame – Crime Never Pays. It depicts both the police and the gangsters and leaves for you to decide which is right of the two.Company is the story of two friends who turn foes through the length of the film. Chandu is a small time 'bhai' who makes it big as the right hand of Malik. The central character of the film, Malik, is a mafia leader who sets up the most successful crime organization in Mumbai by the name of Company. The two good friends turn enemies somewhere in between the film. It all takes place so vividly on the screen that you almost miss when they turned foes. The script moves meanderingly through the highs and lows of the Company traveling through three exotic cities and a multitude of characters.Action sequences are a huge asset to the film. Choreographed brilliantly by Allan Amin, the scenes are filmed in filthy, unpleasant bylanes of Mumbai. Much like Satya, Company also has the camera following the characters like first person view. Ram Gopal Varma has zeroed in two foreign locations for the film and both are vital to the story. Hong Kong's enormous intersections and the extra-tall buildings are a metaphor to the Company's growth and success. Kenya's Nairobi comes in the post-interval where an intense, eloquent chase sequence takes place between Chandu and Malik's men. This scene is not to be missed. The cinematography is exceptional. It has weird camera angles and some noteworthy movements. Varma's films always have innovative cinematography. Also, shooting a film with those camera angles is no easy task. I deeply apprehend the hard work gone into the making. Not a single frame has been compromised with.Production design by R. Verman is experimental at places. For instance, the look of the track 'A Shot of Company' in the beginning has a unique stamp all over. The use of red lights, spooky dance movements and a ghastly set make the song a different experience. The songs composed by Sandeep Chowta are very good. 'Khallas' is a winner from the word go and the music video is impressive. Though it comes as a speed breaker in the film, I felt it was very much necessary. This is the only song in the film. Background score by Chowta is phenomenal. Malik's soul is his best composition to date. The percussive tabla in the track is hauntingly beautiful.Story and screenplay by Jaideep Sahni deserve all the praise. As mentioned earlier, it is vivid and detailed and almost leaves you unquestionable. The film maintains a steady pace throughout which itself could have been sped up, but that doesn't hamper either. The final hour is pure bliss. Varma gives his best to this part. Also, the length is unconventional. It has an hour and a half pre-interval and just an hour's post-interval running time. This, in turn, proves Varma's unwillingness to add meaningless scenes to increase the running time and make the film dividable into two halves.Company has a bigger budget than Satya, and instead of using them for dance numbers in Egypt or Swiss, Varma gives a technically slick look to the film. The level of technical excellence in Company is what \"Indian Cinema\" (not bollywood) needs to attain. He sets a target for other filmmakers. Company could arguably be the only Indian film where every actor of the ensemble cast gives his career best performance. Starting with the débutante Vivek Oberoi, he gets the meatiest role in his very first film. He makes an ideal debut in a role that doesn't require histrionics but requires an actor to be that character throughout the film. He doesn't show much variety throughout but he is outstanding in the limited acts he has to do. Antra Mali springs a pleasant surprise, especially in the outrage scene in the second half. Manisha Koirala doesn't have a well defined role but she creates space for herself in the few scenes she gets. Also she smokes with élan. Ajay Devgn shines in serious roles and Company is no exception. Mohanlal exudes class in his limited screen time. His South Indian accent syncs with his character. He is the ideal tough cop of Mumbai.Company must be appreciated on the technical, narrative and performance levels. It is a notch above other Hindi dramas. Being Ram Gopal Varma's magnum opus, it is a must-watch.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Better than all contemporaries(Including Good Fellas,Godfather!)","review":"Seeing main review on IMDb was really disappointing,since i am a big fan of this site,in terms of reviews,But this review i am afraid is ridiculous in terms of comparison making.Comparing Goodfellas with this masterpiece is an insult to Ram Gopal Verma.I think,Indian reviewers or critics are in habit of seeing plagiarization of English movies and therefore they alway go on with Grandiloquence about the Movies that are made with exceptions.I have always been a great fan of RGV films.probably because i have watched English movies throughout my life and i hated the mainstream Genre of commercial films(the so-called Formula films) viz Karan Johar or Shah Rukh tag films.Amidst all this chaos,there emerged Ram Gopal Varma who had the guts and creativity and perhaps technical excellence to compete with Hollywood.The Film \"COMPANY\" is no exception.It wastes no time,the story is tight.Even the Song-Khallas with which Isha Koppikar gained popularity was a \"PUN\" or a double meaning song and provided some lightness to otherwise tight plot.The story of \"COMPANY\" draws inspiration from real Life(In case of GOOD FELLAS,the real life inspiration was not that accurate,Tony De Vito was called a psychic Killer and a Murderer,whose role in the robbery wasn't apparently well known and wasn't established,so as to say.Only Joe Pesci had made this guy more popular.The story as we all know is about feud between two gangsters,namely Malik and Chandu which reminds us of real life feud between Chhota Rajan and Dawood Ibrahim(which Mr. RGV promptly denies in having association with).The story spills out details with generation of thrill in every frame of the movie and manages to keep us up till the end.Narrations are excellent.Unlike Godfather,in which the first half you feel like sleeping,because of lack of any pacy background scores etc,the music keeps us interested till the very end.Ajay Devgun shows what an actor can do in a film without having to say much.He's given powerful(and yes,better than Marlon Brando) performance.Vivek A.K.A chandu Oberoi is magnificent in his first role.And no! Rani Bai's character is NOT a wasteful one.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Great Mohanlal in engrossing and slickly directed gangster flick","review":"This is yet another entertaining gangster flick by Ram Gopal Verma that comes close but falls a bit short of 'Satya'. The plot of Company is engrossing but Vivek's character isn't as interesting as JD Chakravarti in Satya. The film is slickly directed but remains gritty. The first hour and a half is brilliantly paced. However, the last forty minutes or so sees the plot slowing down and the film ends a touch predictably. Ajay Devgun, Vivek Oberoi and Manisha Koirala are all very good, but Mohanlal effortlessly steals the show with his understated performance. Worth watching.Overall 8/10","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Greatest Hindi Film Ever.","review":"This is easily the greatest Hindi film ever made. It is perfect in everyway, there is no way to improve upon it. The problem with Hindi movies is that they have stupid LONGASS songs. But in here the songs are needed, as they tell a story, and aren't extremely long. If this was re-released in English theaters and properly advertised, it would make millions. I simply love this movie, and it is the top 1# movie in it genre of gangster/mod movies. I've seen Godfather, and this movie is on par with it. It just so well written, and acted, that I could've of easily mistakin it for an English film.(except for many many things done in the film).","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A brilliant movie to watch","review":"I am actually a person who hate Indian movies , not because they aren't directed good or the story isn't good ,it's because I watch English Movies , and as you all know there is no match of an English or Indian Movie,so ....After reading the above paragraph , It's hard to believe that I've seen this movie for more than 100 times I guess ,the reality that has been shown in this movie , and apart from that it's not like conventional Indian movies that describe only revolving around a female and how to get her and love her the whole life of yours ....they never bother to show the realities of life as we saw in COMPANY....The camera-work was simply outstanding , acting of AjayDevgan was all time great....well I believe that movie'd have been more successful if \"Malik Bhai\" had not died . ... A Brilliant Movie to watch","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Dark, insightful and engrossing.","review":"Company is a very taut, very dark look at the ruthlessness with which the Mumbai underworld syndicates operate, and the games people play when their only motivations are greed, power-lust and more than a little pride. It focuses on how important inter-personal relationships are to the success of any business venture (here, the venture happens to be organised crime), and how the fraying of such relationships can be used effectively by law-enforcement agencies to bust gangs like the Company of the title.Performances: spot on. Ajay Devgan is chilling yet wonderfully controlled in one of the two leading roles, and Vivek Oberoi's intensity in his role as the violent, ruthless yet eventually human underling is riveting. The women's roles are small but well-written and well-performed; all three - Antara Mali, Manisha Koirala, and Seema Biswas - do a good job. Mohanlal is also excellent, and I actually thought his Malayalam-accented Hindi was perfect for the role. At times, watching Company was like watching a particularly well-crafted documentary. I love the way Ram Gopal Verma depicts Mumbai in all its raw, hustling energy. The locations all seemed very real, as did the situations, characters and dialogue (which was realistic and street-smart without being particularly profane, which I think was quite an achievement). I also liked the fact that the voiceover was in the same slightly edgy dialect of Mumbaiyya Hindi, so that one felt like the speaker was a part of the same world as the protagonists. My only problem with the film was that I found Chowta's background score over-loud and often jarring in its attempt to build up mood when the director was doing so very successfully anyway, leading to it seeming redundant and sometimes irritating. There were moments when it overshadowed the dialogue, and this was really annoying. Over-emphasis is something this film could have done without, and it is this that holds me back from calling Company a total triumph. Pity. Khallas is a great song, though. :-)Interestingly, the film manages to combine esentially amoral characters with an eventual denouement that drives home a moral message (very subtly, though). I'm not sure where I stand on this, I tend to see the 'good guys win eventually' message as something of a cop-out to the conventions of Hindi cinema. Nonetheless, if this makes the film more palatable to mainstream audiences, so be it. I'm particularly interested to see how a film like this, which for all intents and purposes pushes the boundaries of 'Bollywood' film-making in a totally new direction with its absence of conventional songs, extremely moody lighting, heroes who really aren't that heroic, realism in dialogue, characterisation and setting, and very flashy, almost MTV-like editing, (all things that have been tried in the last two years in several Hindi films, but not together and not with so much skill)does at the Indian box office. If it succeeds, then it proves that the success (however limited) of Satya, Chandni Bar, Lagaan and Dil Chahta Hai, which in their own way moved Hindi cinema away from the formula, was not a flash in the pan, and will hopefully inspire more experimentation. What's certain is that with this film Verma has proven that he is perhaps the most innovative mainstream film-maker in India today, and I await more films from him with interest. He seems to be getting better with every film.\nOverall, a must-watch, especially if you like the gangster/noir genre.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Company! The greatest Indian film ever.","review":"First I would like to add that I am not very much fond of the crop of Bollywood movies. They are convoluted and hackneyed story lines with excruciatingly long dance numbers but I stumbled upon this film, \"Company\". At first thought, I realized the parallels to Scorsese's \"Goodfellas\" but once the story digresses it is more than that. There are clear influences of the great mobster films of Coppola and others but the story in the way it is told is quite refreshing for Bollywood standards. We see the rise of this slum dweller Chandu, who meets upon this respected underworld leader, Malik, and slowly progresses up to the top of the hierarchy. Ram Gopal Varma is a very effective director. He displays very bizarre camera angles through exquisite cinematography. The editing is sharp and quick with the running time flying by. The only criticism is the song sequence in the beginning and the dance club number. Totally pointless. With the recent influx of Chinese films being displayed in America such as \"Hero\" and \"Shaolin Soccer\", I hope someone like Tarantino brings a film like this to a larger audience because not doing so would do it an incredible injustice. What more can one say,It's \"Company\".","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Pretty Good Bombay Mafia Flick","review":"A depiction of Bombay/Mumbai's underworld scenario seen through the eyes of the Crime-Lord Ajay Devgan and new to the 'Company' Vikek Oberoi. The film is a loose take on the life of Dawood Ibrahim and his troupe.The film has excellent direction and a good script unlike most bollywood trash. The actors, who despite having little acting talent, have actually done a fabulous job in portraying their respective characters. Anatara Mali and Manisha Koirala have also done a good job supporting rest of the cast.A refreshing change from the usual bollywood stuff. A must see.Compare to: Satya, Godfather Thank you","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Just what Bollywood needed","review":"None of your cringeworthy \"typical Bollywood fashion\" Mafia dialogues. The bad guys don't talk in riddles and come the closest to having believable personalities amongst all Bollywood gangster movies so far. It also has the most plausible account of Mumbai police and for the first time, we see what a sensible IPS officer looks like.\nI also quite liked that there was no unnecessary violence and item numbers. The entire cast is really good, but Ajay Devgan and Vivek Oberoi stand out for their stellar performances.\nDefinitely recommended!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the best gangster movie","review":"Ram Gopal Varma's SATYA is one of my very favourite Hindi movies, though rather an anomaly in the Hindi movies that I've seen. Much darker in tone than Bollywood usually offers, it's also one of the most intelligent movies about gangsters ever made in my opinion. RGV returns to similar themes with his latest movie, Company, but this time brings a whole new style to his direction that makes the movie stand out even more from the Bollywood crowd.\nThis has to be one of the best underworld movies ever made in India. After the disappointment of jungle and mast Ram gopal varma has bounced back to deliver one of his best works. It rivals his own earlier work Satya. Though based on the underworld both films are completely different as his own words put it company is above the underworld unlike satya.\n9/10","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Another Outstanding film by a genius who gave Satya","review":"Favourite film after Satya and difficult to compare the two as both have their charm alongside a sure shot winner all the way...RGV a Maverick director for giving us two of his memorable works, ie, Satya and Company","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" really awesome","review":"this was a really great movie as it showed a lot of realism in gang violence. so heres how the plot goes Chandrakant \"Chandu\" (Vivek Oberoi) seeks with Malik (Ajay Devgan) to join his gang along with his girlfriend Saroja (Manisha Koirala). But here comes IPS officer Veerapali (Mohann Lal) to cause a rift between Malik and Chandu as Chandu got married to Kannu (Antara Mali) and the two get in a cold war with each other. Now the movie and everything was just perfect, however its downfall was its music as it wasn't that entertaining. The film would've worked without the music. Performance wise. Ajay Devgan really leads the cast with his performance as well as Mohan Lal. Manisha and Antara are perfect in their roles. It was time that Rajpal Yadav does something serious other than comedy and he was good. However, Vivek Oberoi steals the show with his debut performance as a rookie gangster. He was really impressive and really kept the movie going. If you love crime-related movies and violence, this one cannot dissappoint you.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Brilliantly directed, one of the best Bollywood gangster movie..","review":"Ram Gopal Varma is a man of extremes because he can sometimes make quite bad movies, as well as come up with masterpieces like Satya,Rangeela,Sarkar,Company etc..Company is probably the best directed RGV movie along with Satya, the film gives an exact, detailed and working of Mumbai underworld,as well as showing the relationship b/w dons Malik(Ajay) and Chandu(Vivek) loosely based on the relationship of Dawood Ibrahim and Chota Rajan and their rivalry.The film highlights the economics behind running an Indian mafia organization. In the opening of the film, Ajay Devgan describes the modus operandi of underworld. He states \"Despite anybody telling anything else, in this world everything is done for profit, so is this business. We don't pay taxes, neither do we keep accounts; For this work is done by inducing fear. Anybody can join us anytime, but can never resign. Whoever breaks our law, is broken by us. Here friendship, respect or honesty, the only real reason behind all these is same thing -- Profit\". During murder / extortion scenes following, Ajay Devgan adds \"profit happens -- like this, like this or like that\".The story revolves around a young man named Chandu (played by Vivek Oberoi) joining the world of crime in the Mumbai underworld to \"make it big\" someday. Gradually he learns tricks of the trade and increases the gang's earnings and profits. This leads to his affinity with Malik (played by Ajay Devgan) who is the leader of the gang.The film features one cold blooded murder scene wherein Malik and Chandu kill Saeed and his brother Anis in the rear seat of the car on a chilling rainy day. Thereafter Malik goes on a bloody rampage killing all his opponents, so as to take the reins of underworld in his hands.They include his rival gang leader and colleague under Aslam's umbrella Sharma, who was in a meeting with police inspector Rathod, also killed off. Inspector Rathod, who once tortured and abused Chandu in jail in early days, was also killed at Malik's permission.However, both come at loggerheads during the execution of a contract killing. The contract was from a politician who tries to use Malik's gang to eliminate a front-runner, a contender for Home Minister's post.The rift between Chandu and Malik widens due to various misunderstandings. The Commissioner of Police, Sreenivasan IPS (Mohanlal) makes use of the rift to bring the mafia under control. Chandu and Malik end up becoming bitter enemies. After Chandu's retaliation of the assassination of his life long friend of one of lieutenants Warsi, two factions of Mumbai's once most powerful gang 'Company' went to a full scale war.Malik and Chandu killed as many members of each opponent gangs as possible. Sreenivasan, as the police chief of the city of murders due to the war, became criticized greatly, but he and his men knew this war ultimately is shortening the to do list of his department. Big number of button men and lieutenants from both gangs were being killed. The war results in an intense chase sequence shot in Kenya where Malik hires hit men to kill Chandu.However Chandu survives, though he is injured severely. Sreenivasan convinces Chandu to come back to Mumbai and fight his war with Malik by helping the police bring the mafia under control.The film reaches its climax when Chandu kills the politician (the mastermind of the contract killing) within the prison. At the same time, one of Chandu's aides named Koda Singh, who swore revenge to kill who went against his friend Chandu, shoots Malik point blank to death in Hong Kong.This shows, Chandu and Malik came to a truce but Chandu never withdrew his order to Koda to kill Malik. It's not confirmed that whether Chandu has forgotten to withdraw his orders or deliberately kept that on. But, after the assassination Sreenivasan notified Chandu and Chandu became tremendously shocked at this news. So, possibly Chandu forgot to send a come back call to Koda.Koda Singh was arrested by Hong Kong Police on that day. The film ends, showing Chandu spending the rest of his life in prison after being persuaded by the Police Commissioner to surrender.Among the cast Ajay is great, Mohanlal is brilliant as usual, Vivek is excellent in this one, hard to believe this was his first movie, Manisha is good,Antara is alright for once,the rest of the cast is perfectly chosen and do their jobs efficiently.The movie is gritty and intense, the background score by Sandeep Chowta suits the mood of the movie perfectly, music by Sandeep Chowta is excellent with some very good songs like \"Khallas\",\"Sab Ganda Hai\",\"Tumse Kitna Pyaar Hai\"...This movie is among the best gangster movies ever made in Bollywood along with Satya,Vaastav,Parinda and Agneepath...Company is definitely one of the best DIRECTED movies made in Bollywood.A Salute to RGV for this one.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Mumbai's organised crime and those that fight them","review":"Another movie in the 'crime genre' from the soon-to-a-be-a-legend Ram Gopal Verma. This movie will always be compared with Satya ( his earlier film). Its an open secret that this movie is about the famous gangster Dawood Ibrahim and his hench man Chhota Rajan. The movie quite loosely follows the real life story of these gangsters. I would rank this movie as an extremely well crafted one and technically Varma's best film. The editing, the score, the scenes are just perfect. What it lacks is that raw power of Satya because of poor casting of the main hero in this film who looks more like a model ( which he is in real life) than a hungry wannabe gangster. Ajay Devgan is very good but the major find of this movie is Antara Mali. This is not your regular hindi movie with songs and dances. It is an extremely well planned movie right upto the interval timing. Really fantastic. Though the story ends rather tamely but the direction and some excellent scenes like the \"escape\" and the \"wipers in the rain\". Really superb.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Indian version of Goodfellas!","review":"Company has become one of Indias first cult films.  The film did average business at the box office, but found a larger audience on dvd and video due to good word of mouth.SPOILER ALERT I likened the film to an Indianized, (not copied) version of Goodfellas. The rise and fall of the small time hoodlum, under the watchful guise of an underworld don, is similar to the relationship shared by Ray Liotta and Robert DeNiro in Goodfellas.This is Vivek Oberois first film, and he gives a mind shattering performance as Chandu, the gangster in training.  It is hard to believe that such a performance was extracted from the newcomer.  He holds his own over the veteran, Ajay Devgan, who plays the underworld don.The story gets very interesting post interval when Oberoi and Devgans characters have a difference of opinion and embark on an international campagn to kill one another.I loved the fact that the film was shot in 3 to 4 different countries. Hong Kong and Kenya were used a actual backdrops to excel the storyline rather than pituresque locations to film songs.Company is a hard hitting drama that has not been seen in Indian cinema for quite awile.  Vivek Oberois introduction to bollywood has been on the same level as Shah Rukh Khans risque performances in Darr and Baazigar almost 10 years ago.","imdb_rating":8,"our_rating":0,"algo_label":0}]