[{"heading":" Cute romantic movie","review":"I loved the movie so much enjoyed watching this blockbuster movie for me I think it's a blockbuster in my opinion songs are good jimmy is superb as the romantic hero and chocolate boy he is the superstar of Punjabi cinema he's my favorite actor the heroine did well in her role other did good their role direction is good and the story-line is very attractive in this movie and point my rating 7/10","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Totally unconvincing in all accounts","review":"Okay then, Ameesha Patel plays a young popular singer who never knew her real parents, so she goes with her boyfriend on a journey to find out who her real mother is. And she finds her only to discover that she is actually the product of a rape, and that's why her mother gave her away upon birth. From then on she decides to take revenge on this man for her mother, who does not show any sympathy to her own daughter. Yeh Zindagi Ka Safar is directed by Tanuja Chandra, a young woman who is not a particularly great director but whose previous films, Dushman and Sagharsh were enjoyable thrillers in spite of being unoriginal. But Yeh Zindagi Ka Safar is a weak show which lacks depth and conviction. The issues it is supposed to deal with are poorly handled, the script and the dialogues are average to very bad, and the entire movie does not make any impact, at least from my point of view, given the high melodrama and not much substance. Amisha Patel's is a sad case. Not that I ever thought of her as a particularly good actress, but her performance in that same year's Gaddar was really good, and here, she hams it up in many scenes, while in others she is simply unnatural. Her whiny crying scenes were very irritating and really got on my nerves. Jimmy Shergill is just there, but he performs relatively well. Nafisa Ali is pretty likable, and is still beautiful and full of grace, but unfortunately she too does not really play the traumatised rape victim that convincingly. Maybe it's got more to do with her appearance and overall dignified persona which comes across very clearly on-screen and which makes it hard to believe that she had ever gone through such an experience. I would conclude by saying: avoid Yeh Zindagi Ka Safar, it's got nothing new or special to offer.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Good story, but bland","review":"Nafisa Ali shines as the mother.  Story of a girl's quest first for her true parentage, then, when she finds out she's the produce of a rape, the quest for retribution.  Rather Bollywood ending (which ain't bad!).  It's supposed to be women's lib, but Amisha always is crying on Jimmy Shergill's shoulder (I think they found out she can cry well, so she cries all the time now -- he's great, though, and very cute).  Fairly good movie; I'd watch it once, but not buy it.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" I couldn't even get through this movie","review":"I kept checking my watch and yawning and I wasn't even tired. Amisha Patel has really disappointed with this one. The songs were so bland and the plot and direction very weak. Jimmy Shergill who is usually an ace actor was more like an ass actor in this one. It all just stunk really bad. Plus, Gulshan Grover gave me a massive headache with him yelling all of his dialogues the way he did and overacting nearly all of his scenes. Even Rajpal Yadav was irritating (and I usually love all his roles) in the film as well. Forget about the directing, it looked like everybody involved in the film just showed up and started doing whatever they wanted to do.","imdb_rating":2,"our_rating":0,"algo_label":0}]