[{"heading":" I wannasay something .... that I love you","review":"Despite the fact that this movie got average commercial success and it's a remake of a Telugu movie - Tholi Prema (1998), it is to be acknowledged that it's a good movie. It is a romantic movie but it portrays silent love in the hearts of teenagers who are hesitant to express their feelings to their love-interest because of fear of refusal. In this teenybopper love story, the boy feels his love towards the girl since her very first sight but unable to convey it to the girl whereas the girl comes to know of her feelings towards the boy in the end only. And in between goes a rom-com with songs, comedy and some action, summing up to an entertaining journey for the spectator.Mujhe Kuchh Kehna Hai tells the story of Karan (Tushar Kapoor) and the narrative moves with him only. He belongs to a well off family with a loving mother (Himani Shivpuri), a stern father (Dalip Taahil), a benevolent and jolly uncle who is his father's elder brother (Amrish Puri), a loving and caring elder brother (Pankaj Berry) and an affectionate sister, Priya (Rinki Khanna). Karan is careless as far as the studies are concerned. However he is kind and helping by nature and ever ready to do anything for friends. Amidst the frolic and enjoyment of his happy-go-lucky life, appears Pooja (Kareena Kapoor). Karan starts feeling some unknown bond between himself and herself and once she gets introduced to him by sheer stroke of luck, gradually love blossoms in his heart. But what to say and how to say, is his dilemma. Hence he remains content with his one-sided love only. However silent waves keep on going from his heart towards Pooja's heart and when she is about to depart for abroad (for pursuing higher studies), all of a sudden Karan's love becomes visible to her something like an illumination in her heart. Now she is no more willing to leave India but Karan admonishes her and they conclude to wait for each other and let their love ripen with time while pursuing their respective careers meantime.Mujhe Kuchh Kehna Hai has a youth appeal and the director of this movie, Satish Kaushik has handled the plot of the original Telugu movie with utmost care. He has presented an entertaining movie to the audience with ample doses of comedy and emotions. In addition to the silent love between a boy and a girl, the movie highlights family bonds also in an impressive manner. All the angles in a family, viz. brother and sister, father and son, uncle and nephew, elder brother and younger brother etc. have been developed very well. Only the relation between mother and son has been downplayed. The father who has a perennial resentment with his careless son. becomes restless in the climax to know that the love-interest of his son is leaving India and gets too much concerned for the feelings of the boy, leaving all his resentment towards him behind. Similarly, the emotional bond between a brother and a somewhat elder sister has also been underscored very well. The brother knows that his sister who is pursuing the course of medicine, isn't willing to marry a doctor and it's her dream to marry a pilot, is stunned to know that ultimately, it's a doctor only who is going to be his brother-in-law. And then, he is further amazed to know that it's his sister herself who has arranged this marriage because the groom has been in love with her for three years and she feels that it will be unwise to turn down the proposal of such a loving person. The sister understands the sentiments of her brother towards Pooja very well and she is less a sister, more a friend. In my view, an ideal family should be like that only with everyone caring for the others.The character of the hero's uncle has a comic flavour and enough laughs have been generated through it for the audience. The activities of the hero and his friends are also rib-tickling (though some action has also been forced through them). Though most of the characters playing the hero's friends are sketchy and somewhat over the top, they are able to amuse the spectator. The scene in which a friend of the hero gains a lift from him to attend an interview by lying to him that he had seen the hero's love-interest there and the hero's reaction upon coming to know of this cheating is touching and an eye-opener for many. Seek help of a benevolent person by telling him the truth instead of playing with his emotions by lying to him. I praise the script-writer for thinking of such a thing which is a lesson for life.This entertaining movie boasts of good music by Anu Malik also. In fact, the chartbuster songs were also a factor in its (limited) commercial success. The title track, Pyar Re Dil Maange Pyar Re, Man Dole Mera Tan Dole, Ankhiyon Ne Raat Kya Jaadu Kiya, Is Pyar Ko Main Kya Naam Doon etc. are all good to listen. However the song which won my heart is Jab Se Dekha Hai Tere Haath Ka Chaand, Maine Dekha Nahin Raat Ka Chaand in which Tushar visualizes the moon made by myrtle on the palm of Pooja while getting lost in his romantic thoughts of hers.This is the debut movie of Jeetendra's son Tushar Kapoor and he is so-so. Frankly, enough maturity does not seem to have come to him to play the pivotal role despite the fact that the role is of a teenager. The heroine of this movie - Kareena looks more mature than him. The best performer is Amrish Puri who as the romantic and frolicsome uncle of the hero is awesome in his performance. A decent watch it is.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Heart warming and very entertaining","review":"This is the debut movie of Jeetendra's son Tusshar Kapoor. It is a light hearted family movie with plenty of romance and comedy. It tells the simple story of a Boy who falls in love with a girl, but is not sure how to express his love. Its a 2 in a half hour movie, about him trying to show his love, but still manages to entertain. Tusshar Kapoor delivers a Good performance, not bad at all for a debut. His next bunch of films sucked at the box office. Kareena Kapoor was quite good believe it or Not. Amrish Puri was amazingly funny in a great performance. Satish Kaushik makes a great movie that you can enjoy. Overall, this is worth the watch, give the movie a chance, You may like it.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Believe it or not....its pretty good!","review":"Boy meets girl...he falls instantly for her...he struggles to find a way to enter her heart...dramatic twists...and eventually they end up together. Isn't this a typical Hindi film plot outline? You bet.But to be honest, MKKH is a pretty decent film. This was my first ever Hindi film I think, and I fell in love with it on the first screening. Seeing it again, I see the negative points too, but there is no doubt it is a good movie.I thought Tusshar Kapoor does an impressive job for his first film. He and Kareena have a great chemistry. I admit, Kareena is good too, these were the days when she was all innocent and pretty. I liked her in this movie, and I like her in these types of roles. I am not that big a fan of her new stuff.The music is really nice. Very melodious and catchy, and each song is well crafted. I enjoyed it.Its as cheesy as hell, but enjoyable","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Funny, but often unintentionally so","review":"This is the first Bollywood film I'm giving my \"5 out of 10\" rating. I usually reserve that for \"So bad it's good\" films. Mujhe Kucch Kehna Hai is no exception. Although it's clearly a comedy at times, it's just as often funny when it's not supposed to be--both the comedy and the serious bits are frequently ridiculous. That makes it a lot of fun to watch, but it's not exactly a good film.The plot, in a nutshell (a nutshell is really all there is to it), features Karan (Tusshar Kapoor) trying to find and court Pooja Saxena (Kareena Kapoor--she and Tusshar are not related as far as I know; they at least do not seem to be closely related). Karan happened to see Pooja from a distance and instantly fell in love with her. They keep having close encounters, but something always interrupts, and in a typical Bollywood move, Karan never musters the courage to initiate anything other than polite, casual conversation. Karan lives in a moderately sized Indian town. Pooja is from the States, visiting relatives to do research on \"Indian culture\", and trying to get accepted into Harvard. Karan is much less scholarly. He has a cadre of relatively goofy friends, they have a band, and we learn that he can fight unbelievably well.The idea of the plot isn't horrible, even if it is simplistic. Mujhe Kucch Kehna Hai is basically a series of misadventures. The problems with the plot arise in the way director Satish Kaushik and writers Rumi Jaffrey and Karunakar handle it. For the first half-hour, they're basically just treading water. Kareena Kapoor doesn't appear until the 35-minute mark. We have a fifth of a typically overlong film just to introduce characters, in absence of any real story. Further, because of the simplicity and the necessity of increasing the severity of the misadventures, and also related to length, we have a film that peaks at least 40 minutes before it is over. Like too many Bollywood films, this story would have played much better if kept to 90 minutes. On the positive side, the ending is refreshingly unusual. Kaushik and crew avoid simply resorting to clichés.But there are bigger problems with Mujhe Kucch Kehna Hai than the plot. Kareena Kapoor, although more than pleasant to look at, consistently comes across as if she thinks she's doing a shampoo commercial rather than a dramatic film. She constantly \"glamour mugs\" in an exaggerated way, and she's regularly flipping and bouncing her hair around (her first scene, where she's bouncing up and down and showing off her decorated hands, is particularly funny for its absurdity). This was one of her earlier films, so maybe the ridiculous and ill-suited overacting is more excusable, but that makes it no less unintentionally funny to watch. Admittedly, her acting has improved rapidly. She didn't seem so out of place in Main Prem Ki Diwani Hoon (2003), although on the other hand, that film is absurdly cartoonish at times.Tusshar Kapoor comes across as the better actor here, even though this was his first film. But as decent as he is, Kaushik and crew have him and the rest of the cast doing ridiculous things. The bits that are supposed to be comic--like Karan's daydreaming leading to him using his friend as a guitar--are okay for their ridiculousness. To be funny, there has to be something \"out of place\", roughly. But a number of scenes that are supposed to be climactically dramatic--such as an attempted rescue from a cliff, or Karan's proposed and actual birthday presents to Pooja, end up being just as funny.Kaushik also stages a couple absurd fight scenes, with random \"striking\" sound effects that reminded me of the hilarious fight scenes in Mudda (2003). For my tastes, there was also an overabundance of songs, which featured way too much \"look how young and hip we are\" mugging, some very fake musicianship from our stars (doesn't any member of an Indian film crew know how to set up a drumset?), and some very \"flamboyant\" dancing and posing from some of the male back-up dancers. Of course, the typical travelogue cinematography accompanies most of the love songs. Much of the Mujhe Kucch Kehna Hai was filmed in New Zealand, and Kaushik does a good job of exploiting the setting, even if that means prominent appearances of businesses such as McDonald's and Burger King. No one involved with this film is reluctant to show their immersion in popular western youth culture, even though it usually comes across as more goofy (and occasionally behind the times--just check out the preppy shoulder sweater) than anything else. The first scene is in a disco, with a crowd dancing to \"Who let the Dogs Out\", before Balram Singh (Amrish Puri) begins his constant utterances of \"very good, very very good\", as he has a group of girls \"rate\" boys he parades across the stage. That gives you a good taste of what is in store for the length of the film.If you do not speak Hindi, you're in for a bit of an extra challenge with Mujhe Kucch Kehna Hai, as much of the dialogue moves by very quickly, resulting in subtitles that disappear quicker than you can read them. There are more lines than usual that remain untranslated, and for some reason, they just didn't bother to translate the lyrics to the songs at all.If you're in the mood for some silly humor, both intentional and unintentional, this is worth a watch. You'll laugh at the film as often as you laugh with it. Just don't use this film to introduce any of your friends to Bollywood.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Tusshar's debut","review":"MUJHE KUCH KEHNA HAI was the first film of Tusshar plus it was actually Kareena's first hitThe movie is a typical love story where the guy proposes only in the end but it's well handled and tusshar's character is shown very boy next door which worksHis scenes with his father(Dalip Tahil) and Tauji(Amrish in a delightful role) are well handled the love story is well treated though they are some additional scenes like the prolonged first half and also the forced action scene between Tusshar and YashpalEven the end is a bit implausible and looks too sudden but yet the film has nice moments like the entire track where Kareena is saved by Tusshar, even your heart does go for TussharDirection by Satish Kaushik is good thakfully not overboard with drama Music is good Camera-work is decentTusshar looks the boy next door but a problem with him is his too laidback and his expressions are too babyish at many places but however Satish directs him well, and he does well in emotions and comedy but his screen presence is always a problem and also his dial delivery Kareena is decent however she tends to overdo her role many times yet she is simple compared to her crap poo roles Amrish is wonderful, i like to see him in such roles rather then the bordering on comic villainy roles he did many times though he excelled in many villainous roles yet he did some crap ones In this film he is superb in comedy and steals the show and he has always been a delight in comedy Dalip Tahil is okay Himani Shivpuri is alright Rinki khanna is too loud","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" A nice, refreshingly different love story","review":"Boy meets girl. They fight. They fall in love and end up together after fights and misunderstandings. That is typical Bollywood love story for you. Which, fortunately, MKKH is not! Directed by Satish Kaushik, MKKH is a refreshingly different romantic story. The story centers on Karan (Tusshar) who is weak in studies but is good at heart. He helps friends and is good in music but is disinterested in studies. On a Diwali night, after being rebuked by his Dad (Dalip Tahil) for helping a friend in attempting to elope with a politician's daughter, he sees a girl for the first time on a road. He gets infatuated with this beautiful girl and would later come in contact with her. She is Pooja (Kareena).Fate has Karan saving Pooja, almost dying in the attempt. Pooja and Karan become fast friends. Karan, who was already attracted to Pooja, falls madly in love with her. Despite repeated prods from friends and his sister (Rinkie Khanna), Karan fails to open up his heart to Pooja. One day, Pooja gets a chance to study in Harvard and off she has to go. Will Karan be ever able to tell her his feelings? A simple love story on the surface, MKKH has symbolic undertones that I guess very few can comprehend. On a Diwali night, the inner darkness of Karan is dispelled by the divinity in the form of Pooja, a bright student. It is also in a temple where fate brings him close to Pooja again. The point is clear, the divinity has plans to show Karan the true meaning of life through Pooja. Not for nothing does Karan feel that he has a timeless relationship with Pooja. It is actually divinity that touches Karan in the form of Pooja.Slowly, Karan transforms into a responsible man. He becomes mature enough to place his lover's interests above himself. What happens in the end, will move any romantic. View it from the light I pointed out and you are bound to find a very different meaning altogether at the climax. It is not only a tale of love. It seemed to me also as a story of a young, irresponsible man trying to find a goal in his life. In his case, it is love that shows him the way.Brilliant direction by Satish Kaushik with not one scene extra in the film and no excess KJo type emotions. Lilting music by Anu Malik. I particularly liked \"Rabba Mere rabba\", though other songs like the title track, \"Maine koi Jadoo\", \"Jabse Dekha Hai\", \"Dupatta Mera\" and \"Pyar Re\" are also great to listen to. \"Rehna Hai\" is also great. 10 years have passed and they frequently come back to my play-list.Tusshar was nice as a newcomer. He was an excellent choice and the feeling you get of a mismatched couple when you watch him and Kareena together just makes it right for the film. Kareena seldom looked so beautiful and acted well, though she was a bit raw those days. Dalip, Amrish and the rest are first-rate too.Overall, a nice movie that can give you a long, lingering smile that will come back every time you remember about the film. In my case, it does.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Absolutely Brilliant!!!","review":"What can I say that hasn't already been said about this fantastic movie? To be honest when I first heard about this movie I was sceptical as to whether or not it was going to be good.  I instantly liked the songs but just because the songs are good doesn't always mean that the film would be good. And the fact that there was a new-comer opposite Kareena Kapoor (in only her 2nd film) didn't help the pre-discussion about this film as hit films tend to have the likes of Shahrukh Khan and Madhuri Dixit in the lead roles.So when I saw this movie for the first time I was so sure I knew what was going to happen (as a lot of Indian movies tend follow the same sort of endings) that I expected one thing to happen and something completely out of the blue happened at the end.  I was not too fond of the ending but it was different all the same.  I liked this film so much that I purchased it on DVD (and I only ever buy the ones I really like...)The acting of Tusshar and especially Kareena Kapoor was beyond a doubt one of the finest performances for fairly new-comers to the acting scene and the roles seem to fit both Tusshar and Kareena perfectly.  I have definately been converted into a lovable and loyal follower and will certainly be following their careers (especially Kareenas') into their future releases. And not having seen Refugee yet (shame on me I know) I will definately be watching it soon and undoubtedly commending on Kareena's performance (and probably buying it on DVD).  She is definately going to be big star and I for one will certainly be there to celebrate alongside her.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great Film Ever","review":"It was one of the best movies i have ever seen in my whole life. Great acting and good composing. Awesome editing and a lot of action is there in this movie. A lot of drama. Hero was dying to say that he loves the heroin. But every time there was something .. you have to see this movie to believe that there are a lot of things which you should understand before proposing someone. his film is about passion, love, bravery, romance, fight and a lot of genre you want to see in a single movie. I suggest you to watch this movie and you will be very relax after watching this movie. One of the great actors of all time \"Mr Amrish Puri\" worked in this film. He is no more in this world. But in this film he played a positive role which is another unique thing about this movie.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" congratulation","review":"as a viewer I would say the movie was great, especially for Tusshar as a new comer..  he was brilliant and the manner he delivered his role was just great.  His dressing, his looks was just perfect for the role... I would say that he is a good actor.  God bless him and guide him for reaching his destination as one of the top forthcoming hero.  He should be optimistic and have faith himself and he will come up.. congratulation  Tusshar..... son like father.....Kareena was good and has delivered her role well.  Both of them have delivered their role in the manner I expected them.","imdb_rating":10,"our_rating":0,"algo_label":0}]