[{"heading":" A beautiful film about bringing families together","review":"This film shines from start to finish, and runs the gamut of emotions. The cinematography, sets, and costumes are brilliant. The sparkling performances of six of India's leading actors alone makes the movie worth seeing, even if some might not feel comfortable with the deep sentimentality displayed by the leading men (women are fine with this; American men sometimes find it unnerving). Hrithik Roshan is pure eye candy for women of all ages, somehow oozing sweetness and innocent sexuality at the same time. The catchy song and dance number he performs with the lovely Kareena Kapoor at their 'prom,' \"You Are My Soniya,\" has gotten regular replays in this household for weeks (even by my 79-year old mother, who will say, \"I need a Soniya fix\" - it really cheers her up!). The other musical numbers are very enjoyable, too, and never seem out of place or at odds with the flow of the film. Shahrukh Khan is adorable, as always, as the favorite son, and can hold his own in the dance numbers, too. Kajol gets to show her comic side, and was great at it! And knowing that the 'parents,' Amitabh and Jaya are a married couple in 'real life' just makes their interactions in the film that much better. Don't miss this wonderful movie! If you see just one Hindi movie, make it this one! (I am adding this question, for anyone who knows the answer: I wanted to find out what actor played Rohan at about age 12; the cast list shows three names for \"Fattie\" but no further details for any of these actors. If you happen to know the answer, please email me at punzelle@cox.net. Thank you!)","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Trademark Karan Johar","review":"I respect Karan Johar. He is an honest director. There are a lot of young directors out there today that are taking the Hollywood approach to film making and the end result is a mish mash of a desi product in a foreign packaging. Karan Johar, on the other hand, takes a desi story, puts it in a desi package but only refines it more than most others do. What you get is a very good Bollywood movie that has elements of emotion, melodrama, comedy, family values, romance and music in equal doses. Yes, I admit that the story does leave a lot of questions unanswered, but that's OK considering the desired target market is one that is alright with that and sheds expectations of credibility before walking in to the cinema.K3G is a beautiful example of what a good director can do. Agreed, the movie may not have been as great without the power star cast, but then, let us not forget that before those people are stars, they are very good actors. Well, except maybe Kareena and Hritik.This is where the minus points are. Hritik did nothing but weep perpetually. Kareena played an overbearing slut. And to top it off, she and her friends all spoke American slang and also had that slight twang of an American accent. (PHAT: Pretty Hot And Tempting?? That's ghetto lingo!) And I really didn't like the national anthem thing. i felt it was a little pushed. I think KJ went a little overboard there in trying to make the NRI audience cry. The only time that trick has worked effectively was years ago in \"naam\" when Pankaj Udhas sang the \"Chitthi Aayi Hai\" song.There are certain scenes that I found really well done in the movie. The last time Rahul meets Rohan before the latter goes off to boarding school, he has a talk with him about taking care of Mum, losing weight and joining he cricket team. They are sitting on a bench, side by side having this talk. Years later, in the second half of the movie, after Rahul realizes that his brother has been living with him all this while, the scene again cuts to them sitting on a bench, this time ten years later. It could've been shot anywhere, but the fact that the setting is so similar just makes it even more memorable.The scene where Nandini (mom) meets Rahul after years at the shopping mall, she places her hand on his shoulder and he turns around. Wow.And the finale of course. Amitabh breaking down with SRK.One mustn't expect great international cinema here. this is what great Bollywood is all about.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A grand, musical and emotional Bollywood extravaganza!","review":"Karan Johar's Kabhi Khushi Kabhie Gham is one of the most ravishing, grandiose and melodramatic Hindi films ever made. It is incredibly unrestrained and stormy in its emotional quotient, and yet so watchable, enjoyable and at times even pleasurable, that you can't but applaud to this spectacular show. It is one of the few films where overacting seems superb acting and overly melodramatic proceedings, despite being very cheesy and occasionally clichéd, become quite bearable. It combines realism and surrealism, comedy and heavy melodrama in a very unique style, which makes for an altogether colourful picture which is fun to watch.The film is about relationships in family, about loving your parents and your family, about pride, values and regret. The well defined and written characters are used to create and present all these qualities. Even the least emotional scenes are accompanied by orchestrated violins, heavy piano and strikingly sad pictures on-screen. The film shows both the bright and dark sides of happy families, and while it never breaks new ground, never looks totally authentic, it is always entertaining in spite of its flaws. It depicts both the Indian traditional world and the western modern world and tries to bring them together in many instances.Some of the film's too emotional scenes could have been better edited and partly cut. The cinematography is good, the sets are extremely lavish, and the narrative is effectively laden with numerous songs and many memorable moments of comedy and drama. The comedy provides great relief and lightens the otherwise more-than-enough drama, and the music is extraordinary. My favourite song is \"Suraj Hua Maddham\", a greatly melodious number wonderfully performed by Sonu Nigam and Alka Yagnik and extremely beautifully shot across some breathtaking locations. Needless to say, the chemistry between the two leads, Shahrukh Khan and Kajol, is as electrifying as ever.Where acting goes, Amitabh Bachchan is restrained and displays well the hidden pain and the visible pride. Jaya Bachchan is superb as the subservient yet strong woman. Towards the end there is one very powerful scene in which she really stands out (you'll know which one). Shahrukh Khan in a typical, cynical and likable character, is great as always. Kajol utterly steals the show and proves her prowess as a gifted comedienne. She is hilarious in her comic scenes and equally shines in moments of drama. Her strong, charismatic presence is perhaps the best thing about this film. Farida Jalal provides excellent support. Hrithik and Kareena are unimpressive and inconsistent. Hrithik is over-expressive and far more emotional than required, and Kareena, while attractive and quite funny at times, badly overacts.All in all, Kabhi Khushi Kabhie Gham has bits of everything: drama, melodrama, romance and comedy, all presented wholeheartedly in true Hindi-film style with lots of tears and lots of fun. It is an example of Bollywood entertainment at its grandest, and works as such. This is a movie to be seen with one's family. Go for it.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" hoorah! for Bollywood!","review":"I have never been a Bollywood-fan, believe me. Especially with all those movies full of cobra's, killing and corrupt policemen. But today I decided to go for a handsome face on the poster of the cinema, and sat down to watch about 3 hours of typical Bollywoodfun. No regrets! A modern story about conflicts between generations, growing up in different ages, with different traditions. A story that will make the audience in many countries feel could be their own story of life. Even the music was not disturbing, and the humor is refreshing at times. The music is even for a westerner like me something to ad to my collection of cd's, and the only minor thing for me was the sudden apearance of Egytian pyramids as background for a romantic song. After movies from Indonesia have won my heart earlier in 2001, and France with 'Amelie', Bollywood is the next, with Hollywood loosing ground.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" I adored this movie!","review":"I absolutely adore this movie. I borrowed it from an Indian friend and first of all fell IN LOVE with Hrithrik Roshan. Not even the bootleg tape I had could hide his beauty. I think I watched the movie 3 times in one week! Seeing as how the film is 3 1/2 hours long, that's saying a lot.As always, Sharukh Khan is a pleasant diversion on screen. Kajol's character was a lot of fun too. It's nice to see a girl with spunk get her man! Nearly all of the songs and choreography were stellar. I will most definitely buy this one.Like some of the other reviewers mentioned, there is definitely some over-acting but those few moments of suffering are rewarded with a variety of eye-candy. This film is definitely worth watching.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Sweeping","review":"Glossy emotional drama, bringing together talent across the acting generations of Indian cinema. With a cast that reads like a Who's Who of Indian cinema, Karan Johar's film focuses on the tensions within a divided family, namely the rift between strict disciplinarian father Yashovardhan (played by Bollywood megastar Amitabh Bachchan) and his estranged son, Rahul (Shah Rukh Khan).With Bollywood heart-throb Hrithik Roshan in the role of brother Rohan and Kareena Kapoor as sister Pooja, the A-list cast is completed by Jaya Bachchan. Following the fortunes of wealthy non-resident Indians in the UK, the film takes in beautiful locations from the British Museum to Blenheim Palace and serves as a paean to the motherland, India.\nK3G (as it is more commonly known) is a glossy emotional drama, bringing together talent across the acting generations and includes the show-stopping number 'Shava Shava.'","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Life, love and then some....... all a lesson we should learn.","review":"Saw it Own it. And not just because I'm a woman either. The movie is rather lengthy but well worth sending the message it sends, which is: Family is our most precious asset we can own in this world. No matter what Family is Family and you love them regardless of their choices, mistakes and what nots. This is the type of movie that should be shown to all, to wake up our society and make them realize that life and family are too precious to take for granted. I wish more people knew about this movie, it has a universal language and appeal. And while others may think its too long of a movie to watch, I say get an attention span. I wish American movies were more like this one. The musical numbers while at first seem a bit weird, are rather entertaining and joyful to watch. Excellent movie!!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" One of the BEST Bollywood Movie ever made","review":"Kabhie Khushi Kabhie Gham known as K3G is one of the Best Bollywood Movies of all time. It was a Big Budget movie with the Big Giants of Bollywood together in one movie. It has the biggest opening in UK reaching Number 3 in the UK Top 10. It was directed by Karan Johar after the Huge Success of Kuch kuch hota hai, This film looked like a instant Hit judging from the trailers and Star Cast. Amitabh is Great in a powerful performance, Shah Rukh Khan is Superb in a wonderful role. Kajol is amusing and annoying, but her character is suppose to be dim, so she did entertain for a bit. Hritek Roshan is Fantastic in one of his best performances. Jaya Bachchan is Marvellous and full of emotions as the mother. Rani Mukherjee is Good in a small role. The only person that gave this film a slight weakness is Kareena Kapoor. Her character was so unrealistic and annoying, in reality if a person acted like that in college then they would of been laughed at bye me. This was a real delightful movie to enjoy watching with the family, but Kareena's character was a bit of a slapper, who did not look pretty and over acts. Overall a Great Movie.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Love and forever love","review":"\"I shall pass through this world, but once! Therefore any good that I can do or any kindness that I can show to any human being, let me do it now, let me not differ or neglect it. Cause I shall not pass this way again!\".Yes, this film makes above statement true! To be in love with anybody makes everthing better and more agreeable, your girl, boy or your parents. Also you should do it for your own sake! Cause nobody can live with it (love). About the movie must say that Indian movie stars could not performed their roles better, they were perfect and honestly my heart beats faster every time I see this movie! About its director, I must add that he made an acceptable movie with a perfect collection of movie stars, lyrivs and music that are unique in all indian films. This movie worth to be seen by any human being, to understand that to be in love is something worthy even in this new century! Be in love forever.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" It's about loving your family............","review":"This movie is truly a work of art, with the emphasis on art.  Dazzling costumes, magnificent buildings, glitzy cars, tons of emotions.  Karan Johar is a master at extracting the exact emotion that he wants from the viewer. You cannot help but weep or cry at various scenes, even though you see them coming a mile away.  The storyline is cliched and has been done many times before, but NEVER has it been packaged in such a powerful way.  Kudos to the director, who despite the small flaws in the script, steers the viewer away from it, and engrosses you in the myriad of artistic explosions on the screen. Amitabh Bachan plays the patriach and is fairly good in the role, although he has done it before and is starting to stereotype him.  Some scenes, I thought, were a little demeaning to him [the dance with the females in the Shava song], and should have been done more tastefully.Jaya Bachan is very good as the wife, with the amazing ability to sense her son.  The scene where she stands up to Amitabh is brilliantly executed, as is the scene where ShahRukh meets her in the shopping mall in London.Kajol is brilliant, and this is probably her best role/performance of her career.  She is pure magic and fills the screen with bubbly enthusiasm and sheer excitement whenever she is in frame.Kareena Kapoor is appropriately cast and is also excellent in the role of Poo.  She is a delight to watch, and does not falter, even in the comic scenes with Shahrukh.  One cannot imagine anyone else in this role.Hrithik Roshan, to me, was the surprise of the movie.  He was brilliant and just about steals the show in the second half of the movie.  His performance is sincere and visually a treat.  He is indeed the superstar of the future. Bulging muscles and hip dance steps aside, this guy is a brilliant actor through and through.But for me, Shahrukh Khan is the star of this movie.  He is stupendous, magnificent, brilliant.  He makes you laugh, cry, dance, cringe, smile. He does all this with flawless perfection.  His pairing with Kajol is magical, and it shows on screen.  I can now understand why Karan Johar says that he cannot imagine doing a film without Shahrukh.  The guy is amazing.On the whole, this is an excellent movie that is worth at least 4 trips to the cinema.  Thank you Karan Johar.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A pleasant diversion","review":"Kabhi Kushi Kabhi Gham is the story of Rahul (Shahrukh Khan), the adopted son of multi-millionaire Yashovardhan Raichand (Amitabh Bachchan). When Rahul disappoints his father by marrying the wrong girl, Anjali (Kajol) he is disowned. Rahul and Anjali move to London where 10 years later Rahul's younger brother, Rohan (Hrithik Roshan) tracks them down in an attempt to re-unite the family. Along the way a romance buds between Rohan and Anjali's younger sister, Pooja (Kareena Kapoor).The story breaks no new ground here, but I have to admit I was drawn in, probably because of the actors. With a star cast like this one, you have to be entertained...Khan/Bachchan/Roshan have a wonderful three way chemistry in my opinion, and the presence of the bubbly Kajol is icing on the cake. Also admirable is Jaya Bachchan as the family matriarch who never stops longing for her elder son's return...she and Shahrukh Khan share a screen relationship that is authentically warm and completely believable.The films weaknesses (and there are many) start off first of all with the odiously conceited Kareena Kapoor, who in spite of the costume designer's self-proclaimed \"sophisticated\" wardrobe looks and acts like a cheap tramp throughout the film (note to Bollywood costume designers: in England and America the only women who dress in skin-tight cleavage-revealing sequined mini-dresses when they go to the mall are PROSTITUES. Get it right!)The second weakness is the overdone splendor of the sets. I felt the story and the cast were enough to hold the viewer's attention. We simply didn't need every scene to look like it was shot in Buckingham Palace or an interior designer's showroom.The third weakness (and Hrithik/Kareena fans will disagree) was all the disco look-at-Hrithik's-muscles look-at-Kareena-shake-her-butt dances. I fast forwarded them after a few minutes. Tasteless and boring, IMO. Hrithik is not a bad actor, he is more than just a bulging-biceped pretty boy, but you'd never know it from these scenes. Also, again, the fact that all the NRI women in the film are dressed like hookers is just WRONG.And last of all, although I love all the emotional exaggeration in Hindi films MOST of the time, I thought there was just a bit too much weeping in this one...a little less snivelling from Shahrukh and Hrithik would given the remaining scenes a bit more punch, I think. (But Khan is the King of snivellers, so I guess Karan Johar had to let him do his \"thing\")Overall I think this is an enjoyable film, mainly because of the cast, and a pleasant diversion. I recommend it.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A must watch as it happens to be the best of the trio-Big B, Jaya & SRK","review":"What better way to showcase 'happiness and tears' Its all in Mr Yash Raichand's family . Nandini (Jaya Bachchan) is at her very best, She never gave birth to Rahul yet loved him more than she would her own, even when she did gave birth, she never stopped loving him. When he was disowned by the super rich and cultured Mr Yash Raichand (Amitabh Bachchan)on the ground of not adhering to family values, she suffered the brunt, as a part of her has been removed and nothing seems to matter any longer in the world to her. A kudos for her. Shah Rukh Khan (SRK) is not doing badly, his always at his best. SRK should learn to touch peoples wife (Kajol - first song in the movie) with some decency and respect, mindful of the fact that his wife is not into acting. BIg B, the ICON, the genius is never finished until he is finished. The Big B look so real in all facet. He was loving and caring at one time and uncompromising when he felt that he has been failed by his own.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" About the characters and the title.","review":"First of all, the Movie is beautifully made.  The settings, the places and surroundings in which the movie is made is just beautiful.  The characters all have their own role in the movie.  The characters are sketched differently and uniquely, but all have their own weight to carry in the movie.  Amitabh Bachchan was good as always.  His role is similar to that of Mohabbatein and Ek Rishtaa but he portrays his emotions in a different way. Jaya Bachchan is just excellent playing a mother.  I couldn't think of anyone else doing a better job than she did as a mother.  Shahrukh Khan still has the energy and intensity that he's had.  Kajol does a fantastic job even though she doesn't appear in too many movies now.  Hrithik is the limelight of the film.  He could make someone cry whenever he appears in emotional scenes.  He has done the best job from my viewpoint.  He can dance, and act.  You just have to see the emotional scenes in the movie to believe how well he did.  He proved he has all aspects of a good actor. Kareena had a different role, but played it good.  She was definitely funny in the movie and looked great.  Overall I think the storyline was similar to other movies, but the method it is made in is very good.  It is not easy to give six big characters a fair amount of footage.  The title does very well suit the movie because it movies from happiness to sadness and happiness again.  I would like to see this movie win an award because it was the best of the year.  Excellent job by Karan Johar again!!!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" a brilliant film for all","review":"Kabhi Kushi Kabhi Gham: a film directed by Karan Johar, one of the best directors around who has bought us remember-able films such as Kal Ho Na Ho and Kuch Kuch Hota Hai. K3G as it is popularly known as, has some world renowned actors, from the likes of Big B  Amithabh Bachchan, and King Khan  Shahrukh Khan to heart-throb Hrithik Roshan. Not forgetting the beauties Kajol and Kareena Kapoor and the queen of her time  Jaya Bachchan. With big names brought together this film was almost destined to be a success. This film gave a mixture of emotions, it made you happy when the family was together and tears when the family broke apart, this is a film which almost every family can relate to as the tagline goes \"It's all about loving your parents\" With every superb film there is also a mind blowing soundtrack: the title track \"Kabhi Kushi Kabhi Gham\" sung by the one and only Lata Mangeshkar brings out the love and affection within the family. \"Say Shava Shava\" sung by Alka Yagnik, Sunidhi Chauhan, Udit Narayan, and Sudesh this brings out the laughter with Amithabh and his ever lasting dance moves. \"Yeh Ladka Hai Allah\" sung by Alka Yagnik and Udit Narayan, an awesome pair in their own right. \"Suraj Hua Madham\" the first love song in the film sung once again by Alka Yagnik but this time with Sonu Nigam features Shahrukh Khan and Kajol who make the perfect couple. Sonu Nigam and Alka Yagnik come together once again for \"Deewana Hai Dekho\" the first song with Kareena Kapoor and Hrithik Roshan. \"You are my Soniya\" the third song by Alka Yagnik and Sonu Nigam which again features Kareena and Hrithik. The final song in the film in \"Bole Chuddian\" sung by Kavita Krishnamurti, Alka Yagnik, Udit Narayan and Amit Kumar in which the whole family is seen together. The film also features some small songs and instrumentals; there is Vande Materam, two sad versions of the title track and the soul of k3g. A brilliant film and definitely a family film for all ages as everyone can relate to it.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Terrible movie...unwatchable","review":"It is not often that you find a grand movie with all the super stars plain unwatchable but K3G is one such movie. The reason is plain and simple: almost everything about this movie is fake. The movie talks about loving your parents but throughout it is impossible not to feel that all emotions have been manufactured. There is a complete lack of realism and people seem to cry at every available opportunity.The scene where all children at school (including British) sing the Indian national anthem is one of the worst scenes in a very long time. It was so cheap and you feel like asking what is going on?The movie is just all gloss. There is no substance or soul.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" This movie is the best!!!","review":"This movie was a really good story, and all the actors and actresses did really good in it, especially Sharukh and Kajol. Hrithik Roshan looked really hot in this movie, and he also did a great job. The music in this movie was really great too, especially the songs \"Bole Chudiya\" and \"You Are My Soniya\".","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Get the tissues! This one is a real tear-jerker!","review":"K3G is an intense, mature, and entertaining film. Shahrukh plays the role of a son(Rahul),who worships the ground his father walks on, and would do anything to avoid hurting him. The day comes, however, when he falls in love with an \"ordinary\" girl named Angali, and dashes his father's hopes and dreams for him to pieces. The intense emotion displayed as the two have a falling out, not soon to be reconciled, is heartbreaking. It splits the family apart and it will take everything a younger son (Rohan)has to try and reunite them.Shahrukh shines (as usual), as the creative actor he is, in this wonderful family film.If you haven't seen this film yet, you don't know what you're missing! But have a box of tissues at hand.~ written by Simran","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the finest Indian cinema movies ever made....","review":"This film has a brilliant cast which makes it work.The Raichand family is one of the richest and privileged. While on a family visit Rahul, the elder son falls in love with a girl and so romance ensues; however Yash Raichand the father of Rahul decides he has picked the perfect girl and makes an ultimatum with Rahul. Either marry the girl of his fathers choice or leave for good. Rahul leaves...But the second half of the movie focuses on Rohit; Rahul's younger brother who makes it his mission to reunite his broken home.Every actor plays their role with enough emotion and charisma and makes the film an emotional journey. Like all bollywood movies the sets are stunning and the music is catchy. I caught this in the cinema with my family; the songs and acting fits perfectly with each other. Yeh Ladki hai Allah! is one of my personal favourites.Here we see a rare insight, where three legends stand side by side. Amitabh Bachan who was the past, Shahrukh who is the present and Hrithik Roshan who will most likely be the future. This movie is pure bollywood, it holds the ideals and values that the South Asian community hold and watching this on the big screen makes one feel a sense of sadness and excitement.I would recommend this to all film lovers and for first time Indian Cinema fans.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Sometimes happy with it and sometimes sad","review":"K3G centers around family and more specifically, parents. I really don't want to reveal any spoilers so i'll say this about the plot: this movie focuses on the choices that Amitabh Bachchan and Shahrukh Khan make and it shows just how strong love and family can be.With that said, Kajol is beautiful as always, albeit she acts rather pagal (crazy) at the beginning, but how can you fault such a beautiful lady? Rani Mukherjee also makes an appearance in the movie and is gorgeous. But seriously, how could anybody expect a movie with such a good cast to be disappointing; how can you go wrong with Amitabh Bachchan and Shahrukh Khan in the same movie-you can't.In addition, this has to be Hrithik's best movie yet; i've only seen Fiza and that movie was really bad. But to tell you the truth, it seemed that he was always wanting to cry when on screen in K3G.As for Kareena Kapoor, whom I don't fancy, at times she was so ditsy. Like for example when she's at school and they talk about who wants to go to the prom with Kareena: \"not applicable\" (you'll see what I mean).\nOne of my pet-peeves of Hindi films is that they get so cheesy when the actors or actresses try to act like they're from North America or Great Britain, as if they think it's cool to speak English in these movies, I wish it would stop as it takes away from the movie. An example of this is Hrithik's impression of Rambo in Fiza, why do Indians feel that they should mimic hollywood to get good reviews, it's just dumb and wrecks the movie. If anything they should feel proud of their culture.I do want to say that (SPOILER WARNING!!!)there is a rendition of Jana Gana Mana that I really did like, except for the fact that they messed it up momentarily (you'll see what I mean when you watch). Even I liked it, and i'm not even Indian so I expect that it will bring a smile to most that watch this film.(END OF SPOILER)My biggest problem with this otherwise wonderful film was its abrupt ending, it's like there's the climax and you're over flowing with emotion and then it's over. The same sort of thing happened in Dilwale when they're on the train and the dad starts singing \"Le Jayenge\" and then they cut to Tujhe Dekha To and then it's over, we don't get to see Simran and Raj's life, etc. Or even in Mohabbatein at the end, I wish they wouuld've played that tune alittle longer at the end and also played the entire \"Humko Humise Chura Lo\" in the end credits.Bottom line, if you liked two of my favorite Hindi films, Mohabbatein and Dilwale Dulhania Le Jayenge, you'll like this one: 8/10 but 10/10 without ditsy scenes (Kareena's lap scene) and a fuller ending. There were times in this movie that Kareena was so nice, i only wish it were like this during the whole film. So I was left both happy and sad with the film, but more happy I guess.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" very enchanting and magical","review":"A huge emotional sucker punch that I wasn't quite ready for. The beauty of films with long running length is that they get more than enough time to explore the already complex and deep characters on a slow note allowing the emotional depths to flow freely without any hinderance. This definitely won't be a film to be forgotten anytime soon considering the effect it gave with its astounding performances and its challenging direction by a brilliant master.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Brilliant cast and acts, Admirable storyline","review":"A mixture of Glamour and Moral is the perfect recipe for this shake of Bollywood. An absolutely entertaining and lovable movie. The story line analyzes morality in different dimensions. It's beyond my words to express the quality of the story, all I can say is that this movie is a must see. The cast are picked perfectly. Kajol, Hirthik Roshan, Shahrukh Khan, Kareena Kapoor, Jaya Bhaduri and Amitabh Bachchan perform flawlessly. A colorful stream of talents. Every single song is pleasurable. This is a genre where Bollywood is the best at, a musical love story enriched by bringing to picture the power of values and staying away from nonsense fighting scenes. Kajol performs her best ever. Matched with Kajol's best performance, Shahrukh Khan brings another legendary act. Hirthik Roshan's talent is depicted so vividly, he is a super star, undeniable. The mesmerizing Amitabh Bachchan is empowered by the company of Jaya, and spunky Kareena Kapoor is a perfect match for Roshan in this movie.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Lovely story","review":"I feel sad when there is few people doesn't enjoy this film.\nK3G is telling us about family problem and India's cultural in the family. Sorry if India's cultural is different from u'r country.\nI feel jealous because they having lovely parents who love them very much and very take care of them. The song, the dance, and the music was amazing like kuch kuch hota hai. I'm the first time felt very touching in India movies is in K3G, the story not just about a lover, but about konfilk in your heart too. Very enjoyable film. you will cry if you really enjoy this movie, and not cry but fell sad if you have same problem like they have.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Nothing new, but the old has been artfully recycled...","review":"Movie going audiences the world over, or so smart young filmmaker Karan Johar would like to believe, are glad that the wait is finally over: `Kabhi Khushi Kabhi Gham' or `K3G', the snappy alternative title that the publicity machine came up with, hit movie screens today!  The shrewd publicity campaign ensured that wherever Hindi films are shown, a fever pitch of anticipation sharpened to incandescent proportions over the preceding several months.  A record 650 prints of the film have gone into distribution-unprecedented for a Bollywood release.  The cast of the film is equally unparalleled: Amitabh and Jaya Bachchan, Shah Rukh Khan, Kajol, Hrithik Roshan, Kareena Kapoor, plus another popular leading lady in a `guest' appearance, form the headliners.  Such a formidable phalanx of stars alone would guarantee that this film would elbow out the competition.  So, you ask, how good is this film; was the foregoing hoop-la justified?Let's put it like this: I saw it this afternoon (first day, first show, just like in my student days!) and, though it is a shrewd and manipulative exercise in filmmaking, I bought into it.  I laughed, I cried, I resisted the urge to dance in the aisles.  The word `shrewd' comes to mind again and again.  The casting was shrewd, the marketing blitz, as well.  Ditto, for the mix of the film's ingredients, the plotline, and clever typecasting. Shrewd, shrewd, shrewd!  But Karan Johar persuades you to overlook the blatant exploitation of your emotions, the plot twists seen coming a mile away, the unsubtle set-up of the next dramatic confrontation.  He inveigles you into colluding with him in this charming filmic flim-flam; he winks broadly and you roll your eyes but go along for the ride.  Why?  Because the characters, while not the least bit new, are likable.  Johar handles his dauntingly large cast well, gives each of them a moment to shine.\nAmitabh reprises his stern unyielding patriarch role.  He has portrayed uptightness before, as recently as `Mohabbatein', but here he's filthy rich and the stakes have been ratcheted up a notch.  He plays a captain of industry, though what industry, we are never told.  References are made to his appearances on CNN, so one gathers he is a globally important captain of industry. As is the wont of tycoons, he lives in an enormous salmon pink palace, but inexplicably, all the indoor scenes take place only in the cavernous drawing room with its spooky shadows and fifty-foot ceilings (like the lobby of a particularly unwelcoming hotel), or in his dressing room. Early in the film, his business tycoon character is shuttled to the office in a helicopter.  The man gets out, shoots a look of proprietary pride at the monogrammed chopper and deadpans to a minion, `Nice machine!  Should get a few more!'Jaya plays his worshipful, obedient wife clad in matronly pastel sarees with tasteful embroidery and triple strand of pearls--appropriate Mrs. Tycoon garb.  Just as you question the wisdom of coaxing her out of retirement for this thankless role, Johar gives her a small scene where she puts her steely-eyed pig-headed husband in his place, and this without raising her voice and thundering as he does, and you think, right on! Then it makes sense that she is in the film.  Shah Rukh, as their son, plays Shah Rukh yet again, alternatingly lovelorn and stubborn, but here he gets to do some comedic shtick too.  Mercifully, it's not slapstick; in fact, all the humor in the film is intelligent.  Even Johnny Lever, who is insufferable in most films, is given some pretty good lines.  But best are the throwaway ones that Shah Rukh, and on a couple of occasions, Kajol, toss off casually. Anyway, Shah Rukh has a London MBA in this film, and good thing too, because he has to go off and make his own fortune in the tough, cruel world. Oops! I gave away something you'd never have guessed would happen in a Hindi film.It is a delight to see Kajol in a film that makes good use of her looks and skills.  Her screen appearances are becoming rare and it is a shame to see her squandered in execrable fare like `Raju Chacha'.  In `K3G', she looks ravishing, is photographed lovingly, and positively sparkles playing, once again, a character called Anjali.  Hindi filmgoers will recall that Anjali was her character's name in Johar's debut film, `Kuch Kuch Hota Hai'. This Anjali is from Delhi's Chandni Chowk and speaks an outlandish mix of Hindi and Punjabi.  You don't understand it all, but her sheer effervescence bowls you over, so it's no surprise that Shah Rukh (whose character, like the one he played in `Kuch Kuch Hota Hai', is named Rahul) falls for her almost immediately.  They go into an extended dream sequence that involves them singing around the Pyramids, a heretofore-unused location in Hindi films. Kajol wears loads of kohl and numerous stunning monochromatic sarees which contrast well with the starkness of the Egyptian sands, while Shah Rukh, not to be outdone, resorts to see-through organdy shirts. Unfortunately, right after the sartorial one-upmanship of this song, daddy announces he has other plans for his son, and thus begins the `Gham' (sorrow, tears) portion of the film.Hrithik and Kareena play the other romantic leads and they are adorable. I got a kick out of the back story that Hrithik's character has been given: in early childhood, he was obese and all the scenes featuring the boy Hrithik (played by an extremely tubby child actor), show him either eating or conniving to get something to eat.  So all you overweight boys out there, take heart-you could well grow up, turn into a Hrithik, captain a winning cricket team, and end up with a cutie-patootie like Kareena Kapoor!  But I should caution that it is unlikely that this would happen outside the wacky world of Hindi films. The grown up Hrithik is endearingly earnest and sets about restoring the `khushi' (joy, happiness) of his film family, but takes time out to drive fast cars, and show off some nifty dance moves and bicep revealing leather vests. But mostly, as he performs good works, he gazes soulfully, while his brown eyes glisten with unshed tears.Kareena Kapoor's character is modeled after Archana Puran Singh's in `Kuch Kuch Hota Hai', so of course I loved her.  After seeing Ms. Puran Singh in a film called `Raja Hindustani', I became a big fan of her work.  In that movie, she played a deliciously evil stepmother, had a fabulous wardrobe and was nasty to everyone within hollering distance.  She was so enthusiastically wicked that she completely overshadowed the insipid heroine played by Kareena's older sister Karisma Kapoor.  But, enough about that film.  Here Kareena, channeling the spirit of Ms. Puran Singh, vamps hilariously and is adorably clueless.  She is aided and abetted by two sweetly dim cohorts.  Of course, like any self-respecting younger female lead, her clothes are skimpy to the point of being almost non-existent. One of the best lines in the film has to do with her blink-and-you'll-miss-it outfits.  That she pulls this off without looking cheap or vulgar is to her credit.  After this and her similarly fabric-challenged turn in the awful `Asoka', the courageous Ms. Kapoor should be given some sort of award for conserving cloth and her contribution towards reducing the wardrobe budgets of films.So you see, I had a couple of good laughs, tapped my feet to the songs (the handiwork of three different composers), and shed several cathartic tears that Karan Johar contrived to wring out of me. Of course, the \"gham\" (sorrow, tears) in the film was disproportionate to the amount of \"khushi\"(happiness), but as a friend e-mailed me, what good is a Hindi film without the opportunity to weep copiously!  I walked out thinking, `There was nothing new, I was hoodwinked with my complete cooperation, and it was all good fun!'","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" The best movie ever","review":"This is The best movie I have ever seen !! Its a movie with all the best actors and actresses in it.How could that not be a hit?.. well If you haven't seen this movie I just want to tell you Go and watch it!. And before you do have a box of tissues next to you because you will definitely need it...Its a story of a boy Rahul Raichand (srk) who is adopted by a very rich family the Raichands (Amitabh Bachchan & Jaya Bachchan) and Rohan Raichand ( Hrithik Roshan) Its a perfect family until Rahul falls in love with A crazy girl Anjali ( Kajol) Rahul's father doesn't approve of this girl because she isn't Good enough for them she is poor, But Rahul still marry's the Anjali and that is when he get kicked out of the house . He leaves to England and his little brother Rohan tries to bring the family back together","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" OTT Acting & an Insult to Intelligence","review":"This film can only be enjoyed by those people who can easily suspend their disbelief and without question lap up the talent-free films served up by Bollywood directors and actors. The likes of Shahrukh Khan and Kajol are worshipped by millions, yet I honestly cannot detect any signs of acting prowess or versatility.So the main family lives in a huge mansion, gets around by private helicopter and have a fleet of Jaguar convertibles and Ferarris at their disposal. Hmmm, I can really identify with these guys. Even though in the story, this mansion is supposed to be in India, it is clearly in the UK. Amitabh Bachchan's \"Indian\" office is clearly Canary Wharf in London! The helicopters in India have British registrations! I mean, the directors must assume all viewers are in a vegetative state not to notice! As usual, the acting, especially from Shahrukh Khan, is way over the top and unrealistic. The way that these people behave just seems so divorced from real life, you soon start wondering whether they are aliens from the planet Jupiter.I know that people argue that Bollywood films are a means of escapism for the many millions in India. But if other countries like China, Iran, South Korea and Argentina can make films that have a realistic message and which many more people can relate to, why cannot the Indian film industry?","imdb_rating":1,"our_rating":0,"algo_label":0}]