[{"heading":" 3 hours of my life i'll never see again.","review":"As i have obsessively watched K3G over 20 times i anticipated Hrithik and Kareena's reunion, so i could see them put their on screen magic to use once again, tut tut tut. I honestly believe the actors signed to this film blindfolded, with guns to their heads. WHY... the cartoon Parrot, the scary overacting we see from Hrithik and kareena. Although Abhishek's character was a Complete robotic LOSER, who kept staring at her in his stalker-like-ways, he was a better match for Kareena, but to be honest i couldn't care less how was BURDENED with her at the end. It wasn't boring because you were constantly thrown into confusion, it was hard work watching this film, cringe worthy. The 3 points are for the music, which was good.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Main ~Pain~ Ki Diwaani Hoon (BDSM)","review":"Sooraj the young whiz-kid came with a big bang with Maine Pyaar Kiya followed by biggest blockbuster Hum Aapke Hain Koun. Subsequently keeping the tradition of Rajshree Film came up with multi-starrer Hum Saath-Saath Hain. When the latter didn't fare well at the box-office, Sooraj decided to catch up with times and make a contemporary movie of today, doing away with strong values the Rajshris used to uphold upon. In the process a major overhaul was done - for instance Anu Mallik steps into the shoes of Raam-Laxman and foreign locales chosen to film major portions of the movie in the garb of some Indian village.The story itself is a re-hash of Rajshri's Chit-Chor with the latest ingredients and new masala's added.How-ever the movie sticks to Sooraj's movie length of over 3 hours and makes you wince in pain. The story is so very predictable from the word go.Valentine sequence was a big drag. Comedy sequences didn't evoke enough mirth. The animated bird was almost anything but stupid.Kareena was doing extension of Poo's character. Hritik tried to give his best to live to the character of energetic blabbering guy. Abhishek gave a restrained performance which was good in comparison to others. A few songs were okay.Sooraj needs to re-think as to where he has faltered big time. Avoid at all costs even if you are a big fan of Rajshri movies, Hritik, Kareena or Abhishek.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" WHAT A HORROR!","review":"My gosh! Do they still make this crap? I can't believe these are the same makers of \"Hum Aapke Hain Koun\". And to think this was 2003's most awaited film? Glad \"Koi Mil Gaya\" is taking that position?Basically, Sanjana (Kareena) is to get married to Prem (Abhishek), but instead, his employee and close friend Prem Kishen (Hrithik), comes instead. Sanjana's father (Pankaj) and mother (Himani) approve of him, but one night they find out he's a fraud, Sanjana's mother no longer approves of him. He goes back to USA, and it's fights between Sanjana and her mother. Then the real Prem comes, and the two hit it off real well. Except, Sanjana doesn't know he's there to marry her. What is she to do? WHAT THE HELL ELSE WILL SHE DO? Come on, \"I will love him to the end of time!\"...Main Prem Ki Diwani Hoon??? Of course it's Hrithik!This film is garbage. This is where Bollywood faulters: the audience chooses quantity over quality, and would rather watch an entertaining film, than a great film! In May, a horrible film \"Ishq Vishk\" started a wave of successes. These films include: \"Andaaz\", \"Bhoot\", \"Chalte Chalte\", \"Qayamat\", \"Hungama\", and of course, \"Main Prem Ki Diwani Hoon\" - ALL HORRIBLE FILMS!Hrithik Roshan needs the award for \"MOST OVERACTING IN A FILM\". His character is so irritating, that you'd pay Sanjana to kill him! Hrithik's loud, childish, immature, stupid, sickening, insulting performance will surely go down as another embarrassment to the Hindi film industry, just like many of Salman Khan's roles.(Hello Brother, Har Dil Jo Pyar Karega, Hum Dil De Chuke Sanam, Kahin Pyar Na Ho Jaaye)Kareena is okay. I don't want to say much. Abhishek is the best performer of the film, alongside Sanjana's parents.\"Bani Bani\" is the only song with good picturisation. The rest are all stupid. To make matters worse, the film has an animated talking parrot that names famous Hindi films, and pops up out of nowhere. There is also a dog that gets a cartoon face when he gets mad. Sounds stupid yet?Don't see Main Prem Ki Diwani Hoon. Please!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" too loud,, too annoying","review":"sooraj barjatya tries self consciously to get oh so hip in his new flick. the effort falls flat on his face. in creating hritik roshans prem, he has creasted the most annoying, loud , irritating and obnoxious character on screen this year.. hritik if u r reading this , please stop accepting trash like this? whatever hapenned to movies like fiza and mission kashmir?kareena was ok but getting one dimensional in roles like this,also, sooraj please get a clue!! how about not plagiarising old hindi films ( like chitchor),, only saving grace was the music . altho even here,the director went overboard with 5 songs too many. in conclusion, please watch this movie at your own risk!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" The worst movie ever","review":"This is the worst movie ever made I'm bollywood. Pathetic performances by all actors except Abhishek Bachan.Hritik Roshan has acted the same as he has in Koi Mil Gaya. Hey but the role is different. May be he was in character then! The pathetic shows of animations for the dog(Johnny) and the parrot add to the disgusting performances in the movie.Kareena Kapoor's acting is negligible. and to add to this hoolah, we have Javed Jaffery and Ruby Bhatia cracking ridiculous jokes for the valentines day poppycock.This movie is definitely a miss. Don't watch it even if you are paid to do so.Kareena's friends are the most interesting part of the movie. Please, that does not mean its good. It only means compared to other parts of the movie, that is good.Anyways, if you are going to watch this movie, keep a good dosage of aspirin handy.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Don't waste your money!","review":"Well to start everyone in this had overacted. It is very much of a crap movie and the actors are just so lame. Hritik being the hero, \"loser\" hero more likely and Kareena Kapoor as usual about her performance thinking that no one can act \"better\" then she can(still very bitchie in this this one). anyway all i want to say is that Main Prem Ki Diwani Hoon is crap, crap and mega crap i can't even believe that why do directors waste so much money in making these worthless crap romantic movie's which don't even have much of a romance.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" This movie was shot in New Zealand!But it's still bad!","review":"I just wanted to set the record straight once and for all!This movie was shot almost entirely on location in the South Island of New Zealand.I saw someone commenting on this page that \"Sundarnagar\" (which is where this film is supposedly based)looked a lot like Switzerland! Plus many people have wondered aloud about the \"coordinates\" of \"Sundernagar? Well it's actually New Zealand! :)The bulk of the movie was shot in Christchurch.(I know this because a few of my friends who were living there at the time, saw some of it being shot).Even if they had not seen it, one look at it, and anyone from this part of the world would recognize it as Christchurch.From the scenery I know that most of the \"action adventure\" stuff,which was \"jet-boating, bungee jumping, sky diving, and white water rafting\", where ALL shot in Queenstown, which is considered the \"Adventure Capital\" of the Southern Hemisphere.(I have actually been on \"Shotover Jets\" which were the jet-boats that they hired for this film.)That's some \"Location\" trivia for anyone who cares to know!Moving on to the film, the most disappointing performance from Hrithik Roshan to date. I don't think he has done anything this bad before or since. WHAT was he ON when he did this film? The overacting is taken to such absurd lengths. Kareena as Sanjaana is over-acting as well.The role was played rather \"one dimensionally\". But she is not entirely bad. The best acting in this movie is by Abhishek Bachchan who plays the \"introvereted Prem\" to Hrithik's \"Extrovert\".The supporting cast was adequate, but nothing too special. I liked Pankaj Kapur's rendition of the \"long suffering Dad\".The music was actually quite good. Few songs too many. Many of the video's have Hrithik Roshan SANS shirt, prancing around,(I swear sometime he just looked plain \"Gay\")! and Kareena Kapoor wearing her signature \"strappy top and tight pants\"!The best song was \"Bani Bani\" accompanied by a nice dance from Kareena.I also liked the songs \"Aur Mohabat Hain\", and \"Kasam Ki Kasam\".From a director like Suraj Barjatiya, this is a HUGE disappointment. The story could have worked with a better script, and a more tight reign on the performances. But that didn't happen! Too bad!The best thing about this movie was the \"scenery\", but then I would say that. After all, I AM a New-Zealander! :)","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" I want my money back!","review":"Please save mankind from these feel good movies. Isnt there a law against torture in the name of movie making? I understand that a commercial hindi movie must be taken with a pinch of salt but then isnt asking the viewer to actually swallow a barrel full asking for too much?The movie starts with Prem (Hrithik Roshan) coming to \"SunderNagar\" where Kareena Kapoor stays with her parents. This  Sundernagar is supposed to be some remote place in India but has a striking resemblance to Switzerland. There are lakes, snow capped mountains and Honda Cars. The Honda Cars are innocently number plated with a UP number plate. You can go water rafting, bungee jumping (From a chopper to boot) and deep sea diving here. The \"village\" railway station can put any in Europe to shame. God, please make me a villager in this village called Sundernagar. There are no problems whatsoever in this Paradise.Kareena lives in a palace (which her father refers to as a \"chota\" ghar) with a computer generated parrot which reels off Hindi movie names. The director challenges the intellect of the viewer with asking us to believe this. There is a misunderstanding with everyone assuming that Hrithik is the owner of the estate. Kareena falls for him (Whoa isnt that a twist in the tale!) and a couple of meaning less songs later, Abhishek Bachchan appears as the real owner. The movie then drags on with sacrifices and a predictable end. Hrithik attempts to be this enthusiastic person with a zeal for life. He ends up overacting. Kareena is her usual loud self. Abhishek, thanks to the role comes out slightly better than the others.I appeal to the government to bring out a law against making such utter crap.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" I am not crazy with love for this film...","review":"Time marches on inexorably; the latest example of this truism comes in the form of Rajshri Productions' newest release, `Main Prem Ki Deewani Hoon'. Under the Rajshri banner, the Barjatya clan has been dishing out family fare for well over thirty years: melodramatic tearjerkers, chaste love stories, moralistic family dramas that were sensitive and inoffensive, if overly simple.  With the arrival of Sooraj Barjatya, the clan's output took on a veneer of modernity that imparted a certain slickness to their somewhat regressive `family values' agenda and also introduced a new element: cheesiness.`Maine Pyaar Kiya', Sooraj's directorial debut, was loud, kitschy, and launched a new romantic pair with great fanfare: Salman Khan finally had a starring vehicle, and a starlet from Indian TV, Bhagyashree, was catapulted onto the big screen.  Though there was much to crib about in this film, it had a bizarre, anachronistic charm, as well.  Everyone, other than the villains, was sweet enough to bring on a major case of diabetes, especially the heroine.  The characters were mono-dimensional, the hoary plot simple in the extreme, but what saved the film was that its lead pair truly was young and looked genuinely lovelorn.  What appealed to me was that the film kept scrupulously to all the age-old conventions of Hindi cinema; though it was made in the late eighties, it could easily have been passed off as a product of the 'forties or 'fifties.  The public adored it and the Barjatyas made a ton of money.  Salman parlayed the success of this film into a booming career, but Bhagyashree foolishly stipulated that she would only appear in films with her supremely untalented husband and soon vanished never to be heard from again.Sooraj Barjatya then went on to make variations on this theme in the form of `Hum Aap Ke Hai Kaun', which I found insufferable (and interminable!) despite the presence of a gorgeous Madhuri Dixit, and `Hum Saath Saath Hain', which was just as dreadful, but had a pleasing pair in Saif Ali Khan and Karishma Kapoor.  The millions in India, however, loved these films, and the Barjatyas once again laughed all the way to the bank.Now, with `Main Prem Ki Deewani Hoon', Sooraj Barjatya displays a brand new awareness of the changing times.  Somebody has recently clued him in about the birds and the bees; thus, though there is love galore (beginning with the title of the film), there is also a fiery exhibition of raging hormones and the unmistakable frisson of sex!  Mind you, the heroine still remains chaste, but now she actually lets the hero kiss her and the screen steams up with this novel willingness to indulge in the pleasures of the flesh. Kareena Kapoor plays Sanjana, a maiden who is winsome, sexy in a wholesome mango-lassi-and-kulfi kind of way, and of course, the apple of everyone's eye.  She has a noble but browbeaten father, and a beady-eyed mother who, the minute Sanjana completes college, starts scouring the world for a suitable moneybags husband for her darling daughter.  The three of them reside in a town called Sundernagar.Sundernagar merits a paragraph of its own, so unusual and geographically baffling is it!  Within its city limits are gently undulating Alpine slopes so that the family can go on healthy bicycle jaunts, snow-covered peaks and daring ski runs for the hero to demonstrate his snowboarding prowess, pristine white sand beaches and clear blue oceans filled with myriad tropical fish, existing, once again, merely for the hero to exhibit that he has well-developed amphibian skills, as well.  Sundernagar boasts of an entire spectrum of ethnicities living harmoniously together, for kindly white helicopter pilots take the lead pair bungee-jumping, the florist shops are similarly staffed by Caucasians, the local college with plump brown nuns, while the family's retainers are decidedly from some unnamed village in Bihar.  The gospel of the Spice Girls has somehow made it to this geographical and anthropological marvel, for the college has a girl-power themed musical show, complete with mini-skirted, pom-pom wielding cheerleaders, a phenomenon that was unknown in Indian cinema until the advent of Karan Johar's `Kuch Kuch Hota Hai'.  Sanjana, our leading lady, even has four best friends who are the Hindi-movie equivalent of the now-defunct Spice Girls.When Sanjana's parents get an e-mail from their older married daughter, who lives somewhere in the USA, announcing the imminent arrival of an almost impossibly eligible bachelor in Sundernagar, they make tracks for the local airport, find a young man named Prem (Hrithik Roshan) there and promptly bring him home.  They do everything, short of hurling Sanjana at him, to let him know that he'd be more than welcome to take their daughter out.  Of course, it being springtime, the young couple's hormones run amok and they fall in love and a kind of prim-and-proper lust.  The cherry blossoms are in full bloom (once again, I scratched my head and tried in vain to figure out the coordinates of Sundernagar), so it's the perfect season to sing duets, which they do under the gentle voyeuristic gaze of the ubiquitous desi (local) Spice Girls.  Prem (Hrithik) finds every pretext to shed his shirt, while Sanjana swoons ecstatically at the sight of all those manly muscles.Alas, the family has goofed up in a major way.  Another e-mail arrives which informs them that they've brought the wrong Prem home, so much to the distress of our leading lady, her beady-eyed mother loses no time in turfing the ineligible Prem.  Mummy also pragmatically suggests that her daughter speedily transfer her affections to the correct young man.  The real moneybags Prem (Abhishek Bachchan) shows up with a glamorously attired mother in tow, and, in short order, falls in love with Sanjana.  Of course, he is the antithesis of the gregarious, well-muscled Prem, so what's a young leading lady to do?  Sanjana sheds many pretty tears and sings sad songs, none of which have any effect on her determinedly upwardly-mobile mother. How does it all end?  Does this terribly sad mess get sorted out at all?I must stop my narrative here, or there won't be any reason for you to see the film and further fill Sooraj Barjatya's coffers.  This movie, like all its recent Rajshri predecessors, is strident, trashy, with a few absolutely hideous elements like a CGI talking parrot and cocker spaniel, but strangely fascinating nevertheless.  The three leads are nice to look at and take all this nonsense very seriously, so we too end up buying into it.  Kareena is a polished performer, a well-schooled practitioner of the guiles and wiles of a Hindi-film leading lady.  Her suitors in this film acquit themselves well too, with Hrithik chewing the scenery (and nibbling on Sanjana in equal measure) as the flamboyant extrovert Prem, and Abhishek managing to hold on to his dignity as the pensive introvert Prem.  None of the supporting performers merit special mention, but I did like Reema Lagoo's glamorous new look.  See this movie at your own risk, and millions, no doubt, will to give the Barjatyas yet another blockbuster.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Its True...You can fall a sleep in the cinema...","review":"I have worked in a cinema for 3 years, and i have personally been to a cinema 1000s of time. Never did I know that you can fall a sleep. If the film is this Awful and boring, you can fall asleep. I am not a Big Fan of Kareena Kapoor. I think she ruined K3G with her Poo acting. I think Hritek is overrated, but watchable. At the time i was not fond of Abishek Bachchan, now he is doing well. I watched this movie because the director had given us BLOCKBUSTER HITS Maine Pyar Kiya, Hum Apke Hain Kaun and Hum Saath Saath Hai. I didn't expect his next film will be so disappointing. his previous film HSSH, was a little boring because of Karishma Kapoor's annoying character and the script wasn't amazing. MPKDH was ruined by the sister and script. Abishek was a little weird staring at her like a stalker, but surprisingly he kept the film a little alive. What i mean buy alive is that I didn't after all go to sleep the whole film. DISGRACEFUL","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Not iska Dewana","review":"***MILD SPOILERS*** I am always remember that a Rajshiri Production was something to always look forward ever since I was introduced to the Indian cinema by Maine Pyar Kiya. This banners movie though not as polished as the Chopra's or Ghais's movies, they were very family orientated, well developed, had a good blend of comedy to serious moments and delivered good performances from actors.\nHowever it seems that this time around Rajshiri, specifically Sooraj Barjatya has decided to break their tried-and-tested formula and go for a more modern movie. In doing so he has given us a movie that is unrealistic, far too long, not properly developed and annoying to watch.\nSomething that we had come to expect from this banner was the availability of pure family entertainment movies, but it seems that the director really wanted to go ultra modern in this flick and push the boundaries even further then other movies. First up there is the unnecessary under dressing of Kareena and friends (hey I do not mind seeing it, but what conservative Indian parent is going to let the daughter wear tank tops, strapless & backless tops and mini skirts?); then there is openness to talk about sex; it also seems family culture is thrown out the window (like any parents will let their daughter stay out till 2/3 am with a stranger); and finally there is the onscreen kissing (not that interesting when you watching it with elders!!)Carrying on with the annoying bits, there are so many - where does one being: what is the deal with the animation? Was it really needed? The parrot was so annoying and not really needed. To make matters worse for the parrot, the subtitles (that were being provided in the UK) were so off the mark, an example, because the parrot quotes Indian movie titles he said 'Raja Hindustani' and the subtitle said 'Mr Wonderful' ? Moving on , then there is the dog Mr Johnny, again a reincarnation of the dog actions from 'The Mask'. One final annoying bit was that Sarooj decided to dump Alok Nath from this movie - he would have really suited the role of the father.\nDrawing to the boundaries of idiocy, was the wonderful town that the characters lives in. It is meant to be a small village/town but it seems to boast a modern airport, infrastructure and hang outs of a city. In trying to develop modern characters it seems that director has created a town that is something found in a fiction novel. It would have to be considering that it has quick access to: mountains for skiing, ocean for deep sea diving, mountains for climbing, rivers for river rafting, long white sand beaches and ability for bungee jumping! Wow!!Starting on the movie. It's a love story triangle with a new twist? Well not really, its same formula for two guys who have admiration for one another falling for the same girl. The Girl in question is Sanjana (Kareena Kapoor). She is meant to be modern, feisty strong headed girl who lives in a small town in India. Her parents are looking for a suitable match for their daughter, with the typical requirements of being rich, rich and rich. Sanjanas sister living in the US informs them that a well respected and rich boy who she has dealings with is coming to their town and he is interested in seeing Sanjana. Enter Hritik Roshan as Prem.  Over a period of two weeks he manages to smitten the mum, dad, parrot, dog and friends. Also in this time he changes Sanjanas view from hating Prem to loving Prem. Then disaster strikes. It seems that this loving Prem was not the intended Prem. Enter Abishek as the intended Prem. Who just happens to be the boss of the loving Prem. Of course the loving Prem decides to abandon his love for his boss and runs away when he finds out that his boss also loves Sanjana. Ahhh. but don't worry all ends well as expected in Indian movies.\nThe cast and characterization would be described as mediocre at best. Karenna acting is what we have come to expect from her, the immortalization of Po from K3G. Her expressions are the same: her shocked look, her annoyed look and crying look. She really falls flat on her face when she has to act emotional. Then there is Hritik, who so wound me up with his acting that I would cringe every time he came on screen. His over the top acting reminded you of Salman Khans acting in Hum Aapke Hai Kaun, but at least it suited him then. It also seems that being so desperate for a hit, Hritik is desperate to draw on the female appeal by shedding his clothes for the first time in this movie. Finally there is Abishek. To be honest his character really grew on me and really thought he was good. It could be because placed next to the other two his was the only one that seemed good.This movie would have been so much better if the right cast had been chosen. Sanjanas role had would have been better played by either Pretty Zinta or Rani Mukerjee. The love Prem would have been perfect with SRK and intended Prem with  Aamir Khan. Then that would have been a movie worth watching.I guess we can only hope that the next Rajshiri movie is worth waiting for.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" In agreement..","review":"I have been reading a few other comments by users, and the general view is that this movie is bad. I agree. Although, sadly, it had the ingredients to be good. Those ingredients do not include Hritik and Kareena, the script and definitely not the animation! Hritik's Prem has had 12 too many Red Bulls and for the first half of the movie, he is a live wire that loves everyone, and aside from the fact that he can annoy the crap out of you, he is the perfect good boy. Kareena's Sanjana is also a daughter to be proud of. She dresses in skimpy clothes and prances around at the school function to which her parents have been invited, but other than that she gives her parents a lot to be proud of. Sanjana's family owns a parrot that talks unnecessarily and a dog whose face becomes animated when angered.Abhishek's Prem enters and really saves the day for the movie because he is the only sober performance in an over-excited cast.The music is pretty good and the movie is shot well... the storyline isn't bad either, but the cast mess it all up.By the way, did anyone notice that Hritik keeps whistling an unknown tune through the movie. It was a tune he kept whistling in K3G as well. Absolutely useless information, but true none the less.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Surprisingly cartoonish, but enjoyable","review":"This is a tough one. While Main Prem Ki Diwani Hoon does have some problems, and I can see why some people would hate at least some aspects of it, for me, the film ended up working--I was completely wrapped up in the story by the climax, getting appropriately annoyed with some characters, crying at other moments, etc. If that's the case, the film can't merit too low of a score. The film did one of its \"jobs\"--namely, it transported me to another world, so to speak, where I care what happens to characters.The story is centered on Sanjana (Kareena Kapoor). She's from a family I'd call wealthy, based on their home and such, but her mom thinks they're not so well off. Sanjana has just finished undergraduate school, it seems (this point was not so clear to me, but it could have been a translation problem in the subtitles), and for the graduation celebration at the school, she and her friends perform a song asserting their modernity, independence and their conscious break from the tradition of arranged marriages. Naturally, Sanjana's mom has a different idea, and so does Sanjana's married sister, Roopa (Tanaaz Currim), who is living in New York. Roopa calls to say that she has the perfect suitor for Sanjana--Prem, a very successful, wealthy business acquaintance. He's going to be coming to India. Roopa has arranged for him to stay with her family, with the goal of arranging a marriage between Sanjana and Prem. Of course Sanjana balks at this, and she's initially ill mannered and sarcastic towards Prem. But will Prem grow on her? Making things even more interesting, there's a big twist about halfway through the film.Like a number of other recent Bollywood films, Main Prem Ki Diwani Hoon begins, at least, by self-consciously trying to seem very modern. The first song, \"Papa Ki Pari\", has a kind of Disneyfied MTV style--Sanjana and her four best friends are on stage in relatively skimpy clothing, something like a cross between an Indian Spice Girls and five Hilary Duffs. There are flashing lights, lots of affected attitudes, Sanjana is posing with a guitar, there are graffiti backdrops, dancing cheerleaders, and so on. Unlike most American school-oriented films, everyone loves each other in this opening scene. Teachers dressed like nuns are in the audience grooving to the music, holding signs that they love the students. Students are holding signs that they love the teachers. The parents act very moderately \"shocked\" by some of the things they're hearing and seeing on stage, but just for a moment, then they're back to smiling and being proud.Taking something of a left turn, director Sooraj R. Barjatya mixes the typical Bollywood romance-comedy mode, which is rooted in realist inclinations, with a kind of bizarre cartoonishness once the setting changes to Sanjana's house. Sanjana has an almost purely CGI parrot who squawks commentary by reciting movie titles. She has a dog whose head is occasionally drawn over in a Saturday morning cartoon style. The interior of the house was constructed in a studio, and in some scenes, it looks like there was supposed to be exterior scenery composited into the windows, but it wasn't completed, so it's just left as bluescreen. This mood lasts up until Prem first appears. Hrithik Roshan plays Prem manically but comedically over-the-top. At this stage, Main Prem Ki Diwani Hoon feels more like a crazy sitcom--the overall mood isn't that different from the early sitcom segment of Natural Born Killers (1994), although there's obviously less of an evil undertone here.This is probably the point where a lot of people decide that they really hate Main Prem Ki Diwani Hoon. We know that a lot of people hate CGI. A lot of people hate departures from realism, whether conscious or not, and so on. I didn't hate the film at this point, but I was having problems adjusting to it. Especially given the mood change that follows, it seems, as it does in too many Bollywood films, that perhaps Barjatya didn't know exactly what mode he was shooting for at first. From MTVish glam-party to surreal, absurdist sitcom to Bollywood comedy-romance is quite a shift in gears. But I like both surrealist and absurdist stuff, so the sitcom section didn't bother me--I even admired the insanity of putting the crude and corny CGI and animation in the film. It was just too weird not to like.And after that point, I began being drawn into the film more and more. It doesn't hurt that from the beginning Main Prem Ki Diwani Hoon is full of beautiful people, including the women, and especially including Kapoor. It also doesn't hurt that Barjatya fills his exterior shots with breathtaking scenery (filmed in New Zealand and Mauritius). After the sitcom stuff, there's an extended sequence that's part travelogue, part \"extreme sports\" promo. This whole section is beautifully shot, beautifully edited, and the sports are beautifully choreographed. On a purely visual level, Main Prem Ki Diwani Hoon is often worthy of a 10.The love story kept getting more interesting from that point forward, as well, and the film also remains humorous for most of its length. By the time the twist arrives, I was completely into the film. Yes, the performances remained almost consistently over-the-top, but as the film always has a cartoonish undercurrent, it worked for me. And although some people might find comic relief-man Johnny Lever annoying, he makes me laugh.Finally, I loved the songs. Since this is a Bollywood musical, that's important. Composer Anu Malik smartly abandons clichéd Bhangra rhythms and gives us something much more sophisticated rhythmically, harmonically and melodically that manages to both be very modern and retain its traditional elements while being catchy at the same time.Main Prem Ki Diwani Hoon is no masterpiece, but it's not a disaster, either. Still, exercise caution if you're only looking for realism and you dislike \"cheese\".","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" 2 words and a vowel--Gimme a break","review":"Suraj Barjatya never gets it. Despite his previous movie going down the drain at box-office (Hum 77 hain), he tries yet another \"mom-bro-pop and that ohsocute dog + parrot' shot at the box office. The first 60 mins are dedicated to a whole galaxy of family members, that pour in at the right time & with a right line.Hritik is overtly conscious, Kareena goes over the board and Abhishek is untolerable. In the end, 2 words and a vowel--Gimme a break. Please dont waste your money on this one.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" excellent direction","review":"one of the wonderfully made bollywood flick which has shown the modern aspect of marriage in India, good production values, great performances though people might say that hrithik's character is bit loud but that's how his character was written and i have seen many guys like that, so his character really appealed to me and i am sure there are millions of blokes of his type who are zealous and go overboard, film's 2nd half is even better and abhishek takes this movie to one step forward, his expressions are really cool. to understand this movie u really have to understand these three characters, than i am sure u will love it because this movie is full of emotions and energy.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Elvis Presley meets Ace Ventura in \"India\"","review":"I think the only way a Western European cineast can bear the minimum-three-hour schmaltz of a typical Bollywood flic like this is by inviting some friends for a DVD night and laughing, shaking heads and making fun throughout the film. That's what I did, which is why the film was a great experience for me. Of course this doesn't prevent me from noticing the terrible cinematic quality of this film. In addition to the usual Bollywood film weirdnesses, this one had: unbearable misunderstandings, emotional pain of a degree that causes a head-ache even thousands of miles away in Austria, and a terribly over-acting clown looking like a mixture of Elvis Presley and Ace Ventura. Oh, and Ace Ventura reminds me of the animated red parrott and the half-animated dog, both supposed to be funny but completely displaced.Switch off your brains, invite some friends and enjoy this extremely physical experience!","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Overacted... but moving, so give it a break!!!","review":"Talk about a movie getting bad reviews on the IMDB. I am kind of surprised. Cause this movie did NOT suck. Let me first start with the story. Sanjana (Kareena Kapoor) falls in love with Prem (Hritik Roshan), a man chosen by her parents to marry her. After he has finally won her heart, her parents find out that they mistook him for his boss. Meaning the boss has money, he doesn't. So her mother and her sister encourage her to get along with the boss also called Prem (Abhishek Bachchan). Now start the woes. Does she choose the man she loves? Or does she obey her mother and marry the boss who has fallen in love with her?The first half of the movie was annoying at best. Both Kareena and Hritik indulged in overacting. Their childish behaviour was enough to wanna make you throw the remote at the tv. This all, however, made the second half an even bigger surprise. It showed us a Kareena that can actually act provided she isn't cast in the role of dim lightbulb or bimbo cheerleader. I found her performance very moving. I actually felt for her. Hritik unfortunately remained annoying, not for his childish behaviour this time, but for acting like a total spineless jerk. As for the other characters. The mother you wouldn't wish on anyone. I'm surprised her husband didn't throttle her a long time ago. And well, Abhishek Bachchan. This is the first movie of his I have seen. And I swear, when he gets out of the car, he looked like the spitting image of his father. I found him quite adorable.\nSo, let's recap. The movie isn't original. The acting isn't the greatest you have ever seen. But... it's a nice, moving story. To be honest, I even cried a little. Well worth the watch.And the movie quoting parrot was NOT annoying, he was funny. Just like the cartoon dog.***/5 stars","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Real Treat for the Fans of Hilarious Overacting","review":"I'm shocked too see some very bad ratings for this movie. How could anyone call Main Prem Ki Diwani Hoon boring?? I found it very over the top, cheesy and crazy... never boring for a moment.Every time I thought, \"wow, it can't get any crazier than this\" ...it did! And yet again and again! For example the scene where one of the girls tried to check out Hrithik's hands... ha ha ha! I nearly died from laughter! XD Watch it with a bunch of friends after a few beers... or, if you are a romantic at heart (like me) you may end up enjoying the romance at much as the silliness. The songs are good, especially the one (O Ajnabi?)when Kareena & Hrithik are on the deserted island. This is not serious cinema but very good entertainment.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Best movie in the universe Kareena looks like an Angel","review":"Best movie of my life seen it like 100 times, I can't tell you how beautiful Kareena is looking in this movie. Story is amazingly real, it happens in India when the girls mother and father really treat their soon to be son in law like a star. Hrithik acting is amazingly amazing. Abhishek has done justice to his role. Hats off to Sooraj ji for making such a beautiful movie. I loved this movie actually this movie is the fountain of youth.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A sweet movie made for die-hard romantics","review":"I don't know what the other reviewers here are upset about. It's not that you go to see a Sooraj Barjatiya film hoping to see some Oscar level performances or great story or brilliant film making. If you are in love, believe in love or are a die-hard romantic, see this one. True, there is some hamming from the actors and a lot of overplayed emotions. But hell, they are in love! And they are passionate about it! But its all done very sweetly with a lot of sincerity in some fantastic locales with some outstanding music. Hrithik will make your heart cry, Kareena will make you want to fall in love and your heart will go out to Abhishek. And you will go home believing that the world is a beautiful place full of love. What else do you want from a Sooraj Barjatiya movie or from any movie for that matter?","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Dreadful!","review":"The biggest blunder I have seen in Hindi Cinema. Expecting something great, I stupidly went to see this. My God, was I in for a shock! You are given talking parrots fluent in Hindi, a set waaaay too good to be true, terrible acting, an unreal story, songs that make you want to rip your ears out, and atrociously attempted comedy.Even if someone holds a gun to my head, I would not watch this movie. Yes, it is THAT bad. I'd give it a miss any day of the week, no doubt.Hrithik's worst performance ever, just before Yaadein. Kareena will probably regret doing this film for life, and Abhishek...well, who cares.Sooraj Barjatya's worst! ...You have been warned!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" geart movie!","review":"I went to watch this film just recently, even after hearing a lot of the criticism towards the movie. I went in with an open mind to make up my own decision about the movie and i feel everyone should do the same. So the story is nothing new but who cares? I don't think any bollwood movie concept is going to be new now,theres so many bollywood films! However, I think the movie is made exceptionally well. It's a movie so many young teens and adults can relate to. Its good how the movie is made to look so modern, especially since the storyline is about modernising and how tradition is not always the best way to do something. Also, who cares about the reference to sex in this movie??? I think it's about time, I mean how many of you have seen a hollywood film. I'm pretty sure theres nearly always a scene which refers to something sexual, so why can't they incorporate this in a bollywood film.Good on them! All the characters were very believable. Take Sanjana for instance(Kareena Kapoor), her character likes to look her best and attract male attention but when it comes to actually being with a guy she is very restricted. This film tells the truth and shows that not everything has to be done in a traditional manner. If you ask me this makes the film different and interesting. So what if this film hasn't exceeded all expectations - its still done well and is a good movie!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Terrible movie!","review":"If you haven't seen this movie, PLEASE do not waste your time and money by renting it now! This is Kareena and Hrithik at their absolute worst! The whole movie is completely unrealistic, over-the-top and just plain bad! Kareena and Hrithik should stick to modeling and never open their mouths again! Okay.. now that I'm done ranting, I will say that some of the songs are decent. In the actual movie, they're just as cheesy and stupid as everything else in it, but alone, they're not bad. Abishek Bachchan also turns in a decent performance. Next to the other two, you almost wonder what such a nice, intelligent, normal guy is doing in this movie. For your own sake - skip this one!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Annoying Hrithik in hilariously bad remake","review":"Rating2/10This film has too many problems. Hrithik is extremely annoying in a hyperactive role. Possibly his worst ever performance. Film itself is yawn worthy remake of old Rajshri film but it just doesn't work. Hilariously bad at times. Some ok visuals and songs.Avoid","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Worst effort to try to copy 1976 movie Chitchor","review":"You are better off watching the original version chitchor.","imdb_rating":1,"our_rating":0,"algo_label":0}]