[{"heading":" The path of love - the wrong way!","review":"'Yeh Raaste Hain Pyaar Ke' is an unwatchable film. The story is corny and filled with clichés, the writing is terrible, it is melodramatic, boring and completely uninspiring. I expected much more from a film starring Madhuri Dixit, Ajay Devgan and Preity Zinta. The film starts with the characters of Ajay and Preity, two professional thieves who perform planned robberies. The character of Ajay appears to be Madhuri Dixit's character's deceased husband's lookalike and there starts the trouble when he enters her house on the day of his death. Yeh, complicated and messy it is. The film's saving grace may be Madhuri Dixit who delivers a sincere and natural performance. Ajay Devgan is completely unimpressive here, so is Preity Zinta, who is just okay and whose charm and vivaciousness seem to be missing in this act. Perhaps the most watchable sequence in the entire movie is the song \"Jo Pyaar Karta Hai\". It is a beautiful and moving song and the acting of the actors on-screen while they are singing it is convincing, particularly the contradicting moods of Zinta and Dixit, the former having sad and poignant expressions and the latter being happy and joyful. Anyway, this film is still not worth your time so you better spend it for a better purpose.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Crap","review":"This was one of the biggest films in 2001 with a big cast having Ajay and Madz with Preity who was growing popularlyThe film is the same melodrama we have seen since ages, it reminds us of many old films especially KHILONA (Sanjeev Kumar), DUSHMAN (Rajesh Khanna) and DAAG (Rajesh Khanna, again!)The first half is as boring as ever, nothing works till Madhuri enters Then the story starts but there are too many cinematic liberties too The flashback of Madhur- Ajay is clichéd but when Ajay goes to Madhuri thinks get better but not for much time Also the climax is badly handledDirection by Deepak Shivdasani is good in parts Music is okayAmongst actors Ajay continues his thief act after RAJU CHACHA and DEEWANE in 1 role and he seems bored in the role while in the other role too he is just okay Preity irritates, Madhuri is good Amongst rest Sunny in a guest role is likable Vikram Gokhale, Rajiv Verma, Kiran Kumar are okay","imdb_rating":3,"our_rating":0,"algo_label":0}]