[{"heading":" Crappy ending ruins a potentially good film","review":"I have been a fan of Govinda ever since watching him in Hatya, Marte Dam Tak and his comedy films. I also felt him and Rani shared good chemistry in Hadh Kardi Apne so i couldn't wait to check this film out but was left in sheer disbelief at the end. \"How could they end it like that? Why? How could the directors, actors allow such an ending?\" is what i asked. The only reason i could think of is the film-makers were trying to show how much a deewana pyar can be! And boy is pyar one shocking deewana! Just look at the expressions on the actors/actresses faces. Om puri is in sheer shock at the deewana's actions, Poor Rani starts to cry, it was too much for her to bear and Govinda is just left speechless with the end. Even the supporting actors at the end can't hold their tears back, the director had shown them \" Pyar Deewana Hota Hai!.To be fair to the cast most of them do well despite one of the most unbelievable ending's. Rani puts in a restrained performance and shows she doesn't need big banner films to do well. Govinda has shades of seriousness and comedy in the role and i actually liked it. He was funny saying \" Baa baa baa\" or \"beh\". I felt also he created sympathy for his character in the film where his friends make fun of his lack of education or when he gets chucked out of his job. If only the film's ending was better.Jonny Lever has his moments. Deepak Tijori and Apoorva Agnihotri do not get much scoop. Om Puri is his dependable self. The rest do their job.Overall Pyar Deewana Hota Hai had potential to be a very very good film but the ending makes it a average affair. It is worth watching for Govinda's and Rani's performance.If you want to avoid the ending just do what i do whenever it comes on. Watch the film up until the ending and then change it over and assume all is well that ends well, otherwise you will be left wondering at the sheer stupidity of the ending.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Cringe !","review":"Govinda, as Sundar (alternatively spelled Sunder), plays a naive man from the rural hinterlands on his travels to the big city. Sundar is uneducated and is duped several times, even by his friends, through his innocence. Sundar meets Payal, portrayed by Rani, and through misunderstanding Sundar is mistaken for being mute. Sundar is uncertain if Payal loves him or pities him, but does not want to lose this love by revealing he can speak. Sundar eventually feels his lies make him unworthy of Payal's love, so he decides to take a drastic step.Pyaar Diwana Hota Hai is a complete Bollywood film. It provides comedy, romance, musicals, drama, melodrama and to a degree, bittersweet horror. Govinda plays the full gamut of emotions brilliantly and it is hard not to empathize with his character's increasing anguish. An exemplary moment is while Sundar is waiting in a room before he has an operation. You can feel his pain as he shouts words of love he has never spoken before to Payal! The ending is abrupt and made me cringe as the reality of his actions hit me, but upon reflection, it suited Sundar's disposition, his guilt for betraying Payal, and his passion to redeem himself to the woman he loves. Well-written, well-played and bittersweet indeed.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Rani is beautiful, but the film is less so","review":"Sundar (Govinda) is a boy from the country. He arrives in the big city and finds that life is not easy for someone without an education. He applies for job and gets it but it isn't what he expected.Payal (Rani Mukherjee) is the daughter of a well-off family. She's just returned from America.They meet and because Rani is quite beautiful, there will be some sparks.There are musical interludes (shot in Switzerland) - A trio of male friends for the hero which serve as a Greek Chorus and also provide some humor - The music is just OK - There's a dance sequence which was the best musical part of the entire film, neither Rani nor Govinda appeared in it.As others have stated the ending sort of comes out of nowhere, and really is a downer.Still if you like looking at Rani Mukherjee you can watch the video. But she is the sole reason to watch the film. It runs about 160 minutes. Do yourself a favor and watch only 153.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Once in a while... you get a movie like this.","review":"I believe that our fundamental film opinions take 3 categories: Excellent, OK and Awful. Sometimes you get a movie which is below average throughout but then the last 15 minutes are as if it has been directed by someone else and it suddenly grabs your attention. At the end of it you think back to the film and although most of it was less than mediocre, you still class it under \"Ok\" simply because of the ending. Well this movie is exactly the opposite... once in a while, you get a movie like THIS.The bulk of the movie was quite good until suddenly the last 5 minutes of the film was so terribly awful that I was left with total disbelief and my jaw had dropped while I was thinking to myself \"No... that cant be the ending... they cant have finished it like that\". The ending in this \"film\" is quite simply THE worst ending I have ever ever EVER seen. It drops this film so far into 'awful' that once I saw the ending I even forgot all the funny, good bits in the rest of the film and just imagined watching that ending for 3 hours instead.I would definitely recommend this movie to anyone who needs a lesson in how NOT to make a film. If you like realism then i wish you luck when watching this movie... and worse still it sucked 3 hours of my life away! UNBELIEVABLE!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" A good beginning and middle but poor ending.","review":"I think Govinda is the best actor at making funny films. I really enjoyed him in khullam Khulla pyaar karan and had kardi aap ne. I am a great fan of Govina because he is just so good at playing his part in every film of his. Rani Mukherji was good in this film but she was better in had kar di aap ne. Jhonny Lever was good as usual and him and Govinda suit working together as they are both funny actors. The beginning and the middle were great but the ending let the whole film down. The cast could not have been better and I'm not a great fan of Om Puri but I thought he was good in this film and Farida Jalal was good at playing her part.","imdb_rating":7,"our_rating":0,"algo_label":0}]