[{"heading":" Romantic","review":"After the dismal Maan (2000), which was a major let down from Indra Kumar, he seems to have slightly matured with this film in terms of his technical skills. However the director fails to understand the audiences expectations and their intelligence yet again. All of his films Dil (1990), Beta (1991), Raja (1994) & Ishq (1997), had problems of being damn right offensive to those who were in the minority or disabled. While the humor has been thankfully toned down for his present film, it still has unnecessary humor which I found to be insulting. What is more disturbing is that some of the audiences in the cinema thought it to be funny.Personally I found the humor in the phone calls Pooja makes to Chander during the the first half of the film. These scenes also brings out the characteristics of the two main characters which are depicted as both young & innocent. While Chander has boyish mannerism in a grown man, Pooja lacks confidence in approaching Chander to ask him out, thus troubles him on the phone. Although not the sweetest of scenes seen in an Indian movie it still is the highlight of this film to which many will audiences will smile at and is a decent narrative which helps us establish the characters, and plot.Here the two actors Bobby Deol and Karishma Kapoor shine. Surprisingly they received a lot of harsh criticisms from film critics about their acting but I feel they did an excellent job, which is suited to them. You only have to compare their performances in this film with their last performances together in the dismal film Hum To Mohaabat Karega (2000) and you know certain improvements have been made - give them credit year! Speaking of humor in the paragraph before I should also mention the two inspectors, played by Murkesh Rishi and Ashok Saraf, which formed humor in the second half of the film through their comic performances.Showing audiences that Indian 'film' families are all not as sweet as portrayals seen in films like Hum Aapke Hain Koun (1994), or Dhaai Akshar Prem Ke (2001) is a breath of fresh air. In this film the character of Pooja comes from a unstable family background with her wealthy mother and alcoholic father. The film has its plus and shows a growing change in the way ordinary Hindi films are changing. Up to this point the film is satisfying and one of Indra Kumar's best cinematic moments.When we reach the second half the film falls with the tendencies of 'hero saves the day' motif, which is predictable and not as gripping as it was once upon a time. This is in the form of a flesh trader, played excellently by Rahul Dev. While the action scenes are well executed, as is the climax with a decent fight sequence, it does slow the film down with the separated side-tracked comedy scenes of Johnny Lever, the uninspiring songs, poor music score taken from the American classic 'Godfather (1973)' & some plot holes concerning Chander's escape from the police.Aside from this the film is an entertaining one and if Indra Kumar carries on improving, as he has done since his first film Dil, he could eventually achieve a film which everyone will love.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Believe me Its Good Movie","review":"It is very entertaining movie\nLots of Songs and some of them are Good...\nStory is Good.....very Bollywood style of story ...Boby Deol,,Karishma Kapoor,,,Anupam.....Rahul Dev...etc.....all acted nicely","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Stupidity at it's height","review":"Indra Kumar who made some decent films like DIL, BETA sadly has the worst sense of humour. In his films craziness goes beyond limit, his comedies are mostly so stupid that they make you feel like a kid. Not that other filmmakers don't boast of such quality but Indra Kumar's 90s films had some of the cheesiest scenes, remember the shock scene of BETA, Raja had several such gem of scenes and also ISHQ, MANN.etc In 90s his films were divided in 2 parts, first half would be nonsensical comedy while second half would be full on melodrama this formula worked many times but failed by the end of 90s and pre 2000 and then he shifted to full time comedies. AASHIQ is a film that reminds us of crap cinema that was made in 1990s. The first half is replete of some cheesy comedy scenes like Bobby Deol making an omlete of his watch and Anupam Kher hearing alarm rings in his body, Johny Lever's wife becoming a dwarf after Mukesh Rishi lands on her and later Mukesh Rishi lands on Johny Lever and makes him a dwarf. The film is replete of such scenes that make you cringe The first half has some few scenes well handled like Johny Lever marriage scene though nonsensical works, even some Bobby-Karisma scenes and the twist too is well handled but second half becomes predictable and Indra Kumar takes several cinematic liberties in the film like some mentioned above and the climax too is so far fetched that it looks fakeDirection by Indra Kumar is below average Music by Sanjeev Darshan was good, but too many songs in the film The title song and many songs are tunefulBobby Deol wears the same lost comical look throughout, it works at some places jars at many especially towards the end Karisma gets into her cry act mode and is irritating Rahul Dev has a small role and he does look scary Naseer is decent in his role Mukesh Rishi and Ashok Saraf are good, Johny Lever has some funny moments Vrajesh Hirjee is loud Anupam Kher is typecast","imdb_rating":1,"our_rating":0,"algo_label":0}]