[{"heading":" Family Drama","review":"A nice family Drama which can possibly happen. A billionaire father Yashpal Chaudhrey's only daughter Komal falls in love with a street-fighter. The movie starts with Suraj( Anil Kapoor ) running from the hospital carrying his new born son. He lives in an unknown village where all the people love him. He works there. His son turns up 2 and Suraj realizes that his legs tingled when he stand. He takes him to a doctor and he says that the boy couldn't walk for the rest of the life. But somehow Suraj is determined to walk Karan. (Jibran Khan ).He does everything and at last he enters Karan into a race at the school sports meet. Karan broke his leg pads and ran and won the 1st place.. In the prize giving he thanked his papa for his earning. At the time Komal(Karishma Kapoor) is thinking about her son and is mentally weak.Yashpalji (Amrish Puri) is determined to get his grandson back. The movie turns on to Vaijanthi (Shilpa Shetty) who falls in love with Suraj not knowing he has a son of 7 years old. But knowing his wife is dead as all say she tries him.. But at last she discovered that Komal is alive.She helps a lot in helping Suraj. Komal lies in the court that her husband asks him money. Court decides to give Karan to his mother Komal. Later Suraj is asked to keep 15 lacks in court before 3 months. Abdul helps him in practicing fighting again. At last the truth is discovered and that is Komal's father hired a lady and gave her the key to prove that Suraj has another woman in his life. And also that he plotted to kill the baby at birth to destroy all the relationships between Suraj and Komal. Komal runs to the fighting place and plead sorry. At last the whole family including Yashpalji settle down. It is really a good movie. Action, Romance, love is based and we can get good advices in life from this movie. I can recommend it to anyone and can offer 9 stars.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Bollywood at its worst","review":"I'm not Indian but I can claim to have seen about 150 Bollywood-films until today, so I guess that qualifies me as someone with at least a little insight. My insight into the movie at stake, Indra Kumar's \"Rishtey\", is very brief: It's a bad movie.I'll dive into the movie a little further. It's the story of a hard working street boxer (Anil Kapoor) who kidnapped his own son because the father of his wife (Karishma Kapoor) wanted the baby and him killed. He raises the boy - and after seven years, he has to face his past and confront the family of his wife again. Standard Bollywood-plot, so to speak. But that's not yet a criticism: Someone like Mani Rathnam could have done a good film out of such a tired story.I'd also not blame the actors: Anil Kapoor gives a strong performance, the boy does a good job too and Amrish Puri (who plays Karishma's father) acts such roles in his sleep. Karishma herself is less convincing. She stumbles and cries through the scenery and her role is terribly underwritten. She's more a red herring than a character. The better female in the cast is Shilpa Shetty who delivers some humor and a lot of skin.So who's to blame? Well, where do I start. The music is terrible. It's your typical \"angelic Bollywood choir\" with its \"aaaah aaaaaah\" over every emotional scene. Sometimes that works, here it does not. The sound effects are equally bad. Expect sound effects right out of a Batman-cartoon. You can hear all the \"swooshs\" and \"swishs\" in the sound track and it's just utterly annoying. The direction: Could this be any more heavy handed? Every event in the movie is forced upon the story (and the viewer) without any ease. The courtroom scenes are cheesy, the divine intervention by Rama is wooden and the final half hour is as fatalistic as possible and results in a unbelievable happy end.The movie was ruined for me in the first half hour already. After they stole a scene from \"Forrest Gump\" (\"Run Karan, run!\"), the boy gives a clumsy speech for his daddy. And it goes on in this direction. The meetings between Anil Kapoor and Shilpa Shetty get equally embarrassing. In one scene, he has to tell her, how beautiful she looks and she cannot believe it. Hellooo? Isn't it, well, obvious that she's very pretty? Ok, I can forgive all that... but then, the movie tries to copy \"Over to Top\". Why this one? Why perhaps Sly's worst movie? And the title lends itself perfectly for a negative review of this film ... over the top. Well, what I'm trying to say is that once you've seen that it tries to copy that movie, the suspense is gone as well.I could go on and on. To make it short: It's an embarrassingly heavy handed movie. Nothing flows easily in this film. There are some nice songs (the one after 30 minutes is strangely sexy for a family film) and some nice performances, but that's about it. If you want a \"boy wants to live with his daddy\"-film, try \"Rahul\". That one's heavy handed too, but it has more charm than \"Rishtey\" and comes across less forced. My rating3/10","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Watch Shilpa Forget Everything Else","review":"Originally 'Rishtey' was to be made sometime in the late 90s. Amitabh Bachchan and Jaya Bhaduri's production company ABCL was ready to launch the movie while Indra Kumar was to direct. The original cast included Aamir Khan, Madhuri Dixit and Juhi Chawla. However, after ABCL fell apart, the film got shelved. Years later Indra Kumar tries to revive the film with a new cast that included Anil Kapoor, Aishwarya Rai and Preity Zinta but after the two actresses walked out they were respectively replaced by Karishma Kapoor and Shilpa Shetty. So, that's the history. Now what's the end product like? 'Rishtey' is a pathetic excuse of a movie. The writing is so dreadful. The plot is one of those old fashioned crap about a stupid couple separating due to a misunderstanding created by the girl's father. There's a baby involved and after 10 years or whatever the mom finds out that the baby is alive and wants him back. In the end they live happily ever after, yes, even with the evil father who becomes a good guy after his daughter slaps him across the face and whatever. Indra Kumar is a terrible director. I think his earlier films were more watchable because of the actors and the music. Here all the songs (with the exception of 'Deewana Dil') are garbage. The best song in the soundtrack ('Dilbar' sung by the sensational Asha Bhosle) wasn't even in the movie.The acting is clichéd and ridiculous to the core (with one exception). Anil Kapoor is miscast and, he whines, he barks, cries like a schoolgirl, is too old for the part, looks pathetic with the 'hey look I'm young' getup, and whatever. Karishma Kapoor is the queen of hamming. Though I must add that her character was awfully written. Deepshika and Sharat Saxena play clichéd characters that give them no scope and Amrish Puri's caricature evil dad is nothing memorable. Jibraan Khan is irritating.The only good acting, and the only good thing that comes out of this heap of rubbish is Shilpa Shetty. Yes, she looks very sensual but if one can see past that, we do see a character with depth. The character does mildly suffer due to writing and the clichéd dialogues but Shetty moves ahead of that. She displays some impeccable comic timing and is wonderful in the dramatic sequences. One can only feel sympathy for her Vyjanti who is an uneducated fisherwoman hopelessly falling in love (as the definition of love is vague to her) with someone who does not give a damn. She selflessly does all she can to reunite Suraj with Komal knowing that there's nothing to gain and I was moved by the last scene where Karan looks at her and we see her eyes filled with tears of both joy and sadness as she signals him to not say anything.So that's about it. This is a horrendous film with only one thing going for it and that is Shilpa Shetty.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Just Enjoy It","review":"When I'm 13en Year Old , i Watch This Flick On Sat Max & Just Cry After Watching The Movie & Now I'm 22 Year Old Still When I Watch The Flick I Just Emotionally Attach To This Flick ! At My Point Of View; One OF The Best Movie Of Family Drama. Enjoy With Popcorn Or Cock Or Both, Its Simply Biggest Entertainer As Its Show , Excellent Performane , Good Music & Of Course The Story Which Emotionally Attach To Us... So,Enjoy With Your Family !","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Outdated","review":"Indra Kumar gave many hits in the past like DIL(1990), BETA(1992), RAJA(1995), ISHQ(1997)one look at most of them and especially RAJA was nothing to rave about DIL was typical romance with some overdone drama and comedy fit for the 90's while BETA which started before DIL and released in 1992 was a good melodramatic film as made in early 90's RAJA was crap while ISHQ was decent MANN was crap again, AASHIQ was hideous which brings us to RISHTEY(2002) which was actually to be made in late 90's maybe it would've worked then too But sadly it's a bad film to release in 2002 The story is a mix of AKELE HUM AKELE TUM(1995), KUNWARA BAAP and many more filmsSadly the comedy which is the biggest problem in most Indra Kumar films(before MASTI) is too bad half an hour is spent on the useless Shilpa- Anil track while the emotions take a backseat The story is done to death as usual Anil and Karisma separate due to Amrish Puri's plan(again) and then Anil brings up the child alone(who is shown to be lame first for no reason) rest is typical melodrama which leads to a volatile action climax which is clichéd Direction by Indra Kumar is ordinary Music is okayAnil Kapoor is a miscast to play a boxer and he is brilliant as the father but looks too old Karisma is as usual, hams to the hilt and her crying for her child(similar to RAJA HINDUSTANi and SHAKTI) is boring Shilpa suffers from the hangover of Sridevi Amrish Puri sleepwalks Sadashiv Amrapurkar is too loud Adi Irani is okay The child Jibraan is good","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Don't Waste Your Time","review":"This movie is masala at its worst. A mishmash of several old Bollywood films and Hollywood movies remixed with over the top acting , melodrama, bad music, more melodrama - and there you have it. This is Karishma at her worst, and beautiful Shilpa doing her best to put a brave face on a poorly written part. I was so very disappointed with one of my favorite actors of yesteryear- Anil Kapoor. IMO, this was his worst role. The movie is sheer nonsense and a sad disappointment.","imdb_rating":3,"our_rating":0,"algo_label":0}]