[{"heading":" 'Charade' Meets Indian Cinema","review":"Does Audrey Hepburn's \"Charade\" ring any bells? It should, because \"Chura Liya Hai Tumne\" is so very similar to it. Replace three male villains, with two male and a female bad a** + replace the heroine's husband with her uncle + add in her cousin and the cousin's son + mix it up with Bollywood style some decades later = Chura Liya Hai Tumne/Charade. Esha Deol is no Audrey, and Zayed Khan (in his debut film) is no Gregory Peck, but it's still an awesome film. Some elements are extremely corny, for lack of a better term, stereotypical of Indian films and at times so rawly raunchy, you want to just cringe. But aside from that, it is an excellent story, great songs, and superb acting on both parts by Zayed and Esha. They have amazing chemistry and the story line keeps you on your toes. \"Boys Are Best\", is my favorite song from the film, it's light and airy, reminding me of a Hindi reprise of a 60s Frankie Avalon movie. While, \"Do you Love Me\" is too cute, quirky and simply adorable. \"Mohabaat Hai Mirchi\" is exactly how it sounds, \"HOT,\" with the bad girl looking like she belongs in Indian Playboy, for sheer silicon looking breasts and no dancing technique or talent along with her six-inch-stripper-heels -- sure to make men sweat in their seats. This movie only proves further that Esha Deol is an excellent dancer, (see \"Naa Tum Jano Naa Hum\"), and that Zayed Khan should make another one (wait! he did \"Main Hoon Naa\"). Final comment - watch it!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Better than most Indian stuff....","review":"If you are tired of watching the typical Indian movie where a typically handsome and smart guy meets and falls in love with a typically beautiful girl, and are wishing for something more original, then 'Chura Liya Hai Tumne' is a good option. Though it does include some of the 'typical' stuff, the story is not entirely based on the love-life of two love-birds.The plot revolves around a bank robbery, which has caused a stir amongst the secret services. Murders and shooting scenes(always present in such a movie)are there. The songs of the movie are pretty good and the movie is not expectable. Some of the things, which were expected, did not happen. This makes the movie better than most of the Indian stuff being released nowadays, and this difference, I believe will greatly contribute to the betterment of Indian movies. The movie is not perfect and does require polishing but still, it's a good effort by the team and a worthy watch.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" a classic case of illogical reasoning","review":"Welcome to a land of Nowhere. If there is some award for the absence of logic or reasoning, than it should be given to this film, as it has surpassed all its contemporaries and shall have absolutely no competition with any other film. Esha Deol meets Zayed and sings a duet with him. Soon after she gets the news of her Uncle who is killed in Thailand. She sets out for Thailand. Now look at the turn of events. Other than an Uncle whom she has not even met for years, no relatives of Esha are shown. Who is paying for her bills, from her birth till her adulthood ? The Thai Police officers mutters some strange, nonsense, illogical words. Even an illiterate can make out that it can be anything but Thai language. The supposedly rich uncle of Esha is running down the streets with his only possession-a cheap handbag before he gets killed. The Killers who killed him for his money forgotten completely to take away the bag. Why in the first place did they kill him when they should know that he can be the only person who knows about the money ? The Police Deptt. who is investigating the murder case didn't even bothered to check a coin worth 10 Crore and it just escapes from their eyes whose very job is to find where all the money disappeared ?Next, a Criminal not just enters an embassy but even poses as a high-rank official and nobody is keeping a check on it in the entire building. Now this Embassy official tells Esha deol that her life is in danger but he did not even send any security considering she is all alone in a Foreign Land. She turns out to be the Ultimate as she didn't even suspect his identity, at that time. Esha has enough money to stay in a luxury hotel but not enough to buy herself a mobile phone that too when her life is in danger. Esha is threatened again and again by criminals who are after her life and still she never asks for a Police protection. The Criminals including a skimpily-dressed bimbette look like cartoon characters straight out of a Walt Disney book-imagine them into stuff like Bank-Dacoity ?Zayed Khan, a stranger from a foreign country lands up in Thailand and the so-called hard-core criminals not just employs him but even entrust him the responsibility of hooking the heroine and getting a fortune from her. All Characters stay in the same hotel, where the criminals openly attacks Esha Deol and Zayed Khan umpteen times, open fires at them but nobody not even a single waiter seems to be affected by it. To Top it, there is nobody seen around in the hotel. One after the other the murders took place in the hotel, but there is no sign of Police. Even the hotel rooms of the deceased are not sealed or locked. A Coin worth 10-crore is being sold openly in a small 10X10 shop at a shopping mall. Anybody can just walk in and buys it. There is no system of checking its authenticity.In the climax, when Hero has to bash up the Villains he don't just kick them but jumps in the air, takes a complete somersault and then kicks them. One can just wonder why didn't the victim run away in the meantime. (Three cheers to Stunt Director Sham Kaushal for matching the imagination of the Director).I'm sure there will be more such instances . The film is from a nowhere land and I just wonder how come the director Mr. Sangeeth Sivan considered his audience also to be from there ?","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Hands up... your money AND your love","review":"When I first read this story I thought this is probably a remake or other of a big Hollywood blockbuster. Fortunately I couldn't figure out which one, so I could watch this movie with a completely fresh and objective view. And from a fresh and objective view it was quite refreshing. It's quite difficult to come across a Bollywood movie which has a good balance between romance and suspense. Churaliyaa I believe has managed quite well.POSSIBLE SPOILERS!!! The story starts off with a daring armoured car robbery. One of the thieves gets away with all the money leaving the others to fend for themselves... in jail. Three years later the jilted thieves look up their cohort and guess what... he ends up dead. But where's the money? The thieves believe that he somehow passed on the money to his niece Tina (Esha Deol). But she doesn't seem to have it and certainly doesn't seem to have any knowledge of the robbery. As the baddies start chasing her and threatening her, she comes to rely on her new boyfriend Vijay (Zayed Khan). But can she really trust him? Can she trust anyone? And where is the money? Slowly we see the story unfold.Churaliyaa is an entertaining thriller. As with any Bollywood romance/thriller the first part of the movie is focused on the romance and the second part on the thriller. The story now and then interrupted with a few mediocre songs at best. Aah... if only the producers could capture the beauty of the original Churaliyaa Hai Tumne song, but alas... the quality of the golden oldies escapes them leaving them with nothing but titles for new movies.Churaliyaa does not offer anything new. Just 2 and a half hours of mindless entertainment like most Bollywood movies. The story is not bad, but it's not exceptionally original either. The romancing offers nothing new at all. And the action is as always unbelievable, and that is not a good thing. No matter how often a person gets beaten, kicked, stabbed or shot they manage to get up and still give it their best, unless ofcourse they HAVE to die in the interest of the plot. The fight sequences are similarly unbelievable. Perhaps Zayed Khan is angling for the role of Keanu Reeves in a Bollywood Matrix remake. Nonetheless, it's better than most but certainly no masterpiece.A final word on the acting. I cannot but speak positively of Esha Deol's performance. Not because her acting was outstanding, because it was simply good (which is also a performance to be proud of), but because when I saw her laughing and dancing I couldn't help but be reminded of Hema Malini. She posesses that same charm and a certain je ne sais quoi which Hema also has. Star potential. This is why later I was not too surprised to find out that she is Hema Malini's daughter.***/5 stars","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Big Fat CHARADE!","review":"If you've seen Stanley Donen's classic \"Charade\", starring Cary Grant and Audrey Hepburn or even the awful Jonathan Demme remake \"The Truth About Charlie\", you'll pretty much figure out what the story is. This movie is a big-fat rip-off with a predictable and well known storyline, cheap thrills and bad action. The script is absolute bulls**t, so are the performances.For starters, Zayed Khan doesn't look like a cop from any angle (so what if he's undercover), what with all his wannabe styles and gimmicks. Even the Mark Wahlberg-Tim Robbins-Thandie Newton version's worth a rush through. But this one is absolute rubbish. Esha Deol needs to do lot more than a crash course when it comes to learning acting. Gulshan Grover is crap, but thats okay. As for the other sidekicks, the least said, the best. The songs are just a cherry on this piece of crap, making it even crappier. The action bit is an absolute disaster. Taken from almost every Hollywood blockbuster's that's come into the action director's head.Skip it, even if you've not seen the original. Skip it, even if its the only thing you got.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Scrappy movie!!!!","review":"i Think this movie sucks a lot!! This was one of the badest movie I have ever seen. The acting was horrible and the story... was not really about anything... A stupid coin thats worth 100mill...wooow... that could not even happened in real life...And the actors... There were only a few actors in the movie. I guess they just didn't have enough money for more actors...The worst thing I think about the movie, is the fighting scenes and the shooting scenes. It does not even seem real, not at all!! He guy can jump 2 meters in the air!! Well, at least I had a good laugh while watching it...","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" squeaky clean","review":"Captured by You is a Bollywood film about young love and intrigue. I heard that East Indian movies were very clean with G ratings. This film was a cross between a Mentos commercial and an old time musical. Actually it was refreshing to see a movie that wasn't trying as hard as an American movie to press the envelope in effects and violence or drain you of emotional capital. Better captioning would have been nice as it seemed that a lot of the dialog was missing and sometimes the English they did speak didn't match the captions. It's about a girl named Rhea and a guy named Vijay who fall in love and meet with some unexpected intrigue with Rhea's uncle. Vijay isn't what he seems. The whole thing was very clean and G rated and is suitable for the entire family. Although most Americans would find the movie boring, it is definitely a B+ to A movie with good acting and energy.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Another Indian film like any other","review":"When foreign films make it to the U.S. market, they are usually good to excellent movies. It costs a lot of money for film makers in poor countries such as in Asia, Africa and South America to distribute their films and put a sub-title on it for the U.S. audience. Therefore they only export the good ones. But of course there are exceptions to the rules in particular when dealing with Indian and Chinese movies. Chura Liyaa Hai Tumne is one of those. With directors such as Satyajit Ray, Mira Nair and Deepa Mehta among others from India, you expect better movies coming from there. It is a shame to see movies that have the same subject and plots repeated over and over. The only difference is the actors and actresses but everything else is the same. Chura Liyaa Hai Tumne has everything that you see on a mediocre Indian film except it has a couple of good song and dance plots. I gave this movie a 5 and would not recommend it.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" A mediocre rip-off of a Hollywood classic","review":"I was disappointed to find that the movie was a rip-off of the 1963 Cary Grant-Audrey Hepburn classic \"Charade\". But, well, that is to be expected with a vast majority of Bollywood movies which seek *inspiration* from Hollywood counterparts. Nonetheless, the movie can be given a shot provided that you haven't seen Charade, otherwise the main suspense in the plot would be obvious, and the movie would be a drag. A couple of songs are hummable, though.","imdb_rating":0,"our_rating":0,"algo_label":0}]