[{"heading":" son of sardar-watch it-its worth","review":"i have read about this movie here-and heard about the rumor saying- both films hit theaters same day and both failed at box office...but for me both the films are good and we should appreciate their effort to bring on screen martyrs story...here in this film bobby deol and sunny rocks, and in that bhagath singh movie(Ajay devagan) Ajay devgan singly rocks.....what i liked here: 1.bhagath singh asking mother many questions about British and their rule.. 2.his conversation with bro deol on screen. 3.making of film....we were not there when it happened-but at least now we can see it and remember the sacrifice made by those young martyrs...every Indian must n should watch this movie and tell about it show it to future generation too...>>guddu dhanoa proved he can direct such films too.... >>>all songs are SO nice n melodious with meaning....i give it 10/10 n it deserves more....","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Desh Maangta Hai Qurbaaniyaan....","review":"Another 15th August ! One more Independence Day ! One more annual occasion to remember the martyrs who sacrificed their lives for the cause of the motherland. Our patriotic sentiments seem to have got associated with the particular dates only. Well, in this review, I am linking the date of 15th August, 1947 to a sixteen years' earlier date - 23rd March, 1931 - the date of martyrdom of three young bravehearts who fearlessly laid down their lives for the cause of freeing their motherland from the slavery of the British. Today I pen the review of a movie made on the martyrdom of Shaheed Sardaar Bhagat Singh, Sukh Dev and Shivram Rajguru whose title is 23rd March, 1931 - Shaheed which was released in the year 2002.The story is nothing but the biography of Bhagat Singh, the son of Sardaar Kishan Singh and nephew of Sardaar Ajeet Singh who devoted their entire lives to make their motherland, i.e., India free from the shackles of slavery. Bhagat Singh (Bobby Deol) joined the organization of the like-minded (believing in violent means) patriot youths - Hindustan Socialist Republican Association led by Chandra Shekhar Aazaad (Sunny Deol). The movie has portrayed the looting of the Govt. treasury at Kakori by these revolutionaries (famous in history as the Kakori Conspiracy) and connected events in detail. After some time, the death of Lala Laajpatrai due to getting beaten by sticks while opposing the Simon Commission, sparked the feelings in the hearts of Bhagat Singh and others to seek vengeance from the responsible British officer - Malcom Scott. Mistakenly they killed another officer - Saunders. Bhagat Singh's views regarding independence and social justice got refined and moulded with time and he got himself arrested alongwith Batukeshwar Dutt after exploding a harmless bomb in the national assembly. The remaining part of the movie is devoted to the prolonged trial of the revolutionaries, their epic fast in jail and finally embracement of gallows by Bhagat Singh, Sukh Dev and Rajguru with smiles on their faces.While deciding to make this movie, producer - Sunny Deol committed two blunders - firstly, he chose his brother-in-law - Guddu Dhanoa to direct this movie and secondly, he cast himself in the role of Chandra Shekhar Aazaad. Skilled in directing masala action-thrillers only, director Guddu Dhanoa could not grasp the sensitivity of the plot and the movie could not do justice to the personality of the great revolutionary and his invaluable sacrifice. Besides, both Sunny and Guddu conveniently forgot that at the time of his martyrdom, Shaheed Chandra Shekhar Aazaad was barely 25-26 years old and a forty-plus Sunny was completely miscast for that role. Besides, to encash Sunny's popularity as an action-hero, the director has portrayed him as a larger-than-life typical Bollywood hero and unduly inserted long action-sequences which might have attracted the front-benchers but spoiled the naturalness and gravity of the movie. Due to the prolonged role of Sunny as Aazaad, Bhagat Singh's presence is not properly felt in the first one hour of the movie which is a clear weakness of the script. To be frank, Sunny-Guddu duo has reduced the movie to a regular masala flick only.However the movie impresses in the first half due to the sequences pertaining to Sardaar Ajeet Singh and Shaheed Kartaar Singh Saraaba. Despite the moving of the storyline in a typical action-thriller style, the movie scores at places. Good songs also help the cause. However in the post-interval session, the script-writer has lifted the screenplay of Manoj Kumar starrer classic movie - Shaheed (1965) for the court-room drama and other episodes. And when compared with the classic B & W movie, this movie comes a cropper and does not impress the audience. Had the script-writer applied own mind wisely for the second half also, perhaps it would have been better. The roles of Sukh Dev and Rajguru (with the other revolutionaries too) have not been given any importance and the movie appears to be an all Deol show only.On the plus side, firstly, it's Bobby Deol who has played the role of his lifetime and infused life into the role of the immortal revolutionary. Amrita Singh as his mother, Divya Dutta as Durga Bhabhi and Suresh Oberai as the jailer have done well. Sunny has concentrated on action and (over the top) fist-fights only. Aishwarya Rai as the fiancée of Bhagat Singh is another disappointment. But the actor who won my heart is T.V. actor - Imraan Khan who brought Shaheed Kartaar Singh Saraaba to life through his amazing cameo. The most impressive song of this movie - Desnu Challo, Desh Maangta Hai Qurbaaniyaan has been picturized on him only. In addition to this song, the other songs are also quite impressive (including the immortal songs of the revolutionaries themselves, viz. Pagadi Sambhal Jatta, Sarfaroshi Ki Tamanna and Mera Rang De Basanti Chola).Technically and production-value wise, the movie is good but I would have been happier had the director paid proper attention to the sensitivity and depth of the plot which is a golden chapter of India's struggle for independence.Despite its flaws, this movie is watchable for its patriotic value. I end my review with the slogan invented by Bhagat Singh himself - 'Inquilaab Zindabaad' (long live the revolution).","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Real Patriotism and Heroism.","review":"Shaheed is a very realistic depiction of our India in the pre-Independence era, as our heroes fought valiantly and stuck strong to their cause of freedom. The Deols, being real Punjabis, fit their characters of Bhagat Singh (Bobby Deol) and Chandrashekhar Azad (Sunny Deol) perfectly. Personally, Sunny should have won Best Supporting Actor for this film, which was sadly ignored by the biased media (the media is ignorant and stupid). This is movie is dramatic, and yet, so invigorating. A movie like this really boils your blood so hard that you just want to go out there and take action with big guns and go after those zamindaars. Stand up for the country's honor and dignity. Action and performances are excellent. If our own Indians today knew about our past and its greatness, it would be in better situations today! You will like this movie a lot!! Cheers!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Good Experience and perhaps the most accurate film ever on Bhagat Singh !!","review":"This is an absolute accurate movie , based on Bhagat Singh. Bobby Deol certainly has done justice to the role. Sunny Deol , though not better Aamir Khan or Akhilendra Mishra , yet has created a feeling that he is the man for the role of Chandra Shekhar Azad.Also as per the history , the hanging too was accurate as the scene , in reality , took place somewhat close to 8 'o' clock , and in the movie too, the scene takes place at the exact time .As for Bobby Deol , kudos for his superb action as Bhagat Singh , and hope that the great Bollywood wakes up from its deep slumber of ignoring perfect masterpieces.Thanking the users, Theirs Sincerely, Animesh","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" An absolute fantastic film and one that will touch many hearts","review":"At first i thought that this would be another story about the independence of the two nations (pakistan and India) but how wrong was i it is an absolutely fantastic film that really makes you proud of the fact that there were people like Baghat Singh who would fight in the name of freedom so that we could benefit. It was a perfect choice to have the punjabi brothers play such a vital role and all credit goes to them for making it all that better. Overall: Acting 100% really makes you want to go and help them; a heart wrenching yet proud situation for Vidya (Amrita Singh)who has done a fantastic job. i would watch this film over and over again just for the reason that it really is a film that the family can watch and you really feel the pain the passion and the emotions that they had gone though. all in all GO WATCH IT im off 2 get the DVD lol x","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Aishwarya Rai's performance!","review":"Aishwarya isn't actually in the film but she shows up to perform one song (Jogi ya) for Bhagat Singh (played by Bobby Deol) and does this perfectly. It is rare for someone in the Bollywood film to show up for an item number but end up carrying the entire film on their back and Aishwarya does just this with this one song and dance. She is the most beautiful thing you have ever seen as she dances around hoping to impress Singh who admires her from afar but does nothing to egg her on. The dance moves are as intricate as you've ever scene Rai dance before, and she is backed by an arsenal of well-wishing women from Singh's household who dance around her, echo her sentiments and bless her with their love and support.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" A Film for those who love to hate!","review":"I occasionally like to watch Bollywood films on Saturday afternoon television here in Toronto. We have a large South Asian population. I generally enjoy them. Not this one! This film horribly warps history and shows the British(read English) as bloodthirsty, merciless monsters from hell, and Indians to be saintly creatures, long-suffering but heaven sent. The fact is overlooked that there never was an India until the British Raj, just diverse states in constant wars with each other, a social structure stagnant for 1,000 years, a few ridiculously rich families and a vast population who lived somewhere far below them. Yes the British Empire made mistakes, all Empires do, but they left India in a responsible fashion, setting up the framework for the thriving, democratic (if imperfect) India that we see today. This film is the type of filthy propaganda that gets people killed. I've read the comments here about \"blood boiling\" desire to club Caucasians. If this film had been made in the west sowing the same seeds of hatred that we see in this film of the East there would be a great deal of outrage indeed. Love the ending where the Brits are turned into human torches by the riotous mob! This film is a 1 out of 10!","imdb_rating":1,"our_rating":0,"algo_label":0}]