[{"heading":" The story lacks freshness, direction lacks impact, Tusshar lacks Star looks, Kareena lacks acting ability and even the dupatta song lacks a dupatta.","review":"An eternal love story  that will be forgotten even before the viewer reaches back home. Nadeem Shravan's timeless music  indeed takes less time for the viewer to reach the exit door with a painful song popping up every now and then. An extra 'r' in the title  justifying Kareena's overdone facial expressions, very very unnatural.The movie starts with a very unappealing pair of obese kids swearing undying love and singing songs (in their age I was unable to recite even nursery rhymes). But then rich girl poor guy, so father fumes and love doesn't bloom. Years later  Enter Tusshar with a living-in-India, dancing-in-Paris song. Enter Kareena with a living-in-Paris, praising India song. Both are in search of each other. But why the hell do they insist on sticking to their childhood love, unseen for years. What if she would have turned into a tun-tun and he into a Gabbar singh? Post interval they meet and sing more songs. But daddy still ain't cool and fires shots. The highly clichéd bhagwan-ka-chamatkar end, where Tusshar gets back life appears most ridiculous. In between the story is also stuffed with several unconnected sub-plots, like a tight-pant veejay's (Mallika Sherawat) one-sided love affair, an angry old Alok Nath, a turban headed Satish 'Sardar' Shah(again) and a Kader Khan going philanthropic ways.The story lacks freshness, direction lacks impact, Tusshar lacks Star looks, Kareena lacks acting ability and even the dupatta song lacks a dupatta. Also imagine, the title song is pictured in a disco.Kareena's dressing sense is pathetic and in between she's also seen in a Saree. Yes, a Saree. The movie essentially bears a Mujhe Kuch Kehna Hai hangover, which is evident not only in it's cast and crew but also with those similar outdoor locations, song picturizations, Kareena's dupatta song and Tusshar roaming on hill tops with haver-sacked shoulders. Finally Mujhe Yeh Kehna Hai, that miss it under all circumstances","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" same old story but well made","review":"Poor guy falling for a rich girl. Tusshar and kareena has no screen chemistry at all. The movie can be seen once but it is not a movie which will make you want to see again and again. Kareena acts the best in the movie. She is hot.Watch it for her. My rating- 7/10","imdb_rating":9,"our_rating":0,"algo_label":0}]