[{"heading":" Karisma breathes fire for her child... a powerful film!","review":"The power of Shakti is evidenced in its portrayal of the power of a mother's love, the exceptional performances, the steady execution and the rather innovative script. The film tells the story of an Indian woman, Nandini, who lives in Canada with her husband Shekhar and little kid Raja. All of a sudden her husband informs her that his family in India (of whom she had never been aware) is in troubles and the couple rush to India. When they get into the village, Nanadini is shocked and terrified to witness a very wild rural culture; Shekhar's family, ruled by his cruel, highly cynical and merciless father Narasimha, lives a poor and highly violent lifestyle which is full of murder and terror and where women are subservient and helpless. Nandini starts nagging Shekhar to return home, but he is soon killed by his father's enemies. When she wants to leave, Narasimha refuses to let her take Raja back to India. Here starts the intense struggle which can be called \"Nandini vs. Narasimha\".India is not presented in a particularly positive light in this film, but it only shows a very tiny minority of its rural areas, so it may be even correct. The portrayal is in my view fair and not one-sided because the positive side is also presented to an extent. Such a horrifying sight could be shown in a film about any country in the world. The locations are amazing, the music is wonderful, and Krishna Vamshi's direction is aided by very effective cinematography and good editing. One thing that must be noted is the very ear-pleasing background score by Ismail Darbar, which is fantastic. The characters are very well defined though we do get to see both their bright and dark sides in different portions of the film. Portrayed realistically throughout, the film is totally chilling and gripping, and it flows well to create an interesting and fairly entertaining watch. The dialogues are superb, and although the shocking proceedings are disturbing at some points, a great deal of positive moments manage to relieve the tension.The film's biggest strength is the performances. Karisma Kapoor is breathtaking and very believable as Nandini. Her ability to strike a balance between vulnerability and unrestrained emotion is simply incredible. She displays so much intensity, anguish and determination as the mother who wants to get her son back that this little kid seems to be her own son. Her outbreaks while facing off Nana Patekar which are like volcanic eruptions show us how the simplest of women can become a tigress when it comes to her child. After Fiza, this is her most powerful performance. One of the greatest actors Indian cinema has seen, Nana Patekar is indescribable as Narasimha. He manages to be hateful as Narasimha yet admirable as the actor who plays him. Patekar displays cruelty, wittiness and even humanity with total conviction, and his dialect and mannerisms are outstanding. Another great performance comes unsurprisingly from India's most underrated actress, Deepti Naval, who sensitises her character to perfection. Sanjay Kapoor is just adequate and Shahrukh Khan provides great comic relief. Anyway, do watch Shakti - it could have been better, but it is definitely a must-watch.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A nice do","review":"Well, I'll be honest: It is not exactly a Sholay. But you cant get a Sholay every week. In fact, you could see distinct signatures of \"not without my Daughter\"(Sally Field, 1991) in this movie. However, as most \"inspired\" movies go, this one was a well-inspired one, well handled and well done. Nana Patekar, as usual, tends to overdo his hysterics, but all others are commendable. Specially so about Dipti Naval: Saw her after a long time, but she hasn't lost any of her grace. In fact, she has performed much better that when I last saw her. Another one of the Bollywood stars that seem to grow more beautiful as they age?All in all, a nice watch.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Uneven but compelling drama","review":"Uneven Bollywood drama. Karisma Kapoor is excellent as an Indian woman in Canada who marries a friend (Sanjay Kapoor), has a child, and then visits his family in India only to find they are terrorist warlords. Drama and tragedy ensue, and the film becomes a kind of NOT WITHOUT MY BABY styled thriller. Film is compelling, its few song/dance numbers are uninteresting and needless, the gaity of Bollywood song and dance is really out of character for the intensity of this film's drama, at least once we've left the comforting confines of their Canadian love nest  although one number involving a cameo by the stunning Aishwarya Rai is enjoyably provocative, if ultimately misplaced as well. Likewise, the inclusion of Bollywood superstar Shahrukh Khan as a happy-go-lucky drifter who helps Kapoor in her escape from the clutches of the warlord turns what had been a very serious drama into a silly farce, and it only gets back on his feet when his character  and his fantasies about Rai that generate her cameo dance  are dispensed with. His throw-away comic-book dialog and the silliness of his fight scenes detract from the film's primary gripping drama. The cast is nicely supported by Nana Patekar as the warlord, and the elegant Deepti Naval who is outstanding as his long-suffering wife who finally choses to stand up against him in one of the film's best scenes; Ritu Shivpuri and Rajshree Solanki are also very good as Sanjay's sisters in India, and very pleasing eye candy. But Sanjay himself overacts terribly, especially during obvious ad-libs. The directorial style of writer/director Krishna Wamsi is sloppy, rampant with rough transitions and abrupt cuts, although his camera movement is good. The musical underscore is also quite effective, moody, featuring wordless female voice over a small orchestral ensemble (too bad little if any of that made it onto SHAKTI's soundtrack cd, but Bollywood hasn't yet discovered the value of including score along with songs on their soundtrack albums, at least not in most cases). But SHAKTI is Karisma Kapoor's film, all the way, though, and the intensity of her performance once the film switches to India contrasts nicely with the gentle romance with which she engaged with Sanjay in the initial Canadian scenes. Despite the unevenness of much of the picture, Karisma's performance completely sells the film and solidifies its otherwise inconsistent measures. In a strange way, also, I found the story to be another take on the ostentation of royalty I'd noticed in CURSE OF THE GOLDEN FLOWER and MARIE ANTOINETTE, both of which I'd seen just prior, although SHAKTI of course is an entirely different kind of film; but the focus on a dysfunctional royal family  here living in the austerity of terrorism-controlled poverty in India rather than the elegance of Versailles or the massive megalomania of feudal China's Tang Dynasty  whose self-serving seeking of power brings ruin upon many others and forces an uprising of one kind or another provides the film with a notable subtext.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" An insane moviegoing experience; possibly the death of cinema","review":"Seeing this movie was the most fun I've had at the cinema in a long time. However, I am not able to say whether this is a good or a bad film, because such simple qualifications simply cannot be applied.  This picture has everything any movie could ever have.  It has characteristics of a romantic comedy, a political commentary, a thriller, a drama, an action movie, a musical, and an absurdist self-conscious art film.  It's all in there, adding up to a myth.The basic premise is about an Indian couple, Nandini (Karishma Kapoor) and Shekhar (Sanjay Kapoor), happily living in Canada, who rush to India to visit the husband's parents after a disturbing news report. The rest of the story takes place in India, where the couple find themselves in the midst of a plot of fratricidal violence.  At one point, the story borrows from \"Not without my baby,\" but to call Shakti a remake of anything would be an injustice.The ostensible story line takes a backseat to a number of astonishing interruptions, including Shah Rukh Khan's dream of Aishwarya Rai which comes as if out of another movie.  In fact, the two stars are on all the posters, but they appear really late in the film, and only Shah Rukh ends up being a real character.  Yet he makes up for it with a spirited and truly unexpected performance.Karishma Kapoor is the one with most work to do in this film, and she does an admirable job, having to link up the film's twists and turns with a show of believable emotion.  Another notable presence is Nana Patekar, who plays Narsimha, the tyrannical father of the husband Shekhar.  Nana Patekar dominates every scene he's in with a scary but nuanced character.The movie is not without its share of realism.  Violence is rampant, but truly disturbing in the abuse received by most of the female characters, with Karishma getting soundly beaten on a number of occasions.  At times, this violence is clearly disturbing but ultimately it becomes surreal as every dramatic sequence is usually followed by such comic and spectacular turns that the overall effect is nothing but cathartic.I have seen a share of Bollywood releases, and the mixing of genres and incredible plot resolutions are certainly their norm.  But \"Shakti\" raises the bar by absorbing an even greater masala without becoming ridiculous. It is a film that achieves the grandeur of a Shakespearian tragedy, where the audience of the rabble and royalty is equally entertained.  It is pure, gratuitous cinema, and the director Krishna Vamsi must have had a dream of a good time by throwing in every trick in the book.  Perhaps, the all-important message of violence begetting violence and the inspiring extents of motherly love were not the thoughts on my mind, but I came out of watching \"Shakti\" exhilarated.  Making movies can be the most fun in the world!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" nana is the best in Indian cinema","review":"good movie, good music, good background and an acceptable plot. but the main point again as his movies tend to be, the man is the best actor in idia and can turn dust into gold. nana patekar. this may be his second best performance after parinda( others may disagree). although other movies are not far behind. one man that will never ever disappoint you.good movie although i think shahrukh was a luxury this movie could have done without. you can see in his movies, others try very hard to reach his heights and act out of their skins. but this man is really something elase.the movie is cool, the music and direction is excellent plot a bit thin but the screen play and dialog again very good. a must watch.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Both Karishma and Nana Patekar offers superb acting!","review":"This is a movie that is worth watching for Nana and Karishma.Both have done a superb job.Karishma is in top form after giving great performances in Raja Hindustani,Dil To Pagal Hai,Biwi No 1 and Fiza.Karishma shows in every emotion and feeling.After Sridevi in Laadla i have never seen an heroine putting on such anger,emotion at the same time.This is her best performance.Nana is also excellent though he and Karishma goes over board at times.His dialog delivery is superb for no doubt with lots of gray shades.He gave a knock out performance in the climax.Though he is completely superb.The kid though is cute is passable.Deepti Naval is fine as the mother.Her confrontation with Nana in her final scenes is note worthy.Sanjay is passable.SRK is pathetic.His dialog delivery is incredibly pathetic and he hams.Though a fan of Shah Rukh myself.I felt that Salman Khan could have suited that Roley more because he is the bad guy of Bollywood.Tiku Taslania and Jaspal Bhatti are wastedThe movie is bloody but different.OK,i know there is a lot of screaming,yelling,vulgarity,over the top acting that you do want to fast forward.Some are sick through.i do feel like vomiting.Direction is great in some scenes but mediocre at the rest.Characterisations are powerful at times yet a little sketchy.Dialogs are passable.editing could be better.Camera work is average.Foreign locales are nice.the first few minutes are boring but once Shekhar hears the news the movie really becomes interestingSongs are forgettable.The saving grace the catchy Ishq Kameena.Sridevi has done a decent job.As a fan of Sridevi i request her to stop producing movies because she is average as a producer.Krishna Vamsi has done a decent job with this and so does Boney Kapoor.The movie title means power.It has some power but enough of them power it required.Give it a decent watch","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" The power of a mothers' love","review":"Okay, I know this does'nt project India in a good light. But the overall theme of the movie is not India, it's Shakti. The power of a warlord, and the power of a mother. The relationship between Nandini and her husband and son swallow you up in their warmth. Then things go terribly wrong. The interaction between Nandini and her father in law - the power of their dysfunctional relationship - and the lives changed by it are the strengths of this movie. Shah Rukh Khan's performance seems to be a mere cameo compared to the believable desperation of Karisma Kapoor. It is easy to get caught up in the love, violence and redemption of lives in this film, and find yourself heaving a sigh of relief and sadness at the climax. The musical interludes are strengths, believable and well done.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Bollywood needs a film like this every once in a while...","review":"I initially bought this DVD because it had SRK and Aishwarya Rai on the cover and I thought, hey! another film starring Aishu and Shah Rukh, little did I know that Aishwarya would only appear in an item number in the last quarter of the film in a song which she shares with SRK and helps introduce his character who is in the film for about just 15 minutes. Shakti is a film about a mother's love and endurance. It's a film about transformations, ignorance, coming of age, stepping into the know and embracing the harsh realities of life. The item number in which SRK and Aishu appear in has nothing to do with the movie. It's actually a dream sequence that occurs while SRK's drunken character is knocked unconscious by booze. He dreams that Aishwarya Rai is this sexy street girl who shows up at his favourite hangout spot one day, dressed scantily and begins to seduce him. The title of the song is 'Ishq Kamina' (loosely translated as \"Love's a bitch!\") and it is just plain smoking hot! Don't miss it.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Disturbing, Bloody but different","review":"Shakti is a film that Bollywood cannot ever produce genuinely.  What I mean by this is, the fact that with an intense story such as the one in Shakti, the requisite bollywood formula of 5 dance numbers just does not fit into the storyline, and thus becomes jarring and inappropriate.  The only way to remove the songs would be to classify the movie as an art film, which would lead to many filmgoers dismissing the film and subsequenlty producers would have a tough time attracting top stars to the project.Shakti is a very ambitious film with a very different storyline from the bollywood conventional norms.  The problem is the over abundance of violence and profanity which many current filmgoers have become averse to.  Even hot blooded indian males seem to be shunning action movies and watching gay musical romps with teen agers in the lead roles. Come on we need more Sunny Deols and Akshay Kumar movies. I think that the violent nature of the movie and the characters will lead a large majority of filmgoers to ignore this film, including the ladies and the above mentioned males.Nana Patekar does an outstanding job as the trecharous father in law.While the lead actress, is severly mis cast in her role, and is just screaming for a national award.  Although we must give her kudos for attempting a difficult role requiring more range than dancing around the alps of switzerland.Shah Rukh Khans role is inconsequential and meaningless.  Since there is no positive role in the movie, you would expect him to be the knight in shining armour but he just seems to be stuck in, in the last 30 minutes of the film to sing a song and may be draw in audiences who are unaware of his overglorified cameo.  And his subsequent fate is rather meaningless was well. (spoiler alert)!!!! The sad part of the film is the fact that it does not follow bollywood conventions when it is neccesary.  Why does Karishma kapoor not get her revenge in the end.  Instead she is seen pandering to her father in law by leaving india thinking he is a great man because he let her son go. Blow his brains out KK, audiences would have loved to see a female commando.I gave this movie a 6/10 for effort.  But the actual material is handled quite poorly.  It is not surprising to see that it wilted away at the Indian/International Box Office.  Too bad Shakti had no power.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Karisma and Nana both steal the show","review":"SHAKTI(2002) was Sridevi's debut as a producer and was supposed to be her comeback after JUDAAI(1997) but she was pregnant and then the role after Kajol was finally accepted by Karisma. Shakti has no resemblance with Shakti(1982) whatsoever,The film is a remake of Telugu super-hit film Anthapuram (1999), which inturn was inspired by Hollywood film Not Without My Daughter (1991) which was based on the real life story of Betty Mahmoody. The film was damn violent for it's time and was completely rejected in 2002. The film however consolidated Karisma Kapoor who was known merely as a star into an actress after FIDA, ZUBEIDAA. The film starts off with Karisma and Sanjay Kapoor(not her husband but the actor) who are married and then go back to Sanjay's gaon. Obviously the North(Bihar,UP) and there Karisma is shocked by the violent escapades. Nana Patekar is portrayed very brilliantly. The characters of the village and the following scenes till the interval are brilliantly handled. Suddenly the filmmaker things lets throw in commercialism and they we have an item song with Srk and Aishwarya out of nowhere, Ishq Kameena which was a hit song those days especially after the success of DEVDAS(2002). Srk's character is used for comic relief but the impact is missing and towards the end though the outburst of Deepti Naval is well handled, the climax is abrupt and the change of heart looks unconvincing.Direction by Krishnan Vamsi is good though his handling does resemble South films(He is a south director) Music is decent, Hum Tum Mile is melidious, Ishq Kameena is superb but forcedNana Patekar steals the show in a role only he could play, He brilliantly conveys the ruthless character Karisma Kapoor does a great job in her role and breathes fire into her confrontation scenes, the actress earlier mostly just did run of mill stuff but post FIZA she took herself seriously, sadly she got typecast in films and her crying became tortorious in other films Sanjay Kapoor is decent in his role, SRK tries hard but his character seems forced, his death scene is unintentionally hilarious similar to ARMY. Prakash Raj doesn't get much of a role, Vijay Raaz is fab Deepti Naval is fantastic and so are the rest","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Karisma and Nana act brilliantly; good movie, could've been better.","review":"This is probably Karisma at her best, apart from Zubeidaa. Nana Patekar also gives out his best, without even trying. The story is very good at times but by the end seems to drag, especially when Shahrukh comes in the picture. What really made me like it were the performances of the leads, the dialog delivery, as well as the story, for what it was. It could've been directed better, and edited. The supporting case was even great, including Karima's mother in law, even though she just had one shining moment, it was great to watch her.The sets were also pretty good. I didn't really like their portrayal of a Canadian family, but once they step in India, it's as real as it gets.Overall, I would give it a thumbs up!","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" so near yet so far","review":"I sat down to watch Shakti with a lot of trepidation....though the reviews had been mixed.....they all seemed to agree on one thing.....the brutality and the gore was just too much and many reviewers questioned if a film like shakti which promotes itself as a film about female emancipation is in fact more detrimental to women that the normal bollywood formula film.....to my amazement i was pleasantly surprised with shakti........loosely adapted from the sally field starrer not without my daughter......the story of shakti is simple enough (spoilers ahead)....circumstances take nri nandini to india where she is shocked at the brutality and violence of her husband's father.....after her husband is killed.......nandini finds herself in a desperate struggle to leave the country with her father-in-law hot on her trail to get her son and his heir......from this fairly formulaic premise, shakti builds into an engrossing, compelling and yes, brutal movie......shakti takes place in a fictional feudal town in bihar....a state that has long been known for it's bloody caste wars and general lawlessness....in fact the violence depicted in shakti maybe closer to reality than many of us would like to admit.....but the question about how much violence is too much violence has to be asked....here is my answer.....according to taran adarsh (BOO!!!!!), females and gentle ladies like myself have our delicate sensibilities offended at the reckless spilling of blood......unfortunately for taran, my sensibilities are rarely offended by gross brutality (whether this does not make me a gentle lady is debatable).......i sat through bandit queen and bawander..two recent films that put some pretty terrifying stuff on screen........but i am offended when violence is used as gimmick......when throwing a bomb or chopping someone's head off in the most primitive way is shown as a reason for the front-benchers to break into loud applause.....and this was my primary problem with shakti....not too much violence but too much gimmicky violence......what other reasonable explanation can there be for the annoyingly stupid - \"look i kick ass like keanu reeves in the matrix\" excuses for stunt work that krishna vamsi showcases in the film.......they are fairly poor special effects which not only slow the momentum of the film but take away from it's effectiveness.....some of the most effective scenes of violence in shakti are not the cool stunts or the \"main tera khoon pi jayunga\" kind of killing.....it's the simple scenes......like when nana patekar uses his hands and feet.....to hit out at karishma kapoor outside the police station after one of her first attempts at escape.....and when karishma fights back....there's no yelling or cool moves......she uses her hands rather ineffectively, flailing against him in desperation, to pummel him finally getting a gun but using the butt of the rifle to keep the goons away....it's crude but effective......no slow motion neccesary....but gimmicky violence, extremely useless music (all the songs are either boring or wrongly placed) and choppy editing aside......shakti scores with it's generally well-done background music (except for the cheesy western srk theme...that is so sholay), interesting cinematography ( i loved the constant panning of the desolate landsacpe and the quick swoop close-ups)and most importantly it's performances.......nana patekar has done this kind of thing before...the i'm so loony i'm dangerous role....most memorably as anna in parinda.....but it's the kind of thing he does very effectively as he demonstrates in shakti.......srk's short but sweet role as a petty thief and nandini's knight in holey vest kind of armour is a throwback to the kind of heroes hindi cinema used to have before they all morphed into harvard-educated, armani-wearing, sensitive 90s men (remember anthony gonsalves....even jai and veeru).......and perhaps srk is one of the few current bollywood actors who has the requisite star power and charm to pull of the role.....he does so with panache (even his hamminess seems necessary here) but for the second movie in succession struggles with his accent.....after turning devdas' posh british accent into a crude american drawl ('yeah yeah'......for crying out loud!!!).......his bihari accent wavers constantly between bambaiiya and bihari with the occasional posh english word thrown in......in a lesser actor it would be laughable.....in an actor of srk's calibre....it's unforgiveable coz it points to lazy acting or lazy directing or both.....as for sanjay kapoor.......he still reminds me too much of his older brother who is a much much better actor.....and actually played a longer version of sanjay's role...the village pacifist to better effect in virasatbut the stars of the show are the women....they represent two diametrically opposite views......deepti naval plays the submissive, long suffering mother who watches the brutality silently and even jokes about it when she laughingly tells a tailor she'll chop him into a thousand pieces if he screws up the measurements for her beloved son's new clothes.......karishma plays on screen what many are thinking as they watch.....first confusion, then horror and disgust at the brutality.....it's been a while since deepti naval had a meaty role and she latches on to it for dear life.....as ma she moves fluidly between undying love for her son and undying loathing for her brute of a husband.....her final scene is memorable for it's scathing dialogue and deepti's bang on delivery of it....karishma kapoor has an uncanny knack of picking roles all other reputed actresses have rejected and turning it into pure gold.....she has also for the last couple of years worked single-mindedly to erase all memories of \"sarkailyo khatiya\" from our heads.......once again she succeeds in both.....as nandini she delivers her most heartfelt and hard-hitting performance to date....showing love, confusion, fear, loathing and surprising will with ease.....she lives her role whether it is screeching desperately for her son or giving her father-in-law a piece of his own medicine.....and yet shakti also disappoints.....it showcases all that is wrong with bollywood formula and why many current directors are seriously rethinking it.....in the midst of highly effective melodrama....bollywood formula demands an item number, the jhakaas entry for the hero, the 5 songs, the extended and overly melodramatic fight sequences.....shakti has it all and it's all jarringly out of place....krishna vamsi makes a decent debut but if he had had the courage to abandon the formula completely.....it would have been a far far better moviefinal rating - 7/10.....ps indian censors continue to annoy and amaze me...they ban bandit queen....heavily censor bawander but let shakti go with a few curse words blocked out.....crap!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" family crime","review":"It's a family drama crime related... the power of mother ...SRK,Nana,Karishma acted brilliantly from their position...\nthere's no any reason to separate a child from her mother...","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Yucky","review":"What a boring film! To sum it all up, its was basically just Nana Patekar beating up his daughter-in-law Karisma Kapoor, while she tried to flee from the village, with her son. Can someone say BORING??? The concept wasn't too bad, but it was poorly executed. The Canadian locales, and some of the village scenes were nicely shot. However, overall the cinematography came up short. The story could have been great, but the movie just seemed to drag on. There is only so much stupidity a person can take, let alone three bloody hours of it.The best part of the whole movie was the song \"Ishq Kamina\", and that was only five minutes long. Other than that, this movie was a piece of crap.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" An Incredible Movie Experience","review":"Indian Directors have it tough, They have to compete with movies like \"Laggan\" where 11 henpecked,castrated males defend their village and half of them are certifiable idiots. \"Devdas\", a hapless, fedar- festooned foreign return, drinking to oblivion, with characters running in endless corridors, oblivious to any one's feelings or sentiments-alas they live in an ornate squalor of red tapestry and pageantry. But to make a good movie, you have to tight-rope walk to appease the frontbenchers scumdwellers who spit in their homes and theaters,who are the quentessential gakwkers, mesmerized with Split skirts and Dishum-Dishum fights, preferably involving scum actors like Aamir Khan, Salman Khan, who are the ugly makaka monkey's, good for cleaning toilets, who should never been allowed into India. So you can connect with a director, who wants to tell a tale of leonine village head, who in own words \"defending his Village.\" This is considered a violent movie or too masculine for a male audience. There are very few actors who can convey the anger and pathos like Nana Patekar (Narasimhan). Nana Patekar lets you in his courtyard and watch him beret and mock the politician when his loyal admirers burst in laughter with every word of satire thrown at him, meanwhile his daughter is bathing his grandson. This is as authentic a scene you can get in rural India. Nana Patekar is the essential actor who belongs to the old school of acting which is a disappearing breed in Hindi Films that is taken over by these suvvar corrupt rats. The violence depicted is an intricate part of storytelling with Song&Dances thrown in for the gawkers, without whom movies won't sell, a sad but true state of affairs. Faster this changes better for \"Bollywood\". All said and done this is one good Movie.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" The Mother Of All Action Films : Riveting Till The End","review":"To start with, I dislike violent movies and usually can not watch them. This one was different. It was action packed till the very end with more than a reasonable dose of gore, but riveting nonetheless.The story unfolds horrifyingly, more so when you realise that there are feudal pockets like this still remaining in some parts of India where 'rule of law' is not even a theoretical concept. Yes there is violence but the story line is interesting to the point that you just must keep watching to see what happens next. The interest factor is sustained so that one does not feel the movie is dragging unnecessarily.Karishma Kapoor has superbly portrayed the terrified newly widowed mother. Nana Patekar does what he does best. Shahrukh Khan's black humour delivered effortlessly in the most natural way, is after all his trademark that has made him the actor he is. Deepti Naval did well. The little boy child actor was convincing, the cinematography was outstanding.This is a violent movie, NOT SUITABLE FOR CHILDREN. For adults even those like me who do not care for violent movies, it is riveting and holds the interest right till the end. Do watch it.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" The Power without a Hitch","review":"A strong woman oriented subject after long, director Krishna Vamsi's Shakti- The Power, the Desi version of the Hollywood hit Not Without My Daughter is actress Sridevi's first home-production. A story about a woman's fight against harsh injustice.The story of the film revolves around Nandini (Karisma Kapoor) who lives in Canada with her two uncles (Tiku Talsania, Jaspal Bhatti). There she meets Shekhar (Sanjay Kapoor), falls in love with him and they soon marry. Their family is complete when Nandini has a boy, Raja (Master Jai Gidwani). But their happiness is short lived, as the news of Shekhar's ailing mother (Deepti Naval)makes them leave their perfect life in Canada and come to India. And that's when the problems start. From the moment they reachIndia, both are shocked to see the pollution and the vast throngs of people everywhere. They take a crowded train to reach Shekhar's village and when they finally reach the station, they have to catch a long bus drive to his village. The filthy sweaty bus combined with the uncertain terrain makes it a never-ending drive. And unfortunately for them, a frenzied mob that beat Shekhar out of shape for no fault of his attacks their bus. Fortunately, they get shot dead just in time before they can further harm him. After that, they drive to the handing Havel where Shekhar''s father, Narsimha (Nana Patekar) lives with his wife (Deepti Naval). Nandani realized that her father-in-law is in command as soon as she enters the place, but her only solace is her mother-in-law's warm welcome.Living there, Nandini learns of her father-in-laws tyrannical behavior and realizes that ruthless killing is a way of life for him. The day she sees her father-in-law teach her son to throw a bomb, she loses it and lashes out against him, insisting to Shekhar that they move back to Canada. But terror strikes again when Shekhar is murdered one day, leaving a broken down Nandini alone with her son in this strange land where she is harrowed by a cruel father-in-law. Her fight against this man to save her son is what makes up the climax of this emotional heart-wrenching film.What sets apart Shakti from most films being made off late is also the rural setting of the movie. The only drawback is Ismail Darbar''s music, which fails to rise above the script. The only saving grace is the sexy item number Ishq Kameena, which has been composed by Anu Malik. Another pat for the director comes because he has extracted some splendid performances from his cast. Karisma Kapoor is the life of the film and has given a moving performance as a helpless mother. She is sure to win awards for this heated portrayal. Second is actor Nana Patekar who is back with a bang with this film. His uncouth mannerisms suit him to the hilt and he's shown his versatility once again with this role. Sanjay Kapoor is the surprise packet of the film with a sincere and effective portrayal that stands up against both the other actors. Deepti Naval too is in top form and her Pr-climax showdown with Nana is praiseworthy. Shahrukh's cameo provides the lighter moments and surely he's been pulled in to get the required star value. Though his role was not really required, he's done it well. Overall, Shakti is a far superior film than most churned out these days and the Pr-release hype is sure to get it a good opening. Shakti is sure to get the critics and audience thumps up. So what if the film needs to be desperately trimmed by at least 2 reels to better the impact. Shakti still has the power to go on without a hitch!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" By its end I felt embarrassed, while someone else should !","review":"We have: A character who sings and dances after his death. A heroine who does nothing but crying, running, crying, running, then crying again. A loyal henchman who kills his boss's daughter just to make way. A bunch of thugs, who already have guns, fight one unarmed man that they really hate with only sticks. The same unarmed man got shot right in the middle of his back, then fights 10 men bigger than him with his bear hands, wins them all, runs after a train, catches it, saves a women and her son, fights again, kills all the bad guys, then finally dies out of his injury (remember it?!). Yet nothing in the world can outmatch the ending; where one of the toughest men ever appeared on screen turns into a complete idiot who stops chasing his late son's wife after numerous - totally bloody - pursuits, leaving her utterly alone out of the blue AND FOR NO REASON AT ALL!!!!!!!!!!!!!!!!!!!!!!!!!!!In some movies I forget logic a bit, but this time I regretted to do it, then became incapable of doing it anymore. The scenes of (Karisma Kapoor) crying are free and endless; many times I felt that the director should yell cut, well, he didn't. The father-in-low was enjoying beating up his daughter-in-law in non-stop way which assured that the director was the one who enjoyed it the most. The character of (Shah Rukh Khan), which reminded me of the young (Amitabh Bachchan)'s roles, turned out to be the most disappointing cameo ever. I thought he would be the lead, instead of that dispensable guy who played the husband, but I was awfully wrong. (Nana Patekar) is wasted in nonsense, his last scene is the worst thing he did, or any actor could have done. Actually the whole third act is a fine cinematic interpretation of \"random\". While the board of \"The End\" showed suddenly, it is one of the most surprising indeed, I had a big hysterical laugh, being in denial, to just laugh again and again. Believe it or not, I kept laughing even in my sleep after the movie was finished!For some time, I felt how that could be an Indian western. However, it ended up as a cross between pure violence and outrageous comedy. Maybe the makers of it wanted basically to make an action, and comedy came unintentionally. Well, to tell you the truth, this is not an action, a comedy, a musical, a romance, or even a social commentary. It's a huge savage cartoon, a commercial fatuity, and an explosion of silliness. In a word, this is a frank shame, and you have to see it to believe that this actually exists, and being made with big budget and proud artists. By its end, I felt embarrassed, while - in fact - not someone, but \"some ones\" else should. I just don't know how these artists can face people again?! But according to their very movie, I see that they don't lack the impudence!(Shakthi: The Power) has a lot of reasons to be one original rubbish. In the same time, it's one of the longest jokes ever made. So, laugh out loud, if only you can stand it!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Movie was chaos!","review":"Very dramatic. Irony in every scene. Ending was just laziness! All of Karisma's energy wasted. The little details were good and gave a good insight (like when husband was raising his hand too), but the director often kills it when deciding to go with a love or realistic story and completely changes direction. This movie receiving any stars is due to the acting or \"Ishq Kameena\" song, NOT the storyline. I loved the display of culture. Like many POORLY executed. Recommend similar movie Lajja over this, it deserves WAY more credit.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" You cannot dare to miss this film!","review":"What makes this film unique?Firstly it challenges the contemporary notions of Bollywood where the savior and the Messiah is only the male actor or actors, and alsow the notion that females have to be subservient to the male.This film however manages to flip to the other side of the coin and offers us a female protagonist! That is Nandini played brilliantly by Karishma.Contrasting her is this rural beast Narsimha played to perfection by Nana. The next best element is the rural setting that almost scares you even in broad daylight.Sanjay Kapoor gives in good support to the entire scenario and the chemistry between him and Karishma is mind blowing!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" It's just the same thing","review":"It's all lovey-dovey at the start with some beautiful visuals of Canada and you think you're stumbled unto a pretty decent Hindi show for once. Boy and girl get matched up by two popular comedians and in the space of a single song, they marry and have a child. Then when the husband sees footage of factional violence in his home state of Rajasthan, he gets all panicky, stumbling around like a madman trying to get a phone to work. His wife repeatedly asks him what's wrong and he tells her to be quiet. This is where you, as the viewer realise that the wife doesn't have a clue who her in-laws are or from where her own husband originates. Oh, for crying out loud....","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Silliness warning","review":"I can't say I truly liked this movie. However, I will start out with some good points, just to let you know I really tried to appreciate it. I was impressed by the use of color. Once the story moved locations into India, the ladies costumes exploded into a full rainbow array of silk beauty. Several times I noticed that the director had selected costume placement, tapestries and backdrop in order to maximize color arrangement, providing a very pleasing and artistic effect. There were some beautiful scenes where a lavish amount of jewelry was used to decorate the women. Particularly the leading actress, who in one particular scene had over 30 pounds of sparkling gold and diamond (cubic zirconium) dangling from every available node of her body. It was enough to satisfy the most particular of fetishes.The costume designer was apparently only able to dress the female actors. All the men wore plaid or t-shirts. LA gang-bangers would have really put them in there place in any fashion contest. I was not impressed. Even the leading male actor, who would have looked great in some nice authentic Indian colors, wore only a bluish-grey turtle neck in his most dressed up scenes.This movie was first and foremost a musical. With impromptu dancing springing up in the most exotic of locations. One such set was choreographed with a draped backdrop of beautiful Indian mountains and streams. One must overlook the fact that our curvy leading lady must have brought 10 changes of clothes along with her for the day, but then again don't try to look for anything past the thinnest veil of a plot in this flick. They danced around the Indian castle in the desert in another fine musical scene. Once again very beautiful, but it seemed to have little to do with the plot. The singer in this scene popped out of nowhere (apparently because he had no acting skills. as I noticed afterwards) and sang and danced. I had a distinct feeling that the movie was trying to say I should know who he was. A cameo completely lost on me, but I'm certain that he will be familiar to those in the know. The musical scenes where singly the best part of the movie. I found the music very nice, but I am not a knowledgeable fan of Indian music, so I suggest you check the soundtrack first if this is important to you.Some scenes were highly overdone. Like the continual close-ups of the leading lady. My companion and I counted well over 20 prolonged close-up on her eyes while some weird hypnotic sounds and chimes played. These jarring segues were unsettling at first, but became humorous as the movie played on. I felt as though the film was trying to mesmerize me with her eyes. Maybe it worked because I found her more and more attractive as the movie proceed (although I suspect it may have been the midriff revealing Indian costumes). Also, there was one particularly poor scene where the leading man was running across the desert to reach a jeep 10 feet away. His running was shot from about 20 different angles and he continued to get further and further away on each cut. I assume this was for some climatic effect, but it really didn't work.There seemed to be a fixation on blood sweat and tears throughout the movie. Primarily blood, which I believe was being used to eroticize some of the scenes. I found it had the opposite effect on me, but this may be a result of cultural differences. Also, you'll like this movie if you're into seeing men sweat. Particularly, in one of the musicals, there has to be about 40 topless men with glistening muscular bodies dancing around. This scene alone may be enough to interest some viewers.Even though I refuse to give plot hints away on principle alone, I would advice you to look elsewhere if you're after a deep and intricate story. It paralleled Woody Allen's bananas in depth and Godzilla in logic. Perhaps the thin plot allowed me to laugh a lot more, which was nice. The initial opening scene of a screaming women with blood on her face, put me on the edge of comfort and made me wonder what I was in for. Fortunately, the movie was much more light hearted. But now I'm breaking my promise. I'll give no more away.I have to confess that I didn't watch the whole movie. I know it's not fair to judge a movie without staying until completion, but it was a marathon. At 2:00 into the movie and during a major scene, the screen shattered and it said 'Break'. The movie continued, but I looked around and wondered out loud \"Was that the intermission?\" After 2:45 we snuck out, being careful not to disturb the other 4 audience members in the over 400 seating capacity theatre. I just knew it was going to be another hour or so, because there were too many holes to be filled in the plot. Or maybe it was about to end with a bunch of dangling questions. Either way I didn't lose any sleep wondering what might have happened next.In the end I had a real fun time. I can say that I will never forget this movie. I did laugh a lot. I would only have wonderful things to say about this movie if they'd work on the men's costumes, get a good script, higher a new film editor and get some better actors. Is that too much to ask? My advice is that you should see this movie if you are looking for something very different from the standard fare and this is the only Indian pop movie playing in your neighbourhood. Be warned that it is quite long and may be a bit of a marathon for some (bring a pillow and blanket for comfort.","imdb_rating":0,"our_rating":0,"algo_label":0}]