[{"heading":" Well made film with a social message and good actors","review":"\"Lal Salaam\" is an amazing motion picture because for an Indian mainstream film, it is very daring. It has a strong social message, some tough topics (abuse, rape), violence and no happy end! It has songs though (which are good but feel sort of strange in this kind of film), but they are probably all that connects it to your average Bollywood blockbuster.\nThe actors are very good. I especially liked the performance of Nandita Das as Rupi. Also, the direction is good. Some minor flaws in that department, but not many. Even the running time (130 minutes) fits the film perfectly. But there's one problem: I didn't dig for a second that all the government people would be so evil. Yes, there might be corruption in the government - but come on. This is too much. Just too much cliche. We're then led to sympathize with people fighting a democratic government. That gives me hard time.But that's a problem many Indian movies about terrorism have. The terrorists, their beliefs, their actions are often a bit fuzzy. Equally fuzzy as the film's view on the topic. It's not that bad in \"Lal Salaam\" but the diffuse politics sort of undermine the quality of the film. The film seems to take the viewpoint of Dr. Karna (who's closest to my own pacifist social democratic beliefs) but Karna never comes across as the most charismatic character. To make it short: I fully agree with the social message the film has, but the government-as-villain theme is cheap and in a way reminded me of the way Rambo treats his corrupt bureaucrats in \"Rambo II\".But that's a relatively small issue. Everything else in the film is actually done very well and even if I didn't believe the government-evilness, it perfectly fits the story. Without the evil government, there wouldn't even be a story, so I guess I can swallow it :)Rating 8/10","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" One of Nandita's Social Roles","review":"It is interesting that in 2002, Nandita made two movies where her character joins a rebel group. The other is Mani Ratnam's Kannathil Muthamittal where she joins the Tamil rebellion (mostly to find her husband who has disappeared). I wondered how this coincidence could have happened. Anyway, I almost totally agree with the preceding review. But until I live somewhere, I'm not going to be so bold as to infer that the movie is overstating the behavior of police or army. After all, India passed a law that exempts police and army from normal restraints when fighting in a zone of active rebellion. I think it would be absurd to guess that they behaved perfectly. Look at every other war. Looked at Wounded Knee in America. This is what soldiers do when fighting against rebels. Never seems to occur to them that justice is the best medicine against rebellions. So I wholeheartedly endorse this movie.","imdb_rating":8,"our_rating":0,"algo_label":0}]