[{"heading":" A movie good for kids.","review":"I am a big fan of Govinda's older movies, such as Saajan Chale Sasural, Radha Ka Sangam, Pyar Karke Dekho, so i am very familiar with the way Govinda acts. ~ But this was sort of a let down. I think there is a certain quality to a good actor when they can play a far from normal character and Govinda doesn't seem to pull it off. ~ First of all, in the first half the fact that he sounds a bit weird? i cringed every time he said something...and his whole \"Mera Ek Screw loose Hai, Baaki Sab tight Hain!' funny at the start but got weak. The other co stars, they seemed to pick up the useless acting too.~ The whole lot of them, Shakti Kapoor, Mohnish Baal (the guy who was in Hum Aapke Hain Koun, for god sakes!) even Kader Khan who was amazing in Coolie, seemed to look like idiots! ~ And the whole Po Po and Ko Ko or whatever it was during the Preity and Govinda scene was so annoying! i mean come on, I've seen better scenes in a children's program! ~ My only hope when i began watching this movie was that it would become a little bit better and it did, but only a small fraction. The second role when Govinda played a Qawali singer, made me smile...and Raveena Tandon seemed to bring a bit of life to this movie. ~ The songs were okay, out of the whole movie, the best song has to be Waah Tera Kya Kehna, when we are first introduced to Raveena and the 2nd Govinda. the rest are fairly moderate and the worst has to be I want money! with a film like that Govinda you aren't going to get much! ~ The only person who seemed to enjoy it out of my family and i, was my younger brother who was five at the time. and you can see why, its childish humour. its audience should have been targeted towards five years old, not adults. ~ So in short, If you want a Bollywood movie for your under tens then this is good...otherwise anyone over ten should bring a book with them to read whilst watching it, believe me it gets very boring!","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Not a very good movie","review":"The movie is a comedy plus drama. Govinda is in double role. Some scenes can make you smile by overall it is not a very good comedy. The songs are also dance numbers. One is \"I want money'. I have given it 5/10 points. If you are a Govinda fan, then watch this movie and if you donot like Govinda very much, then donot try it. Otherwise, you will be angry at the direction of the movie for 3 hours.","imdb_rating":6,"our_rating":0,"algo_label":0}]