[{"heading":" An Excellent 'Satirical' Black Comedy","review":"I recently had a re-watch of this hilarious flick. It's hard to categorize it in a specific genre. It could be viewed as a black comedy or as a dramady of the chawl culture and it can be seen as a parody of Bollywood films. Very enjoyable indeed. Manjrekar himself cleverly wrote the screenplay while Jha directs his first film. You'll be laughing a lot! As the title claims, the movie focuses on a chawl. It's sort of in the semi-documentary/semi-feature film format. Sushmita plays herself as the presenter of the documentary. Then there's another voice-over narrator. The film further focuses on the people living in the chawl. There's the hyper Ganpat (Vijay Raaj) who pretty much does nothing. There's a naive housewife Laxmi (Raveena Tandon) who's desperate to have a baby with her husband (Sanjay Navrekar), there's Mona, an aspiring actress (Namrata Shirodkar), Dulari (Divya Dutta) a working mother suffering a bad marriage with an alcoholic husband and a greedy mother-in-law, Suman (Rinke Khanna) a young tutor taking care of her traumatized father, Soundarya (Dia Mirza), an 'ugly' duckling who's rejected by every suitor, Sheela (Shweta Menon) a mother of two children and wife of an unemployed abusive husband and numerous other dwellers. While the main focus is on the lives of the women mentioned. We see them living their lives bravely and making the best out of them. In spite of their circumstances, the women are strong, hardworking, caring and they accept the way their life is. Then in contrast, we see most of the men who are lazy, waste their women's money on booze or anything else, beat their women, fool around etc. Yet, as I mentioned it is a satire and both men and women can easily enjoyed it. Everything is shown in good humour.Continuing with the plot, the owner of the chawl, Parvin Seth (Khedekar), wants to build a modern shopping complex and is desperate to take back the chawl. He tries to compromise with the inhabitants but in no way are they willing to leave. Seth makes different attempts (he even sends a hit-man) only to fail. Enters a researcher Aman Joshi (Aman Verma) and changes the life of the dwellers. They see new hope in him as he helps them with their difficulties. However, things aren't the way they seem.Jha directs the film brilliantly and skillfully spoofs it up without falling flat. The language is a little street and coarse (I think kids shouldn't watch this) definitely adds to the chawl lifestyle, the parody songs e.g. Chale Chalo (from Lagaan), Hum Bhi Hai Josh Mein (Josh) etc. are hilarious and fun to look at. The whole 'sati' sequence is another track that provides loads of laughter. I'll try not to say too much about the content as it's best if you discover the surprise by yourselves.All the performances are very good. To mention a few, Raveena Tandon is fantastic and plays her part with sheer ease in a very natural way (Mahima Chaudhry was the earlier choice for the part). Vijay Raaj, Aman Verma and Divya Dutta are excellent. Sanjay Navrekar is simply hilarious. Namrata Shirodkar does very well. Ditto for Rinke Khanna and Dia Mirza. This is probably Shweta Menon's best role to date and she does full justice to her part. Sushmita Sen shines with her contagious laughter. Sachin Khedekar is good.On a more serious note, the film does help us to appreciate the chawl dwellers. Known as middle class people, they are the hard workers, they're the ones who keep the country going, who vote, who suffer the most during conflicts e.g. political, they're the ones who sacrifice, they are strong, they are brave, and to say the least, they are survivors. Thanks to Jha and Manjrekar for making this film and giving us a relevant message through laughter.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Starts slow but gets better","review":"This movie began in such a terrible way that I almost turned it off after 10 minutes but I stuck with it and it got considerably better. There are some inspired bits of comedy to go along with some fairly pointy comments on the rights of women, Hindi-Muslim relations and corrupt human beings. It is a bit schizophrenic in the way that it seesaws from absurdist comedy to ultra serious drama in a matter of seconds. This is not a great movie but if you are looking for something where you won't have to think a lot, this will work for a couple of hours of entertainment. Overall I thought the cast did a good job with the material they were given to work with. 6/10","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Tries too hard, but fails miserably","review":"This movie didn't have too bad of a script going for it, but it just couldn't rise up to be an intelligent movie.It poked fun at a few movies and the movie industry for not producing \"hit\" movies, but it made fun of all the cliches like slo-mo running by the \"hero-heroine\", but making fun of slo-mo running itself is a cliche now.The preaching done by the voice-overs and the characters is too heavy. The sarcasm loses it's effect just because it is explained in words right after it is show on screen. No subtle sarcasm of the \"Jaane Bhi Do Yaaron\" types.The Sikh-Muslim unity characters were no better than any sampradayik ekta cliche we have seen over and over and again and again.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" A very smart comedy","review":"I caught this movie on the Dish and was pleasantly surprised. Very pleasantly surprised. This movie is the best satire commentary I have ever seen. The pace is fast, the acting is very good and the dialogues are to die for. To really enjoy the punch you would have to be very well acquainted with the masala Hindi movies and their masalas.","imdb_rating":7,"our_rating":0,"algo_label":0}]