[{"heading":" What Will You Do If Every Girl You Like Ditches You...","review":"I think this movie has got a very low rating. Choreography and filming locations of this movie are excellent. The movie has the story that actually happens in real life these days. With girls often ditching boys for no good reasons. Its a nice film to watch with friends, family or with anyone! Very good movie. Shahid's acting is good, actresses are fine too but could have been better. Some songs like \"Aisa Deewana\" and \"Maine Chunn Liya\" are really top class. Music is good. I started watching this movie and watched it completely in one go. Movie story is just sweet and simple. It has got low rating (5.4/10) but don't we need sometimes just sweet and simple stories?Nice one!Overall 8/10 thanx vipin","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" which one will he end up with?","review":"The film begins with him being in love with Neha (Soha Ali Khan), his girlfriend of four years. Neha, an ambitious girl, leaves their village, Samarpur, to come to Mumbai to become an air hostess. Nikhil follows her to Mumbai to bring her back. But He does not succeed. As luck would have it, he lands himself a job in a music store exactly opposite the institute where Soha is training. He keeps trying to convince her but there is only rejection for the lover boy. He ends up falling in love with his colleague Sarah (Tulip Joshi), but does she really love him?...It is the story of Nikhil Mathur's (Shahid Kapoor) quest for true love. His passion in life is his village Samarpur, and football. He is desperate to fall in love with one woman but ends up with three women in his arms ready to swear undying love for him.A great movie, very colourful and joyful. Entertaining most of the runtime, very good acting from the head characters especially. Dil Maange More\" isn't great cinema. But it's funny, sassy, sweet, tender and intelligent. That's a lot more than what we get in most cheesy love stories","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Gulshan Grover is great & story is interesting. Light, romantic, fun.","review":"I'd give the movie a 7/10 for entertainment value. Since the hero is new and not well known, I was reluctant to watch the DVD. After a few months I did and I'm glad.No one mentioned Gulshan Grover! He provides great comedy and charm in the movie and sets the stage for how all the main actors interact with each other. This is one of my favorite performances by Gulshan Grover and a must see for his fans! This role may be more low key and not as flamboyant as his big movies where he's the villain but he gives the best performance in the entire film.There is a particular scene with a Mohd. Rafi song - great song and tribute. That itself made the scene very romantic - my favorite scene of the movie.In comparison to many Hindi movies - the plot in this one isn't so bad. Actually, I praise it for having a realistic component unlike many movies where the heroine gives up everything for love. In this film, does she or does she not? It isn't so predictable.I don't think there was copying of SRK by Shahid Kapur. Actors do some things in common. In a sad scene, all actors are frowning (not smiling). That is the kind of similarity I would say the two have - a fundamental one. Although I do agree that he tried to pick up a few thins from Tom Cruise but no matter.It was good entertainment.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Yah Dil REALLY Maange More","review":"welcome all you guys to the world of New Bollywood. this what the director told us before the release of the film. He said that now directors are focusing on details. Now we have a so-so film DMM. OK first first. This film is good. not a time-pass and not even a blockbuster. Shahid has done a good teen stuff acting. All heroines are good too especially Ayesha. This is 1st film of Soha Ali and sadly she has done a bad job. The film plot revolves around Shahid who always land up in wrong situations at a right time. His first girl friend leaves him for a career. Second get a new bf. Third......hmmm she accepts him. but have to go through a lot turmoil seeing he also sees other two. All wells that end's well. Go and Watch It!","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Wacky film","review":"This is one of those movies that is so stupid that it leaves you laughing the entire time. I'll admit that there were a few funny parts. What's nice about this movie is that it maintains a light-hearted atmosphere. There is no unnecessary drama. Songs are nice. Shahid Kapoor sure has some good dancing skills. But the story! The story seems like it was written in 15 minutes while the writer was drunk! Towards the end of the movie, I was like, This move is completely ridiculous. Then came the climax. This movie has the most hotchpotch climax I have ever seen. It was so weird I burst out with laughter. Strangely enough, this movie is an enjoyable experience just because it's so dumb.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" Could be better but okay","review":"Anant Mahadevan tried out a love triangle of sorts here The film isn't a bad one though nothing newThe film starts with Shahid and Soha love story which is nothing great and even the chemistry and Soha's talent(for her debut) is missingThe scenes between Gulshan and Shahid are fabulous while the Ayesha- Shahid story is fun first but gets predictable and boring laterShahid and Tulip Joshi story is also thanda he problem is that the film looses ground in 2nd half and the climax is too stupidDirection is ordinary Music is okay though too many songsAmongst actors Shahid I often accused earlier of being a SRK wannabe is good in his part, he shares a good chemistry with Ayesha Takia and does well though he often apes SRK which can't be hidden Ayesha steals the show here though she got boring later doing the same stuff here she did a great job Soha is teakwood for her debut, thank god she improved with RDB while Tulip is nothing great Gulshan Grover is fun to watch as A R REHMAN","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" entertaining, a better story line would have helped","review":"I think the hero looks a lot like tom cruise or at least he has spent enough time practising to walk and make expresssions like him ~ anyway, wish it had a better storyline but I think its pretty good given that I could watch it in one sitting without shutting it off. The songs are great but the plot/climax should have been a little better. I am giving it a 8 since I think it served the purpose of being entertainment enough.Overall, excellent songs, dance, lots of fun, lacks a good story, bad climax.Rajesh","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Shahid the Shahrukh Khan wannabe","review":"After watching Shahid Kapoors first film Ishq Vishk. I thought to myself who is this Shahrukh Khan wannabee. He tries to copy everything about Shahrukh Khan. Hairstyle, body language, Face expressions and tries to do the innocence that Shahrukh Khan does to imprees the girls. Anyway moving on to the film Dil Maange More is a little bit of a childish fairy tail love story. Boy love girl 1, Girl 1 not serious about him, Girl 1 chooses career and leaves him. Girl 2 is his colleague, she uses and abuses him to make her ex jealous. Boy is heartbroken again till he meets Girl 3. He finds out that girl 3 loves him, so he goes out with her. Suddenly Girl 1 comes back claiming too love him. Even Girl 2 tells him that she loves him. In the end, he goes with true love, which is ever so predictable. Shahid's performance is an imitation of Shah Rukh Khan, so i will say not original but poor. Soha Ali Khan gives a average performance as a unusual stupid character. Tulip Joshi gives a crap performance with a weak character. Ayesha is the prettiest out of the girls and gives the best acting out of them all. Overall, not too bad, not Good but just below Average","imdb_rating":4,"our_rating":0,"algo_label":0}]