[{"heading":" A good family comedy.","review":"Well, what can I say. Hero No. 1, Govinda, has done it yet once again. With a long list of hit comedies behind him he has just added this lastest movie to that list.Ankhiyon Se Goli Maare is a comedy about a father(Kader Khan) who wants his daughter(Raveena Tandon) to marry a ganster. But she is already in love with Govinda who is a really straight guy. So now if Govinda wants to save his love, he'll have to impress Kader Khan by becoming a gangster. And so does the laughter begins as Govinda sets out to save his love.With lots of great one-liners and quick dialogues by Govinda, this movie is going to be halirious and a big hit for every Hindi movie lover.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Typical Govinda nonsense","review":"If you like Govinda, go ahead and see this film. If you are not, and think that his acting is silly/melodramatic, then don't bother with this movie. A goon (Kader Khan) wants his daughter to only marry a goon (he must know all the perks of the job, so wants his future son-in-law to be from the business). A rich boy (ie, Govinda) loves this goon's daughter (surprise, surprise), and is willing to do anything to marry her. So, he tries to become a goon, and succeeds handsomely. Raveena Tandon's presence seems almost incidental to the whole plot. Govinda's acting is as silly as ever. The dialog is cheap, ridiculous and frivolous. Govinda's 'costumes' are as colorful as usual. The story is so far-fetched that it does not merit much attention - the ONLY reason to watch this film is if you like Govinda.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Timepass!","review":"You will like this movie- if you watch it as a nonsensical over the top comedy!Govinda had probably began to lose his touch a bit around this time. This movie was among the several flops he had delivered in those couple of years.However, if you watch the movie now, he is just being the zany, crazy spontaneous self. His act as \"Bhopadiya dada\" (what a name!) is stuff of legends. It can't be scripted. It is pure ad-libbing!Raveena is having fun. She is graceful and looks good overall and is sincere wherever the plot demands it.Kader Khan is good form is both the roles. Shakti Kapoor and Johny Lever play their usual crazy parts. But it is Razzak Khan as 'Faiyyaz Takkar pahalwan' who takes the spotlight! He specialized in crazy cameos and this one, especially in the company of Govinda, stood out!Overall, a good movie for a lazy afternoon/evening!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A dud","review":"After 2000 Govinda begin to lose his mantra of success, In 2000 he gave 5-6 flops, In 2001 too except Jodi No.1 all films flopped, Ankhiyon Se Goli Maare is from the same team who gave us Dulhe Raja in 1998 However this time the film turned into a dud. The comedy fails to make you laugh, First of all it's hard to digest that a Goon will search a goon for his girl Govinda's act where he acts like a DON gets irritating however, Also several scenes take the term cinematic liberty to another level and crosses ideocracy.Direction by Harmesh Malhotra is outdated, This was his last film and died few years back Music too gives a dated feelGovinda plays his part well as usual however his gunda act is irritating, and also age shows on him, Raveena does her usual act Kader Khan is good in both the roles, rest are typical Johny Lever has his moments, Shakti Kapoor annoys Avtar Gill and Rana Jung bahadur are as usual","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" very nice old movie","review":"In the era of illogical comedy movies, you can watch this movie an feel refreshed, Jonny Lever, Kader khan, Govinda all the actors have acted well.","imdb_rating":10,"our_rating":0,"algo_label":0}]