[{"heading":" A good comedy with nice action!!","review":"It is a good comedy movie. Of course the action scenes have been stolen from Hollywood movies, but seems good in the movie. At least it was an Indian movie with crisp action scenes. And Akshay really suits the action scenes pretty well. But the main power of the movie is its sense of comedy. All the actors have done a commendable job in comedy. Undoubtedly Paresh Rawal was best of the lot by playing a short memories person. There is not much in the plot but whatever it is, has been executed pretty well. However they could have done with some original ideas for action scenes as they were already spending a good amount on shooting those scenes. Even the climax of the movie was fine. If possible, they can come with a good sequel to the movie!!!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A funny rehash","review":"APD starts off as a 'Been there, Seen that' yawn of a movie. In true Bollywood style, it rehashes Action from 'The Matrix' and a plot more than loosely based on 'The Whole Nine Yards'. Akshay Kumar, who is slowly establishing himself as an actor par excellence with every movie he signs makes one wonder why he is doing the same thing again, especially when you see how lame the action looks in the context. But then, about half an hour into the movie, something happens that has one rivetted to their seat for the next two hours. Paresh Rawal enters. The more said about him, the better it gets. the bellyaching laughs start and don't stop, even if you try your best. And what's more amazing is that his singular joke in the movie never gets old. Such is the explosive talent of this fine actor. There is a myriad of characters to keep you laughing, one kookier than the rest.Akshay is good as the Serious, no nonsense don who can't help but work with the army of misfits surrounding him. Suneil Shetty, in the smallest role of the film manages to come across as very funny as the man who forgets simple words. Johnny Lever as the stammering sidekick with a short fuse is hilarious, especially in his one 2 one's with Rawal. Aftab Shivdasani carries the part of a henpecked Husband with conviction.Supriya is great as Paresh Rawal's menacing wife. Out of the three leading women, Aarti Chabria has the best role, but pity she is not as good an actress as is needed to carry it off.And finally, Paresh Rawal... funny to the hilt, his innocent, miserable husband who cannot remember names is simply fantastic.All in all, a film definitely worth watching. Highlight of the film - EVERY SCENE WITH PARESH RAWAL IN IT.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Amazing Comedy","review":"This is one of the most hilarious comic produces of Bollywood.Most people are apt to label it run of the mill stuff that Bollywood churns out mindlessly(yes..accepted..this is mindless..but you have to watch johny lever and Paresh Rawal in this one)..The movie is a slight offshoot(a euphemism of course) of the whole nine yards.Aftab Shivdasani,Akshay Kumar and Sunil Shetty are their usual selves.Drab and forgetful.They are there for the usual stuff.Getting paid and strutting around irritating viewers.Now cut to Chota Chatri and Paresh Rawal.Awesome is the word.You have to watch the histrionics of Johny Lever especially.This is one of the very very rare Hindi movies where I actually laughed out aloud.Especially with Johny Levers comic antics.Please don't miss this one is all I can say.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Great Movie!!!!","review":"The movie was great there were a few flaws such as the fight scene at the beginning of the movie it was so long, and there was no use for it they were trying to make it look like the scenes from the movie \"Crouching Tiger Hidden Dragon,\" but it went totally wrong it looked really fake. The role of Paresh Rawal was my favorite, in every scene he was in was great I couldn't stop laughing because of his innocence in the movie. Overall I give it a 9/10 rating, the movie was one of the greatest since \"Hera Pheri\". If you haven't seen it I suggest you go watch it you won't be disappointed.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" good movie","review":"this movie is good.I really liked the comedy akshay does a good job in 1 scene where he hugs the girl and tries to get emotional he sucks he was not good in that ,i think story could have been better action scenes were copied but still looks cool. Shahid did a okay jab and casting of rimi sen was completely wrong although i am not saying she's ugly but she's not that pretty that so many men can fall in love with her at the same time some other heroine should have been selected for this role but otherwise this is a LOL movie. You can watch this movie for timepass and if you are an akshay kumar fan like me then you will just love him in this movie. go watch it.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Cool fun","review":"AWARA PAAGAL DEEWANA was Vikram Bhatt's first multi starrer The film had Akshay, Suneil and Paresh together again after HERA PHERI The movie is based on THE WHOLE NINE YARDS(2000) and it's quite funnyIt starts off okay, Om Puri's monologue is funny but the fun actually starts when Paresh enters the frame and then the comedy starts which is damn funnyThe bickering of Surpiya, Amrita are funny too and also the scenes between Akshay, Aftab and Paresh and then between Suneil, Johny, Paresh, AftabThe interval point is a surprise part The first half is a bit too lengthy thoughThe second half has too many sub plots like the romance part plus the songs and also the overall length plus the confusion about the lookalikes which takes the impact away Yet it is watchable especially the entire bickering between the gang and the climax is stretched too much and the film seems never ending and the finale could be betterDirection by Vikram Bhatt is good for most parts Music is okayCinematography is great while Stunts by Philips Ko and Abbas Ali Moghul though inspired from MATRIX were different those days though many are too similar to THE MATRIX and seem tepid compared to themAkshay Kumar excels in his serious gang lord kinda role which he should do now as he is mostly doing nonsense comic roles Suneil Shetty comes across as a poor third here and is funny only in places Aftab seems too kiddish in his part and annoys Paresh steals the show, his mere presence instills life and is one of the best part of the film Surpiya is funny too Amrita Arora, Aarthi Chabria and Preeti are horrible, Preeti is wooden while Amrita Arora and Aarthi irritate with their overacting Johny is hilarious and not too loud Rahul Dev is as usual Asrani, Om Puri are forgotten by the time the film ends","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Great action - comedy","review":"Wonderful , stupendous , piece for genre of action- comedy","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" comic relief","review":"this rotten film has one of the funniest scenes i have ever seen in a hindi film. the silly hero (aftab) is telling some even sillier heroine about his love for her, and a gangster (johnny lever) thinks that aftab is coming out of the closet and declaring his love for him. makes the entire film, including the ludicrous special effects (NO, it is not cheesy enough to be good!) worth watching.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Just partly copied","review":"All in all, it was a funny movie. The main, basic idea may have been of the movie \"The Whole 9 Yards\" but a lot of ideas were original. Sometimes it became a little boring, but always made it up for it this way or that way. It is an entertaining movie for the whole family.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Awara Pagal Deewana: A treat for Akshay Kumar's Fans.","review":"Released in 2002 and one of the highest grossing Indian film of that year. APD is a good action- comedy but only for Akshay's fans.Some people said this movie was a straight copy of Bruce Willis's \"The Whole Nine Yards\". But that was partially true because the original movie had many vulgar scenes and this flick was a clean comedy.I have seen this film in 2005 on TV since then I've watched it many time.Akshay,Suniel and Paresh was awesome. Songs were the weakest part of this film.Johnny Lever and Aftab both were likable.Action scenes were copied but slick and cool.All in all APD is an entertainment package that comes with lots of thrills.My rating ***1/2 out of 5.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" corny movie(except Paresh Rawal and Johnny Lever)","review":"This movie tries to set a mark on the Indian film industry by over-doing action scenes. But unfortunately it fails. The story straightly ripped off from The Whole Nine Yards and the action stolen from The Matrix. The only thing significant about this movie is the comedy done by Paresh Rawal and Johnny Lever...this was the only reason why I kept watching the movie. The movie is extremely stupid you should forward to scenes of Paresh Rawal and Johnny Lever. Maybe the movie is so horribly awful because the director lost interest in the film while shooting.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Shameful...Shameful...Shameful","review":"One of the most ridiculous movies to have been made in WORLD it copies stunts from \"the matrix\"(that too very poorly)& has ripped off the story from \"the whole nine yards\"whoever made this movie has put a blot on already not so glorious record of originality of bollywood....down with these fakers :-(only thing to look out for is some funny acts by Jhonny lever but this movie altogether is just a bad taste in the mouth...except for people with horrible taste in movies...to all non-indians please don't judge Indian movies according to this piece of trash... movie is entirely forgettable!!!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Probably one of the worst movies I have ever seen","review":"A movie that is truly a blemish on Bollywood. I saw it on the next day I saw \"Gulaam\" on TV. I kept wondering as to what prompted Vikram Bhatt to make a movie that made no sense at all. The opening sequence are straight rip-off from \"Matrix\" and \"Crouching Tiger....\". Once that is over, the picture takes turn for worse. The story line makes no sense, none of the actors seems to committed to the movie, comedy is crude and vulgar, music is torture to ears, and one can't help shutting of the VCR. I wonder what trash is imposed these days in name of entertainment.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Why?! Oh why did I have to watch this movie?!","review":"I've grown up watching Indian movies all my life and as such have learnt to accept that most of the time you have to take them with a whole bag of salt and not just a pinch. But for movies like this one, all the salt in the world doesn't prove to be enough! The plot is just plain weird, the acting is insanely cheesy, and the special effects are even cheesier and complete rip-offs from the Matrix, Mission Impossible 2 and Crouching Tiger Hidden Dragon. Ripping off action sequences or plot ideas from Hollywood movies is not something new to Bollywood but c'mon! There was no originality whatsoever to that whole action sequence performed by Akshay Kumar after (WARNING: SPOILER AHEAD) he kills the Home Minister! What was the director trying to prove?! That Bollywood is really good at ripping off an action sequence from a movie that is so well known that just copying it in another movie loses all the charm for watching the sequence?!!Where have all the good Indian movies gone?! Or have I just become too old to watch Indian movies anymore? I've been in America for the last four years and as such haven't watched hardly any Indian movies since but the few I have seen have left me disappointed. Even the ones which were more watchable than the rest were just terrible compared to American movies. The stories are so unrealistic and unbelievable and the acting by so many of the so-called \"good\" actors is just barely edible. No thought is given to the audience's intelligence when penning the script; and the strange thing is that this is probably not that much of a problem because most of the poor and uneducated masses in India lap it up!When will the insanity end?!","imdb_rating":0,"our_rating":0,"algo_label":0}]