[{"heading":" Fine, just one small issue!","review":"Karz has lots of action, and it is a typical revenge story. This is fine, and Sunny Deol goes perfect in action; Sunil Shetty does well. Only one small problem is in the very last scene. When Sunny jumps into a train car and kicks the main baddie, Ashutosh Rana (psycho villain and coward), Sunny is suddenly shot thrice, but then he bounces back and brutally bashes the baddie to death; surprisingly, the 'dhai kilo ka haath' was enough to kill the baddie! Now to be honest, Sunny's character unwittingly dies, which kind of makes the ending a little abrupt. This part makes no sense, and it is unfair to Sunny, because his character is one that fights too much to get his life straight, and he deserves the right to a newer and better and happier life, and NOT die. Only this aspect chops off 1 pt. from this vote. This kind of reminds me of Jeet in this regard. Having said that, just like Jeet (Sunny as main hero with a 2nd fiddle and heroine; also seen here), Karz also could have easily done without Sunny's character dying because tragic endings are NOT well-received, and they do NOT fit the story, unless the hero was a famous martyr. Another thing, the good cop, who was helping Sunny, was NOT even in the climax. Where was he? He should have been there! Anyways, the movie is NOT bad or anything, just avoid tragic endings! Johnny Lever in the 1st half is funny!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Incredible Acting by the Duo.","review":"Two actors that stand out are Aushotosh Rana and Kiron Kher. I personally think this is one of the best acting by Kher only should be seen to be believed. Rana who gave some fantastic perf. in \"Raaz\" is just phenomenal. It is sad that there acting is wasted in a little known movie with Sunny Deol who is his usual self here. In the beginning he is a drunk singing inconsequential tunes in a fetal position and somewhere in the latter half he realises that this is not good for his image and sobers up to some Dishum-Dishum fights to the pleasure of the front bencher's who never seem to get enough of this. The movie should be seen just to appreciate Rana and Kher.","imdb_rating":0,"our_rating":0,"algo_label":0}]