[{"heading":" Good comic Moments","review":"Let me tell you first the story line is old, and hence the movie was not a hit. But its one of my favorite movie Ever, Bcoz 1st half is a good comic one, specially the scenes of Lucky(Menon) and Anil too do a good job as a Comedian, then we have Ghummar Singh(none other than Kader Khan) as a Singer, few awesome jokes, good direction, everything is right in 1st half, it makes u laugh a lot. A complete family entertainment. 2nd half is again a good one but not as comic as the 1st one, but here you all like the superb acting of Anil Kapoor, he does his best as a heartbroken Lover, do his all efforts 2 c her love happy. And a superb Acting, Anil kapoor is the best actor, he proves in this movie too, Satish is a good Director, his all movies starts with comic factors and ends up with emotion, Shilpa is too good, Florence is also good from her side, But Sunil Menon does a good job. Music is awesome. Please watch this flick as its a good one.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" 2 Movies. One is Great. And One isn't !","review":"At first, I fell in love with it. This is some movie with super comic dialogue. OH MY GOD, when I watched the scene of (Kader Khan) as bad singer who people prefer to commit suicide instead of hearing him.. I guffawed like crazy. For me, this is not only rare to happen in front of an Indian movie, but in front of a movie. The pace is hot. The characters are catchy. And the main conflict is so lovely and original; seeming like a smart mix of (Romeo & Juliet) and (For a Fist full of Dollars - 1964). After a while, the female lead appeared with many questions about her true identity. Then we were hit by such a twist that changed the whole thing and made it even more attractive. At that point, I said to myself WAW! This is a great movie already. BUT nothing is completely perfect. Because after that, I experienced another movie, TOTALLY another one, with another story, characters and songs!The thing about this second movie is its naive and dry feel. Moreover, being a provocative flashback that crippled the main, more powerful, story for quite sometime. Let alone that its connection with the first movie was too fabricated. So it got nothing to do with the story, or the quality, of what we were watching. I bet that they hired 2 guys to write. I bet that they wanted to show off the good make-up. I bet that (Anil Kapoor) loved the idea of acting as a fat person. And I bet that everyone watched that LONG sequence hated it as much as me!After the end of this movie-within-the-movie, we came back gladly to our fast-paced and funny original one. But disappointingly the problem of re-gathering the 2 quarreling families was solved so fast. It's very good comedy, with unmistakable message about love and how it solves everything. However, it didn't entertain us with more details. Plus how the other movie thing was so heavy and detached apart. For instance, what was the need for the character of the screenwriter at all??!!Anyway, the directing handled the job with liveliness and sensitiveness. The cadres were filled up with romantic sense, and the image was surrounded with endless colorful flowers all the time; that made the movie brighter than a children story book. So there were some moments that made me in my ultimate relaxation zone; namely a state of mind that cheers me up to the max. (Amrish Puri), one of the main villains in the Indian cinema during 3 decades, assured through being the kind grandfather that he was a man with a 1000 faces indeed. (Kader Khan) amazed me, but as a comedian this time, with immortal line: \"Who got to make you sad?! I'll SING for such a person!\". And I must refer to the last shot in which the lead leaves without marrying the heroine. Ahhh, at last, an end that breaks the ever-eternal rule where the lead must marry the heroine even if he had no time to love her. Way to go!Finally, it's like great / shoddy / less-great mishmash. I believe it needed another treatment to be one, really great, movie.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" One of my all time favourite!!","review":"This movie is simply a gem. Different story,great performances specially by Anil Kapoor.Story of true love with a massive twist. I will recommend this movie to anyone and everyone and it has something for everything drama, action, comedy and romance. A perfect blend of everything.Don't miss it!!","imdb_rating":9,"our_rating":0,"algo_label":0}]