[{"heading":" Arjun shines in a role that was made for him","review":"I have to start off by saying that i agree with the entire population when they say that the only good thing about Pyaar Ishq Aur Mohabbat was Arjun Rampal's performance.  I also have to add that i have been a fan from that moment on.  Deewanapan was a very interesting movie for me to watch.  It was not really an excellent movie, the plot has been done a thousand times before, and the music is average.  The direction was good though but Arjun carries the entire movie on his shoulders.After a typical bollywood opening to the movie, the pace picks up and Arjun just gets better and better.  After seeing this movie i believe that he can play a villan equally as well as a romantic lead.  The way he changes his facial expressions in some scenes and then be someone totally different in another was great.  His female lead was a bit weak though, but she improves as the movie progressess.  The fight scenes are superb and i applaud Arjun's efforts.  Anyone who says that this supermodel, turned actor cannot act, has to see this movie and revise that opinion.Arjun is a definite star of the future.  His popularity is already growing, so watch out Hrithik, i see a storm ahead!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Arjun in a role that confuses action hero with romeo!","review":"I hated the way they made him vamp out like the incredible hulk in the culminating scenes. It was just weird for a film that is supposed to be about a couple falling in love and weathering the storm. Arjun Rampal is the guy obviously and Diya Mirza plays the girl he falls in love with while she is on holiday in Switzerland. Yup, those Bollies sure love Europe don't they? Anyways, her family is against the match and make the lives of Rampal's family members a living hell in the process. The whole film plays out like a soap-opera of \"hey, what are they going to do to them next\" type thing which gets tired after a bit. But if you're a girl, the script could be that tacky and lame but you would enjoy the eye candy that Rampal never fails to provide. LOL! :D","imdb_rating":7,"our_rating":0,"algo_label":0}]