[{"heading":" Still njoying!","review":"I've seen this movie umpteen times.But i still njoy the tricks used by our hero sunny deol to vanish the wrongdoers. script is wondrful in all respects incl. story,screenplay and dialogues.Story is truly wonderful.Screenplay is quite good to make u sit and njoy for 3 hrs.Dialogues mouthed by sunny deol r good enough to give boost to our testo level. Performancewise its sunny deol's show all the way.Denny is as always remarkable as main villain.other actors support well. Songs lacks chartbuster quality but r otherwise hummable.\"Hum chalein\" song appearing in background is soulful. Direction is good. Action scenes are enjoyable. The one and only department in which the film falters is cinematography which is just okay enough to capture,the director's take , on celluloid. BUT still enjoyed its other aspects.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Good film","review":"Hi my name is AARON I am writing this masterpiece movie review This was superb there was lots of good action scenes from this blockbuster film Sunny Deol is superb as the hero shilpa is brilliant they make a great pair in the film Mukesh Rishi was superb as the villain Danny did brilliant in his negative role Songs are splendid rajat bedi is good shakti is brilliant other were excellent performances My rating 8/10 or 4/5 ********\\********** or ****\\*****","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Great action movie!","review":"Indian is truly one of Sunny Deol's best action movies ever, as he shows more patriotism again, but here, he is a tough and clever cop (modern version of Chandrashekhar Azad). He nabs a terrorist, figures out the treacherous games, and one by one, he finishes the baddies. This movie is NOT at all anti-Pak as some believe as they did NOT understand the real essence of the film. However, the film exploits corruption in India itself in police, rich people, etc. who would stoop down so low to be traitors for money by helping terrorists. If more Indian cops were like Rajshekhar Azad (Sunny Deol), then corruption would be so much less. Our Jat hero goes beyond limits to save the country from deadly attacks and is honored by all good. Watch this film with an open mind, and you will like it. This is another personal favorite of mine, and even today, I still love this action movie. Sunny, you rock! Hindustan Zindabad! Jai Hind! Maa Tujhe Salaam! I loved the scene where he saves his 4 sidekicks from the baddies by bashing so many goons at once and also when he roars about being Indian after killing the terrorist. 15/10!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Sunny Deol typical film","review":"Sunny Deol was a huge crowdpuller in 1990s after Ghayal, Damini and then came a time fatigue set in his films, with every film having the same story, same action scenes post late 90s his films started flopping but suddenly he got a blockbuster Gadar Indian released few months later and managed to be an average hit What is different in Indian that we have not seen before? Nothing actually Here too Sunny middle aged(in his 40s) plays a DCP who runs after terrorist The first half also has him romance Shilpa Shetty who is in the film only for that and some cries. He also has some followers like Sanjay Narvekar who treat him like God and in the second half we have Danny making an entry and there are some good scenes between them but other then that the film is the same Sunny film With long dialogues, some funny scenes where Sunny informs a theatre about a bomb, slaps a bus conductor to have a strike and in the end saves the country by difusing a bomb in a climax reminding you of SPEEDDirection by N Maharajan is good, the film was a remake of a Tamil film but is given full Sunny Treatment Music is okay, Deewana stands out, while Thaat Nawabi is okay rest are forgettableSunny Deol does his usual act and is good but nothing new Danny is superb in a done to death role Shilpa as I said dances, cries and thatz it Sanjay Narvekar and rest are okay, Rajat Bedi is teakwood Rahul Dev has a brief role, Shakti Kapoor is okay Raj Babbar has a very small role to speak of, Reema Lagoo is as usual","imdb_rating":4,"our_rating":0,"algo_label":0}]