[{"heading":" Impressively and decently made horror film!","review":"Ram Gopal Varma has always been a favourite, and Bhoot is his most intense attempt at horror. I was previously blown away by his little tiny piece \"Kaun?\", and expected to see something intriguing this time as well. I was not disappointed. The film is interesting and captivating and it flows brilliantly. What I particularly appreciated about it is the lack of simplification, which sets it aside from all the mindless horror films which have no purpose or reason, and you will discover it towards the end. However, I would still not call Bhoot a horror film - because it wasn't really scary. I think it is best described as a very effective and chilling suspense thriller. Cinematography, background score, editing are aspects which contribute to it very well. Urmila Matondkar plays Swati, a ghost-possessed woman whose husband does not know what to do to save her. Matondkar is indescribably brilliant - this is one of the most difficult roles to play and somehow Matondkar seems to do it with total ease and unsettling intensity. This is an exceptional impulsive performance. Ajay Devgan is very believable as the helpless Vishal who loves his life but is also quite terrified of her. Devgan displays both fear, worry, love and concern convincingly. The film has many appearances by different famous actors, most of whom are portrayed as somewhat emotionally disturbed. Seema Biswas is wonderful as the strange, shady and very disturbing housemaid. Rekha is also fantastic as the mysterious exorcist. Other cast members, including Nana Patekar, Victor Banerjee and Tanuja, are great, while Fardeen Khan is unfortunately not up to the mark. Do watch Bhoot. Regardless of how scared you may or may not be, it is an entertaining picture.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" It's creepy alright!","review":"This movie definitely has a very creepy setting. What works on you is that its not a haunted mansion setting, but a local apartment in Mumbai, one which you could be renting right now. Add some creepy looking doll and eerie music, you're most likely going to grab the next person sitting next to you and cry to be released. But! this intense thriller, horror remains only in the first half of the movie. The second half, although I'm not going to make any specific remarks, ( want you to find out for yourself) tries to remake some of the earlier Hollywood movies and it sort of takes your attention off of the whole movie. That's when the movie's originality begins to slide and fail.They should have done something different, but most horror genres have this habit of screwing up some portion of the movie. But let me warn you, this movie is certainly NOT for kids. If you cannot withstand watching supernatural horror, please don't watch this one, it might really grip you tight for a few weeks, or even months maybe!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" great horror flick after a long time","review":"hail Ram gopal verma.the true master of horror genre movies in recent times. i saw this movie in Dubai in an multiplex. the background score is an character in itself which propels the movie to greater heights.some may find this remark awry but i feel that the background score is the spinal cord for a horror movie.an ensemble of great acting talents of the likes of Nana,Rekha,Tanuja,Ajay & finally Urmila.lets not talk about Fardeen.great editing,cinematography add to the haunting mood of the film.overall an classic product from RGV's factory.don't miss it.greatly recommended but certainly not for the faint hearted.watch it in an multiplex and then u will realize what i meant.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Ok, I was scared.","review":"Which about sums it up. For all the talk of songless-ness and being different and reinventing the genre (if remaking it in the standard Hollywood mode can be called reinvention; perhaps 'rescuing it from the Ramseys and the white-sari-clad woman with a blood-streaked face' is more appropriate) - all of which were true - what mattered in the end was whether this film could sustain the tension and make you empathise with the characters. And it did. The background score is really effective; camerawork is creative; the leads act flawlessly; there's a liberal sprinkling of red herrings, the characters are believable, and we're spared the quasi-religious mumbo-jumbo that mars so many films in this genre. While making a horror film is inherently a derivative process, Bhoot manages to avoid seeming cliched, both by the standards of Hindi filmdom (okay, that's not hard - the absence of either a dak bangla or a kabristan, as well as the aforementioned white sari, pretty much ensures that) as well as, to a lesser extent, Hollywood (which it is closer to in 'spirit'). Not by any means a pathbreaking film, but a very well-made one nonetheless. Excellent!   Go watch it!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A great thriller/horror flick from bollywood in a long long while","review":"The movie greatly benefits from excellent direction and the pacing is great. One is always on tenterhooks and many a times the viewer gasps or mayhaps even lets out a small scream.After a long wait, the Indian horror movie segment has come out with a real gem of a movie. Gone are the plastic rubberised masks of yesteryears and this movie plays on the psyche of the people. Fear is generated not through visual aids and props but rather through ideas and the thought processes of people.All in all an excellent offering.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the most popular BOLLYWOOD horror films ever made","review":"Not being a huge fan of horror films, and still smarting from my 'Jungle' experience, I began watching 'Bhoot' with some trepidation. 'Bhoot' translates to either 'ghost' or 'spirit', so right away, one knows the subject matter of the film. The title and its succinctness act as a caveat to the faint of heart.The opening scene has an irritable young man, Vishal, searching, rather unsuccessfully, for rental accommodations in the company of an agent. The broker has shown him several less than satisfactory apartments, and the young man's patience is wearing thin. He points to a towering high- rise building nearby and says, 'That looks like a fine building! Do you have an apartment available there?' We pick up on the broker's nervousness as he responds, 'Actually, yes. But you wouldn't want it.' Vishal insists on seeing the twelfth-floor apartment, which turns out to be huge, even palatial by Mumbai (Bombay) standards, and he cannot understand why the place is still unoccupied. Such an apartment would be snapped up in moments. The broker hesitantly tells him that the previous occupant of the apartment had fallen-or jumped-to her death from the balcony. The pragmatic Vishal retorts that practically all dwellings must have had someone die in them at one time or another, and proceeds to finalize the rental deal. He then moves in with his perky young wife, Swati. With their furniture and belongings, the empty, echoing apartment gets transformed into a comfortable home.Vishal is a stockbroker, and Swati, a stay-at-home housewife. We gather that they have not been married long; they are playful and romantic, still in the honeymoon phase of marriage. They inherit the previous occupant's maid, so apart from some grocery shopping, there isn't much for Swati to do while she waits for Vishal to return home from work. She sits in front of the TV and channel-surfs distractedly to pass the time.One such day, the belligerent watchman of the building sneaks into the apartment without knocking and startles her. Swati and Vishal complain to the chairman of the building council, who also happens to be their next-door neighbor. Decrying the lack of good help, the neighbor says there's nothing he can do. As the watchman is a witness in the police investigation of the previous occupant's death, they cannot very well get rid of him. This disclosure comes as a complete surprise to Swati, as Vishal has withheld from her the details of the circumstances in which he came by their new apartment.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A \"spirited\" take on the horror genre!","review":"Prior to `Bhoot', I had seen only 1 ½ Ram Gopal Varma films:  years ago, I'd enjoyed watching `Rangeela', a frothy confection with a delightful Aamir Khan and a newly voluptuous Urmila Matondkar (I say `newly' because until then, I only knew of Urmila as the bubbly child actor from the memorable `Masoom'); the ½ film was `Jungle', a movie so gratuitously and graphically violent that I'd walked out of the movie theatre.  I have no idea if it was any good.  Other than that, all I know about Ram Gopal Varma is that he has a predilection for single-word titles for the movies he directs: `Daud', `Khauff', `Satya', and so on.Not being a huge fan of horror films, and still smarting from my `Jungle' experience, I began watching `Bhoot' with some trepidation.  `Bhoot' translates to either `ghost' or `spirit', so right away, one knows the subject matter of the film.  The title and its succinctness act as a caveat to the faint of heart.The opening scene has an irritable young man, Vishal, searching, rather unsuccessfully, for rental accommodations in the company of an agent. The broker has shown him several less than satisfactory apartments, and the young man's patience is wearing thin.  He points to a towering high-rise building nearby and says, `That looks like a fine building!  Do you have an apartment available there?'  We pick up on the broker's nervousness as he responds, `Actually, yes.  But you wouldn't want it.'  Vishal insists on seeing the twelfth-floor apartment, which turns out to be huge, even palatial by Mumbai (Bombay) standards, and he cannot understand why the place is still unoccupied.  Such an apartment would be snapped up in moments.  The broker hesitantly tells him that the previous occupant of the apartment had fallen-or jumped-to her death from the balcony.  The pragmatic Vishal retorts that practically all dwellings must have had someone die in them at one time or another, and proceeds to finalize the rental deal. He then moves in with his perky young wife, Swati.  With their furniture and belongings, the empty, echoing apartment gets transformed into a comfortable home.Vishal is a stockbroker, and Swati, a stay-at-home housewife.  We gather that they have not been married long; they are playful and romantic, still in the honeymoon phase of marriage.  They inherit the previous occupant's maid, so apart from some grocery shopping, there isn't much for Swati to do while she waits for Vishal to return home from work.  She sits in front of the TV and channel-surfs distractedly to pass the time.One such day, the belligerent watchman of the building sneaks into the apartment without knocking and startles her.  Swati and Vishal complain to the chairman of the building council, who also happens to be their next-door neighbor.  Decrying the lack of good help, the neighbor says there's nothing he can do.  As the watchman is a witness in the police investigation of the previous occupant's death, they cannot very well get rid of him.  This disclosure comes as a complete surprise to Swati, as Vishal has withheld from her the details of the circumstances in which he came by their new apartment.With this new knowledge, softhearted Swati, a gamine little thing with a waifish hairdo, starts brooding over the possible circumstances of the young woman's tragic death.  Her innate sympathy makes her receptive, a sort of emotional lightning rod, to the unhappiness around her, which triggers off a number of rather alarming paranormal phenomena.  At first, she only senses the presence of the woman; then, she catches a fleeting reflection of her in a mirror, and then, the woman starts invading her dreams and even her daytime reveries.  With time on her hands and due to her susceptibility, she becomes the ideal receptor for the occult manifestations.Vishal, at first, is dismissive of his wife's paranoia, her `ghost fixation', and teases her mercilessly. But, as their lives become increasingly hellish and his wife changes to the point of being unrecognizable, he seeks outside help.It would be unfair to reveal any more, except to say that Ram Gopal Varma has a made a first-rate thriller.  I read somewhere that the inspiration for this film was one of Varma's own films; he had watched it again recently and had cringed at the inadequacy of his early effort.  `Bhoot', a sort of remake of that earlier film, is his way of getting it right this time, and boy, does he get it right!  There is none of the `Jungle' gore; the suspense and the scares are psychological and the result is terrifying. He alternates between a steadicam and a hand-held camera in several scenes to bring an urgency and claustrophobic feel to the apartment.  Even in broad daylight, there is a sickly blue cast to the surroundings, which foreshadows what is to come.  The truly scary thing is that Varma has managed to take prime Mumbai real estate and turn it into something so sinister, you wouldn't want it for free!  The camera follows his protagonists down corridors, hallways, and stairs, and your heart lurches as you worry about them.  My only grouse was the silly haunted-house soundtrack, with its creaks, groans, and howls, which starts the movie off.  Silence would have been far scarier; Varma catches on soon enough, for the background score gets muted from then on. In fact, the first look we get of the spirit is done in such masterfully throwaway fashion, that we almost wonder if we imagined seeing the apparition.  The tension builds insidiously and in barely perceptible increments, until, like its unlucky inhabitants, all we want to do is run screaming from the apartment.Urmila Matondkar is simply astounding as Swati.  With only the barest traces of makeup on her face, she effectively conveys the grisly changes in her character through body language and voice.  Her pixie look for this film is inspired: with her short, tousled hair and pert little nose, she personifies `adorable' and `harmless'.  What she does with that fragile look is to her credit as an actor.  Ajay Devgan is excellent, too, as her tortured husband, driven to his wits' end by the events in their once-happy life together. The supporting players are fine:  I have not seen a film in years that has used Rekha's hypnotic voice and eyes to such potent effect.  Tanuja does good work in a miniscule role, as does Victor Banerjee, in the role of the psychiatrist called in to treat Swati even as his own daughter lies dying. Nana Patekar, as the investigating police officer, and Seema Biswas, as the maid, enhance the spookiness quotient.  Visual effects in Indian films are becoming slicker, and this film benefits from the advances in technology. The tight editing and inventive camera work deserve praise, as well.\nScience and the rational world collide with the inexplicable and occult in `Bhoot' in a credible, riveting manner.  Ram Gopal Varma can feel proud of his cinematic achievement, and you, dear viewer, had better look over your shoulder.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Real scary","review":"Bhoot is one of the Ram Gopal Vermas milestone, and also the only good movie which is of genre horror and also a professional Bollywood film. Before Bhoot, the horror movies made in Bollywood were mostly will fit in comedy. Off course, other than Ramse movies, some serious tries were made like Ankahee and others. But they failed to get attention of the audience or to get good reviews and critics. Even Ramu's previous movies Raat and 'Darna Mana Hain' failed to get any attention. So before watching Bhoot I have prepared for a movie which will scare you less and make you sleep more. But I was totally wrong. The movie doesn't have ghosts with painted faces, neither it has females wearing bare minimum clothes and throwing other people around like basketball, neither it has Mantriks with skull in their hands. It is a very simple low budget movie. It is more comparable to Kaun than any other Bollywood horror movies you have seen. Most of the credit goes to the Director, and remaining to the actors, specially Urmila. Urmila is the main character and mostly the story revolves around her, and she fits there so well. Ajay and Nana were as usual at their best leaving us with nothing to curse for. Ajay a simple, middle class husband who is totally helpless and got no clue of what should be done, while Nana a 'Chakram' police inspector who has doubt that something weird is going on. These two characters too are plotted very well, and done with the same power by the actors. Another good aspect is its short length. The movie starts quickly, without showing us any love story and song. A couple getting into a new apartment house, which is haunted, and the wife gets possessed by the ghost. Its just one line story. The most important aspects of ghost stories is the environment making, and thats the most positive part of this movie. Just the sound of lift coming up and down makes so much of impact. I will recommend this movie to everyone, who enjoys Bollywood movies, and also to those who enjoys horror movies. In my opinion, this movies should go in \"101 must watch Bollywood movies\" as it is the only good horror movie made in Bollywood till date.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" India's best horror movie in true terms!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","review":"Bhoot is masterpiece and it really is a bhoot! Like ghosts which u rarely see, Bhoot is a bollywood production, a bollywood piece with such hight quality and standards that u rarely see!!!!RGV is great as we always knew but in this movie he give us just another proof that he is one of the world's best directors, comparing to Hollywood directors!!! Although i believe we shouldn't compare Indian films with Hollywood cos both have very different value systems and therefore the way they act and react to things is different!!! Indian movies are just for Indians!!! Anyway, rather then flying off on a tangent, i would like to say few things about Bhoot: 1. Urmilla was absolutely brilliant 2. Ajay looked so realistic as a worried husband when his wife was troubled 3. That bai (cleaner lady) was so freakish!!!!! 4.Rekha was absolutely a DIVA and haunting!!!!! 5. Last scene where Fardeen gets done is marvellous!!!!!People if u haven't seen this movie yet, go to your local movie library and rent it!!![[[[[[[[[[[[[[ AVOID VIDEO PIRACY]]]]]]]]]]]]]]]]]]","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" All in all, not a bad movie","review":"The story of \"Bhoot\" is one of thirteen in a dozen. Far from being a horror die-hard, I can't avoid the impression of having seen the same story in many, many other films before. Horror is clearly not Bollywood's strongest side: if an idea is good, it is generally stolen, and when an idea is original, it is generally bad. In comparison to horror from countries like the USA and Japan, Bhoot is weak. There is no point in denying that. However, in comparison to other horror flicks from Bollywood, it should be said that Bhoot is different and... considerably better. Ram Gopal Varma has raised Indian horror to an entirely new level, which is still way below Western standards, but way beyond Indian horror flicks from the 1980s and 1990s.The acting work is pretty much okay. Not surprising, given the cast of gifted, versatile actors. Virtually every haunted house movie has a skeptic who does't notice anything and starts believing something is wrong only when he sees it happening with his own eyes. He acts as a liaison between the audience and the scary stuff: just like you folks, he doesn't believe it, and yet it is happening to him, so y'all better be scared! In \"Bhoot\", our skeptic is played by Ajay Devgan. His performance is not bad, but it is not impressing either. Probably not Ajay's fault, though: it is just that the role is little interesting. He is merely there to be the skeptic, but that is about all the depth there is to his character, and that makes him hard to identify with.Urmila Matondkar plays the leading role of a woman, who is possessed by a \"bhoot\", a ghost. She received quite a lot of awards for this role. In my opinion, she is doing a fairly good job, but calling her performance a masterpiece would be a grave exaggeration. With all the weird faces she makes with the bhoot inside, she looks more funny than scary. But then again, that is not the actress's fault, but rather of the whole concept of the movie.The most memorable roles are in my opinion: Nana Patekar in the role of inspector Qureshi, Rekha as a \"witch doctor\" (this woman has such a screen presence that she merely has to be there to steal the show), and Victor Banerjee as the psychiatrist.However, the best thing about \"Bhoot\" is undoubtedly the music by the duo Salim and Sulaiman. Luckily, there are no typically Bollywood-style songs in the movie, but then, what a terrific background score! Obviously, the director asked them to make the most horror-like music imaginable, and so the brothers were free to do what they were really good at. From the beginning till the end, the music creates an atmosphere of evil lurking, no matter whether something is going to happen or not. Of course, sometimes a horror film is more effective when the music doesn't give away everything in advance, because then at least there is an element of surprise. But that is a matter of choice. If you want some really horror-like music, Bhoot is one of the best examples I have ever seen or heard.All in all, 3/10 for the story, 6/10 for the acting, 7/10 for the direction, and 9/10 for the music.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Scary one","review":"I went to see this movie expecting to find another dumb \"chaitan\" story. But found that this one is actually pretty darn good, even without qualifying it as a Hindi horror film.Hindi horror films are awful. I am yet to see one that is really scary, and most of the time, when the *scary* part comes, my friends and I burst out in laughter. The make up leaves much to be desired and the story is always the same.The story part is pretty much the same here too. This is not exactly a never-seen-before sort of storyline. However, other things make up for it. The movie completely belongs to the actors and the technicians, mainly the sound editor and the cinematographer. They have done away with grotesque make up and stuck to minimalistic approach, which is actually scarier.The actors are brilliant. The have not given in to the urge that many Bollywood stars have, of going into the rhetoric by making loooong speeches and show extreme expressions. All the parts, except Urmila's and Rekha's have been portrayed very subtly. Urmila is pretty good, Ajay Devgan is very believable. Tanuja gives an excellent understated performance. Rekha is truly amazing. She manages to creep you out even more than the ghost in some scenes.The one complaint I have, is that the movie loses some of its fear factor after the intermission. It just isn't that scary anymore. Also, there isn't any particular twist. However, there is one part which could have been the twist, but was downplayed. But on the whole, I'd definitely recommend it to anyone who likes a good scare. The movie is not for people who see the same for stories.Overall - 8 / 10","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Back with a vengeance to haunt you....","review":"When \"Raatri\" (\"Raat\" in Hindi, 1992) bombed at box-office I am sure Mr. Varma uttered \"Yaad rakhunga, tujhe yaad rakhunga!\". Exactly a decade later he changes a few components of the original, re-brands and sells it under the packaging of \"Bhoot\", and guess what it works. RGV must have smiled and thought to himself \"Revenge is a dish, best served cold\".Urmila:: This movie would not have worked without her and no questions to that. She put her heart and soul to breathe life into the Bhoot (paradoxical statement aye). This was the last full-fledged outing with Varma.Ajay:: Was his usual self. Rekha:: In the original, this role was assessed by Om Puri. Rekha added a novelty value to the role. Plus it would go down the history of cinema as collaboration of Rekha & RGV.Nana Patekar:: He adds his own quirkiness to the character. As usual RGV has played by the unconventional rules resulting in weird camera angles and long drawn shots. I particularly liked the way he toyed by building up momentum and not scaring the audience at the usual places. Instead he catches you off-guard at unusual and unexpected spots. Background music is engaging and adds to the thrill. If you haven't watched \"Raat/ Raatri\", you will certainly love \"Bhoot\" (perhaps the only decent horror RGV made and a successful one!).","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A honest and sincere attempt to frighten.","review":"Many may recall Ram Gopal Verma made a horror movie in 1992 called 'Raat'. Bhoot is very much in the same league and there is no doubt that Verma was inspired from his previous movie to make this. 'The Exorcist' too seems as a source of reference as the similarities are evident. The horror genre has come a long way since the Ramsay era and Bhoot specifically had set the standard for intelligent and mature styled horror. Recently many other directors continued the trend that Bhoot began. '1920', '13B' and 'Raaz 2' were very reminiscent of Verma's works. But they did not gain much box office success as the themes were very similar to each other. As a result of this it has led the horror genre to become very repetitive.Bhoot initially does not contain much horror elements. The movie presents a unsettling and psychological atmosphere. The gradual build up of suspense and surprising moments sustains throughout most of the first half portion of the movie. Verma very carefully handles these scenes with clever camera work and the sound effects help in giving the correct impact. He has directed the movie in tone with the theme. Verma has always adapted his directing styles according to the genre. Bhoot consists of many close up frames of the character's faces and capturing their expressions. This has become a repeated technique of late and I feel that it is very effective.SPOILERS AHEAD Devgan and Matondkar move in to a apartment that once occupied by a woman and her son. After they settle in Matondkar begins to experience nightmares and hallucinates of a woman. As it becomes more common she visits a doctor and he states that her symptoms may well be caused by a multiple personality disorder. A few nights later the building watchman is murdered by Urmila and a murder investigation begins. Devgan attempts to hide the truth behind the killing. Meanwhile Nana Patekar, a cop attempts to find evidence which will point at Urmila as being the culprit. A psychiatrist played by Victor Banerjee assists him. Later that Urmaila is possessed by the spirit of the woman who had fell from the balcony of the apartment. She is confined to the bed. Patekars persistent attempts to uncover the truth behind Urmila's involvement behind the watchman's murder fails as know one is willing to cooperate with him. Devgans attention is brought towards a woman played by Rekha that helps to uncover the truth behind the previous tenants death and Urmila's possession. However later it is revealed that the woman's death was a accident. But to free her spirit from Urmila's body will only be achieved by vengeance. END OF SPOILERUpon initial viewing in 2003 I would say that the movie qualified as a horror movie. Unfortunately it does not stand the test of time as after two watches the movie would not have as much mental impact on the viewer. With a running time of 1 hour 55 minutes the movie progresses at a moderate pace. The first hour consists of Urmila's paranoid behaviour and frightful experiences. The post interval segment has a plot and gives Urmila the opportunity to play a different character. I could not understand why Patekar's subplot was not integrated accordingly. His character seemed a little sidetracked. I'm not sure if police officers in India are restrained from fulfilling their investigations. As the movie has a repeated theme there are factors that make the movie get attention. Verma's direction, camera movements and the sound effects add realism to many of the scenes. The background score is perfect. Many different sounds are incorporated and helps set the mood.Urmila Matondkar gives the performance of a lifetime. Her portrayal of a wife to a possessed woman is very convincing. The transition phase she takes is very realistic. There is not a moment where there were signs of overacting. I would not be surprised if she had received an award for her acting. She overshadowed everybody Else's involvement to a high level. This is one movie that can be appreciated for acting.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Very creepy horror film.","review":"\"Bhoot\" is a supernatural horror movie set in urban jungle of Bombay.Vishal(Ajay Devgan),a stock analyst and his wife Swati(Urmila Matondkar)move into a new apartment.The fact that the previous occupant died jumping off from the balcony doesn't deter Vishal.He doesn't inform his wife about that tragedy.Eventually,she finds out and then creepy things do happen.She loses sleep and begins to experience strange incidents,illusions and nightmares.The truth is horrifying.\"Bhoot\" is a wonderfully suspenseful horror film made by Ram Gopal Verma(\"Raat\").The cinematography is breathtaking and the atmosphere is so thick that you could cut it with a chainsaw.The climax is pretty disappointing,though.A must-see for fans of Hindi horror.8 out of 10.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Psychologically Scary","review":"The movie was really good and so intensively scary about a couple who moved into a new home and the woman is possessed by a ghost of the person who lived at the apartment. The whole film keeps you in the edge of your seat and makes you jump in a few scenes. It was straightforward and the mystery kept you guessing until the very end. Ajay & Urmila's acting were terrific and what has Urmila done to her hair? It was short, thick and curly; probably to suit the character and long hair won't look good in a horror film. Bhoot is inspired from The Exorcist but Bhoot is a lot better and I did not like The Exorcist one bit. It has to be one of Ram Gopal Verma's best films.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Bhoot-Hindi for:Ghost.","review":"Taking a look at Bollywood titles that I could watch for a poll being held on IMDb's Classic Film board for the best films of 2003,I was thrilled to spot a movie which by pure chance I had recently picked up,which led to me excitingly getting ready to be haunted by the bhoot (ghost.)The plot;Searching round for a flat where he and his wife can live,Vishal notices a flat that the estate agent weirdly keeps away from discussing.Pushing the estate agent,Vishal finds out that the flat has been taken off the market,thanks to the previous occupant being a woman who mysteriously died by jumping off the balcony.Dismissing the agents tale as superstitious nonsense, (whilst making sure to keep it hidden from his wife Swati)Vishal tells the agent that he will go for the flat right away.Moving into the house,Swati tells Vishal that the atmosphere in the flat feels oddly unsettling.Telling his wife that she just needs to get used to the place,Swati begins to doubt her husband words,when Swati starts to see,what appears to a ghostly woman wondering around the flat,and entering her dreams.View on the film:Closely working with sound designers Vikram Biswas and Dwark Warrier,director Ram Gopal Varma builds a haunting atmosphere by creating a scrambled soundtrack,with the score and slips of sound from the TV being smashed into an Ambient soundtrack, (featuring no songs!)which perfectly expresses the disorientating nightmare that Vishal and Swati are facing in the flat.Matching the soundtrack,Varma and cinematographer Vishal Sinha use tightly coiled angles which reveal the claustrophobic Horror that Vishal and Swati find themselves trapped in.Along with the tightly coiled angles,Varma and Sinha use brittle wide shots to chillingly place the viewer face to face with the evil getting unleashed.Whilst he does very well at attempting to build a mysterious atmosphere,Varma disappointingly dampens his target by openly showing the 'baddie' within the first 15 minutes,which ends up taking away any chance that the audience has in gradually creating an image of who (or what) is haunting the young couple.For the screenplay writers Lalit Marathe (who also gives a very good performance in the movie) and Sameer Sharma keep away from taking the title in a gory direction,by instead taking a delightfully poetic route,with the flat setting being an excellent backdrop for Swati and Vishal's crumbling relationship,with the writers also striking a chilling note by gradually reveal the background to the figure haunting the flat.Giving the title a shot of sass,Nana Patekar gives a very good performance as Inspector Liyaqat Qureshi,with Patekar doing very well at showing Qureshi's increased desperation to uncover what is taking place in the flat.Entering the film as a care-free young couple,Urmila Matondkar and Ajay Devgn both give excellent performances,with Devgn shattering Vishal's over-confidence by showing a sense of confusion to slowly seep in,as he finds himself being unable to come up with an answer for his wife's terror.Joining Devgn,Matondkar gives an incredibly icy performance,with Matonkar superbly showing Swati crumble at the psychological horror,as she finds herself face to face,with bhoot.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" \"very good film\" \"excellent film\" \"outstanding film\"","review":"Ram Gopal Varma's Bhoot steps away from conventional Hindi cinema and stands as an outstanding piece of work.All the actors perform perfectly, the camera work remains consistent and the music as well as the long silences hold the tension. With a quick ending that in context is perfect if a little rushed, the film remains a entertaining fantasy right till the end. Go watch this film and every other Ram Gopal Varma film as well... you wont regret it.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Extremely Scary...Well Edited..Well Executed..Amazing Acting","review":"The Movie has a very ordinary story.. two people moving into a haunted house..the wife being posessed..n the ghost taking revenge but the treatment and execution have a very scary and exciting ride in store for u.The film has been inspired from earlier hollywood and bollywood films..thogh all of them have predictabile scnees..this one treats them differnt,,jsut when u expect the ghost to come it dosnt n then it does n catches you.Some scenes have been brilliantly executed: 1) the opeining sequence..high class editing 2) the scene where the couple moves in their furniture( editing again) 3) The scene where Swati-touches the mirror and u expect to see the ghost but u hear the door beelll which scares u to hell 4) The maid..leads a mislaeding character..lookin possesed but is not. 5) The scene where swati is posseses has some very high class acting though copied from the Exorcist..the acting surpasses the priginal by miles and seems very convincing. 6) The doctors daughter is shown suffering from blood cancer..she says (in hindi) \" I am afraid papa\" and the same line when said by the possesed swati...seems extremely scary and ties in the only subplot in the movie. 7) post interval many new characters are introduced all of which blend into the story really well . 8) the last scene when the ghost leaves swati..again has some very very high class acting..as soon as the ghsot leves u can see the difference on her face which jumps form evil to cute in a split second..very convincing.On the whole bhoot is a very well made film..with no songs..no subplots..perfect acting.9 / 10 for a horror movie 10/10 for a hindi -bollywood horror movie 8/10 for an international film.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Scaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaary!","review":"This film is a great achievement on so many levels and I just feel like applauding the production team and Ram Gopal Varma for pushing the envelope and creating this masterpiece. As for those of you claim that this is a rip-off of The Exorcist, I really don't think you ACTUALLY SAW THE EXORCIST. Anyhow, I don't want to get into that because this is review is solely about Bhoot! ****NOTE: THE FAINT HEARTED SHOULD REFER TO THE DISCLAIMER AT THE BEGINNING OF THE FILM BEFORE WATCHING.****We meet Vishal (played excellently by Ajay Devgan) as a successful entrepreneur on a house-hunt. As he leaves an apartment complex where he and a real estate agent have just unsuccessful viewed a batch of flats, the weather changes and a downpour of feverish rain begins to fall out of the sky. As the two men are about to start driving away, Vishal notices how beautiful the complex is and asks the agent if there truly isn't a vacancy in there and the agent hesitates before admitting that there is one flat. Now, for horror and scary-movie buffs, you all know at this point that this would be a major no-no. But Vishal is taken to the flat which he views and loves. The agent tells him the history of the place which includes the fact that the most recent occupants fled from the place and also that a woman once jumped to her death from the balcony. Vishal rubbishes any supernatural ties and buys the flat. He furnishes it and moves in with his wife Swati (played to perfection by Urmila Matondkar) and all is well for the first few nights. One night however, Swati gets up to go have a drink of water downstairs and is spooked by a presence in the house. She calls her husband who investigates and finds nothing. The next day, Swati goes to the market and upon her return is informed by the watchman (played by Sabir Masani) that the elevator has broken down. Swati then climbs up 12 floors to her flat where she rushes to answer the ringing phone. While on the phone, she is startled by a presence behind her who turns out to be the watchman handing her a letter she hadn't retrieved from the mailbox. Shocked, at both his intrusion as well as the eerie fact that he managed to get upstairs right around the time it took her to climb up all those stairs yet she hadn't heard him behind her, she throws him out and reports the incident to her husband who in return reports it to the building's superintendent (played by Amar Talwar). That same day the couple notice their maid acting weird and Swati begins to feel uneasy in the house. A series of events lead to the possession of Swati and Vishal fights to snatch his wife back from the jaws of evil and eminent death.Everybody is excellent, but most especially Urmila as Swati. Nana Patekar shows up about half way through as the charming Inspector Liyaqat Qureshi. Rekha is also along for the ride as a spooky looking medium named Sarita, suggested to Vishal by his maid. Even Fardeen Khan as the loser drunkard Sanjay is unexpectedly good in his limited scenes. Victor Banerjee, Peeya Rai Chowdhary and Tanuja co-star. Very well directed, very well acted, very spooky, very scary, very heart-wrenching, tear-jerking and just quite simply very brilliant! A+","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" This film is a copy of The Exorcist","review":"This movie is a rip-off of The Exorcist, but this version happens to be in Hindi. Even the sound design and production quality is completely lifted from the former. I'll admit, it's different from your usual Bollywood fodder, but when you think about it, what's new here? Gimme a hollow hindi musical instead... at least they're more honest about the sum of their parts.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Boring...","review":"Well, I was looking forward to this for a long time, being from my fave director, and what do I get?? Glad, it was not too long... and the worst thing is it didn't scare me.I think, the Horror genre is a very difficult one for the director. Either too gory (which just makes me puke with disgust rather than fear) or something like Bhoot, which tries to scare u but fails. so far for me, the best ones are The Sixth Sense and Fallen. Both beautifully crafted, movies that use \"suggestion\" more than \"blotched up faces\" though there is some of the latter in The Sixth Sense. Bhoot, uses a face, but really, it didnt make me jump, not once!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A disappointment","review":"After the moving Satya and the excellent Company, this horror film by Ram Gopal Varma is a huge disappointment. Why? Because the horrific effects are not subtle enough to be efficient and it's lacking of indian specificity: Satya had the sense of melodrama, Company the mixing of genre but here the first part borrows from Ring and Sixth Sense without being as convincing. And the second part becomes then ridiculous, like a bad italian horror film made in the seventies. Okay, the movie has the Varma's touch but it's not enough in this case. Varma had tried to free himself from the contraints of Bollywood -the movie is short for an indian movie, there's no sung scenes here-, it's certainly a challenge at a local scale but for the moment Varma misses the target. I hope he'll come back to gangster movies because he's not the right man to create India's answer to Shyamalan and Nakata.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Not as expected","review":"The reviews read on different raised my expectations. But, after watching the movie, I could not find it that promising. Infact, the second half of the movie was quite hopeless. The script is weak. Though, the direction is okay and Urmila is great, the movie doesn't delivers upto. In fact, I would say Raat and Kaun were far ahead of this movie. In my view, it can be avoided!","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Not worth!","review":"Ramu did make an good effort on this film which starts pretty well but ends quite filmy way. Ajay Devgan again excells alongwith Urmila. Victor Banerjee,Rekha,Nana &Tanuja have not been utilised completly though they do have good scenes but which hardly lasts for secs... Sound Designer: Dwarak Warrier has done pretty good job.Cinematography by Vishal Sinha is slick.Varmji pls don't repeat this bhootiya act.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" ok movie...not scary","review":"I have to give credit to Ram Gopal Verma for trying out different types of movies. This time with a horror movie he does well but still there are many flaws in the movie and a lot could have been done to make this movie good and above all scary... That was one thing that was missing. It was missing the edge of the seat moment!!!. Urmila was ok and so was Ajay. But i really think Rekha was wasted in such a small role. I am still awaiting an Indian Horror movie that will really scare me!!! Maybe Ram Gopal Verma's next 'Darna Mana Hai' will do it!","imdb_rating":6,"our_rating":0,"algo_label":0}]