[{"heading":" Ajay Devgns portrayal was ahead of Shahrukhs in Darr","review":"Devgns acting was the soul of this film and others lend good support...Though boring in parts but all the other aspects were a - one...A Must- See","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Simply great","review":"This movie is a remake of the english movie Primal fear. I think primal fear was better than Deewangee but deewangee is a good entertainer. It has the tendency to keep the audience at the edge of the seat. Ajay devgan and Aksahye Khanna give a mindblowing performance. My rating - 9/10","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A bad copy of a good movie","review":"In case you have watched Primal Fear, don't even bother. In case you have not, watch Primal Fear. If you are bent upon watching this movie, then I assure you that apart from a few amazing scenes, courtesy Ajay Devgan, the rest is pretty stretched. The plot has too many unnecessary songs. The last half was pretty boring stuff. The plot tries to imbibe the which was left to the imagination by the original. Akshay Khanna as usual was wasted other than a few sequences. This had the potential with an exciting star cast. the climax is the only part where you feel like being on the edge of your seat. More was expected out of Anees Bazmee. Overall, something that can be watched unless you have nothing else to do.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Great Act by AJAY DEVGN","review":"Tremondous acting by Ajay devgn ..super story\nSuper music by Ismail darbarji and best directio of director........HE IS SUCH A FINE ACTOR ......AJAY LOVE U","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" This deserves a sequel.","review":"This movie was one of Ajay's best performances ever. I do not watch American films, so I do not care about Primal Fear. And as the Darr part, Ajay raised SRK's performance tremendously. Ajay was convincing through his eyes. Akshaye played a convincing lawyer, one of his better roles. Urmila was OK as the actress. The side characters were pretty decent as well. The court room scenes were amazing and well planned out. However, the end of this movie was a total let down to me. A movie like this needs a sequel. The song was sung as a random person walked by covering their face, no one knowing if it was Ajay or not. The movie was a spectacular. One of the best thrillers in Indian cinema. I would suggest this movie to any one who is interested in a good movie.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Ajay Devgan best act ever!","review":"Someone told me that this movie is a complete copy of an English movie, forget that point, just watch this movie for the superb and solid acting of Ajay Devgan. This Anees Bazmee thriller is really superb. One cant think that Ajay can act negatively in a movie. He looks so innocent one can neva think he can do a negative role, but guys n gals, he is superb, really superb. Movie starts with the murder of Ashwin Mehta(Vyijendra), and police caught Tarang(Ajay) for the murder. He is a music master and a Guru and friend of famous Singer Sargam (Urmila). When she heard this news, she is shocked, and hires a advocate Raj(Akshay) to save Tarang's life. During the investigation they all came to know that the Killer is Tarang only, but he is suffering from Dual Personality, hence Court sent him for treatment. This is all the first half, a story of a killer with dual personality. In second half movie turns wild, as there is only one person who does his job perfectly fine, he moves the movie on his Shoulder and its none other than Tarang(Ajay). For more story its better you can watch this movie, as its not the movie which anyone can easily miss, its a masterpiece, so people please don't miss this thriller. Akshay does a good job and shows he is a talented actor. Urmila is so so. Supporting cast like Farida Jalal, Tiku, Nirmal Pandey, Seema, Vijayendra, Tanaaz all does good job. But the movie is hit bcoz of only one character Tarang, a silent lover, a dual personality, a singer, a perfect actor, etc. He had done a Award winning performance. Thanks Ajay you did the right job. Anees thriller is a good one, and ending of the movie is surprised one.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Ajay Devgan shines yet again","review":"''Expect The Unexpected''-thus read the poster of this 2002 hit.2002 will go down in history as an exception year in the film carrier of Ajay Devgan.Leaving a disastrous ''Hum Kisi Se Kum nahin'' - Ajay redefined all parameters of conventional Hindi cinema.The year 2001 was a low year for the deadly Devgan as his dual role potboiler-Yeh Raaste Hai Pyaar Ke bombed and although his cameo in Lajja got him rave reviews yet the movie flopped at the ticket window. However in 2002 starting with Company Devgan went on a all time high.His carrier graph is still on a high almost 2 years later.While Company and The Legend Of Bhagat Singh both him immense critical acclaim yet while Company was an average grosser Bhagat Singh had flopped.So Devgan needed a hit in the year to prove that he still had star power besides being an ace actor.Deewangee provided him with that and he was universally accepted as one of the finest actors.Tarang Bhardawaj(Ajay Devgan) is caught red-handed with the body of a music company tycoon Ashwin Mehta(Vijendra Ghatge).Although his clothes are blood stained yet he pleads innocence.His body language suggests that he has been framed in the murder. His childhood friend Sargam (Urmila Matondkar) believes him as she knows that Tarang cant even kill an animal. She asks her fiancée Raj Goyal (Akshaye Khanna) to fight the case.The young lawyer takes up the challenge and fights for Tarang.With the aid of a psychatarist(Seema Biswas) he comes to know that Tarang is a victim of multiple personality disorder.He succeeds in proving Tarang innocent.However he does not know what is about to follow. This in a nut-shell is the story of Deewangee.The script written by director and writer Anees Bazmee has its first half borrowed from the Hollywood thriller ''Primal Fear''.The second half has shades of Darr but it is the N.Chandra directed-Wajood which is clearly visible in the second half of Deewangee.The item program towards the climax,the plot to trap the obsessed lover by a dance from the heroine is straight from Wajood. The difference being that Wajood was a bit too dark and a flop and Deewangee was thrilling and a Hit. To be fair to Bazmee the script is rather good and the movie is well paced. Although the second half has a slow pace and it even drags at time yet the movie overall is kept interesting. Bazmee who had earlier directed Ajay Devgan in the flop Hulchul and the hit Pyaar To Hona Hi Tha was not really a big name before Deewangee.However his direction of the movie is good within commercial parameters.Deewangee was released just few weeks after Abbas Mustan thriller Humraaz was declared a hit.In that movie Akshaye Khanna had played a mean character effortlessly. In that sense his role in Deewangee was very challenging.Moreover it is generally seen that when there are 2 heroes and one has a strong negative role the positive guy usually gets the brickbats.Examples are Sunny Deol in Darr,Jackie Shroff in AgniSaakshi and to an extent even Bobby Deol in Humraaz.But I must say that Akshaye Khanna bravely breaks this recent tradition and proves that if the role is well defined even the postiver character can act well and match the negative role.His performance is really good and it shows his maturity as an actor. Full points for the writer and director for having given him a well written role. His changed look with a different crop of hair than that of Humraaz makes him look damn smart as well.He excels in the court scenes as well as the scenes with Ajay Devgan.This was a hit Urmila desperately needed for a long time.This was her third film with Ajay and surprisingly both the earlier movies Kanoon and Bedardi were duds.She looks OK and gives a decent performance in a role which has strong shades of Juhi Chawla's role of Darr and madhuri Dikshit's role in Wajood.Needless to say the show belongs to Ajay Devgan. From an anti-hero in Company, Ajay transforms himself to a complex negative role. His character is an obsessive lover,a psycho killer,a plotter,a vulnerable man, a simple musician all rolled in one.His performance has the polish which even his earlier great performance in Zakhm lacked.The way he transforms from a stammering guilty man to a devil is amazing. During the awards function Ajay Devgan had 2 nominations for the Best Actor-Company and The Legend Of Bhagat Singh and one best villain-Deewangee. He created a record of sorts when he won the critics award Filmfare for the best actor. The award was shared by Ajay Devgan for Company and Ajay Devgan for Bhagat Singh!!!!He further created a stir when he won the best villain award as well for Deewangee. Ajay did not accept Darr and the offer fell on Shahrukh's lap.Now with Deewangee Devgan kind of had a sweet revenge by playing a negative role and getting acclaim as well as box office success for it.The movie also is the first popular Hindi movie to have dealt with Multiple Presonality Disorder. Conventional mentally disturbed heroes have been part of Bollywood since ages and even Ajay did one in the huge hit Dilwale (it was a much bigger hit than Deewangee).","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" deewangee","review":"Mind Blowing movie one of the best movie Ajay Devgan....","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Mmmmhhh... could have been better, but that would be expecting too much","review":"When watching this movie I remembered why I usually prefer Bollywood love stories over Bollywood thrillers. Because whenever I watch a Bollywood thriller I spend half of the time screaming at the actors and actresses to stop being stupid, dizzy cows. Deewangee is no different. The story is based on Hollywood's Primal Fear with Akshaye Khanna as the lawyer Raj and Ajay Devgan as the psycho Tarang. *POSSIBLE SPOILER* Tarang is accused of murdering a man and Raj is the lawyer defending him. Raj finds out that Tarang has a split personality and gets him off. Then Tarang reveals he was faking it, which is when the trouble really hits the fan. Naturally there is also a pretty lady involved who is pretty much the protagonist, because she is the reason Tarang kills and she is also the reason Raj is so desperate to put Tarang in jail where he belongs.First of all, let's start with the actors. Although Ajay is no Edward Norton, he was simply brilliant switching between sweet, charming Tarang and his wicked alter ego Ranjit. His facial expressions actually nicely displayed his inner feelings. He loves the girl. He wants to marry the girl. And in his deluded head she loves and wants to marry him. So he is willing to do anything to protect that. Ofcourse sane people wouldn't take anything as far as he does, cos as the movie progresses the body count rises. And what about Akshaye... he's actually quite good, but unfortunately indulges in sulking and overacting which is a real shame. But not all is his fault, because Ajay has a way of stealing every scene they are in together. On a personal note, I liked Akshaye better in Dil Chahta Hai playing the sensitive artsy guy. And finally the leading lady Urmila who has no charisma whatsoever. How two guys end up trying to kill eachother over her is beyond me. She can't do scared out of her wits, she can't do shocked and she can't do empowered woman. She should take a page out of Neve Campbell's Scream days and learn to kick butt.Just like most Bollywood movies this one had scenes so inconsistent and illogical I wanted to dive into the tv and whack someone. The worst scene was however the looney bin. *SPOILER* Correct me if I'm wrong, but aren't psychiatrists trained professionals with experience in dealing with schizophrenic psycho's? So, how on earth does Tarang manage to convince them that he didn't attack his lawyer, but that his lawyer injured himself? Granted, he was telling the truth. But as a psychiatrist treating a murderer, I think I would give the lawyer the benefit of the doubt instead of swallowing some sob story by the psycho like a caramel cake. And I surely wouldn't be ready to let the patient leave having seen him headlock the lawyer. The second worst scene involves fifty policemen failing to catch the psycho who manages to flee them, knock out a driver, change into his clothes and get behind the wheel of a car in the span of three minutes. Give me a break!!! I could go on, but I'll run out of space.But it's not all bad. Because, let's face it, it's not like Hollywood thrillers are always that consistent and logical. And many times I have found myself calling Hollywood actors and actresses stupid dizzy cows. So, all in all, Deewangee is OK and it is made better by Ajay's performance. It would have been better if they had given the leading lady a kick butt role, but then Akshaye wouldn't have been able to rescue the damsel in distress. And as far as endings go, it was a pretty predictable one... let's see if you can guess it before the end of the first half of the movie like I did.\n***/5 stars","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Super hit thriller don't miss","review":"Super hit songs I like Ajay performance he was superb in his villain character Akshaye was excellent Other stars did well I think this is a decent movie and of course watchable Great direction great story-line great editing great music what a masterpiece this is blockbuster hit for sure the heroine was decent in her performance","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Decent film though a remake","review":"Anees Bazmee was a writer of several films and then turned into direction with Hulchul(1995), which flopped and then he returned with Pyaar To Hona Hi Tha(1998) a superhit which was a remake of French Kiss Deewangee is a remake of Primal fear(1996) however only the first half is inspired from that film. The film starts on a superb note when Vijayendra Ghatge is murdered, the scenes between Ajay and Akshaye are superb, the split personality part is superbly handled, even the courtroom drama is brilliant. Only flaws are the romantic track of Akshaye and Urmila which is typical,also the songs do interrupt. The interval point is surprising, especially for those who haven't watched the original. The original film ended in the first half while in second half director tries to continue the story and end it on a happy note however the film suffers in this hour, Except some scenes like Ajay assaulting Tanaaz,Akshaye-Ajay scene in the mental assylm mostly the film gets repetitive and nothing exciting, the game of oneman upmanship does get boring after a while, also the director adds several filmy scenes like the pre-climax when Ajay suddenly dresses as a driver and kidnaps Urmila, also the end is prolonged Direction is quite good, Music by Ismail Darbar is hardly impactful, considering the film is based on music there could be better songs, also their placement ruins the impactAjay Devgan in his first negative role, does a superb job in a complex role, he is simply brilliant in this film and also won several awards for his work, he kept doing several negative roles like Khakee,Shikhar.etc Akshaye Khanna except his bad wig, does a superb job in a complex role, those days Akshaye's career was on a high after DCH and Humraaz he does a superb job as the lawyer and also won a nomination for best actor.I wish his career could go on the same length sadly he signed bad films. urmila Matondkar gets less to do and she is alright except in scenes of anxiety she tends to overdo Vijayendra Ghatge is good in a small role, Farida Jalal, Tiku Talsania are typical, Tanaaz Currim is alright, rest are okay","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" one of the best AJ's real superb acting","review":"I saw this movie before watching PRIMAL FEAR and I am writing this review after watching both the films.There should be no doubt Primal fear is better than Deewangee but only in terms of direction and not action. AJAY DEVGAN HAS REALLY DONE COMPLETE JUSTICE TO HIS JOB and this is one of his best performance which really brings real thriller while watching this movie. In one of the scene AJAY DEVGAN beats up a girl and verbally abuses her(don't think he sexually exploit her, that is for some other reason) this type of scene is very rarely shown in bollywood movies where a girl is beaten plus verbally abused and the reason is not female sexual exploitation. In that scene both the actor and actress have done a tremendous job.There is lot more. You should definitely watch this movie.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" man was i in for a surprise","review":"Firstly to get stuff straight, I am a huge fan of ajay devgan and consider urmila to be one of the better actresses in cinema today.All i heard about this movie was that \"ajay devgan did an awesome job prolly his best so far\" by a lot of my friends(i personally consider legend of bhagat singh a better work). This movie made me realize that i need 2 screen my movies a lot more carefully. Primal fear was... correction is one of my fav thrillers of all time. creating a mockery out of it by adding a \"redemption\" hour and a half is not good. the least they could have done is read the novel primal fear is based on and follow up on that plot. ajay devgan did a good job but wasn't convincing enough for me. i knew everything that happened in the first half before it took place and was utterly bored in the second. this just made me realize that i need 2 stick to Hollywood for thrillers and comedy is better off(not the cheesy kind) in bollywood.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" bad copy","review":"I think the first half of the movie was a bad copy of Primal Fear. devgan was not Edward Norton. But second half was better. Mr. Khanna was better then devgan, because he was more orginal and was not copy somebody.But i give it 7.5 out of 10.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" better than i expected but no masterpiece","review":"note: spoilers galore....let me, as i often do when writing reviews, be brutally honest.....i went in to watch deewangee with no expectations....none, zippo, zilch, nada.....the sole reason i decided to waste 3 hrs. of my time on the film was coz of the actors......two of hindi cinema's most under-rated leading men who on any given day can act the pants off most of the so-called superstars and heartthrobs.....so imagine my complete and utter shock when i found out that deewangee was actually worth watching for reasons other than it's lead actors......i'm still picking my jaw off the floor as i write.......the story of deewangee (and i'm being generous with the terminology) is a convoluted mix of primal fear (richard gere and the very yummy ed norton), darr (srkkkkkiran) and every other lop-sided love triangle you can think of with real-life references to the late music czar gulshan kumar who before he was brutally killed was the baby-faced genius who turned t-series into a big player in the music industry....hotshot lawyer raj goyal stakes his name on the line when he successfully defends a young music teacher for a charge of murder...only to find that his naive client isn't what he thought he was.......and of course coz this is a hindi movie.....there's a pretty young lady involved......but what deewangee lacks in originality it makes for in style and surprisingly even substance.....the director anees bazmee....is no genius but he does know that the key to a pulling off a film like this is to keep it moving...and try to surprise your audience while you're at it.......which is something he does manage to do consistently......i was also surprised at the look of the film.....it was not ground-breaking or even different....but it was smooth and polished and managed to walk the blurry line between tackiness (see humraaz sets for tackiness galore) and lavish displays of \"elegance\" (k3g)........not an easy thing to do in bollywood.......bazmee also peoples his script with some tremendous actors who with their mere presence add a weight and a credibility that was missing from the similarly themed humraaz......seema biswas, farida jalal, suhasini mulay, suresh oberoi and to a lesser extent tanaz currim and tiku talsania....all belong to that rare category of bollywood supporting actors who can actually......dare i say it......act......and none of them disappoint in the film.....each takes their brief roles and makes them more meaningful and multi-dimensional than the script ever intended for them to be.....on a side note.....am i the only one who thought that seema biswas given half a chance can be one heck of a pretty lady?but deewangee really gets it's gold star rating for it's lead performers and their performances......urmila matondkar will never be mistaken for a shabana azmi or even a tabu......but she can do what bollywood has increasingly reduced it's female leads to in the 90s.....look really pretty, dance really well, generate chemistry with a telephone pole if she has to and occasionally flail her arms and play damsel in distress while waiting for hunky hero to save her.......all of which she does satisfactorily.......akshaye khanna seems to be finally living upto all the promise he showed in border......the actor who took a self-imposed hiatus for almost three years coz of the sheer stupidity of the scripts being offered to him.......has now with deewangee, in the last year and a half three fairly intelligent films (one - dch - was downright brilliant) to his credit in all of which he has turned in an excellent even award-worthy performance.......he's an ideal pick for a multi-hero film like this coz he is one of the few actors in bollywood who is a giving actor.....by which i mean he has enough acting chops to both share the screen with another powerful actor or command the screen on his own.....khanna has the more conventional knight in shining armour role in the film.....but he gives it his all and is equally convincing while being empathetic to a naive client, testing his psychopathic foe's limits and romancing urmila in the alps......on another side note - i have half a mind to personally go and burn down those bloody mountains - the way indian filmmakers have embraced switzerland - it's like they all have dual citizenship or something - either that or they all have yash chopra alter egos...which is a very scary thoughtthis is my third review in succession of a film with ajay devgan as it's lead .....and i'm fast running out of words that aptly describe the level of his skill and subtlety as an actor......but he is shaping up to be one of those actors who are a genuine pleasure to watch regardless of the film they are in or the role they are portraying.....devgan gets the more showy role and as is his wont - embraces the role with a vengeance....he's excellent as the shrewd now i have a split personality-now i don't tarang.......his transformation from one personality to the other is genuinely chilling and yet he manages to be likable enough so much so that in his final scenes......i actually felt sorry for the brute......it's nowhere near the virtuosity of company or tlobs.......but it's miles ahead of the normal nonsense we get served up as acting on a regular basis.......on every other level deewangee inhabits the kind of mediocrity i initially expected from the film......it's songs, choreography, dialogue, cinematograhpy even it's direction are all just about okay.....not bad but not great either.....but deewangee never aimed to be a masterpiece.....it was meant to be a commercial who-dunnit......the kind that bollywood can and does churn out on a regular basis but not the kind that will rewrite cinematic history......it does achieve it's modest goal and in devgan and khanna.......actually comes close to being something even better.......but not quite........final rating - 5/10 - a smart reworking of a been-there done that plot with some fine acting.....that's about it","imdb_rating":0,"our_rating":0,"algo_label":0}]