[{"heading":" Piece of trash","review":"The movie was a piece of trash and a garbage of a movie.The Karishma and Akshay pair attracted me to this litter.Story is nothing new here.Just a regular old love triangle.Acting is average from all except from Kapoor.She has done a good job.But as a fan of Karishma.I request others to avoid this trash at all costs.Abhisek Bachan is average.Akshay is passable but was good in the climax scene.Personally i don't like Dharmesh Darshans movie.I liked Raja Hinduatani.Dhadkan was average but it had good performances and songs.This and Bewafaa were terribly made movies.Script and dialogs are weak.Karishmas character has a hang over from Sridevis in Chandni,Abhi also has a Rishi Kapoor hang over from Chandni,Akshays role remind us of Anils and Vinod Khannas in Chandni and Taal.The script has too many loop holes.The biggest draw back was Abhi Karishma pairing who were dating at that time.Sadlly there is no chemistry.Locations are too common.Songs are forgettable.With the exception pf Zindagi Ko Bina Pyar the songs are boring and fails to linger in your memory.Avod this at all costs.If you are a fan of Karishma i am not forcing you to avoid it or watch it","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Okay to cheat","review":"This film is horrible. Who in their right mind would go back to someone that's hurt them or cheated on them? This film makes it seem like it's ok to do so and forgive the person. Not the greatest message! Two thumbs down 👎🏼","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" A real life pairing doesn't always work on reel","review":"Many times a real life pairing falters on screen, recently being Saif and Kareena, Abhishek and Karisma were engaged during the film but sadly the film was a failure. This was those days when Small B was giving flops after flops. The film is a boring love triangle with typical twists and turns, conflict similar to EK HI BHOOL(1981), The film is a remake of a 1981 tamil film too hence the regressive handlingDirection by Dharmesh Darshan fails to recreate DHADKAN Music by Nadeem Shravan is saving grace, all songs are melidious Abhishek Bachchan was raw those days and though he tries hard his expressions in some scenes falters, Karisma repeats her crying performance she did normally those days Akshay Kumar is second lead and is okay Amongst rest none impress","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Usual story from Bollywood which easy to guesses","review":"Very bad story with many weakness point. Like I said in many Hindustan films, \" One woman and two man, the woman choose her first love of course\". boring story from Bollywood, and very disappointed movie because she should try new love not just same love. Love is not just one, we must try to find the right one not just with only one person. Especially after he/she already hurt us very deep.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" Yes, I've also seen Ek Hi Bhool","review":"Haan Maine Bhi Pyaar Kiya is a melodramatic, unconvincing and unoriginal movie which offers nothing new to its audiences. The film's director, Dharmesh Darshan is the one who made crappy films like Raja Hindustani and whose only passable film was Dhadkan. Here he tries to tackle a serious theme of marriage and infidelity but the execution is so poor that nothing really works. The story is actually a copy of T. Rama Rao's 1981 comedy-drama Ek Hi Bhool, a film I really like, but here everything is predictable and boring. Abhishek Bachchan plays the leading role, and he is very average. Karisma Kapoor overdoes her part to the hilt, which she sadly does every time she plays underwritten parts of this sort. Akshay Kumar's character is very similar to his role in Dhadkan, and he is okay. The film's ending is as expected sugarcoated, contrived and clichéd and the same can be said about the film itself. If you ever get the chance to see this film, just avoid it.","imdb_rating":3,"our_rating":0,"algo_label":0}]