[{"heading":" Typical Darshan Action Movie","review":"Suneel and Dharmesh Darshan brothers who came into the film making business with blockbusters like Lootere, Raja Hindustani, Dhadkan, and hits like Jaanwar, Andaaz and a few others. But, Suneel just like his brother ended his career with 2 back to back disasters Mere Jeevan Sathi and Shakalaka Boom Boom. Mere Jeevan Sathi can be put in Darshan's worst romantic film and this one could be his worst action film. Coming to Talash, the film is typical, boring, no good reasons for it to be even an average hit. The film is the typical action which Darshan must have copied from another director because his films are natural and this one feels like a typical delayed 90's film. There is no acutual story to tell, his sister gets kidnapped, his dad dies, his mom becomes insane and he teams up with his cop friend and guide to find his sister, take revenge and kill the enemy? How many times have we seen such typical films. I think the 90s was filled with these typical movies but they had good handling. But, this movie has been badly edited and it looks like it was rushed. The action scenes are done to death and the addition of unusual violence in the climax doesn't impress anyone Darshan. The film is so bad it makes you cringe,though this released before Akki's Hatya which was a disaster, it seems to be even worse. Performances are average, Akshay does OK, Kareena back then was terrible, Ashsish Vidyaharthi is always the typical cop in a Suneel Darshan action movie and his role can be played by anyone because he has the same dialogues, he basically sleepwalks in his role and this role of his makes his role in Mrityudata a classic. Overall, another typical crap which was a box office bomb.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" Bad - Don't Waste Your Time","review":"This movie is a stinker from the start.  The story is bad, the action scenes are bad and most of the acting is bad.  The hero is a super human character that marshals his strength when thinking about his poor abducted sister. The women fall in love with him in microseconds, willing to give up everything for this guy.  He is good looking but that is way to unbelievable - even daughters betray their fathers after a day with this guy.  He jumps through windows of speeding trucks, jumps off of buildings in single bound, dodges bullets, well you get the picture.  There are three decent songs in the movie but the set-up and lead-ins are all too unbelievable.  Leave this one where you find it and get anything else.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Talaash: The Hunt Is Ridiculous...","review":"An action-packed movie, I give the film two stars for Akshay Kumar's talent in playing roles of this sort. This film is dreadful, boring and definitely not worth your time, but Akshay always stands out in the action scenes and tries to be as sincere as the script allows him (it of course does not, but anyway). Other than that - there's just nothing good in this film. A story which had been told a zillion times in the past. His sister is kidnapped, subsequently his mother loses her mind, he wants to find his sister to recover his mother's sanity (huh!). It also has a Kareena Kapoor, who gets forgotten before the nightmarish hunt ends, it has a Pooja Batra (there's no reason to say anything about her is there?), and it has a Raakhee, a great actress who gets typecast as the mother whose tragedy makes her crazy. The scenes are formed with one old cliché after the other. Skip this one - it's a good advice.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" the hunt begins..to keep this on the shelf!","review":"*warning possible spoilers ahead*I'm sorry but this movie sucked right from the beginning! What could have started off with a potential storyline, ended with 3 hours of boring fights, a teetering love story and ridiculous \"jokes\". Since I don't know the language it probably doesn't help me out, but in the case of this movie, I don't think subtitles could save this trash.Akshay Kumar is a good actor, it's just unfortunate that he keeps choosing movies that are best kept on the reel than actually being shown. Kareena Kapoor although an ok actress, spends most of her time shaking than dancing. Every 10 minutes a song or a fight would break out, I mean seriously how much can one person possibly take? Also how does a man survive two bullet wounds in the chest while severely beaten up?My advice? Stay away from this one...","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Decent action movie","review":"This movie was brilliant and entertaining and enjoyable and storyline great and Storyline is good screenplay is good editing is superb and the direction of the movie is great Songs are really good Akshay Kumar does a amazing performance as always kareena is superb as always raj is good ghulshan Grover does well other cast is excellent 7/10","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" the one thing other reviewers forgot...","review":"The choreography was somewhere between bizarre and atrocious. Okay, I didn't go into this expecting Hamlet or Pulp Fiction, but... At least with Bollywood you usually get some catchy songs and interesting dance numbers. Most of the music is blah-synth, a few of the songs are decent though I can't be bothered to point them out - yawn - but the choreography was on par with the rest of the bad acting, horrible editing, dopey dialogue, etc.One star was earned just because Capetown was in the movie. Nice to see Bollywood go overseas on location.Next!","imdb_rating":4,"our_rating":0,"algo_label":0}]