[{"heading":" Excellent representation of one of India's freedom fighters","review":"The Legend of Bhagat Singh is a wonderful representation of India, in the middle of its struggle to throw the British out. As with any with movie with a historical basis, I was a nervous that Bollywood would use artistic license to cheapen the story. In fact, the director, Santoshi shows in details how Bhagat came to develop his views of the British with very little outside distraction.Ajay Devgan is excellent as a the title character, bringing the necessary passion that only he can provide with his steel-y stare. Of particular note is the scene showing the freedom fighters telling Gandhi to stop working within the British framework. Westerners can see the parallel between Gandhi's nonviolent methods and the more revolutionary Bhagat Singh with Martin Luther King's methods vs Malcolm X \"by any means necessary\" credo.As the last reviewer mentioned, it's a great reference for those interested in India's independence struggle and it truly reinvigorated my interest in Indian history.See this movie if you enjoy eastern history, but won't go for the traditional Bollywood flick.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A Fantastic Bio-pic on an Intriguing Figure, but Not Without Flaws","review":"The Legend of Bhagat Singh is one of Indian cinema's most ambitious projects to date.  After three years of painstaking research and set construction, veteran film maker Raj Kumar Santoshi and actor Ajay Devgan shot the film in a short stretch of six months.  The film released early due to competition from other films dealing with roughly the same subject.  Overall it's a pretty solid film but one can't help shake the feeling that it could have been a far superior product if it had been worked on for a short while longer.The film tells the entire life story of Indian freedom fighter and martyr Bhagat Singh who, in a nut shell, grew disillusioned with Gandhi's passive movement and lead an independent violent struggle against the British.Colonial India is recreated magnificently in the film and the British atrocities committed are portrayed with aplomb by the director.  One can truly get a sense of how such frustrating conditions could drive youngsters to violence and revolt.  Some of the film's strengths are its hard hitting portrayal of British atrocities, its court scenes and its action scenes.The film's biggest highlight is its lead performer, Indian actor Ajay Devgan.  The actor single handedly manages to uplift even the most dull and unconvincing scenes in the film to a high quality level.  His every expression and mannerism is carefully calculated to maximize his impact on the viewer.  This man can move audiences to tears or wide smiles with just a few short lines and quick glances from his intense eyes.  His work here is par excellence and can easily rival any work done by any grade-A actors the world over.The supporting cast is good as well, with fellow revolutionary Sukhdev (Indian stage actor Sushant Singh) Bhagat Singh's mother (Indian diva Farida Jalal) leaving lasting impressions as well.The last excellent thing about the movie is the music by renowned composer A.R. Rahman.  The music is not as festive as Bollywood movies usually boast, but that's to be expected considering the subject of the film.  The well crafted, soothing ethnic tunes manage to evoke the right emotions without seeming rash and distasteful.The film isn't without its weaknesses, however.  For one, it's obviously a rushed effort.  Segments of the script seem under developed and the impact of certain national tragedies on Bhagat Singh's mindset is never fleshed out as one would want them to be.Also, Bhagat Singh's political ideology (he was a communist, by the way) is never really spelled out for viewers.  Instead, they are left to put together pieces for themselves connecting the dots from dialogs and incidents in the film to really figure out the main character's mindset and view points.The second half of the film moves at an awkward pace, sometimes lingering on minute details and other times racing ahead and skipping crucial events (which are referenced in later dialog).  Finally, for a film that remains very objective in presenting most events, viewers will be surprised by a very negative portrayal of Mahatma Gandhi and India's first Prime Minister Nehru.  This angle of the film stuck out like a sore thumb to say the least.For all its faults however, Legend of Bhagat Singh has plenty of strengths to make it a superb film.  It tells a great story with style and conviction. It has wonderful performances including one of finest performances ever in Indian cinema by Devgan.  It has great action, moving drama, soothing music, and is (overall) a thoroughly rewarding and entertaining experience.  It comes highly recommended by me.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Brilliant Film","review":"The legend of Bhagat Singh is one of the finest movies of Indian film history.The film shows the lifetime of great freedom fighter Bhagat Singh.The film depicts his life,his struggle and his determination brillantly..The film not only shows the freedom fighter's struggle,but also his ideologies and his idea of a progressive nation and how he moved the entire nation. The photography,the script,the dialogues(power packed and very thought-provoking)everything about this movie is splendid.A lot of research has gone into making this film.Brilliant performance by Ajay Devagan as Bhagat singh,Sushant singh as Sukhdev.Ajay literally lived the freedom fighter's life.The music adds to the film's beauty. Raj Kumar Santoshi's brilliant effort and a fitting tribute to the son of the soil.Bollywood should be proud of this masterpiece.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One of the Greatest films from Bollywood.","review":"This film is undoubtedly one of the greatest (for me it is the greatest one) movies from bollywood's basket. Director Rajkumar Santoshi has as usual proved himself as one of the few excellent directors bollywood has.He has done a great task of research before making this film.Each and every department of this movie is just marvelous.Every incident is shown with 100% touch of reality.Everything ,right from sets to dialogues creates the real time of that period.As far as acting is concerned, i think this is the most powerful performance from Ajay Devgan.No surprise he got national award for this film.Other actors in film too deserve 100% appreciation.Sushant Singh has been wonderful, so was Raj Babbar.I wonder why this film was not a blockbuster at box office.Well......we all know why....?it wasn't a rubbish stuffs from badjatya,johar or chopras.Well full marks and thanks to Rajkumar Santoshi for this movie.Must see this film.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Very intense and thought provoking","review":"As I preach that comments are and should be taken no more than personal opinion of an individual, I, right at the outset would say that GO, GET & WATCH this masterpiece. The director seems to have done his homework properly. Very realistic sets, appearance of characters. As far as story is concerned or better say truthfulness of the story is concerned, history poses as one of the toughest problem. There is no going back. The conflict between Gandhi's non-violence and Bhagat Singh's Tit for Tat philosophy is one of the most touching points of the movie. It eventually leads to execution of Bhagat Singh. How true is that? I am wondering and will always wonder with hope that either Gandhi or Bhagat Singh would come in my dreams and tell me what the truth was. But nevertheless, it is a great movie to watch which will stir emotions. Ajay as Bhgat Singh is brilliant. He is among the finest actors in India indubitably. The other character that impresses is Sushant Singh who makes an impact with his intense performance. All in all, all have done justice with their characters and fit well. Director did good home work and hence a movie that we should be proud of is out there on someone who is perhaps not internationally as famous as Gandhi but for sure was a great freedom fighter, real patriot and a great son of Mother India.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Simple narrative and top notch acting","review":"This movie would top my list of all the patriotic movies I have ever watched. To say the least I have seen a lot of this genre. Rajkumar Santoshi as already mentioned in the other comments must have done a lot of research to come out with such minute details. The narrative was very simple and the fact that it could reach out to the larger mass is evident. That indeed did cut down on the international appeal. But no complains as the objective set out is achieved. Now talking about the acting. It would be only fair to say that Ajay's acting in this movie is at par with his role as Mallik in RGV's \"Company\" if not better. To get into the skin of such a legendary character and to act like him was an ardent task and Ajay looked effortless while doing the scenes which according to me would give the Khans a run for their money. I had tears in my eyes, when the three martyrs break into that \"Rang de basanti\" mood in the climax. It will be remembered for a long long time from now. Last but not the least the supporting cast did a splendid job, which is crucial in such a huge feature. Everyone lived out their respective characters. With special mention to the Court Room scenes and the Hunger strike scenes in the cell. There is a lot the young Indians should learn from this movie which in turn would make Bhagat's sacrifices worthwhile. A sure winner from the first shot to the last. A highly recommended must see which should get nothing less but 8/10.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A LEGENDARY FILM","review":"Reavan recommends The Legend Of Bhagat Singh Product Rating : Plot revealed in review  : Somewhat revealed`The Legend of Bhagat Singh' is an excellent example for flawless filming of the life of a magnificent martyr. Raj Kumar Santhoshi is a director known for raising many quiescent questions and not supplementing the same with adequate answers, but this film was entirely different. The director did the film under petrifying pressure rapidly racing it out with five other filmmakers in bringing the brilliant Bhagat to tinsel town. The superceding selection of authentic actors would have greatly given initial comfort to the director. Ajay Devgan as Bhagat Singh, Susan Singh as Sukhdev, Santhosh as Rajguru, Akilendra Mishra as Chandrasekar Azad, Raj Babbar and Farida Jalal as Bhagat's parents all of them made a mind-blowing mark for themselves in this miraculous movie and in the history of Bollywood. The sub cast lead by Amrita Rao, who plays fiancée were no inferior in delivering the goods. A particular mention to be made of the jailor, and the actors who played the roles of Emerson and Gandhiji .The soundest strength of the film was the amazing ability of Rajkumar Santhoshi to impeccably interweave sentiments and dramatic scenes amidst the course of the film , jubilantly justifying history all the way. The suitable sequences for the former fact are the court scene where gosh approves, Sarfaroshi Ki Tamana song, Bhagat's farewell to his mother etc. The cinematography and art direction have done wonderfully well to keep up with the classy cinema. The lyricist and dialogue writer have been efficiently equal to the tumultuous task and their resourceful role has been a pivotal point in the film. One phenomenal personality who had lent the cutting edge to this memorable movie is `Music Midas' a r rahman. The way rahman marvelously meddles with our minds, moods and music is yet another record of his activating ability and acquaintable acumen. He deserves a resolute round of applause for unbelievably using Sonu Nigam and Sukhwinder Singh. Though the film had not tipped TIPS, the producers benevolently at the baffling box office, the immaculate impact it created is not negligible. It is slowly and steadily creating a sound stardom for Bhagat Singh amongst the youth of the country, which was the cause of the film.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great movie for the patriots","review":"I think a great movie on the history with great acting, direction, music, Photography, effects, sets, clothes and over all the story.  The movie has got that touch in it which really makes a person feel that what has happened with the actual person, is shown in the movie very exactly, and specially when the information is coming from the brother of the person.  I think this movie is really worth watching and in fact I liked it so much that I bought the DVD of this movie after watching it in the theater.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Great Movie With Ajay At His Best","review":"A must watch movie for any patriotic person.Watch it for Ajay Devgan at his best.Sushant is impressive as Sukhdev.the screenplay is tight and the movie outplays it's counterparts like 23 March 1931 :Shaheed.I liked the casting and the costumes.Rehman's music is excellent esp. the songs like Desh Mere & Sarfaroshi Ki Tammana. All in All An Excellent Attempt To Remember The Sacrifices Of Soldiers Of Freedom. 10 out of 10 for this one!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Bhagat Singh's Story","review":"Santoshi's 'The Legend of Bhagat Singh' tells a detailed biography of the martyred hero. He does provide both the good side and the dark side (his obsession blinding him to the fact that it's wrong to teach children to make bombs). Santoshi also shows the clash between Bhagat Singh's and Gandhi's viewpoints quite effectively. He has tried to stay historically accurate and even though it was released during the same time as Guddu Dhanoa's snoozefest '1930 Shaheed', 'The Legend of Bhagat Singh' triumphs above that and is a masterpiece in comparison.Ajay Devgan, though intense roles are his strength, may seem like an odd choice to play the title role, especially because there is no physical resemblance and he is too old for the part. Otherwise, he delivers a winning performance. Sushant Singh and Akhilendra Mishra are equally powerful. The supporting cast that includes an excellent Raj Babbar, a sincere Farida Jalal and dusky beauty Amrita Rao leave a mark. I liked the actress that played Durga who seems to be an important female figure in Indian history. I would like to see a movie about this woman. The actors who play the Brits are horrendous.The cinematography is fine and A.R. Rahman's soundtrack is another winner. Most of the songs are patriotic but there are a few different numbers too. The background score, though beautiful, is intrusive at times and kind of adds a melodramatic feel (when that isn't necessary).'The Legend of Bhagat Singh' is one of the fewer biopics in Indian cinema that tells a good story while attempting to stay true to the facts. Some might find it difficult to watch due to the violent content but it is a movie that is worth viewing.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Students can use this movie as a reference for study on Martyr Bhagat Singh.","review":"Assalam O Alaikum! This movie is on the third number in my favorite movie list after Sholay and Lagaan. After watching this movie one can say that the director has done a lot of research on the life of the legend because each scene and every aspect of the film reveal the hard work of the director and his research team (writer Anjum Rajabali) who has done a great job. RajKumar Santoshi has given his 100 percent in making this Masterpiece and will be remembered till the Indian Film Industry exists. Everything was too perfect costume, sets, cinematography, music and performances. Ajay Devgan performance for this role will be rated number one in his acting career. Right from his first movie (Phool aur Kaante) he has proved that he is a good actor and brilliant performer but Indian audiences, critics and directors came to know after so many years. This movie deserved 5 out of 5. Allah Hafiz","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" This film is a staple on my top ten list!","review":"There were 10 reviews for this film before mine and they all rated it 10 out of 10 stars. If that's not enough to convince you about how powerful this film is, then read on. It's one of the best films to ever come out of India and can also boast some of the best acting talents as well. The narrative is quite simple. This is the story of the legendary Bhagat Singh and his friends, a group of young boys who idolized Ghandhi as children but became disillusioned as they grew into teenagers and witnessed that none of Gandhi's peaceful tactics seemed to have worked on getting the British colonialists out of India nor stop the oppression. Steadily, they begin to rebel and form their own group and politics and soon emerge as freedom fighters. The incomparable Ajay Devgan stars as the grown up Bhaghat Singh and he is just flawless, he shoots this character into the stratosphere of acting that you eventually find yourself believing that this man might very well be Bhaghat Singh. He owns the character, he becomes the character, he inhabits the very essence of this freedom fighter and makes it his own life for the duration of the entire film. Amrita Rao is a dream to see, a breath of fresh air after viewing hours of the violence, bloodshed and senseless British nonsensical banter and poor excuse for logic. She stars here as the suitor for Bhagat but is rebuffed by the man she now loves and respects. You've heard the stories, now see it for yourself in The Legend of Bhagat Singh.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Damn this movie needs to be re-released!!","review":"I was 10 years old when i first saw this film.. and now i'm back after 10 years to write a review about it why i felt a need,? i don't know but i guess i just wanted to.. Well the movie starts off from the ending,yeah you'll know when you see it yourself.. and right from the first minute you are glued to the screen i wouldn't spoil it any further..Because of the time of it's release i don't think a lot of audience was able to see such an important film especially for us Indians. I beg the makers to re release this gem so that our generation remembers what it took to get freedom and are we actually free?I Thank each and every person involved to make this movie come possible..","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" You will live this movie🙏🙏🙏","review":"Motivation on another level\nIf you feeling down\nIf you feel like I am breaking from inside\nThen watch this\nBest movie on Bhagat Singh\nYou will be Bhagat Singh follower after watching this\nAjay devgan at his best\nBest work of Rajkumar santosi\nEvery character of this movie is looks real\nThis movie will take you in that era\nHatts offf","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Sarfaroshi Ki Tamanna...","review":"The struggle for independence rested on the twin pillars of Gandhi's non-violent protest and the 'tit-for-tat by any means possible' protest spearheaded by Azad, Bismil and Bhagat Singh. The Legend of Bhagat Singh traces the life and times of Bhagat Singh. The film starts as a jumbled collage of rapidly moving pictures, shows a very young Bhagat Singh who is witnessing the Jallianwalla Bagh massacre in a \"surreal\" way, then moves to his getting thoroughly disillusioned by the backtracking done by the Mahatma, and picks up steam as the young college student Bhagat turns into a firebrand. A ragtag team of comrades gather and nucleate around Chandra Shekhar Azad to rob the train going through Kakori. Then Saunders is murdered by the revolutionaries. Finally in an attempt to show the nation that they are serious revolutionaries and not terrorists and to win popular support for their cause, they blast a bomb in the assembly and are arrested. Many months in prison follow with deprivations, a fast to improve conditions in jail, torture and force feedings. The trio of Bhagat, Rajguru and Sukhdev are sentenced to hang for the murder of Saunders but not before the nation is energized and change is in the air.Who will not be inspired by such a stirring tale that is reasonably well told? But I cannot help compare this tale to the one told to us by Manoj Kumar in Shaheed. This vibrant colorful tale pales in comparison to that stirring take in black and white so many years ago. It seems heavily inspired by the older film, many songs and situations parallel the old. Sarfaroshi Ki Tamanna was not penned in that jail - so if it was an add-on in Shaheed, it was certainly \"copied\" from that version here. TLOBS falls short in a few areas - it is overly dramatized in many segments and this is a shortcoming for a film that has the backdrop of patriotic fervor. Even a subtle film will do the job, and in fact might do it better as shown in Shaheed. The romantic interlude song was the most jarring, why was the Punjabi Kudi dreaming a fantasy number in the Kashmir mountains? I would have been happy with Sarson Ke Khet. The last song and the trio walking through an interminable Bhool Bhuliaya of corridors was not needed. And why were the women folk on the outside? Was the hanging not moved forward by 12 hours? These faults in the scripting made the film seem like a hurried effort.The acting ranged from very good to OK. Sushant Singh did a very commendable job as Sukhdev, as did Santosh as Rajguru, Ajay started out shaky but settled into the role quite well by the end of the film. Akhilendra Mishra was excellent as Aazd. The entire British cast was abysmal and the court scenes were quite bad. Bhagat's family was very well depicted. All in all I think this was a decent and informative film, but it could have been so much better if the director had been able to restrain the histrionics and the overly dramatic moments. I give it an A- for effort but only a B for the overall film.A word about the music - I hate to say this as I think AR Rahman is a genius. But the way the familiar songs Sarfaroshi Ki Tamanna, Pagdi Sambhal and Mera Rang De Basanti were composed made them seem distorted. I wish he had stayed with the original tunes. This ruined the soundtrack for me.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Best Tribute to the Legendary Shahid Bhagat Singh Ji 🙏🙏🙏","review":"Inqalab Jindabaad 💪💪💪\nJai Bharat 🇮🇳🇮🇳🇮🇳\nVande matram","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Real truth","review":"Everyone should watch this movie as this movie shows some truth of history.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Not the easiest Indian film to watch....but a very important film.","review":"s an American, I had no idea who Bhagat Singh was, though I was familiar with the sort of repression that led to his movement. The British were brutal when it came to controlling India. The nation was huge...and the Brits realized that the only way to control such a large nation was through terror and violence. The film \"The Legend of Bhagat Singh\" does a great job in showing the massacres, the torture of prisoners and the coercion of confessions through beatings...and this is something folks outside of India must know about and accept that it happened. And, as a retired history teacher, I really thought this was a very good and important film. My only reservations were the singing. I know that most Indian films have a lot of singing...that is almost expected. But to throw in a fluffy love song in the middle and a song as the three men are being led to the gallows sure did a lot to deflate the otherwise powerful film. Ajay Devgn was great in the lead and the likeness to Singh was definitely present. The script also was very powerful and I found myself tearing up many times. But the songs...well, a couple of them just had to go. Otherwise, a very powerful and memorable film.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Epic, Educational and Entertaining","review":"A historical is probably the toughest kind of film to make. One has to not only educate the viewer but also enlighten and entertain the audience. T.L.O.B.S scores in may fields but it works mainly because it tells a simple story of a complicated man with extreme sincerity. Story? Well if you're Indian and you don't know the story of Bhagat Singh - then you're probably not worth telling it to. If you're not Indian and you don't know the story - I strongly recommend you watch this one instead of reading my mediocre narration. T.L.O.B.S. takes us to the world of Bhagat Singh and a country under British Rule. That's another plus of the movie. It feels so real yet magnificent. I've always been a fan of Raj Kumar Santoshi and I feel the reason he stands out is because nobody can make a better hard hitting drama than him. In T.L.O.B.S. as well, he gives us some shocking scenes and clap-worthy dialogue. Bhagat Singh's transition into a fearless freedom fighter is shown with brilliance. Also, the courtroom scenes are gripping due to powerful direction. There are some minor flaws here and there. The main problem I have with the film is in the narrative. Santoshi has packed a lot into the picture but he forgot to insert a few things that I felt were important since you're making a film on his life. First, how did Bhagat feel when he cut his hair? What about his parents? Also, Bhagat Singh's atheism is not explained well enough. I felt those things needed to be added in the film. There is also a point in the second half when one feels the narrative starts to stretch and nothing is happening. Editing is not crisp enough. The writing is terrific for the most part. The screenplay is straightforward and has only one objective – to tell a story of a legend. Another thing, the film is not afraid to express itself but it also does not jump to conclusions. Note the scenes that feature Mahatma Gandhi. Those are some significant portions and they depict truth more than opinion. A.R. Rahman's music is underrated. In fact, I liked most of the songs and I felt that they were not given enough appreciation, but then again, neither was this film. The technical aspects are all brilliant from cinematography to sound. I would like to point out another thing here – the background score is just out of this world.Santoshi always extracts the best performances from his actors and this film is no exception. The film belongs to Ajay Devgan and there should be no doubt. Before watching this, I did not really see Ajay as a Bhagat Singh because despite him being a Sikh, it did not suit him – but boy was I surprised. He puts even more life into an already powerful character. Just Amazing.Another performance I'd like to mention is of Sushant Singh – who I felt was another surprise. He's terrific. The guy who plays Rajguru is also efficient. Raj Babbar is a delight to watch and Farida Jalal is as always, wonderful. Amrita Rao is okay. The hero her is Raj Kumar Santoshi over anybody else. A brilliant director who back to form after giving a few average to below average films in China Gate, Pukar and Lajja. This is Santoshi at his best.Overall – A brilliant take on a freedom fighter that many have not justified. Ultimately, the film motivates you to also tell the story of a legend named Bhagat Singh. 4.5/5","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A gem in the history of cinema!","review":"Stunning, absolutely stunning. Whenever one witnesses a film like 'Legend of Bhagat Singh', one can only just stare and mentally get back to the earlier days. It's hard to find a single flaw throughout the film as the whole cast and crew join hands to give a stunning presentation of the events that took place in 1928 British-India. Ajay Devgan is absolutely brilliant, he gives a performance of a lifetime! Devgan effortlessly gets in the shoes of the legendary patriotic hero and takes us on a ride through history. An excellent performance from almost the whole cast and above all Sushant Singh who gives his very best as 'Sukhdev'. Top notch performances along with a beautiful score is not all you will get, there is much more here that makes the film much more than just a biographical epic.In the list of top Biography epics like 'Joan of Arc - The Messenger', 'Queen Margot' and many more, 'The Legend of Bhagat Singh' definitely hits the list as well. It's a true masterpiece.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great freedom fighter of India, overshadowed by Corrupt politicians and Gandhi followers","review":"The legacy of Bhagat Singh told in a fine way, the movie is a benchmark, its very very different from the normal stereotype movies, which goes ga ga on Ghandhi and depicts That the Freedom struggle and the independence movement has everything to do with Gandhi alone. The movie shows the love for the country by this youth, who quits Education, family, relationships, marriage, money, fame & kisses death @ the age of 23 & shows Ghandhi in true colors, a well established leader who has great powers & influence, but who fails to save the 3 youths Bagat, Rajguru and Sukhdev for his political gains and ideologies The movie starts with child Bhagat, who witnesses the autocrats of Britishers.. he grows up in the patriotic atmosphere as his parents and uncle take part in active freedom struggles, As a Kid, Bhagat is a great follower of Ghandi, his principals and follows him.@ the age of 12 he witnesses the Jalianwala Bagh massacre & gets highly disturbed by it The movie than switches to a young Bhagat(Ajay) in college silent yet furious in thoughts ..he joins the HRA(later known as Hindustan Socialist Republican Association) He quits Religion, adapts Atheism & communism ideologies, Walks away from home as his father arrange marriage for him.. with the death of the top leaders of HRA, he jumps in to action and takes the party forward, For taking revenge of Lala Lajpat Rai's death he and other revolutionaries plot Saunders murder and execute it, he becomes wanted by British govt @ that time he throws bomb in the assembly, surrenders to police, so that he could make his voice reach to the general public via the prosecution process He is successful in it, the people start hearing to the views of the young and vibrant Bhagat Singh, whose demands and ideas are way ahead of Ghandi, when its about the people farmers, workers, traders, poor etc & The demand for total Independence above everything the current Indian leader Ghandi is forced to demand what Bhagat has demanded to sustain his image This is the historical movement, where Bhagat's popularity is parallel to that of Ghandhi if not above him. He becomes a threat to the British Govt He and his friends are executed on March 23, 1931, Bhagat Singh(23) Shivaram Rajguru(22), Sukhdev(23)These freedom fighters were forgotten by the main stream politicians(Ghandhi-Nehru)It is pity on our government who has tried to hide the reality from the generations after Independence. They have made our great heroes terrorists in School books so that coming generations should not have much interest in reading about them.His History in written in his own blood, a story of struggle, friendship, & One of the biggest betrayal by Ghandhi towards him and Indians","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Most notable artwork of our times.. \"Leave my land or Get thrown out\"","review":"Mr Santoshi, devgan and Rahman performs their career best in this touching magnum opus. Rajkumar santoshi handled so many genres intelligently but when it comes to this movie the amount of research and efforts done must be appreciated. Mr. Devgan has given his career best earth shattering performance... When i have seen portrayal of legendary bhagat singh by Devgan.. I was like OMG!Songs were delightful..every song is unique and melodious, I can not name just one song from this album... all songs stands out with its own speciality. Lakh tnuk tunu\" filled with lots of energy...All the actors have done superb job. Friends of Bhagat singh are intrestingly portrayed by respective actors.\"Leave my land or Get thrown out\"","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Masterpiece!!","review":"The movie is excellent. Bhagat Singh was an extraordinarily brave man who is portrayed very well by his actor in this movie. The movie is a little too violent in nature for anyone too young. Hence, small children should not see it. The movie shows how much so many suffered for Indian independence. The fehringee rule in colonial India was brutal, barbaric and oppressive. The film doesn't hide this fact and the amount of violence towards the revolutionaries is difficult to watch because of its grotesqueness. However, it was necessary, so that the viewer gets an idea of the truth. This movie will bring any Indian to tears and make him realise the sacrifices made by our forefathers. 10 marks out of 10.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great movie for great character","review":"It is one of the best patriotic movies made on Indian independence. Fantastic songs, wonderful music, nice acting. This movie has good flow on the life of Bhagatsingh. Acting of Sukhdev is awesome. The scene of Gandhiji with British for releasing of Bhagatsingh is little bit negative and offensive for Gandhian. Plot and scene selection is better compared to other contemporary on the same subject. I will recommend everyone, who is interested in Indian history and Independence should watch this movie. Again nice songs, I play it all the time. Ajay Devgan has once again proved his acting skill and done a fantastic role play for Bhagatsingh. This movie develops respect for the Independence and for the people who struggled to achieve it.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Wake up Call","review":"Men come & Men go but some people do really make an impact & Bhagat Singh is one of them.Rajkumar Santoshi has really portrayed this character to the BEST.The likes of this movie can only be compared to \"Brave Heart\". History is written by those who dominated it. That's why we've got to know the greatness of Bhagat Singh so late.A Must watch for of all those who love their motherland on how our Heroes have laid down their lives for our freedom. Every moment of pain they went through, every drop of blood they have shed has been well shown. Rahman's background score & music ROCKS.It will really put you down to tears by the end of the Movie.Thanks to Raj Kumar Santoshi for such an excellent master piece portrayal of Bhagat Singh.","imdb_rating":10,"our_rating":0,"algo_label":0}]