[{"heading":" Naushad's Brilliant Score Makes Taj Mahal Great","review":"I saw Taj Mahal on opening night here(Nov. 18) at the Naz8 in Lakewood,California.The film had many flaws in the writing and in some of the performances.Akbar Khan did not present it in dynamic, powerful,cinematic terms.He treated it a though he was making an expensive TVserial.But what makes it eminently watchable even as cinema are the two actors who play the lead roles.Sonya Jehan and Zulfikar Sayed have lived up to expectations.Here credit must be given to Akbar Khan who has taken this bold step of introducing new talent in lead roles.But the greatest credit Akbar deserves is for bringing back India'greatest composer the legendary Naushad.His music(both in the songs and the background music) is superb.I intend to see this movie again and again just because of its music.And that is why I have given it a 10.Naushad's earlier hits like Anmol Ghadi, Baiju Bawra, Mother India,Uran Khatola and Mughal-E-Azam(to name just a few) had twelve songs each. I wish Taj Mahal had the same number.If Akbar had done this TajMahal, with all its flaws, would have been the biggest hit of all times.Even now numbers like Ajnabi Thero Zara,Mumtaz Tujhe Dekha and ApniZulfen will carry Taj Mahal far.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Excellent!","review":"Having read one or two \"iffy\" reviews of this film, I went to see it without any great expectations. And, for the first ten or fifteen minutes or so, with all the battles and the intrigues going on between the sons of Shah Jahan, I did wonder what all that had to do with \"an eternal love story\".However, when the \"real\" story of the film got going through the flashback device, I was more than pleasantly surprised - and very pleased - with the film.I thought everything about the film was great - the colour, the sets, the costumes, and especially the music. As for the acting, one has to make allowances for the sometimes kind of stilted acting and dialogue that these epic Indian films seem to carry with them. Nevertheless, as time went on, you really felt like \"hissing\" the older queen Noor Jahan and empathising more and more with the young lovers, Prince Khurram and Arjumand. I thought that Zulfi Sayed and Sonya Jehan played the latter very well, whilst I kept thinking how gorgeous Sonya Jehan was! Later, and much to my surprise, I found out that this was her film debut. Let's hope we see much more of her in the future.What particularly interested me was to see close comparisons in the sets and music of this film with that other great spectacle, \"Mughal-E-Azam\". That came out especially in the interiors of the great palace, and more particularly in the duet with singers conducted between Arjumand and Laadli Begum in front of Prince Khurram. It was only afterwards that I realised that Naushad had composed the music for both films! As with \"Mughal-E-Azam\", this film is one definitely to be seen again, and the DVD purchased tout suit!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Taj Mahal is superb film made for world audience.","review":"I saw Taj Mahal with many of my American friends who had never seen Indian movies. They were fully involved in the film up to the end, their impression that only Hollywood can make good films was shattered (films like Veer Zara will confirm this belief). Akbar Khan has made this film for the world audience. They loved the music and surprised that an Indian composer (Naushad) can compose fabulous symphonic music. The critics in the Indian media have slaughtered this film, I am shocked at their motivation to do so.One should see and appreciate the director's concept and presentation; instead the negative critics are writing their own script and treatment in an attempt to slaughter this film. It is clear that Akbar Khan is one of the top directors in the world if one views this film with out any prejudice, and background music by Naushad is his best ever.One should see this film not just once, but many times.Zakaria Ahmed","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Fantastic!","review":"Absolutely loved it! The sets were mind-blowing. The acting was pretty good considering they weren't popular actors. Zulfi looks every inch the prince. Pooja Batra is absolutely fantastic as Nur Jahan- makes you wish there were more scenes of her. Arbaaz Ali, Vaquar Sheikh and Arbaaz Khan were good! Kim Sharma made the perfect spoilt princess and Sonya Jehan was good considering this is her first film! The songs were beautiful! Nicely picturised. This film is for all those who want a break from the commercialised basically cheap kind of films being made nowadays in Bollywood! Don't know about the fate of its DVD release. Heard it was suppose to release again! Would definitely watch it again.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Taj Mahal Degraded","review":"A film which took years to make and the producer boasted of a big budget spent on the film. When you see the film you wonder where was the money spent? Non Star Cast, Card Board Sets, Garish Make-up(looked as if the actors faces had been painted with spray paint.)Technically poor, Direction or let me correct it misdirection is there in plenty. In the technical department even student films are of a higher quality.The story was to be the true story but Akbar Khan has distorted history beyond recognition. Its appalling to watch history being turned and twisted to the whims of the ignorant so called director. The actors need to be sent back to a acting school to learn the very basics of acting. The performances are extremely poor and its shocking how such a talent less crew was selected.Sex has been added and obscene content has been forcibly added to market the film. Even on this front too the director fails miserably. Its untrue of what has been depicted and is completely out of place...Its done in an extremely crude manner and leaves with a sick feeling in your stomach. The music is in sync with the rest of the movie as it too is of very poor quality. Naushad was a big name in the era of the fifties but by trying to comeback he has tarnished his image. Its not his fault as people become senile with age but what about the director who took him. The film director is to old in his thoughts as the results reflect in the drab romantic scenes. He should have seen more work of the younger generations or at least called them to give him some tips on technical know how on today's level of film-making.It has the look of TV serials made in India about fifteen years ago.On the whole Taj Mahal has been degraded to an all time low. The Only hope is that due its Disastrous box office result this awful film will not reach the audience who have discarded this distortion of history.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Can i never watch this movie????","review":"Hello, I try to buy this movie since 10 months!!! But there is no DVD. I'm very sad, that I couldn't found a film, which I really want to see.I've reading the book of Taj Mahal and I was so impressed. And now I must hear that the film isn't come out, because it is a flop in India?I just want to tell my opinion. And If someone can tell me where I can found the film with English subtitle or can give me more informations about it,I would feel very sincerely thankfully.lots of love Jay Jay","imdb_rating":0,"our_rating":0,"algo_label":0}]