[{"heading":" Another delayed movie","review":"I saw the movie on TV that day and i checked out the release date here it says 2001, i was shocked Cos Sunny looks straight out of his ZIDDI days(1997) and Chunky and Naseer look younger Then i read the trivia which says the film had started in 1995 and had to have Sunny in a guest role which was extended and the film was sold as Sunny's film which led to a fight and the delay which showsThe movie is trite which was sold as Sunny's films post GHAYAL It has a mega loud and annoying Chunky Pandey who wears purple suits and orange pants It has Naseeruddin Shah doing nonsense and getting old in scenes(is it just me who noticed his white hair in some scenes) Sunny Deol is his usual self Neelam makes an appearance after HSSH where she was a side actress here she pairs with Sunny after the tripe VISHNU DEVAA(1992)","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Sunny Deol film gone wrong","review":"Sunny Deol has done lots and lots of action films in the rural setting and this is one of them. Normally, his films with the same village injustice theme are quite average but this movie is just too horrible. Sunny Deol's films like Veerta, Shankara, Paap Ki Duniya, Joshilay, and, Dacait were all rural setting action films and they actually were not that bad. Even though some of them had that same typical crap, it was still watchable. However, there is something terribly wrong as the same formula fails to recreate here. The biggest problem is this film released in 2001 where these kind of films aren't accepted anymore. Most of the people from this century watch developed and entertaining films with a different style of entertainment. This film actually should have never released, it started in 1995 and released in 2001. If the film released in 1997 to the latest, it would have still done better than what it did in 2001. Delayed films never do good, with the exception of the super hit Ghatak which was a 1996 release when it started in 1990.Kasam has a typical and badly handled story. Neither is the story worth listening, nor worth writing. The best way to describe the story would be a done to death revenge dacoit drama which is completely outdated. I actually had huge expectations from this film because it was directed by Shibu Mitra who had directed Paap Ki Duniya the hit action film. This film is actually a poor rehash of that as both films are common in terms of storyline although that had a few different things and a much better final product of a film.Direction by Shibu Mitra is horrible, he has put no effort in doing anything properly. The movie's editing is horrible as the movie has no proper start, just lots of nonsensical action for a start and the villain does his usual nonsense and the movie goes on with boring and horrible scenes put together. Suddenly, the central village where the story is set is brought up, and then suddenly so many subplots come up and the movie becomes confusing. One only would wonder when the scene comes where Shankar comes back to chasing and killing the main villain Kala Daku. It's like so much bull crap thrown with less of the main story and more of boring comic and crap emotional subplots.Performances are bad, no one does anything worth giving a clap. Sunny Deol does his same typical village act and he fails miserably in the comic sequences. It looks so made up and there is no actual acting present. The only thing worth watching would be a few action scenes where Sunny is beating the villains but which Sunny Deol film doesn't have him fight? Chunky Pandey is horrible, he is not even worth being called an actor. He does nothing but nonsensical comedy but the first comic sequence where he steals that engineers clothes to impersonate him in the village is hilarious. Naseerudin Shah is a legendary actor but he is completely wasted in this film, I can't believe they would be misuse a legendary actor in a crap film. Sadashiv Amrapukar is horrible as the villain, he was never a good villain.On the whole, the film is a crap film and it's performance as a disaster at the box office is no surprise.","imdb_rating":2,"our_rating":0,"algo_label":0}]