[{"heading":" Nice and entertaining!","review":"Chori Chori is a nice movie which can be great to watch on a family evening.It is about the two characters Khushi and Ranvir who do not fall for each other at first sight but after a certain time. Ranvir is an architect who has built a house for his childhood love Pooja. He asks her to marry him but she refuses. At a party he meets Khushi, a lively woman who is an orphan and lives alone in Delhi. When Khushi loses her job and the flat she moves into Ranvir's house in Shimla without his knowledge and claims to be his fiancée. After finding out about her Ranvir is quite angry but wants to continue the game just to make Pooja jealous so that she changes her mind. But Ranvir forgets one thing, that he could fall in love for Khushi.The movie is quite the exact Bollywood copy of the Hollywood movie \"HouseSitter\" with Steve Martin and Goldie Hawn. Nevertheless I liked it, especially because of the great performance of Rani Mukherjee. She plays her role absolutely convincingly. For those who have not seen \"HouseSitter\", it's great to watch and for those who have seen it, maybe it won't be interesting but they will still like Rani's performance.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" One of the Best of all Bollywood films!","review":"This film is a classic example of the power of love and how it always prevails in the end. Like the tag-line for the film goes 'Everyone falls in love sometime' and it's true. When the film opens to the sights and sounds of a Diwali celebration and you see female lead (played by Rani Mukherjee) you can't help but feel sorry for her helpless, lonely, but optimistic self as she purchases sweets and all sorts for her trusty sidekick an inanimate pal Johnathan (played by an adorable stuffed monkey) but she doesn't stay lonely for long as she cons her way through the next phase of her life after a domestic problem renders her homeless. The people who cast her as Babli in the very successful movie 'Bunty aur Babli' most have chosen her based on how she performed in this film because this down-on-her-luck character has plenty in common with Babli which she played years after Chori Chori! If you love romance, laughter, goofiness, bitter-sweetness and just plain old fun for the whole family, make sure you see Chori, Chori! It's a wonderful film and Ajay Devgan w/ Rani Mukherjee are excellent!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Nice movie","review":"This is a sweet movie with nice comedy by Rani, especially in the first half.  The story is good.  Rani, Ajay, and Sonali all give great performances.  The songs are also very melodious.  The movie is quite predictable at times.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Great Performance","review":"Chori Chori is one of those films that has a small portion of everything. It's sweet, funny, and most of all has an excellent climax-meaning that there's a powerful meaning in the movie. Sonali Bendre and Rani were amazing in here- they make a really great team. The songs are formatted and composed really well. It doesn't look like a remake of anything- you know, like some other Bollywood films. So it's really unique. Ajay Devgan was average in this one, but he can do a lot better. He has in other videos. This is an excellent film, perfect for all ages, occasions, and most of all, for fans of the cast. 9/10","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Delayed decayed","review":"The movie was supposed to release in 2002 and was much awaited due to the promos but it finally released in 2003 after the producer diedThe movie is good in parts but overall isn't greatThe scenes between Rani and Ajay are okay but the other scenes are not well handledThe film is too similar to BOLLYWOOD Hollywood and though this was planned before that got released first so originality is lostMilan Luthria disappoints overall after KACHCHE DAAGEMusic is good but too many songsAjay Devgan looks jaded and his appearance gives away that the film was delayed and his acting looks boring too Rani is good Sonali is good too rest are okay","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" A must watch movie for true lovers and dreamers!","review":"Totally a dream world kind of movie for true lovers. Loved the Rani's bubbly character, with so much positive energy, and spreading happiness everywhere. Ajay Devgan also hits so well in this movie, portraying the role of an introvert, but a deep thinker and lover, and also full of dreams inside. Sonali is always a pleasure to watch. Beeji's role is superb. One of my all time favorite movie. If you think about it logically, then it might not make sense most of the times. A must watch for all, who believes or hopes or dreams about the on screen romance in Bollywood. I am a SRK and Karan Johar fan generally. But Ajay Devgan in Hum Dil De Chuke Sanam and Chori Chori has been one of my favorite 'roles' in all bollywood romance.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A story worth seeing again.","review":"A Bollywood version of the 1992 movie HouseSitter (Steve Martin and Goldie Hawn), about a woman who moves into a man, who she barely even knows, house and turns it into her home.Rani Mukherjee stars as Khushi, a girl who lives all alone in the city of Delhi with her stuffed monkey Jonathan until one day she gets kicked out of her flat by her boss who is angry she has missed to much work. Fortunately at a party she was working at the night before she had met Ranbir (Ajay Devgan) a man whose offer of marriage has just been rejected by his childhood friend Pooja (Sonali Bendre) and has a very large unoccupied house due to that fact.So Khushi decides to move in and inform everyone, including his family they are engaged. When Ranbir finds out he is angry at first, then the two decide to enter into a business arrangement together, in order for him to win Pooja's heart they ill continue to pretend they are getting married until the right time. Which, of course, ends up in hilarious results, which none of them would have predicted.I think this movie is definitely worth seeing! Even though at times it is kind of the classic girl likes boy who likes other girl story it is still good and plays out quite nicely.","imdb_rating":7,"our_rating":0,"algo_label":0}]