[{"heading":" Warning: You may fall asleep during some of the long drawn songs","review":"Storyline: The film spanning 4-odd hours covers in adequate details the happenings at the Kargil sector near the LOC in 1999 when the Pakistani infiltrators had crossed the LOC and had entered deep into the Indian territory and the Indian Retaliation. To know more about the story, I would suggest readers to read the news-items pertaining to Kargil.Comment: If one is looking for a formula story in this movie, then one can be sure that it is absent. LOC is a story of Pure sacrifice, patriotism, courage and lots and lots of bullets and Blood. The movie hall where I saw this film was full of whistles and cheers when the Film shows Indian Bravery. Movie audience seemed similar to Audiences like in an India vs Pak cricket match.Watch the movie as a tribute to the Army's sacrifice and for the characterization of the real-life war heroes (4 PVC honoured heroes) who have sacrificed their lives so that we could see this day. The movie has made a brilliant portrayal of the Army who have battled all odds in rough weather conditions. The film's negatives are that it is too stretched and the songs are extremely boring.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" True Story, Bad Direction","review":"If you have seen very less films, this might be a big one for you. If you have seen lot of films, this is a joke.  The acting of real heroes is portrayed very badly.  Not to mention, there are songs, there are lot of flashbacks, and most importantly, the fighting scenes are stupidily performed. New characters, good direction, would have done a better job, but since it contains all the bollywood heros/heroines, you can predict whats going to happen next.  You do not feel sad when something happens, the emotions they protray is terrible, mainly because we have seen this actor in 1000 other hindi movies. It suppose to be a realistic movie, but it fails to show.  There are times you wondering, you have thousands of army vehical filled with soldiers moving and the pakistanis are bombing at them and none of their bomb hits them.  Are the pakis really bad at aiming or the director made them look stupid? There were only a few characters acting that was very good, but as far it is concerned with plot, action, it is poorly directed. This movie could have been short if they took out songs, flashbacks, stick to the point.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Good potential but horrible execution","review":"LOC could have been a very well made movie on how the Kargil war was fought; it had the locations, the budget, and the skill to have been India's \"Saving Private Ryan\" or \"Black Hawk Down\".  Instead it come across as a bloated, 4 hour bore of trying to meld the war move with the masala movie.  Even the war scenes were terribly executed, using the same hill in all their battle scenes, and spending unnecessary time on casual talk.  Instead of trying to appeal to the indian public, a better movie would have been a to-the-book account of what happened at Kargil (like \"Black Hawk Down\") or even spending time on the militant point of view (like \"Tora, Tora, Tora\").  Even better, it could have used a competent director like Ram Gopal Verma to write, direct and edit the film.  Until  then, I'd like to see some one re-edit this film, with only the pertinent  portions included; it would make the movie more watchable.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Long and boring","review":"The long hyped LOC Kargil movie turned out to be a load of crap, once again, much to the disappointment of eager viewers. When it comes to movies like these, the director should concentrate most on the battle scenes but those are the most flawed portions of the film. Basically ever single battle is the same where two groups of soldiers keep shooting each other until the Indians finally bring a Carl Gustav Rocket launcher and blow up the enemy position. The fight sequences are corny and poorly done. One wonders why they did'nt do that in the first place? Next, the Indian airforce is hardly ever seen. Next, there are long and pointless and crappy songs. Next, there is no story nor any subplots nor any satisfaction of seeing any objectives achieved by the soldiers. Watch it on TV or DVD but I would'nt waste my time in the theatre. Watch it for the witty dialog and some amusing scenes. If you want to watch an Indian war movie, go watch Lakshya instead.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" A wonderful movie...a tribute to our brave soldiers.","review":"LOC is one of the most moving movies ever made. The movie is based on the war that actually happened in Kargil between India and Pakistan. LOC is a tribute, a homage to our brave and selfless soldiers who have laid down their lives to safeguard ours. This movie has made me realize the extent of sacrifice a soldier makes to protect us scores of civilians most of whom he does not even know. It has made me see them in a completely different light and i cannot help but appreciate the effort of a film maker who has tried to immortalize their sacrifice on the celluloid.The movie is long. But that is because the script demands it. The movie has an amazing cast and everyone has given outstanding performances. It is an emotional journey and a saga of unseen bravery and unimaginable strength of character.The film's characters represent the Kargil martyrs and the other brave soldiers of the Indian Army. So you have Captain Anuj Nayyar, Captain Vikram Batra, Lieutenant Manoj Pandey, Lieutenant Colonel Y K Joshi and many of the other brave men who authored the script that made India the winner in the Kargil war. It captures their valor in the field of battle, shows how they dealt with each new challenge and each new hardship with renewed vigor, how they motivated the soldiers under their command under the most pressured conditions and how they destroyed their enemies. It encapsulates the soldier's quest for victory in extremely hostile conditions.LOC Kargil is based on authentic research and gives you the events as they took place. A lot of care has been taken to see that the film is accurate even in its minutest detail. The background score and dialogs are gripping. The songs too, are pretty intense and have been extremely well written and composed. The lyrics motivate you, move you and also wrench your heart out. LOC tries to tell the story of the soldiers and their families. It tells you about the sacrifice that a soldier makes for his country and the loss that his family suffers in the process. As the trailers said...\"every bullet in a war finds its mark... into a woman's heart\". A lot of soldiers died in the Kargil war and this movie makes an effort to show their sacrifice before we forget it. It is a must watch, especially for every Indian in the world.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Superb Tribute for India's Armed Forces","review":"L.O.C (Line of Control) documents the story of the Indian Armed Forces incredible efforts during the 1999 Kargil War between India and Pakistan. In the back drop of peace talks between the two nations, intruders were found crossing the de facto border that divides the two nations. India was completely oblivious to the infiltration as it did not conceive that Pakistan would undertake such actions during attempts to create peace between the two nations. Pakistan denied any involvement claiming the intruders were 'freedom fighters'. However the Indian Army soon came to realise that this was a lie and that the 'freedom fighters' were actually Pakistani Army troops that were deeply entrenched high up in the mountains seeking to invade India as part of its Jihad (Holy War). The Indian Army were told to evict the invaders; after 2 months of fighting, 500 losses, and against all odds the Indian Army emerged victorious.J.P Dutta has done a sterling job in this film. He has been meticulous and paid attention to the smallest of details from the uniform of the various regiments down to their particular slogans, and for this reason this makes it the BEST war film produced by Bollywood. The fight scenes are very realistic and the film is truly based on what happened in those 2 months of fighting.The film particularly focuses on Manoj Pandey (Ajay Devgan), Sanjay Kumar (Suni Shetty), Vikram Batra (Abishek Bachan) and Yogender Singh Yadav (Ashutosh Rana) as these soldiers were awarded the Param Vir Chakra (the highest military award in India) for displaying great courage and bravery. Three of these were awarded post humously.I had read a lot about the actual conflict, but watching this film made me realise truly the trials and tribulations our troops go through. I usually laugh at those who cry during movies, but I found myself doing just that, especially towards the end of the movie when the scenes depict the deceased soldiers being flown home in body bags.This is an incredibly beautiful film with great actors/actresses, songs, stories, and most of all deserves credit for telling the story of the brave young men who gave their today for our tomorrow.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Tribute To Those Who Never Returned","review":"In 1999, I first heard about the conflict in the Kargil area of Jammu and Kashmir in the news. I was very intrigued and watched the news every evening as much as I could but at the same time I was sad when I saw the massive troop movement on the National Highway 1A on the TV screens. Then one evening, my nephew asked why I was feeling sad and I replied that I was sad because of so many brave men were being killed in action. At the same time, not knowing what was \"Line of Control,\" where it was and why, I decided to try and find out about it. After a few months, I read an article that mentioned that J.P. Dutta was making a movie on this.In 2003, after a long time and a lot of work such as research and the availability of dates from various actors, the movie was finally released.In 1999, Pakistani backed Mujahideen, infiltrate the \"Line of Control\" in not just one area but several in the Indian Administered region of Kashmir. At first the Indian army fails to realise what has happened until some of its patrol troops fail to return. Its only when they are found dead, and with the help of some of the survivors, that the senior officers realise that the infiltration is not only in just one sector of the \"LoC\" but in several such as Dras and Batalik. The troops that are there are not enough. All members of the armed forces are requested to report to their respective camp headquarters; from which they are ordered to move towards the region and push back \"the unknown enemy.\" At the same time equipment is ordered to be moved but this takes a bit longer.The cast includes: Saif Ali Khan as \"Captain Anuj Nayyar,\" Ajay Devgan as \"Manoj Pandey,\" Sanjay Dutt as \"Colonel Y.K. \"Joe\" Joshi,\" Abhishek Bachchan as \"Captain Vikram Batra,\" Sunil Shetty as \"Rifleman Sanjay Kumar,\" Akshay Khanna, Rani Mukerjee, Esha Deol and Kareena Kapoor. There's also a small role for the Amar Uphadya, who, incidentally, first played the role of \"Mihir Virani\" in the successful TV series, \"Kyunke Saas Bhi Kabhi Bahu Thi.\" The film, though long in terms of time, is not boring for those who like to watch \"war\" movie and had J.P. Dutta included the Air Force side of the conflict as well as some other incidents, then this movie would have been much longer. But in coming to conclusion, the movie does provide with some breath taking scenery, action as well as special effects. All the actors have played their roles very well and the music score by Anu Malik is worthwhile and the lyrics by Javed Akhtar are superbly written and especially \"Mein Kahi Bhi Rahu\" and \"Simaya Pukar Rahe.\" As I walked out of the cinema, I heard someone comment: \"It didn't make any difference! I don't know where Line of Control is\" and to that I felt like replying: \"Look it up and you will see that its in Kashmir and think of all those brave men who were killed in action. Just think that they never returned to their families or to their loved ones.\"","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A patriotic attempt at a tribute but simply too flawed.","review":"This movie could have been so much better but the director looks like he gave it his best. Many of the props including the uniforms, badges, weapons, artillery, helicopters etc etc were all authentic to the core. There are lot of good things in this movie but the battle scenes are just too cheesy, unreal and overly patriotic to make sense. Why do they always have to use that slow-motion death sequence routine again and again? It is not touching. Its embarrassing.While the actors could er..\"act\" well...they were'nt too convincing as fighting soldiers, starting from how the stormed an enemy post, to their stance. The intensity of the battles comes out through excellent use of sound and men shouting but the tracer bullets flying and the flamebursts from the weapons are simply not to be found. Thus when a soldier is supposed to fire a weapon, it does'nt really show. Also, the explosions from mortar, grenades and shells seem extremely impotent as the radius of the blast is extremely small and unconvincing.The dialog however, is brilliant. Totally outstanding, perhaps worth the entire movie. There are enough swears in this movie on the lines of \"motherfer\" and \"sisterfer\" to give Pulp Fiction a run for its money. But since they are also used on the battlefield under pressure, it does not seem as wanton as in other movies. It is a real fact however, that such swears were used on the Kargil battlefield. Talk about attention to detail! The pressure on the soldiers did show, although the fighting did not. The actors did a great job at what they were told to do. If they were trained better and the action sequences better written and choreographed to make them a tiny bit realistic, they movie could have been a real winner. I did shed a few tears here and there though. Even though the action sequences are so flawed, the actors give it all their energy and the unbelievable sacrifices that the soldiers made were no doubt the driving force behind. This movie is worth watching if you keep an open mind. It is at least a good attempt at an honest tribute, even if at times, it can be embarrassing.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Hourly Repetition makes this a long movie...*SPOILERS*","review":"Okay, I was bored and decided to see this movie.  But I think the main thing that brought this movie down was that there would be a hour of footage, then basically that same hour repeated 4 times.  It consists of 1.  Gathering the troops and discussing the attack plan, 2.  Flashbacks to the men's wives 3. The approach of the troops marching in a long line 4.  Men running up hill and shooting, usually the first getting shot in the head then 3 other men rescuing him.  5.  Defeat of the enemy and calling to base to tell of success 6.  Men flashing back to wives and singing 10 minute songs.  That was the basic movie, and that same order of events happened about 4 or 5 times.  and every time it did a flashback to the wives, it would show the man, then his wife and him.  There were about 10 men or more who would have a flashback so this took up tons of time.  Other than that, the men couldn't kill their enemy except with either bayonets or grenades.  I liked the music and there was a lot of action, though the action was repetitive.  Overall, I probably wouldn't see it again, but it wasn't too horrible.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" A Biting Criticism of LoC","review":"First of all, the movie was 4 hours long.  Normally it wouldn't be that much of a problem, but I think in LoC the movie just dragged on for too long. The assortment of actors and actors is incredible, save that fool Sunjay Dutt: his acting alone ruins any of the talent of the other actors.  Usually I wouldn't be so harsh but I think in LoC he's especially bad.  The dialogue is also way too deep; my 9 year old sister was really struggling with just following the plot.  Moreover, I think the movie is too concerned with being popular with audiences than what the original screenwriters perhaps intended.  What I mean is simply - the movie had the potential to send a strong message about the war, but the director got too bogged down with flaunting the cast, so much of the seriousness of the movie becomes lost. I think there's a shortage of good movies on all the fighting and violence that's going on, so part of my displeasure at LoC stems from that frustration; the younger generations of India, and indeed, of the world, need to be well-informed about the atrocities that are occurring.  Movies like LoC turn the seriousness of the situation into a big joke.  Slowly, we're brainwashing people and normalizing people to the idea that violence in the world is not as terrible, when in fact we need to be teaching the opposite.  I think it'd be a waste of time to watch this movie, and while I was dumb enough to see it (I plead ignorance), I urge the denizens of the world to boycott this movie and any future movie that fails to relay the significance of world politics and makes a mockery out of war.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" slow and boring and too long","review":"I went into this movie with Border in mind. The star cast looked tremendous Akshaye Khanna, Saif Ali Khan, Sanjay Dutt, Ajay Devgan, Sunil Shetty. Then there was the countless actresses including my faviourite one Raveena Tandon. The movie was a total and utter disappointment. Firstly the movie was repetitive seeing the same sequence with different actors and actresses was tiresome. Then there was the boring fight scenes when they said it was releastic they weren't wrong I felt like I was watching the news. One of the things I was very disappointed with was that Saif, Ajay and Abhishek had so much screen time compared to others. Also I think one of the other actors would have enacted Abhishek Bachan role much better. when will directors learn that this guy is nothing like his father. Akshaye Khanna would have done a much better job in his role. Performances in the movie Ajay, Saif's and Monaj Bajpai's were very good. Abhsishek,Akshaye Khanna,Sanjay Dutt and Sunil Shetty's werre average. All the other actors had no scope. Rani Esha and Kareena had the most scenes of the actresses of these Kareena and Rani were good. Esha was poor. Mahima and Raveena had no scope neither did the other actresses. To large a cast and not enough emotion 3 out of 10","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" one hill war?","review":"This was a movie that I hoped I could suggest to my American friends. But after 4 attempts to watch the movie to finish, I knew I couldn't even watch the damn thing to close. You are almost convinced the actual war didn't even last that long. Other's will try to question my patriotism for criticizing a movie like this. But flat out, you can't go from watching Saving Private Ryan to LOC. Forget about the movie budget difference or the audience - those don't preclude a director from making an intelligent movie. The length of the movie is not so bad and the fact that it is repetitive - they keep attacking the same hill but give it different names. I thought the LOC was a terrible terrain - this hill looked like my backyard. The character development sequences (the soilders' flashbacks, looking back to their last moments, before being deployed) should have been throughout the movie and not just clumped into one long memory. To this day, I have yet to watch the ending. But there was a much better movie (not saying much) called Border.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" India wants Pakistan to stay away from Kashmir, and you should stay away from this movie also.","review":"I saw this movie with some Indian friends on Christmas Day.  The quick summary of this movie is MUST AVOID.  JP Dutta wrote, directed, produced and edited this movie and did none of these jobs well.The movie tells the story of the attempt by Pakistan in 1999 to capture part of the disputed region of Kashmir from India.  Supposedly based on fact, you get a hint from this movie of the difficulty the Indian army had in recapturing the area from the Pakistani troops - who occupied the high ground.  But instead of telling what must have been a compelling and heroic story, all this movie does is make the Indian military look laughable and stupid, which I know is not true.I watched this movie with an almost completely Indian audience, who were very patriotic and clearly wanted to like this movie, but also found themselves laughing at scenes that weren't meant to be funny.The script was absolutely abysmal.  It gave the impression that Mr Dutta knows nothing about how an army operates and was using bad war movies for reference.  The result is a script that  is brainless and repetitive.The acting from most of the principals was not stellar, but considering the script they were given, I find it hard to criticise them too much.  As for the supporting cast, all I can say is that I hope they were amateurs.The editing was also pretty bad.  It was pretty hard to follow what was going on for a lot of the time, and music would abruptly end at scene changes.Good things: The cinematography was pretty good, although it was hurt a little by the fact that the movie didn't appear to be colour corrected (the colour balance often varied significantly within scenes). Also, the few songs that were in the movie were quite enjoyable - for the first half a dozen or so verses at least.  Unfortunately they went on a LOT longer than they should have.And the worst crime of all?  This mess is FOUR HOURS LONG.  There is enough here that a good editor could almost squeeze a good 1.5 - 2 hour movie out of what was shot.  Sadly, a good editor was not working on this movie.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" Sadly Patriotic.","review":"I have come to the conclusion that Bollywood does not know how to make War Films. A plain vanilla Documentary would have made more justice to the Martyr's of the kargil. The movie is agonsingly long, too many charecters that hoover over a lost script, a technical disaster and repetious to the core. The filmmaker has tried his best to lend auntheticity by using the real terrain but after an hour of the movie it is like Dejavue. The problem I see is Amateur consultants and dialogue that dilutes the theme and reduces the content to a mear childrens play. Bollywood is the leader when it comes to Musical but when it comes to aunthenticity in depicting a war and special effects the two Movies that come close are \"The Hero\" and \"Gadar-Ek Prem Katha\". This movie is an unmitigated disaster even though the Producers intentions were laudable and Patriotic.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A Great Epic","review":"Does J.P. Dutta's war epic L.O.C. meet the gargantuan expectations of the viewer? Can a war epic, which has a running time of 4 hours, keep the viewer glued to the screen for such a long duration? And most importantly, does the film succeed in presenting to the common man the Indian Army's valiant win on the highest battlefield of the world LOC Kargil?Beat the drums, blow the bugle and roll the red carpet for J.P. Dutta and his heroic team of L.O.C. The year 2003 may not have started on a promising note, but it does end on a magnificent note with L.O.C.So, what's the 'story' like? L.O.C. has no 'story' as such in fact, it encompasses the facts and presents it in 4 concise hours for the viewer to comprehend the heroic win of our Jawans.Director J.P. Dutta has tackled various genres in the past, in the form of GHULAMI, YATEEM, HATHYAAR, BATWARA, KSHATRIYA, BORDER and REFUGEE. But he seems most comfortable attempting a war film. L.O.C. more than proves it!In a nutshell, the war epic sweeps you completely off your feet!L.O.C. is based on a number of true stories from the Kargil war. What intrigues you is the way the Jawans fought the war, so that the nation could eat, live and sleep in peace. When they (Jawans became) heroes, it wasn't because they wanted to be one, it was because they were thinking of the motherland, India. The Jawans who freed India from the enemies were a bunch of ordinary mortals, who have been immortalized by J.P. Dutta in this flick.For those of us who never went to war and learned of its horrors only through the reports, L.O.C. reveals the brutal reality, hurling the viewer into the midst of an inferno of twisted metal, shrieking shells and human agony. It is probably the most vivid and visceral war film ever witnessed on the Indian screen.One has to consider L.O.C. from at least two points of view, that of history and specifically of the history of the Kargil war and from the audience's point of view. L.O.C. is both a remarkable technical achievement and a horrifying reminder of the consequences of going to war.The viewer is not soothed or manipulated by song-dance items here, but instead we hear the sounds of bullets hitting metal and bone, skin being ripped apart and burned. There are only life-sized, vulnerable men, being forced to be either victims or heroes or both.L.O.C. works primarily because it shows the world the harsh reality without pulling any punches. The story about our soldiers is told with competency. The story manages to move us through all sorts of different landscapes and scenarios, giving us an unforgettable glimpse of a world unknown to most of us.Undeniably a brilliant director, among-st the best cinematic storytellers of our times, J.P.'s latest work is embellished with razor-edged dialogues (O.P. Dutta), amazing cinematography (Karim Khatri), well executed war sequences (Bhiku Verma) and effective background score (Aadesh Shrivastava). In short, L.O.C. is a demonstration of his cinematographic skills.Directorially, J.P. knows how to convey his feelings about men in combat, and he has the tools, the money and the collaborators to make it possible. His cinematographer brings a newsreel feel to a lot of the footage. And that's a big compliment!Anu Malik's music gels well with the mood of the film, but it lacks that one patriotic song that remains with you even after years ('Kar Chale Hum Fida Jaan-o-tan Saathiyon' and 'Ae Mere Watan Ke Logon' sound fresh even today!).Any hiccups? Yes!The film can do without the romantic track of some principal characters towards the second half. The track comes as a major hindrance and the song that follows ('Pyaar Bhara Geet Koi') takes the graph downwards.Actually, this track gives an impression that since the director has roped in so many actors, he wanted to do justice to each of them.Now to the performances!With a massive cast like the one assembled in this film, it is rather difficult to pinpoint every actor and talk about their on-screen work. But, must add, after years of watching screen heroes go through an extended adolescence, it's a pleasure to encounter the same names act as grown-up men this time around.The performances that stand out in this war epic are (in this order) Ajay Devgan, Saif Ali Khan, Abhishek Bachchan and Manoj Bajpai.Ajay gets into the skin of the role and delivers a performance that's sure to win accolades. Saif is getting better with every film. He manages to stand out despite the heavy line-up. Abhishek Bachchan is extremely likable. This is among-st his superior performances. Manoj Bajpai is controlled and the camaraderie he shares with Ashutosh Rana is fantastic.Sanjay Dutt's role doesn't have much meat, while Suniel Shetty is relegated to the backseat. Akshaye Khanna is alright.The leading ladies don't get much scope. Yet, Kareena Kapoor stands out of the crowd, followed by Esha Deol.On the whole, L.O.C. is a powerful experience. It has power-packed direction and power-packed sequences that remain etched in your memory even after the show has concluded. More than anything else, L.O.C. is a triumph for the master film-maker who has the guts and the vision to make a film of this magnitude!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Seemayen Bulaayen Tujhe Chal Raahi ...","review":"In 1999, under the scheme of General Parvez Musharraf, our perennial enemy backstabbed us and Pakistani soldiers crossed the LOC in the disguise of civilian infiltrators. Some of the regular patrol parties of Indian soldiers went missing and later on, the damaged corpses of our young soldiers were found. And then the eyes of the sleeping Indian politicians and the intelligence bureau got opened to the fact that there has been large scale illegal infiltration on our soil from the other side of the LOC. A formally undeclared war started which lasted for around 50 days and we lost several precious lives of Indian soldiers. The war had to be won in the end and we won it but the price that was paid was just too much.The memory of the Indian masses is short and we very easily forget the sacrifices of the sacrificing ones and get back to our routines of earning a living. Hence, filmmaker J.P. Dutta tagged the line to the title of this movie - 'BEFORE WE FORGET'. Yes, he did an exemplary thing by making this movie before the invaluable sacrifices of the young bravehearts were forgotten by the Indian public. Mr. Dutta used real locations and even real ammunition to shoot this movie. And thereby he has brought the passionate and emotional tales of the real Indian soldiers alive on the screen. All the small and big tales with less footage to some and more footage to some other, are real and sensitive to the hilt. Mr. Dutta has presented everything with utmost authenticity on the screen which shows his deep research work in this regard. He had brought that period of May-July 1999 alive on the screen. A great effort indeed which entitles him for a big hand by the audience. Besides, he has been able to extract exemplary performances from the complete cast. Whether the role is a smaller one or a bigger one, everybody has given his best. Females did not have much to do. The best female performer is undoubtedly, Maaya Alagh. This veteran actress has delivered a highly touching performance as the mother of Lieutenant Manoj Pandey (Ajay Devgan).Anu Malik's music with Jaaved Akhtar's lyrics could not top up the charts but if you just listen to the songs peacefully and patiently, you will feel the quality of both the words and the tunes. The songs are quite long because the director had to accommodate the scenes of several actors while the song was continuing, but they are highly patriotic as well as touching. My favourite is Seemayen Bulaayen Tujhe Chal Raahi. But the other songs - Main Kahin Bhi Rahoon Har Kadam Har Ghadi, Pyar Bhara Geet Koi Dekho Piya Tumko Gaana Hi Hoga, Aao Jo Laut Ke Tum Ghar Ho Khushi Se Bhara etc. are also impressive and perfectly in line of the mood and the genre of the movie.In my view, Mr. Dutta himself committed two major mistakes which he should have avoided. Firstly, he has shown the soldiers mouthing highly obscene abuses. He had not done so in Border (1997) and it was correct. In this movie, on one hand, the soldiers are getting enthusiasm through religious slogans like Raja Raamchandra Ki Jai, Durga Maata Ki Jai and Jai Mahakaali whereas on the other, they are mouthing so bad words that the females (and also the decorous males) may find it difficult to keep their ears open. Swearings of mother and sister have been given so freely that the decency level has come down to very low. Though such words have been partially beeped, yet it can be understood with ease in each such case what is the complete word. This minus point has snatched the characteristic of a family movie from it. In the ending scenes, Colonel Y.K. Joshi (Sanjay Dutt) asks his subordinates to respect the dead bodies of the Pak soldiers. Then was it necessary to show disrespect to the mothers and sisters of the soldiers of either side ? Patriotism is not enriched by expletives Mr. Dutta.Secondly, he has tried to include as many incidents from the Kargil war as possible in the movie (still he could not include all such battles covered in that war) forgetting that the movie has to be completed within a reasonable time-duration. The fact that he overlooked is that unlike Border which was based on a particular battle in the 1971 war, the canvas of the story of this movie was many times more extensive and hence the temptation to cover everything had to be kept under check. Besides, we all know that the soldiers away from their homes miss their families and their beloved and vice-versa. This is an aspect which fills the gaps in a war-based movie with sentiments and tender feelings. However when there are so many characters (of soldiers), all of them cannot be accommodated in common songs. Mr. Dutta's attempt to do so have not only made the songs extremely long but also monotonous. All things said and done, irrespective of its commercial outcome, J.P. Dutta has made an honest and highly impressive movie. It's able to arouse love for your country in your heart. The complete unit of the movie including all those appearing on the screen and all those who worked behind the screen deserves a standing ovation from the audience.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Bd Idea....Bad Movie","review":"Is this the movie??? Is this what Indians are trying to show?? I think this is one more effort from a sick-minded director to turn down Pakistani soldiers and in fact country....but what we Pakistani's know that we are always ahead of India in every part of our lives...not only in armed counters.Well...this is bad filmed as that of Border in early 1997...and director and writer just tried to overcome a shame of defeat in Kargil by Pakistani armed forces, by creating films like these..One thing is very clear...Whenever there will be an encounter between Pakistan and India....we will win....!!! So Mr. Dutta try to make some good movies instead of Nonsense movies like this","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Priceless effort in documenting the story, but fails to enhance it","review":"When I was watching this movie, I was simultaneously being hit by two thingsthe ordinariness of the 'production' quality. What is called 'production values' - lighting, sound, authenticity of effect, bullets hitting people, the environment. See 'Saving Private Ryan', 'Thin Red Line', 'Black Hawk Down', which have you shivering, and diving for cover as bullets fly. I know we don't have the kind of money that they have, but as a member of the audience I have become terribly spoilt by Hollywood, what more can I say. Remember that I WANTED to like the movie, so I am not being careless when I comment that it came across as too artificial and stage like. All the hill storming scenes for e.g., are all from the same camera angle and all have a hill bathed in a uniform light, as if from a lamppost, and just did not pull me into forgetting it was happening on screen. I was too cognisant that I was watching from an aloof medium, a seat facing a stage on what this was all happening perhaps.The story, the challenges our men faced, their pain, their courage, the difficulty of the situation, all of that.It struck me that as a movie buff, I should try to somehow be able to differentiate the two even in the midst of 'enjoying' the movie. Differentiate all that is hitting me because of what happened out there from that which is hitting me only because of the way it has been treated / presented by JP. I found, limited as I was in my ability to do this, that despite my best wishes to conclude otherwise, I was being only 'moved' by the facts of the former, and not at all by the effort of the latter. If a young guy, who is about to get married to his childhood fiancée dies while bravely storming a hill currently occupied by miserable mother*&£$£s I would strangle personally if I had the guts, its going to move me in tears by just hearing about it. What I couldn't find was a camera angle, a single feature of the presentation that added to this impact. In fact, I will go so far as to claim that the artificiality of the treatment took away some of it.That's about it - was very moved by what the story had to convey, and the research etc has no doubt been brilliant, but as a celluloid 'creation' , didn't find any  'value add' - as a documentary of what happened in itself its priceless, if only because film reaches out to a lot more people than any other media, including newspapers etc.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" What a waste of good talent and hard-earned cash!","review":"There's nothing new for me to say: 4 hours of people dying over and over in the same hill. The cast was stellar, but unfortunately the producer/director/editor/God goofed. He should have eaten humble pie (if not for his own sake then for the men who died in Kargil), hired one of these brilliant Bollywood directors, hired a real scriptwriter, hired a real editor, hired a musician that wasn't related to him in some way (and who seemed to have listened to some bad version of \"Apocalypse Now\" on some cheap Indian drug), hired a real professional crew, thrown away all the fireworks and told a real story. Unfortunately he, like the bigwigs of the Indian Army, made decisions that were terrible for his actors, and terrible for his audience. We all died over and over. Please don't do that again, Sir! Sushma Kathmandu, Nepalps: Next time an Indian director decides to glorify the Gurkha regiment, I suggest he hire more than one Nepali to represent the team. Surely there are plenty of Nepali men working in Bombay--last count was 40,000 to half a million.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" A bizarre cocktail of song, dance, and (ahem) War","review":"This propaganda flick which bombed on its home ground is supposedly derived from real time events, which were supposedly corroborated by the film making crew. By the masses reaction, it seems that they knew better as to what REALLY happened in Kargil.Watch it if you can absorb dancing-in-the-fields amidst war scenes ripped from The Thin Red Line and Saving Private Ryan. A Bizarre brew that for sure! And will someone tell  me why Indian heroes 'dance' so girlishly?","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Terribly made movie!","review":"This movie was absolute torture.  First of all, it's a whopping 4+ hours long!  True, the Kargil war may have had several points that were captured and fought for, but every single one of those battles need not have been shown.  So maybe this is a documentary, not a commercial film as advertised. Sure didn't seem like it, as enough background information was not given and there were some flaws.  The battle sequences were so poorly executed.  I am terribly disappointed from the man who gave well done sequences in Border.  Each battle was the exact same as the previous.  It was so predictable.  (This might be a spoiler.)  The whole army marches uphill, five or so soldiers curse five thousand times each (they also use the same cussword every time), one of the lead actors is shot, someone yells for a stretcher, the actor says, \"No, don't get a stretcher.  That will take 6 men from the battalion,\" and then an actor dies.  That exact same thing happens over and over and over again.  Oh, and the songs are so bad and so long. The cast of the movie is too big for its own good.  Despite such a long movie, none of the characters were well developed.  The actresses had the most miniscule roles.  They all are dressed and portrayed to be the same. Two of them were weeping synchronized.  It was so comical.  They moved their hands and heads at the exact same time and then bit their dupatta together.The list just goes on and on.  I know I'm still forgetting something . Anyways, I think I have bashed the film enough that you get the picture.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Boring, Repetitive....","review":"There were high expectations from this movie. The director had supposedly spent many years researching everything,but the end product did not really show that! Made as a true story about the Kargil war, the movie had its high points: Manoj Bajpai and Ashutosh Rana's acting,PuruRaj Kumar's role as a Gurkha officer, usage of actual Arty guns etc instead of the usual bad special effects. But that was about it!The action scenes were very very repetitive, the movie was shot in sub zero temperatures but it never came through while viewing, the terrain was supposed to look hostile, it looked anything but. Scenes about personal lived of the soldiers were also similarly repetitive and boring Overall if this 4 hour movie can be edited down to no more than 2 hours, it may became a worth watch! 4/10","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Pathetic attempt to recreate the success of BORDER","review":"Where to start from? They got it all wrong from cast to unnecessary lengthy songs. I mean there are so many actors and with no potential or justification. It felt like the director decided to make his own border and failed miserably.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" a loss for mr. dutta","review":"No wonder why it got flopped. the generation wants some item dance and sex but this movie had neither so it was a flop. this movie is great but a loss to j.p.dutta and making huge actors not working with him.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Huge Disappointment !!!","review":"Overacting, Unnecessary melodrama and cheesy dialogs killed what could have been a landmark film. This film should have been a tribute to all those heroic soldiers who sacrificed their lives defending the Indian border. Instead, all it was an embarrassing & exaggerated version of a truly historic event. Not to get too technical but the Director wasn't very realistic about the battle plan either. All we saw were soldiers doing a blind often suicidal rush at an enemy post. J.P. Dutta should be apologetic for making this film and should promise to stay away in the future from directing any such films. He should leave that task to a more competent director.","imdb_rating":3,"our_rating":0,"algo_label":0}]