[{"heading":" Fun + frolic + feast = entertaining fare!","review":"Jhankaar Beats can be termed as a Bible any newcomer should follow to make a technically sound Bollywood film. I am sure the director Sujoy Ghosh has spent more time on pre-production (special mention - script) before embarking upon hitting the movie on the floors. Obvious references that might crop are to Dil Chahta Hain which was a story of 3-friends. Here we have 3-couples perfectly characterized into different slots. Couple One: Sanjay Suri & Juhi Chawla representing the upper-middle class of society, expecting their second child. Couple Two: Rahul Bose & Rinkie Khanna representing the modern urban couple on the verge of divorce. Couple Three: Shayan Munshi & Riya Sen representing the teenagers in love, the hero's love and reluctance and the girl's acceptance.Interlaced around these are the episodes of ad-agency where the three hero's work on a common assignment, conniving next-door ad-agency competitor, the nose-digger prospective client, spiritual next-door neighbor sex guru, the painful divorce process, nagging mother-in-law and finally Rahul Bose's car. The common passion for R D Burman's music and preparation for the competition forms the backbone of the effective storyline.Noteworthy mentioning is loquacious Archana Puran Singh who this time whispers \"mum's the word\". And guess what? Her real-life hubby Paramjeet Singh does not get to share the same frame!All the actors have done their parts extremely well. What stands absolute above all these, is unmistakably the script which is flawless. Perfect emotions blended with good songs and skillful editing makes this movie an entertaining fare.Roll on Sujoy with your next venture. We are waiting.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" The beat goes on.....","review":"Freshman Director Sujoy Ghosh tells a ripping good tale of two bosom buddies who \"work\" at an advertising agency but in reality only live for one thing  to win the music competition Jhankaar Beats! Every year they get oh so close but always fall short. The more grounded Deep (Sanjya Suri)) is married to Shanti (Juhi Chawla), has a daughter and is about to become a father yet again. The more uncaring and Bindaas Rishi (Rahul Bose) is married to Nicki (Rinke Khanna), a successful lawyer, but the marriage is troubled and heading towards Splittsville. Both Deep and Rishi know that they need a guitarist to really have a chance at the competition and that is when a guitarist in the shape of Neel (Shayan Munshi) is thrown their way as the no-good son of the boss at the agency. Neel loves Preeti (Riya Sen) but is unable to say a coherent word in her presence. There is a condom campaign that needs to be put together and there is tough competition from the voluptuous andunscrupulous employee (Archana Puran Singh) of the rival agency. There are the extremely coochie-coo and \"active\" neighbors upstairs, the pigeon that loves Rishi's car, the Boss, and the fact that Basanti did not dance for Veeru but to save her own skin! The film is a delicious concoction of music, outrageous hilarity and some thought provoking looks into the institution of marriage, and the interplay between hobbies, obsessions and occupations. The ensemble cast is highly competent and every single actor does a good job. Sanjay Suri does a decent job as the serious one, but is clearly one upped by Rahul Bose who stands out in the role of Rishi. The newcomer Shayan is competent, Rinke Khanna and Riya Sen work in their roles. Archana Puran Singh is hilarious as the sexpot in a role she manages to do spot on every time. Shashikala is the intrusive mother-in-law, good to see her back. But for me the show stealer is Juhi Chawla as the pregnant Shanti, a portrait of serenity, responsibility, love and fun. She is the high point of Jhankaar Beats. The film has some excellent moments with references to RD Burman, and Sholay and even to the current culture of meditation in an age where clubbing and pop music rule. It was just a bit long and could have been trimmed by about half an hour  but even in this long version it is a rare treat indeed. The music by Vishal Shekhar is excellent and my favorite numbers are Tu Aashiqui hai, and the evergreen Hame Tumse Pyaar Kitna in a very unique variation.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Superb Bollywood product","review":"Before actually seeing this film, I had little to no expectations, but after viewing it remains one of my favorite films. The story is quite simple, its about these two RD Burman obsessed musicians who are trying to win the musical competition, and the funny circumstances they run into along the way. Excellently written & directed by first timer Sujoy Ghosh, with awesome music by Vishal & Shekar, and great performances from the entire cast. This film will have you laughing so hard. The film also contains its messages about life and friendships along the way. This film shows Bollywood's potential in making great films if it pays more attention to script and character development. Though the film does not carry any huge superstars (Except for Juhi Chawla), this film is a must see. A++","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" One line ... I loved it!!","review":"This is actually the very first Bollywood I've ever seen ... and I really enjoyed myself. It's a must see also for people like me who have never seen a Bollywood film in their life.Give it a try ... you won't be disappointed!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" awesome flick","review":"this has to one of the more enjoyable movies ive seen this year... refreshing to see a well made hindi film.., a script one can identify w/.. rahul bose is the cornerstone of the movie,,, exteremly natural actor.. the songs are to die for,, and for once,, the actors who play instruments in the movie can actually keep time w/ the songs!! give this a 10","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Enjoyable light comedy","review":"The movie is about two guys (and later three) who are major RD Burman fans, and musicians themselves. The story is about how they keep on trying to win a particular music festival over the years, and in the background their changing lives.The movie is unlike any other Bollywood movie I have seen. If I am forced to compare with another movie, then the closest would be Dil Chahta hai. Jhankar beats is a light, amazingly well edited and directed movie. A must see.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Brilliant Film","review":"Jhankaar Beats, a film by a debut director Sujoy Ghosh is a witty, intelligent, charming and fun film about 3 couples- essentially representing 3 stages of any couple's life- Couple 1: Sanjay Suri and Juhi Chawla are this much in love couple who are expecting their second child. Couple 2: Rahul Bose (brilliant in his role of Rishi) and Rinke Khanna who play an estranged couple on the verge of divorce- much of their story is told in flashbacks. Couple 3: Shayan Munshi (a quite capable debut turn by him in the role of the bumbling, underconfident Indraneel- bordering on Saif's character of Sameer in Dil Chahta Hai with which this film draws a ready and obvious comparison almost instantaneously) and playing his love interest is a rather beautiful Riya Sen who plays the bimbette to near perfection and initially does not reciprocate Indraneel's affection for her. How he wins her over forms one of the most interesting subplots towards the middle of the movie The story is essentially of these 2 friends, Sanjay (lead vocalist) and Rahul (drummer), trying to win a rock contest named \"Jhankaar Beats\" having lost on previous 2 occasions. Later, in their pursuits, they're joined by Indraneel (guitarist)who also happens to be their boss' son. Apart from the contest, they have to manage their love lives, family lives, complaining neighbours, a demanding boss, an ad campaign for condoms and unscrupulous competition from corporate sharks and other rock bands. In the end, they manage to win the contest and their dream comes true. What works very well for the film is its economical storyline, fine characterisations, great music (especially Suno Na and Tu Hai Aasman Mein). The film is also an ode to RD Burman and is fraught with trivia about him and also, interesting albeit colloquial anecdotes about Sholay and condoms. Go figure!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Good time pass","review":"This is a good movie for the Indian standards. Obviously, Ghosh knows what he's making and how he has to make it!! The comedy is very natural and brilliantly done by all characters. Rahul Bose being exceptional. He is one very rare combination, who can cater both art and commercial movies. Sanjay Suri did a fair job. Shyan Munshi that models can also act. Music is good. It is something to die for and a tribute to R.D. Burman.The script of the film is so fresh.Hope movies like this will become the benchmarks in Bollywood, where Subhash Ghai is great with his Kisna.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Sujoy Ghosh's impressive debut !!","review":"This movie stayed in my mind for a long time after I first saw it. Every small detail is so perfect that there is neither a portion that seems irrelevant in the movie. This was Sujoy Ghosh's directorial debut. He also written the script. The first unique point of the movie was the interplay between the characters. The manner in which the characters communicate towards each other seemed so real. This indeed is Sujoy's best movie to date. Unfortunately 'Home Delivery' could not live up to expectations, but still was a good movie. The recent 'Alladin' was dissatisfying. Sujoys understands the concept of comedy and this is very evident in the dialogues the actors recite. His awareness in the field of relationships is also mature. When both these elements combine, they result in a interesting combination. The plot is not very thick on the substance level however what we the audience are presented with is a fresh perspective on how professional and social life has an impact on relationships. The subject has been handled with honesty and maturity. ****SPOILERS**** Rahul Bose and Sajay Suri work in a ad agency and they are requested by their boss to create a tag line for the latest condom promotion scheme. This they are having difficulty in doing while at the same time they have been loosing at the jhnakar beats music contest for the past two occasions. Juhi Chawla plays Sanjay's wife and Rinkee Khanna is married to Rahul. Rahul and Rinkee are going through a divorce but are indecisive about the matter. Meanwhile Sanjay and Rahul find friendship with Shyan Munshi, who they make part of their band. He happens to secretly admire Riya Sen but is incapable to express his feelings to her. Both Rahul and Sanjay attempt to help him in this situation as well as trying to break him out of a forced marriage. With tensions escalating on the personal front, the music contest is approaching and they hope that they can win this time. ****SPOILERS END**The music by Vishal and Shekar are a highlight in the movie. They have been interwoven to the movie appropriately. They do not deter one's concentration from the movie neither. All actors perform to the highest standard. Rinkee Khanna proved that she had acting potential. It is unfortunate tat after this she decided to quit movies. Her scenes were dazzling. Rahul Bose was excellent and Sanjay Suri gave good support. As mentioned before, the character interactions aspect is the usp. This movie can surly appeal to the young and to those who search for intelligent comedy.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" It was OK","review":"Not the greatest movie, not the worst. The biggest problem with this movie was that it was too slow the entire way until the end where it red-lined. Not the greatest direction, but the dialogue kept the movie afloat and interesting. Great performances from Rahul Bose and Sanjay Suri and Juhi Chawla. shayan mushi was OK, not the best, but he put in effort. This movie could have been much better and more entertaining if it moved faster. It seemed like a drag and I ended up skipping the last couple songs except the last jhankaar one. The songs were nice though, especially the one in the church. Lots of stuff can be cut out though, and it would make sense to, it was such a drag to watch.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" One of the few polished Bollywood movies","review":"I really don't know how the reviewer can even turn good points into bad points. Dil Vil Pyar Vyar was no way near the intellect and light heartedness of this movie. It is one of the most entertaining films in years.Its actually targeted to the youth so maybe the reviewer who might be a little aged might have not latched on to the idea.This movie is so fresh with idea and the editing is so sharp that it should win a few accolades in the awards functions....Bravo for the debut director for making a bollywood movie with enough energy to last its 142 minutes keeping the audience entertained!!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Brilliance from unexpected corners","review":"First of all, I have to say I am appalled at the incredibly low number of votes this flick has got. People would throng the theatres to watch worthless movies and skip the ones that don't have the big-namers. People who really know which movies to watch, this movie is a must-see. Pure, unadulterated fun, great music, craze for R.D. Burman, the movie has it all. Witty, witty dialogues and a sweet, inspiring storyline, and of course, stellar performances from Rahul Bose, Juhi Chawla and unexpectedly, Sanjay Suri. If there's anything lamentable in the movie it is, as expected, Riya Sen's acting. But the movie more than makes up for it. Good entertainment value and a little touch-the-heart in the end. Great job. Bollywood needs more stuff like this.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" one of the best ever","review":"Direction,Acting and Writing plus the musical soul this movie have. very good compilation this movie is.. a must see..must own ..this movie is awesome.. i liked \"pyaar-mein-kabhi-kabhi\" of \"sanjay-Suri\"..but this was awesome.. musical and very funny.. little jokes..and one liners.. are awesome.. if anybody don't like this movie may be he/she/it don't deserve to watch these real kind of movies..i will place this movie in \"mansoon wedding\", \"bend it like beck-ham\" (and other independent movies i liked)category..\\i only had 2 Bollywood movies with me, when i arrived in Canada in 2003 the other one is \"dil-chahta-hai\".. and i always watch it.. must see and must (have to) like it..MOVIE","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" The best movie ever!","review":"Jhankaar Beats was an awesome movie. Strongly recommended! Sanjay suri and Rahul Bose were absolutely hilarious! Funny scenes in the office and with the sexually challenged neighbour teaching he guys how to relax the body with candles. HAHAHAHA!!! The songs are all great. Loved the song \"tu aashiqui hai\", lovely song. The new guy is kinda cute. Juhi Chawla was a delight. Riya 'Sen looks nice but has nothing much to do in the film. Love the fresh story and comedy.Great entertainer!!! Full of Fun and Masti! No Hollywood copy and definitely not like the everyday bollywood movies! The ending is also great with the old granny, everyone thinks is a bat!","imdb_rating":10,"our_rating":0,"algo_label":0}]