[{"heading":" The story is good the execution is flawed","review":"This movie is focused on the story line and the development of characters. It of course it has the obligatory songs but they are no too out of place and the production quality of each different as the plot changes.  The story is about a boy whose father is a criminal and who is forced into this lifestyle because of pressure from outside forces.  It takes to the life with a real favor and becomes a ruthless outlaw.  The life he is leading is full of reflections bank on a troubled childhood and a family that was torn apart by his fathers lifestyle.  He is going through the same things yet he seems to have some issues with respect for people he is close to.  He has a good girl friend, loses the girl and gets her back but with dire consequences.  His lifestyle begins to get him down and he becomes self-destructive.  As I don't speak Hindi the movie's sub-titles were poor but the story was easy enough to follow.  A lot of violence and double-crossing but this was the life he chose.  If you like the Hindi movies that are up beat with humor and great dance numbers this is not the movie for you.  If you want to be entertained by as decent story then sit back for three hours and watch this.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Pretty OK","review":"This film is pretty good for a sequel...but I feel Vaastav was a better film.Following \"Vaastav\", Hathyar traces the story of slain Raghu's family. Ostracized by society because of Raghu's deeds, his family has a tough time making both ends meet but they manage to live on. Soon Raghu's son Rohit follows his father's footsteps, kicking the 'fracture haddi' gang guys and thrashing and killing all his enemies and those who disobey him, but alas, these \"days of glory\" may not last long.Direction is good, all actors have acted well, music is unremarkable, unlike VAastav that had excellent soundtrack.Worth a watch. I personally feel the end of the film could've been better.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" The best sequel of Hindi cinema","review":"Sequels are very rare in Indian cinema.While in Hollywood they have sequels for 70-80% of the movies here we can count hardly 3-4 sequels in popular Hindi cinema.Its a common thing that sequels don't match up to the originals.Only Terminator-2 is the name which defies this rule.That does not mean that sequels don't work,however in India none of the sequels have worked.It is said that Raj Kapoor had ambitious plans of making a sequel of Mera Naam Joker.But the bombing of his epic prevented him from doing so.B.R.Chopra had plans of making a sequel of his hit comedy Pati Patbi aur Woh,but something happened.Similarly Sholay-2000 and Zanjeer-2 were other planned sequels which never took off.Mahesh Manjerakar and Sanjay Dutt made one of the most powerful films ever in 1999 called-Vaastav.The movie was not just a hit but got huge critical acclaim and brought Sanjay Dutt again in limelight after a long gap.Mahesh Manjerakar went on a signing spree after Vaastav.However all his films except the critically acclaimed Astitva Ehsaas,Tera Mera Saath Rahe and Jis Desh Mein Ganga Rahta Hai bombed and were nothing to write about.Even when he paired with his favourite Sanjay Dutt in Kurukshetra and Pitah the results were really bad.However when he launched the second part of Vaastav-''Pratibimb'' with Sanjay Dutt again expectations were raised.The film is definitely not a Vaastav but is by all means the best sequel ever. made in Hindi cinema. The movie starts with Boxer Bhai(Sanjay Dutt) being a corp-orator.He is a power broker and his best friend Paakhiya(Sharad Kapoor) is his right hand man in crime.They work for a politician(Gulshan Grover).Due to a power struggle the politician takes Paakhiyaa into his group and asks him to kill Boxer.Boxer is pumped with bullets and is rushed to hospital.His grandmother (Reema Lagoo) comes to visit him and thus starts the story of Boxer in flashback. Boxer whos real name was Rohit was the only son of Raghu Bhai(Sanjay Dutt of Vaastav) and Sonu(Namrata Shirodkar).After the killing of Raghu the family has to face a lot of hardships.Raghu's father(Shivaji Satam) also dies due to excessive drinking.Raghu's brother(Mohnish bahl in Vaastav) drifts away from the family(we don't see him in a single frame).The responsibility of Rohit and his grandmother falls on Sonu.Helpless,she again starts working as a prostitute of a big man(Viju Khote).Rohit is an ace boxer in college and thats why later he gets the name of Boxer Bhai.In college his class mates taunt him about his mother.In a fit of anger Rohit hits one of them very hard.He blasts Sonu and tells her that he wont call her mother again.Sonu commits suicide in a fit of anger.The vicious cycle of crime happens and Rohit is transformed in a dreaded don Boxer Bhai. Police Commissioner Kadam(Deepak Tijori-who was Inspector in Vaastav) tries to explain Rohit about the miseries of a criminal but Rohit is as adamant or probably more than his father Raghu and he does not find any fault in his life.He loves Gauri(Shilpa Shetty) but her dad gets her married to a wife-beater officer(Harsh Chaya).Boxer comes to her rescue and marries her after she gets divorced.Another person who was very close to Rohit was Munna(Sachin kedekar).A childhood friend Munna had become the lifeline of Boxer.Munna,Paakhiya and Boxer join hands with Ali Bhai(Shakti Kapoor) to eliminate the sons of Fracture(remember fracture gang in Vaastav).However circumstances take turn for the worst.Ali dies of cancer and Rohit kills Munna due to misunderstanding.Rohit's grandmother hates Rohit for following his father's footsteps. The flashback gets over with Rohit re-gaining consciousness.He comes out of hospital and kills his enemies including Paakhiya.Gauri who was staying away from Rohit with their child forgives Rohit but its too late.Rohit commits suicide before police can get to him. Hathyaar is Mahesh Manjerakar's best work after Vaastav and the off-beat Astitva.Although being a sequel there are obvious common points between the 2 and although the story is not that great as that of Vaastav still Manjerakar has written a pretty hard-hitting and gripping tale of crime.As a director although he is not able to create another Vaastav,still his direction deserves applaud.Some fight scenes like that of Sanjay Dutt attacking his rivals on a streamer looks too filmy for the director of Vaastav.Like Vaastav,Hathyaar also has traces of Mukul S.Anand-Amitabh bachchan starrer-Agneepath.The pumping of bullets in the hero,his being in the hospital and his rivals trying to kill him there were all present in Agneepath.Like Vaastav,Manjerakar uses Sanskrit shlokas at the backdrop to create an amazing effects.The shlokas in the end titles are amazing.Hathyaar is to Vaastav what Drohkaal(read my review) is to Ardh Satya.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" See this movie... But not for Vastav.","review":"This is a really good movie butt it could be better if this was not the 2. part for Vastav. Vastav IS a great gangster film like Scarface with Al Pacino. Hathyar is not good as Vastav. Mahesh could make it better!!!Jimmy Khan","imdb_rating":0,"our_rating":0,"algo_label":0}]