[{"heading":" An artistically brilliant but outdated film elevated by Preity Zinta's crazy and unforgettable Sonia Kapoor","review":"Honey Irani made a fantastic directorial debut. Armaan is brilliant in every aspect, despite being fairly outdated. Everything, from the dialogues to the proceedings to the characters feels like being set in the 1960s. I seriously think Irani should have officially defined the period of time as such, because it would have made much more sense. I genuinely liked the film. I thought it was special, realistic and artistic. The concept of life in a hospital was very interesting. I'm fully aware that it does not really work as far as the wide audience is concerned and that many people would find it slow and stretched. In my view, it doesn't take anything from Honey Irani's honest attempt and doesn't mean the film is less worthy, but just a film that does not appeal to anyone.The film, however, had a pleasant surprise which came as a saviour after an hour or so in the form of Preity Zinta, whose bubbly, spoilt, wicked and mentally unstable Sonia Kapoor is both interesting, hateful, funny and memorable. Kudos to Zinta for such a spectacularly played negative role. She was natural and convincing, and she managed to make her evil character unique and almost, if not completely, likable. This is thanks to her animated line delivery and her lively, partly vicious and partly vivacious attitude. I can understand why Irani wrote the character with Preity Zinta in mind. She does not really act in accordance with the film's mood, yet she seems tailor-made for her role, and her commanding screen presence more than carries the film.I think the rest of the cast was very good, especially Anil Kapoor, who was restrained and greatly impressive as the serious, intelligent and well-mannered Dr. Akash. He was very sincere, and this is amongst his most accomplished works. Gracy Singh was very pleasant and compelling. Bachchan was good as always, but he appeared only in flashbacks in the second half of the film, so there was not enough of his role. Aamir Bashir was absolutely outstanding as Dr Sanjay. This truly is an underrated actor. Randhir Kapoor played Sonia's father and for some reason made me laugh every time he appeared on-screen. He was unintentionally funny (I was particularly floored in that scene in which he said he was gonna sue Akash for insulting his daughter).Armaan is almost a classic. There is something in its subtle narrative style that makes it very engaging. It has a much stronger second half though. With the entrance of the character of Sonia Kapoor, the story takes shape and the film flows more effectively. The film becomes much more interesting, entertaining and enjoyable, although it generally still remains loyal to its realism and keeps following its slow pace. One must also note the background score, which is simply exceptional. Shankar-Ehsaan-Loy's soundtrack is quiet and pleasant. My favourite song is Zinta's seductive number \"Mera Dil Ka Tumse\", which is extremely energetic and fun. To all those who appreciate quality films, Armaan is a must-watch.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Brilliant subtlety marks this first-time director's effort","review":"I must admit that after seeing this film the first time a couple of weeks ago I was less than impressed.  Bachchan, of course, was excellent, but I felt that movie was missing something, or maybe it was trying to hard to be something else, or perhaps it was Preity Zinta's villainous departure from her previous girl-next-door roles.....I wasn't sure.....But, upon watching it a second time yesterday, the film's brilliant subtlety exploded on the screen.  It was all there:  wonderful dialogues and performances from Bachchan, Kapoor, Singh (and -- yes - Zinta:  she's a little over-the-top in her performance, but in the end the effect works [the character she creates truly is weird/creepy]); a remarkably restrained and appropriate camera style from Verman (including his interesting use of 180-degree-arc two-shots during key dialogues); outstanding sound recording and perspective matching from Kamte and Dev; brilliant music and choreography (sans the chorus lines); and some excellent writing -- particularly the development of key thematic parallels and negations.\nFor example, Irani masterfully, yet subtly, contrasts the two dominant child-parent relationships -- Soniya-Gulshan and Akash-Siddharth -- to comment quietly on the impact of western materialism on the values of successful Indians living abroad.  The theme is reinforced by the masterfully directed wedding scene -- starkly devoid of the colorful mise-en-scene, music, and traditional practices that are picturized in typical Hindi film weddings -- in essence emphasizing the alien(ated) character of the proposed relationship.  The effect is reminiscent of Subhash Ghai's Pardes (1997), but without the grandstanding that dominates the earlier film.  Additionally, Irani's selection of neurosurgery as Akash's profession provides an excellent metaphor for the exploration of the film's climatic theme, which --without giving too much away -- involves the resolution of a key moral dilemma.All-in-all, Irani demonstrates remarkable restraint and deftness in her directorial debut.  The film's naturalistic look belies the subtle thematic complexities that inform the storyline.  Watch this film more than once -- you might be surprised!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Preity shines out of the whole cast","review":"Armaan is an inspiring movie, with amazing performances, and nice music. The downfall of this film is that it slows down one minute, and goes too quickly the next. You are either confused from what has happened, or you are wishing it would hurry up. It could have been better there.I'd say the best performances were from Amitabh Bachchan, and Preity Zinta, who I have always thought was very charming.The story is relatively simple, and is one that many films have tried, worked, and failed in the past. Armaan is one that works, but only because of the acting, and maybe the script.Amitabh Bachchan did a really nice job as the caring, dying father. He was perfect for this role, however, there are times when the character seems fake. Anil Kapoor makes a forgettable performance, I preferred him in other movies, which he did excellent in. Here his performance is not as good as I expected of him. Gracy Singh makes another \"bechaari\" role, I wish she would branch out more. For her role I would have enjoyed a Tabu, or Juhi Chawla, even Urmila Matondkar or Rani Mukherji. Certainly not her, that's for sure. My favourite performance was Preity Zinta; I have liked her since I saw her in 'Dil Hai Tumhaara', in which I thought she was amazing. Here she does another remarkable job, she has outdone herself, and is the star of Armaan. There are times when she even overshadows Mr Bachchan. Her new look adds glamour and appeal, and I say she looks not beautiful, but very elegant. Her first try at a negative role earns rave reviews from me.The music is excellent. The best songs would be \"Mera Dil Ka Tumse Hai Kehnaa\" and \"Mere Zindagi Mein Aaye Ho\" which I enjoyed.Honey Irani has done a decent job. I recommend it.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Three cheers for Honey Irani.","review":"One of the best Hindi movies in recent times. absolutely great. Almost a classic! The movie is quite different in the way it has been dealt with. Very nice and laid back.the performances are some of the best I have seen.Amitabh is Amitabh, superb! quite different from what he has done recently and yeah nothing like Mohabbatein(to those who thought he is playing the usual father).Anil Kapoor is mind blowing. One of the best role of his career.Reminds a lot of Sanjeev Kumar. Very restrained and thoughtful. Gracy singh blew me away with her maturity. Just her second movie(even though she had some small role in Hu Tu Tu). she is comfortable in romantic and emotional scenes. Preity Zinta is good too and this has to be her best performance.Worth a watch for everything! Music is extremely pleasing to the ears! Photography is good. I have to admit that I enjoyed the movie much more on the subsequent viewings as compared to the first. One of those rare movies, where such things happen. Best Hindi movie since Dil Chahta Hai.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" I desired more from this \"Armaan\"!","review":"`Armaan', which marks Honey Irani's directorial debut, has a surfeit of high-minded sentiments, some genuinely honest and lovely moments, and unfortunately, also a number of snigger-inducing scenes.  Mind you, her direction is charmingly understated, and the leads are truly likable.  You have that eminence grise of the Hindi film industry, Amitabh Bachchan, playing the noble Dr. Siddharth Sinha and Anil Kapoor as his equally noble son, Dr. Akash Sinha.  Gracy Singh, who was a winsome village maiden in `Lagaan: Once Upon a Time in India', and selflessly stood by her man, plays Dr. Neha Mathur, a winsome anesthetist here, and again selflessly stands by her man.  Preity Zinta, that cherubic-looking leading lady, is cast against type and has fun as a spoilt heiress (is there any other kind?), unhampered by scruples or too much clothing, who will do anything to get her way.  At one point, she helpfully dons a pair of scarlet horns to show just how diabolical her character is.  She has a hoot being devious and gleefully smiles at the camera as she mouths insincere apologies to her rival in love, the upstanding anesthetist. Her angelic face belies her spiteful machinations; she makes a persuasive bitch. Randhir Kapoor, appearing on-screen after a long absence, plays her guilt-ridden tycoon father, who gives in to her every whim to atone for his preoccupation with making money, and in so doing, creates a monster, albeit a very pretty one.All of this is fine, except that several of Honey Irani's characters in this film (based on her story; she co-wrote the screenplay, as well) are doctors, and most movie actors, I suspect, are congenitally incapable of convincingly portraying the medical profession.  Amitabh has style and panache, and in his role of CEO of this hospital, he has less medical jargon to spout, which helps his credibility enormously.  He also makes an extremely dapper ghost; his demise does not prevent him from making several well-dressed and chatty appearances each time his screen son is faced with ethical or emotional dilemmas. However, Anil Kapoor playing a neurosurgeon, in an otherwise competent performance, is at his hokiest when called upon to be doctor-ly. The movie includes a couple of surgery sequences where Anil's character peers flummoxed into his patient's open skull and haplessly mumbles to his cohorts, `This is a very complicated case!'.not the most confidence-inspiring talk from a celebrated neurosurgeon.  No number of defibrillators, the glittering array of scalpels and other medical paraphernalia managed to influence me otherwise!  Not for a moment did I buy that Anil and Gracy Singh are overworked, put-upon members of the medical profession, especially when after the first messy surgery, they take a song-and-dance break in the bucolic vistas surrounding the hospital. There they finally get the opportunity to discard their drab hospital scrubs, wear true movie-star designer clothing, break into song and be themselves: a Hindi film hero and heroine!The strongest points of the movie are the lovely depiction of the father-son relationship--Amitabh and Anil exhibit wonderful chemistry together, the well-etched characters of the principled Dr. Siddharth Sinha, his son, and the willful heiress. Randhir Kapoor makes a welcome return to the screen looking, more than ever, like his father Raj Kapoor during his character actor years. Honey Irani elicits sincere performances from her entire cast and deftly stages the emotional scenes with poignancy.  Too bad the story is set in a hospital, and the actors make such awful neurosurgeons and anesthetists.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Review","review":"Armaan is a story woven around a hospital in a town called 'Chandipur' which I suspect has been the land of many other films.  But what makes Armaan's 'Chandipur' special is that it stretches from Mussoorie and Mauritius to South Africa, so naturally it encompasses all the landscapes: hills, plains, waterfalls, lakes, farms et-cetera et-cetera. The main protagonists of the movie are all doctors whereas the antagonist(s) are not, which makes one think whether the 'hidden' message of the movie is that you have to be a doctor to be nice and rational and if you aren't, there is something terribly wrong with you.Anyway, Amitabh Bachchan plays Dr. Siddharth Sinha who runs the Hospital. What??? A Hospital in 'Chandipur'!!! and that too complete with neurosurgeons 'n all, As far as my memory serves me 'Chandipur' only had Dacoits and evil landlords but now it has a hospital. Imagine how many lifes could have been saved if there had been a hospital in 'Chandipur' ever since we started making films but.... alas the patients of 'Chandipur' always had to be taken to the hospital of the nearest 'shehar' and that too by a bullock-cart and that too at night... Oh God! what a revolutionary idea to have a hospital in 'Chandipur' of all places, God bless Honey Irani!!!\nDr. Akash Sinha played by Anil Kapoor is the adopted son of the Big B. Dr. Akash Sinha is a hugely gifted and an equally busy neurosurgeon. I say gifted because in all the operations he does, the patient has a very remote chance of survival (upto a maximum of 5%) but he always comes out with flying colors.  And I say 'busy' because it looks like the people of 'Chandipur' are extremely prone to brain tumors(endemic???), so Dr. Akash Sinha is perenially busy, infact when his wife Soniya Kapoor (Preity Zinta) presents him with two tickets to Switzerland, he refuses to accompany her. Why??? because he has to perform 9 operations in the next 15 days and cant spare time for Switzerland(and importantly Preity Zinta), what dedication!!!\nHere, It is important to mention the role of Dr. Neha Mathur (played by Gracy Singh of lagaan fame(???)) who is a part of Dr. Akash Sinha's Surgical Team and is a anaesthesist par excellence herself. Dr. Akash Sinha and Dr. Neha Mathur are romantically involved with each other before the script demands that Dr. Akash marry Soniya Kapoor who incidentally is the daughter of one Gulshan Kapoor(Randhir Kapoor), and Gulshan Kapoor is one of the ten richest Indians in the world but as the script would have it, he also looks like one of the ten most stupid Indians in the world and the most idle tycoon in the world.It would be unfair to reveal the story(or the lack of it) of the film but generally speaking Preity Zinta looks like an ideal candidate for Vandana Luthra's weight reduction programmes and Anil Kapoor a candidate for her age reduction programme. Coming to Gracy Singh, she never looks good but this time the problem is compounded by her lack of acting abilities. Otherwise, she needs a shave badly. The songs featuring Gracy Singh and Anil Kapoor look like an attempt by middle aged people to re-live their youth.\nPerformance-wise, Preity Zinta in this hyperactive 'made for Urmila' role is irritating at times, As for Gracy Singh, the lesser said the better, Anil Kapoor is adequate and infact does justice to his character. And there is a certain Dr. Sanjay who lends a freshness to the film, his is a likeable cameo in the film. And now coming to the man himself, The Big B has got three and a half scenes in the film and little room to perform as he is dead even before the intermission (you know the director is apologetic about this as Big B's ghost keeps making a presence post-interval). But in these three and a half scenes, He delivers your moneys value and especially in the 'waterfall' sequence which is a must-see for all Bachchan fans as you get the glimpses of the genius that makes Amitabh Bachchan what he is... Amazing....All in all you won't return disappointed if your expectations are reasonable. Passable stuff","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A nice subject marred by a poor story......","review":"Subject-wise, the film is pretty good which deals with medical profession and tries to show the dedication the doctors put into their profession. But whatever has been presented gets highly marred by its poor story which doesn't meet the reality at the slightest. Soon after touching the core subject dealing with surgeons trying to save the patients, it delves into a love triangle which looks very tailor made and becomes uninteresting. The kind of characters created and the drama mounted makes the film highly unimpressive. Especially, the role played by Priety Zinta looks very artificial. However, I can say Gracy Singh's performance and role were better. Had the film dealt more on the real life, the film would have definitely been better. Well, subject-wise you would adore it; but in terms of treatment and story the film is a major let-down. Still Dev Anand's \"Tere Mere Sapne\" is preferable on the aspect.Rating: 1 star out of 4","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" So that's what happens in hospitals!","review":"The funding of hospitals is never easy. There is always a constant demand for new equipment, medical researchers and other staff have to be paid and debts have to be met.. If you can find a rich donor who would like to see his name emblazoned on the hospital walls, lucky you.providing of course the conditions laid down by the donor are not too demanding.In this film a top neurosurgeon Akash Sinha (Anil Kapoor) is compelled to make an unusual decision. In order to save his hospital from closure, he must marry the rich donor's spoilt and somewhat hysterical daughter Soniya Kapoor (Preity Zinta). Akash must sacrifice his love for Neha Mathure (Grace Singh) his charming anesthetist and constant support in all medical matters.If you haven't guessed it by now, the dialogue of this film is in Hindi and it is given the whole Bollywood treatment. It is adequately sub-titled, but you'll need a comfortable chair because the running time is a little less than three hours. It's a strange mixture of a film. Apart from the hospital's basic problems, there is the eternal triangle of one man and two women. The romantic drama is well played out, the gentle Neha swept off her feet by Akash and selfish Soniya doing her best to destroy their love for each other. Soniya is forever having tantrums which keeps the action alive. Some of her wild scenes are reminiscent of the Bette Davis technique.If at any time you are becoming a little weary of the dialogue, rest assured the principal actors will burst into song and you will begin to wonder if this is a musical after all. But no! This is the Bollywood style, and the overpowering music takes up every change of mood and comes crashing down all around you. The Indian population must like this style of entertainment. It's almost as if the film makers are determined to give their patrons three hours of intense pleasure.The characters in the film are well defined and the scenario easy to follow. The photography is brilliant and the music, as I said, encroaches a little too forcefully over the action. As for the dance and song routines which interrupt the dramatic sequences, I guess they are a matter of choice. They give you a \"breather\" , I suppose, in the very long film and add to the whole night's entertainment.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" A breath of Fresh Air,","review":"The Indian film Industry needs revival, since it is stagnating with mediocrity in talent and the mediocrity is put on the pedestal and worshipped by few biased morons of the Indian Media, who have no clue about class, aesthetics or process of review. \"Armaan\" is a one of the movies after a decade of decadence that spells a ray of hope, a wiff of fresh air. The casting could't be any better. When you have two stel warts of the Indian Cinema portraying father and Son, you can only expect some poignant moments and cinematic brilliance. There is no headshaking or filthy gyrations, pelvic thrusts as seen im the movies that has the Bollywood scums--the Khans-that is played out in the name of Choreography and acting and this is not representative of Indian Cinema. Amitab Bachchan the \"Al Pacino\" of the Indian Films has given one of his trademark portrayals so much so you wish there was more of him to see. Gracy Singh has class and elegance and act she can-indeed well. I hope we can see more of this talented actress. Anil Kapoor is the finest actor in the genre of \"Robert De Nero\" an all-rounder and the ultimate actor that the Indian Cinema is blessed with. Overall I like this movie-\"I really,really,like this movie\", if I can borrow the exuberation from Sally Field on her Oscar nomination.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Gem of a Film","review":"Perhaps way ahead of it's time however this flick is a great Movie. Awesome natural acting and very beautifully made movie. For the mature audience indeed.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A bit like an Indian soap opera, but the Borderline portion of the film is terrific.","review":"Dr. Siddharth Sinha (Indian mega-star Amitabh Bachchan) is the devoted head of a hospital. He constantly is trying to expand and improve the facility and the only thing he loves more is his adopted son, Akash (Anil Kapoor). It is assumed that one day Akash will take over the hospital, as he's a very accomplished surgeon. However, Dr. Sinha is a bit of a control freak. He has a heart condition that needs attention but he won't let himself take time off for himself--when he should transition control of the place to Akash.A new doctor, Neha Mathur (Gracy Singh) arrives at the hospital and you KNOW she is going to fall in love with Akash because they have a kooky misunderstanding when they first meet. Not surprisingly, they begin dating and soon talk of marrying.Soon, a VERY spoiled and obnoxious rich girl, Sonia (Preity Zinta) meets Dr. Akash. Although he is in love with Neha, Sonia has decided she MUST have Dr. Akash as her husband. And, since she's a spoiled brat and her father is one of the richest men in India, she knows she will get him one way or the other. So how do she and her father exert pressure on Akash? Well, they approach Dr. Sinha--offering to fully fund his hospital IF he can get Akash to marry Sonia. Sinha refuses and won't even tell his son about the offer.Soon after this, Dr. Sinha witnesses a traffic accident and overexerts himself--and dies trying to save a young boy's life. Then, Akash learns about the deal Sonia and her father proposed to Dr. Sinha--and Akash agrees to marry Sonia. He doesn't love her but feels he owes his father so much that he MUST marry the spoiled brat in order to keep the hospital operating. This is because just how much Dr. Sinha gave up in his life for Akash has been revealed to him.When they marry, Akash tries to be a good husband but it's really impossible for the marriage to work. Sonia is too demanding, too manipulative and too jealous--and she has the bizarre notion that her new husband and Neha are carrying on behind her back. So, she sets out to destroy Dr. Mathur--mostly because she can. What's next? Well, the more the film progresses, the more nuts Sonia appears to be! She's a great example of a so-called 'Borderline Personality'. See the film and you'll see what I mean.It's odd thing about the film is that even after Dr. Sinha dies, that's NOT the last you see of him. Several times, just like Mufasa in \"The Lion King\", he appears to his son to give him sage advice! Additionally, Sonia and her father reminded me of the character Princess and her daddy from \"The Powerpuff Girls\". Now I know few folks who watch \"Armaan\" would also watch \"The Powerpuff Girls\" (or vice-versa), but it is a very apt description.One thing I liked about the film was that Neha and Akash were very ordinary looking actors--not the super-glamorous actors you might expect in such roles. As for the plot, it's a combination of good and bad. I liked the character Sonia and appreciate showing what marriage to someone like this would be like--it's an over the top performance, but actually realistic for someone like this--and there ARE folks like Sonia. I used to work as a psychotherapist and, unfortunately, worked with several like her. What I didn't love was all the soapy bit in the plot--such as when the Mufasa-like doctor kept appearing, the complicated plot involving the hospital and the silly ending involving surgery on Sonia and a change of heart that is just impossible to believe. Thiese tended to distract from Sonia and Akash's screwy marriage and Sonia's craziness. In fact, the first portion of the film and second are really like two separate films and EITHER on their own could have worked well--together it just seemed like too much. Overall, it's a mixed bag where the good does outweigh the negative--plus it's one of the best portraits of a Borderline I have ever seen.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" not remarkable...but an interesting take on a tricky situation","review":"The theme of Armaan is something Indian filmmakers might have heard of for a long time, but probably never pitched because of the complexity and unprecedented use of it. Well here goes Honey Irani or should I say the remarkable Honey Irani as she pulls us through a tale of \"love, seen as desire and ambition\". At least in the eyes of cute and bubbly Sonia Kapoor (Preity Zinta), this holds true. The main guy to be feasted on is Doctor Akash Sinha (Anil Kapoor) who seems like one of those decent and formal types. He takes on after his empathetic father Siddhartha Sinha (Amitabh Bachchan). I find Akash to not be a very convincing doctor because of how he handles his surgeries and how he and his love interest, Neha Mathur are never overworked enough to be doctors. Anyways, the hospital which Siddhartha aspires to build requires a lot of money. Since halfway through the movie Siddhartha dies, Akash is left to pursue his father's unfulfilled ambition. However, he can't afford it. Sonia, noticing this as the perfect opportunity to snatch the man of her dreams agrees to pay the dues, but in return, asks for Akash's love . This is a major problem because Akash is in love with Neha, but he still unwillingly agrees to the proposition. However, Sonia's suspicion and jealousy can never come to a rest, and her messed up psychology leads her to do terrible things. Armaan is quite entertaining, although not perfect.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" What armaan i had from Armaan","review":"What can I say about Armaan?Change in location to a hospital setting made one wonder if this would truly be a change from the traditional bollywood norm movie. Far from it, the characters and storyline is the same. Boy meet girl - boy likes girl - enters villain (ess in this case) and break-up boy and girl - after much tabulation boy and girl get back together!!Bachchan acting was good, a change from his recent stereotypical arrogant mature man; It was nice to see Anil Kapoor finally back with a meaty role, to do justice to. Pretty Zinta was fab in the role, one can see why Honey Irani said that she specifically wrote this role with Zinta in mind; Randhir made a pleasant return to the screen; and Gracey was good in her minute role.For a first movie, Honey Irani was good, unfortunately with such an emotional drama and impressive cast, it lacked the professional touch and would only have done it justice if an established director had taken then helm. Maybe for now she should stick to writing her screenplays, something she is very good at.The only recollection I have of the movie is the few catchy tunes such as 'meri zindagi meh ayeho' and the hippy hairstyles!!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Cinematic gloom","review":"They'll tell you its a story of sacrifice, with some stupendous performances. But really its just dreary and dull trash, this guy Amitabh turns in a 'restrained' performance that borders on the contrived - a problem with most actors from Bollywood; their acting is plain contrived. Lifted across-the-border music [Yeh larka from the original 'Falak pay kaisa', the hit from the mid 80s] does not add much zing to the proceedings. And who was this actress with this Cleopatra like 60s hairdo?? Gawd, guys, get a better person to do that next time!!Only watch if you relish boredom. Really, its just another one in the long list of cinematic trash churned out by the Indie movie industry.","imdb_rating":0,"our_rating":0,"algo_label":0}]