[{"heading":" Salman vs. Rishi","review":"A David Dhawan film is always a David Dhawan film - comic, silly, frivolous, and yet very entertaining. What you expect is what you get, no surprises here. I found some of his movies really awesome. Some of them were unbearable and some were decent. Yeh Hai Jalwa belongs to the latter category, it is a solid comic ride which unites two actors, Rishi Kapoor and Salman Khan. Khan plays his illegitimate son who was born before Kapoor married another woman who is not his mother. Now he travels from India to London to meet his father, but the latter refuses to accept him given his high reputation and family, which includes a beautiful wife and two children. But Salman won't leave it at that. Yeh Hai Jalwa is thoroughly fun to watch, and like most films directed by David Dhawan, it never takes itself too seriously. Salman Khan is very funny in his role. Rishi Kapoor too is excellent and I must note that I find him far better as a character actor than in his days as a leading hero. The supporting cast includes the pretty Amisha Patel, the hilarious Anupam Kher, the fantastic Kader Khan, and the ever beautiful Rati Agnihotri. All of them make this movie a worthy and enjoyable picture, which may not be Dhawan's best, but certainly deserves to be seen.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Hilarious - not a film to taken seriously","review":"Film is a typical David Dhawan Film.The actors who are in form here are Rishi Kapoor and Salman Khan - Who play a father and son role. Their interaction and chemistry is the high point of the film. Salman Khan(son) comes to London to find his father(Rishi) and when they meet, Rishi's character tries to get rid of him as he fears his family will disown him as he was engaged at the time when he his son was born(salman). What follows is a cat and mouse game where the son threatens to reveal all with hilarious consequences. The songs are alright. Typical choreography of a David Dhawan presentation. Amisha Patel has a nothing role in the film and there is a short cameo role for Sanjay Dutt.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Amazing","review":"Amazing Movie Drama Relation Salman Khan is Brilliant","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Desi Halwa","review":"David Dhawan who is a known comedian tries to mix comedy with a family drama and hence makes a trite filmThe film reminds us of TRISHUL and JAB PYAAR KISISE HOTA HAI Sadly it comes across as a poor film compared to bothThe Salman- Rishi portions are watchable at times but the overall film is filled with corny situations and they is lack of continuitySample this: Rati fights with Rishi in 1 scene and leaves the room and then next scene cut to the office where they behave normallyThey is no proper flow too in the filmEven the scene where Amisha marries Salman is bad The film tries to get melodramatic towards the end but sadly it fails there tooDirection by David Dhawan is so so Music is goodSalman khan doesn't do his usual madness and acts in a restrained manner and he actually does well in his role though at times he appears too dull Amisha is bad Rishi is hilarious in his role, his scenes with Sallu are fantastic Kader Khan, Rinki Khanna, Rati Agnihotri are okay Sharad Kapoor, Kiran Kumar, Sanjay Dutt walk in and out of the film","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Just Average","review":"Raju (Salman Khan) was raised only by his mother. After her death, Raju sees a man on television who he recognizes as his father. Ecstatic, he flies to London to meet him and is crushed when the man (Rajesh Mittal played by Rishi Kapoor) refuses to recognize Raju as his son. Raju decides to infiltrates Mittal's family and wreck it in retaliation.With a fairly predictable plot, mediocre musical numbers, and a barely existent love story, this film relies solely on acting to be entertaining. Khan, Kapoor and Kader Khan (who plays Mittal's father) give strong performances, but it's not enough to raise this movie from being just average.","imdb_rating":5,"our_rating":0,"algo_label":0}]