[{"heading":" will the real villain please stand up?","review":"Great thriller that takes a look into the dark side of ambition. Each character has questionable motives, and the human drama alone kept me riveted thru the film. The acting is convincing and the plot has many surprising twists and turns. I enjoyed that every main character had committed some wrong--that they weren't totally innocent. It made the boundaries between hero/villain unclear at times, and it kept the movie unpredictable, and more believable. Amisha Patel was absolutely charming, Akshaye Khanna has a dark scheming edginess that gave me the chills, and I especially enjoyed Bobby Deol as the rich suave bachelor. Bobby Deol amazed me with his acting skills, and portrayed a wide range of emotion very convincingly. I loved the tension that this movie maintained...it was truly edge of your seat!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" A review for a great thriller from an American girl.","review":"I have seen lots of Indian films, and this one is ranked in my top 10. Bobby Deol was fantastic in this movie...not to mention HOT! From Gupt to Humraaz, his acting and his hair are both getting better. The plot was sneaky. You didn't know what was going to happen next. I was totally shocked with the ending. True traditional Indian culture about love and marriage shines through in this movie. Bobby Deol's sweet side shines through as well. He can be rough and tough...you know bad guy written all over him...that's what I like about him (it's sexy). When these Indian movies work, they really WORK WELL! Also, the music and dance scenes worked well in this movie since most of the actors were from a dance group. They put a lot of work into the dancing, and it showed.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" My favorite action and romance movie!","review":"One of the best Indian Movies, It's amazing, everything was perfect, the directors, the producer, the music, the lyricsBobby Deol, Amisha Patel and Akshaye Khanna, you've done a real excellent work! All the best for all of you & thank you.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" rarely a good female performance.","review":"Humraaz(secret of both) is a fine thriller made in this new millennium.. Rarely female actresses give best performances in Indian movies.Amisha Patel is good and she also brings tears in our eyes in the climax scenes.Abbas-Mustan has proved that female characters can perform better than male characters.Amisha Patel's performance is best as well as thrilling. A big salute to Amisha Patel's performance.Her face reactions are best and cleverly matching to this thrilling . The movie had bas been successful due to Amisha Patel's Performance. Wow a female performance after 80's.Surely the female performance make this movie a superb one.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Mind-blowing film that will take your breath away!","review":"Very rare is a film that holds you right from the beginning itself and doesn't let you loose until the end credits show up on screen.Humraaz is such a film. Everything from the characters to the entire wicked atmosphere will glue your eye balls to the screen and I mean it! The best part of the movie is probably the fact that what starts like a perfectly normal scenario, suddenly gets twisted in the middle suddenly! and things start getting fishy gradually.Performance wise the three leads are perfect in executions. However its the aantagonist Akshay Khanna who will take your breath away. Abbas Mustan the duo lay pretty heavy emphasis on the villains in their films and this film is no exception. Secondly the emotions expressed throughout the film by the actors are very believable, specially Bobby!Overall a mind-blowing film and one of the best films Bollywood has to offer!I give this gem a total 10 out of 10. It deserves so!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Deserves a dekko solely for Akshaye Khanna","review":"Among the contemporary Bollywood movie directors, I am a big fan of the director-due Abbas-Mustan. Their filmmaking style contains watching the DVD of some good Hollywood thriller, then getting the script of their next movie ready by using the theme of that Hollywood movie, changing the characters and the milieu according to the taste of the Bollywood movie audience and getting some good songs composed by the music directors. Earlier they used to borrow the title also from some old commercially successful Bollywood movie. This formula has worked well for them in many movies made by them. One such movie is Humraaz (2002) whose title has nothing to do with the story or the classic Hindi movie made by B.R. Chopra - Hamraaz (1967).There are only three main characters in the story - Karan (Akshaye Khanna) who is the leader of a music band, Priya (Ameesha Patel) who is Karan's associate in the band and sweetheart in the real life and Raj (Bobby Deol) who is a multimillionaire businessman. Karan manages to get the contract of running music band on Raj's cruise and then his sweetheart Priya makes Raj fall in love with her. The director-duo has very generously exposed it at the interval point itself that the love of Priya for Raj is fake and she has trapped him in that under some scheme masterminded by her real sweetheart Karan.After the interval, the game of checks and checkmates begin between Karan and Raj when Raj comes to know about the real link between Karan and Priya. However Priya bows before the real love of Raj for her and she no longer remains as willing to dance to the tune of Karan and be a faithful wife to Raj instead. Raj first decides to kill Priya considering her as infidel but soon he comes to know of the change of her heart also. However by that time, he has already taken his plan to ensure her death, only to be checkmated by Karan who is the real mastermind here. Finally, it's the villain only who loses in this chess-like game, not the hero.As said earlier, the title of Humraaz (someone who knows your secret or someone whom you have shared your secret with) has nothing do with the story presented. Though the narrative is very interesting and keep the viewer engrossed, there is nothing like suspense for him. After coming to know of the collusion of Karan and Priya in the scheme of trapping Raj and extorting money from him, whatever little suspense has been there, is also gone and there is hardly any suspense in the post-interval session. The curiosity of the audience regarding the conclusion has been maintained though.The story has been written by taking the basic grains from Alfred Hitchcock's classic movie - Dial M for Murder (1954) which was remade as A Perfect Murder (1998). However the directors appear to be more interested in showing lavishness, remote-control gates, video-conferencing through internet (which was a recent development in the world of technology at the time of this movie), one-way mirrors in bathrooms of the cruise etc than having a good script for the movie, using those basic grains. That's why their grip on the movie gets loosened at many places and the movie could not be as good as it could have been.Technical and production value wise, the movie scores like anything but lavishness leaves a positive impact on the audience only when the script is taut and engaging and Humraaz loses the plot on this count. Raj (Bobby Deol) takes interest less in his business and more in watching nude females through one-way mirrors fitted in their bathrooms. And mind it, he is the hero of this movie. His roaming about the world alongwith his cruise, leaving his vast business behind and leaving his mother in Jaipur (their hometown), also does not make any sense. The lead female character is given the form of a vamp in the major part of the movie but she turns out to be the heroine in the final reels. Changing her infidel and greedy character to that of a devoted wife or Sati Saavitri is sudden and not very convincing.Himesh Reshammia's music contains foot-tapping numbers and can be considered as overall good. Bardaasht Nahin Kar Sakta is my favourite song from this album. Shiraz Ahmed's dialogs are as average as his screenplay is.Performance wise talking, both Bobby Deol and Ameesha Patel are average alongwith the supporting cast members, are average. The real performer in this movie is the villain Akshaye Khanna who has delivered a sensational and convincing performance. He is a talented actor and was able to create his sizable fan-following in the initial years of his career itself. The movie alongwith his role may be considered as ordinary but his performance is extra-ordinary.If you want to watch an Indianized version of Dial M for Murder or A Perfect Murder, I suggest you to watch Mukul S. Anand's Aitbaar (1985) which is a much better adaptation of the classic Hollywood movie (s). Still, courtesy Akshaye Khanna, this Abbas-Mustan presented Bollywood potboiler is also worth a dekko.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Bobby Deol and Akshaye Khanna will keep you on the edge of your seat...","review":"Humraaz is an excellent action thriller. It will remind you a bit of Race in the constant twisting plot. It keeps you going, wondering what will happen next.The story is about a dance troupe trying to make it in Mumbai. I won't give away any more because it will really ruin the film.Bobby Deol's acting is really great. You fall in love immediately with this rich but sincere and romantic man. Akshaye Khanna like always is top class in acting.Overall this is a great timepass film. It is far better than many action type films out there. It doesn't stray away into comedy, it's very believable. Just twist after twist.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" the most entertaining Indian movie of 2002","review":"Humraaz is an immensely entertaining and classy film that is probably on par with any Hollywood thriller. The best thing about the film is that it keeps you on the edge of your seat from beginning to end! When you think the movie is over an unexpected twist happens to keep the pulse-pounding thrills sky-high. Plus, the movie has that traditional, nostalgic Bollywood style romance that everyone loves. Music by Himesh Reshammiya deserves awards, with the best songs being 'Bardaasht', 'Dil Ne Kar Liya', and 'Sanam Mere Humraaz'. Performances from the cast couldn't be better! This is Amisha Patel's best role to date (including 'Kaho Naa Pyaar Hai'), and Bobby Deol and Akshaye Khanna act with zeal and enthusiasm. The only let down of the movie is the cliched ending, but with a film that has appealed to you for a solid three hours, you'll fail to notice.With all that said, Humraaz is a film for everyone, and the most appealing of 2002. Go rent it, or rather, buy it!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Quite decent till...","review":"Humraaz is a thriller from Bollywood inspired by Hollywood. It's a love story too. Of course it has songs and they are ok in the context. The twists and turns are well handled and together with a cast that seems to enjoy themselves the film scores quite some points. Helas at the very end it loses a lot of them again with a ridiculous over the top showdown that is quite indigestable unless you really dig that particular brand of violence that is so typically Bollywood. Too bad since the film has a couple of violent moments before that which are much more realistic and scary. More amusing than scary is the fact that the bad guy usually is accompanied by Gregorian chants when he goes about his business.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" What a lovely ever.","review":"I want to put this movie lovely because that's the part getting in love.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Perfect Murder......","review":"Abbas-Mustan are known for remaking Hollywood films, Humraaz was remake of A Perfect Murder(1998) which was a remake of Dial M For Murder(1954). But Abbas Mustan makes sure to Indianiase it, adding masala and songs. APM had started directly with the Husband's plan while here we have a first half to establish the characters, It starts off quite well with the troupe dance performances and then performance at a cruise, followed by the death of one character Jojo, the first half is mor eon love triangle, songs but the interval point is shocking for Indian audiences. In the second half slowly we are shovered with lectures on Indian traditions by Amisha's character but the twists and turns do startle you, The second half since Bobby's plan is all copied mostly from APM but with lot of changes done from that to suit Indian audiences with a climax changed and straight out of AM films like Soldier where characters get beaten and then suddenly fight.Direction by AM is good though the script isn't perfect Music by HM is good and pacy and suits the themeBobby Deol is excellent in his role and looks the businessman part perfectly, his expressions in the second half are perfect too Akshaye Khanna is superb in his first villain role, he won laurels for his act and stole the show Amisha Patel thankfully doesn't have screachy scenes though at times she does get to the nerves with her dialogue delivery. Amongst rest, Whole lot of regulars like Johny Lever, Sudhir, Dinesh Hingoo are thrown in forced comedy scenes which the film could do without Suhasini Mulay and Bobby's family all are okay, Farhan resembling Emraan Hashmi is good in a small role, rest all are okay.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" I give the storyline a top 8/10.","review":"Karan (Akhaye Khanna) and Priya (Amisha Patel) are the lead performers for the upcoming musical dance troop and are very much in love with each other. The troop gets a contract to perform on a cruise ship owned by a millionaire called Raj Singhania (Bobby Deol). Raj is magnetically drains to Priya and she too is totally swept off her feet as one of the richest eligible bachelor is wooing her in a lavish style.Karan is unaware of the relationship between Priya and Raj.As the cruise comes to an end,Raj proposes to Priya and she agrees.Now begins a treacherous triangular love story, full of surprising twists and turns - both emotional and violent.This movie was good and had the right time of emotions and violent.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Entertainment at its best.","review":"This is singularly the most entertaining movie from Mumbai. I think the credit should go to the incredible music of Himmesh R,The enchanting Choreography,a perfectly chosen Cast,and a brilliant direction by the Doti-clad Duo Abbas-Mastan. This is one of the movies where the talent has been put to good use even the children of lesser talent like Johny Lever. Akshay Khanna may never get a similar oppurtunity to display his talent of a conniving con Artist as he does here. Amisha Patel looks incredible gorgeous with some great dance numbers. Sunny Deol is just perfect as a Tycoon. There is no overacting or filthy gyration in the name of Choreography as in Salman Khan Movies which are bordering on vulgarity. All said and done an enchantingly entertaining film.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Good film that deserves to do well","review":"After all the tripe such as K3g and the like, along with Company  Humraaz is one of the better efforts from Bollywood this year.  Slick production with a Hollywood inspired script, this film is far more gripping for its 3 hours. With good acting by bollywood standards (Amisha Patel doesnt have to cry!! yippeee!!!)and well placed songs in context of the film (Bardaasht is admittently the stand out track with a fair few fillers), Humraaz is a winner.  The backgroud score is exceptional and compliments the on-screen action.  This film could have benefitted from a slightly bigger budget because one gets the feeling that the directors had cut alot of corners in the filming of this film, due to lack of money.  However, they should be praised for trying somthing different and not palming us off with the dire Chopra/Johar love triangles.  Humraaz is what the indian film industry should be striving for.8/10","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" unrealistic thriller but decent watch","review":"Humraaz is a copy of Perfect Murder, with a few different twists. Abbas Mustan the famous director duo usually make great thrillers like Khiladi and Baazigar. Humraaz was a Super Hit, I guess many critics haven't seen Micheal Douglas's Perfect Murder. Bobby Deol was great in some films like Badal, far better then Sunny Deol. He delivers an average performance. Akshay Khanna is the villain in a Superb performance. I'm not a fan of Akshay Khanna but he does impress in this movie. Amisha Patel, the big breasted and nice behind girl gives a good performance. Her character is a little silly, as she is in love with a guy, who is blatantly using her too get rich. She finally realises this quite late in the movie. Thanks to her sexy dance and amazing body, you wont bother. Amisha is one of Bollywood's sexiest actresses with a nice body. Im a fan of her's, If I had the chance, I would love to meet her.","imdb_rating":5,"our_rating":0,"algo_label":0}]