[{"heading":" I loved this movie","review":"This movie was very funny.Sanjay (Uday Chopra) lives with his roommate Ria (Bipasha Basu) and one day the phone rings. It's his childhood friend Anjali (Sanjana) and she is getting married. At this time Sanjay realises that he is in love with Anjali.Sanjay wakes up to this reluctantly but surely sets off to Dehradoon on a noble mission-to break Anjali's wedding.In Dehradoon he is overjoyed to be reunited with Anjali  till he meets the groom to be  handsome, charismatic  Rohit (Jimmy Sherjil). Nevertheless, Sanjay's love for Anjali impels him to take on the world and he sets off on his crusade of poisoning the family's mind against Rohit. On realising that Sanjay is behind these seemingly innocent coincidences Rohit confronts him  a clash between the good and the not so good. Both men decide to give each other a fair chance, letting Anjali be the decision maker and at the end she marries Sanjay.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Welcome to the wedding of the \"Yaar\"!","review":"I was impressed by this movie. The acting was very good, and newcomer Tulip Joshi, or Sanjana??, was quite impressive for a new actor. Uday Chopra is very entertaining as always, and Jimmy Shergill injects some life into the character Rohit, who is supposed to come across as a goody two shoes, but that is part of the charm of his character. He is the \"perfect guy\", so much so that Sanjay (Uday Chopra) feels unable to compete with him on that level. The music was great, especially the song \"Sharrara\" which accompanied a great dance by Shamite Shetty, and great choreography. The story moved very well, and the family sequences created a lot of lighthearted fun and comedy. BUT the best part of the movie was Bipasha Basu. I was SO impressed by her acting, and she did such great justice to the role of Sanjay's long suffering friend Ria. This is so unlike the roles she has done in the past, that I was very impressed with her for trying something new, and being intelligent enough not to care about not being \"the leading lady\" of the film. In some movies the supporting characters are a lot more interesting, than the leading roles, and obviously Bipasha saw the value of this character. Smart girl! The story line was inspired by \"My best Friends Wedding\", but with gender flips! But beyond that there was nothing in common with the Hollywood version at all, and the outcome of the movie was totally different. All in all I really liked the film, and would recommend it to anyone who thinks that friends make the best lovers!","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" A fun-filled film with great songs and good performances","review":"Director Sanjay Gadhvi in his second film has done a good job by sticking to the Yash Chopra (the film's producer) formula. Even though the story is hardly original (a mix of My Best Friend's Wedding, Kuchh Kuchh Hota Hai and Dil Waale Dulhaniya Le Jaayenge), this deficiency is made up for by excellent songs, picturesque locales, great sets, and fairly good performances. Sanjay (Uday Chopra in his second movie) realizes that he has been forever in love with his childhood pal Anjali (debutante Sanjana) only when he gets to know of her imminent wedding with NRI-doctor Rohit (Jimmy Shergil). He rushes off to Dehradun to try and stop the wedding and to win Anjali's heart. Rohit sees through his motive and the two suitors decide to compete with each other while leaving the final decision to Anjali. Bipasha Basu as Sanjay's friend Ria, is cast in a role very different from her earlier appearances and does a great job as usual. The film is an optimum mix of romance, comedy, emotion and drama. The performances of the main as well as the supporting cast are pretty good, even though Uday Chopra tends to go overboard with his dialogue delivery and Sanjana looks quite plastic in the emotional scenes. To it's credit, the look and the feel of the movie is fresh. The songs (e.g. Jaage Jaage, Ek Ladki and the title song) are very hummable. All in all, it's a very watchable movie provided your expectations are not too high.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" my best film...","review":"i have watched it more than 25 times its really a great movie .......my best movie in fact i like every thing about the movie . Uday's performance was superb and the songs........they are great jimmy was looking great in the movie and Sanjna i cant believe it .........i just liked her role in the film she is looking cute and pretty The movie is so enticing nd good to watch my best scene is where Anju is telling Rohit that she loves her child hood friend Sanju ........ at the end of the conversation she said \"that's just why i called u here\" imagine \"just\" is addressed to a breaking marriage Rohit loves Anju ,Anju loves Sanju and this time around Sanju also love Anju wat a love story!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Great Bollywood music and dance numbers","review":"I recently discovered Bhangra music and Bollywood films/music videos and am a fan of both. This movie is well worth it just for the dance/musical numbers. The bachelor party dance was praised in an earlier comment. The dance contest is even better - worthy of Saturday Night Fever! And the wedding number is truly out of this world - music, song DANCE and costumes - and there is even a plot excuse to repeat it.Plotwise this is also a good movie. Even though I could not get subtitles on my DVD player, with a little help from the package notes I could follow the story. One refreshing aspect is that each of two romantic male rivals turn out to be positive, good-guy characters - and there is a girl for each.Very highly recommended for music video enthusiasts, highly for romantic comedy movie enthusiasts.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Enjoyable flick","review":"Having recently revived my interest for Bollywood movies, I was pleasantly surprised by 'Mere Yaar Ki Shadi Hai'. One only has to read the story to know that it is based on Hollywood's romantic comedy 'My Best Friend's Wedding'. Only the gender roles are reversed. Boy and girl are friends. Girl announces her engagement. Boy realises how much he loves her and tries to win her heart. Unfortunately the husband-to-be isn't a total prat, but handsome and charming.The story has nothing new to add, but is despite that quite enjoyable. The songs are beautiful and the dances are quite exquisite, especially the one performed at the bachelor party. Who says women can only steam up a bachelor party by taking of their clothes? This scene is indeed sexier than any old striptease.Naturally the film had some flaws. Not only technical, but also emotional flaws. But all in all, I very much enjoyed this film and can recommend it.\nBipasha Basu was absolutely adorable. My only regret is that her role was so small. She would have made an excellent leading lady in this movie.***/5 stars","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Even the title is not original","review":"Bollywood filmmakers are habitual of lifting the story ideas, plots and sometimes the whole scripts from foreign movies(and old Indian movies too). Sometimes they do not reveal the source of the story and shamelessly take its credit but sometimes they reveal it in advance. Mere Yaar Ki Shaadi Hai(2002) is such a movie made under the prestigious Yashraj Films banner of Bollywood about which the makers had revealed in advance(much before the release of the movie) that its story had been lifted from Hollywood comedy - My Best Friend's Wedding(1997). In a way, it was a prudent step on their part because those who had seen the Hollywood movie or heard about it, came to know in advance as to what to expect in the film. But the height of copycatting is that the makers could not think of even an original title for the movie and they translated the title of the Hollywood movie itself in Hindi(Mere Yaar Ki Shaadi means my best friend's wedding only).However, the difference between these two movies is that the pivotal character of My Best Friend's Wedding is the heroine whose role has been played by Julia Roberts whereas the pivotal character of Mere Yaar Ki Shaadi Hai is the hero whose role has been played by Uday Chopra. In other words, Mere Yaar Ki Shaadi Hai is that version of My Best Friend's Wedding in which the gender of the main protagonist is changed from female to male.Otherwise also, neither the screenplay writer Mayur Puri, nor the director Sanjay Gadhvi, nor the filmmaker Aaditya Chopra has done to insert anything original in the movie. The complete movie, though it's entertaining, takes the oft-beaten path in terms of characters, events and milieu seen many earlier movies made under the YRF and the Rajshri(Sooraj Barjaatya) banners of Bollywood. The same wedding environment, the same plethora of characters(with the task of understanding their mutual relationships being left to the audience), the same colourful garments, the same jovial songs, the same intermittent doses of sentiments and the same all's well that ends well kind of climax after a few twists here and there in the story.Like Julia Roberts in My Best Friend's Wedding, the hero of Mere Yaar Ki Shaadi Hai, i.e, Uday Chopra comes to know that his childhood love Sanjana is going to be married to a suitable boy Jimmi Shergill. He gets disheartened because he had never expressed his real feelings to Sanjana and now he does not see any possibility to get the love of his life. However his close friend Bipasha Basu encourages him not to lose heart and motivates him to do something concrete instead of cursing his fate and his error to have kept his feelings hidden from Sanjana before it's too late. Now motivated and recharged Uday Chopra, heads to the wedding venue as a unique guest whose hidden agenda is to break this matrimonial alliance and stop this wedding from taking place.So now our hero reaches the venue of the colourful Yash Chopra style wedding which is going to take place. Everybody is enjoying in his / her style. However he finds his task a Herculean one when he comes across his Raqeeb(rival in love) Jimmi Shergill who is better than him in every respect - education, career, wealth, manners, culture and noble human traits. Again he is disheartened(had he sought inspiration from the fact that he's Yash Chopra's son, then he would have been able to keep his morale constantly high) to be motivated again by the ever-reliable Bipasha Basu. After some time, the very intelligent Jimmi Shergill realizes that Uday Chopra is actually against him and he wants to break his wedding arranged with Sanjana so that he himself is able to marry her. Quite naturally, when the prize(i.e., the bride) is one and the contestants are two(i.e., the boys desirous to be her groom), then the rivalry is bound to be intense. The game of chess between these two with regular checks given to each other proceeds till the climax when the time for final checkmate has come for one of them.My Best Friend's Wedding is a pure comedy whereas in Mere Yaar Ki Shaadi Hai, the focus has been kept less on comedy and more on romance. The movie does not make the audience laugh very often. Romance and sentiments(alongwith the blows and counter-blows being exchanged between the two gentlemen confronting to get the lady's hand in marriage) have pervaded the movie and attempts have been made to make the viewer getting romantic or emotional.If Mere Yaar Ki Shaadi Hai is to be given the analogy of a delicious dish, then its recipe can be spelled out as follows: take ten tablespoons of Dilwale Dulhaniya Le Jaayenge and two tablespoons of Kuchh Kuchh Hota Hai and mix them properly, fry this mixture in the family pan of Sooraj Barjaatya and serve the cooked dish with Yash Chopra brand sauce to the consumers(i.e., the audience).","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Light hearted film","review":"This movie was so entertaining but it's really interesting and enjoyable Songs are really a superhit and background music is really cool Direction good storyline good screenplay good editing good Jimmy shergill was superb uday was superb tulip joshi was great bipasha was good other cast were outstanding This is really impressive just don't miss it 7/10","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" My Best Friend's Wedding","review":"MYKSH is a remake of My Best Friend's Wedding only the sexes are changed. Instead of 2 girls, it's 2 guys here and who else but Yash Raj's own Uday Chopra with a new girl Tulip Joshi urff Sanjana and that time struggling Jimmy Shergill. The film is a quite a decent film to watch,though it does have several flaws and convenient situations of YRF films. The climax too is predictable, yet the film is quite a good filmDirection by Sanjay Gadhvi is good Music by Jeet-Prita(that time they were a duo) is quite good though most songs sound similar to Yashraj songsUday Chopra does well though his role has hangover of Srk but yet he does it well, Jimmy Shergill who was still to prove his talent those days is quite good in part, Tulip Joshi is raw but does okay Bipasha Basu is okay in a cameo rest are okay","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" A family entertainer","review":"This is a lighthearted Rom-com coming from the stable of Yash Chopra films. The film is a good watch and fairly entertaining although copied from the Hollywood movie\"my best friend's wedding\" its fairly breezy.the story is simple and nothing much to write about. the songs are pretty good especially the \"Sharara\" and \"Jaage Jaage Armaan\" numbers. the production value and set direction are top notch.the direction is good too.the film has a good supporting caste who manage to create a family atmosphere.Tulip Joshi in her debut role is confident,Bipasha is strictly okay. Saurabh Shukla and Nina Kulkarni are competent. Uday Chopra hams his way through and goes on to prove that even if you are privileged, it does not necessarily transcend into being talented.his dialog delivery is bad,add to it his irritating voice and demeanor. Jimmy Shergill is the glue holding the movie,he looks good and acts well. Once again proving how underrated he as an actor is.Overall a good watch","imdb_rating":6,"our_rating":0,"algo_label":0}]