[{"heading":" Best film!!","review":"This is one of the best films ever made! I watched it a few days ago and i still have the movie running through my head. It is so amazing that it has a lasting impression.Once again, Shah Rukh Khan steals the spotlight and does a magnificent performance as the beautiful and sweet Aman Mathur.By the way, i was thinking \"What a funny movie\" until the end...it just gets sad. And me being a really sensitive person, wow...it just blows you away. Shah Rukh Khan's brilliant performance will stay with you forever.I was up at 2.30 in the morning, tissues strewn all around me with tears just pouring down my face. The moment you try to stop crying, another scene comes on and you start again. Seriously, i'm really sensitive so no surprise but i reckon this film was the first film that actually made me cry that much. I just couldn't stop!! This is a must for everyone..including you sensitive people out there! Everyone must watch this film! It's just beautiful and it was actually an eye-opener for me! You've got to cherish whatever you have because who knows...tomorrow may never come.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" if you have seen this movie outside India, you are an elected by God","review":"Watching Indian movies outside of India is something very impossible, everybody speaks about \"the famous bollywood movies\", but nobody want to release this jewels in Europe. I am so lucky I could see this supermasterpiece at the oriental cinema festival in Barcelon, I couldn't believe what I was watching. The script is stunning, the choreography crazy, the actors are superlative, the music is impressive, the plot turns you on...you can keep inside the characters as I never did. The sound is also impressive. It was like watching Mary Poppins when I was 6 yeras old, during 3 hours I lost the total terms of reality!!!! As the movie has never been exhibited in Spain and there is not copy on DVD we are so \"lucky\" We could find a pirate copy in a Pakistan supermarket in Barcelon, with perfect sound and image!!!! Well, I hope this message will amaze you to get this movie from....where?","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Fantastic really!","review":"A friend recommended this movie to me. I was skeptical at first..I'm a Chinese and i haven't really watched a Hindi Movie seriously. BUt i didn't regret watching Kal ho Naa Ho. Heart warming, funny and touching...The songs and Choreography are great! My favourites are Pretty Woman and Kal Ho Naa Ho. The storyline is very similar to Koran dramas, except that the dialogues were much more intense!it really kept my eyes glued to the screen. The acting was very intense as well, feelings were expressed very well. The energy Level was explosive especially during the dance scenes!A must watch!!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Warm, fuzzy and completely lovable","review":"*Story*Naina Catherine Kapur (Preity Zinta) lives in New York with her half-Punjabi, half-Catholic family. Her life is burdened with financial problems, bickering among family members, and memories of a dead father. She is a almost always grumpy and cynical, finding nothing to smile about. The only part of her life she likes is her friend Rohit (Saif Ali Khan) who is a fellow student in an MBA program.Into this drab life of Naina's comes a waft of fresh air in the guise of Aman Mathur (Shah Rukh Khan). Aman, the eternal optimist is the anti-Naina. He invites himself into the homes and hearts of the residents of the cozy Indian neighborhood and eventually, into Naina's life as well. What they don't know is that Aman is harboring a painful secret.The rest of the movie is about Aman, Naina and Rohit finding love, hope, happiness and ultimately the joy of living.*Review*The feeling I had as I left the theater can be best described as the feel of a woolly blanket on a chilly night. The woolly blanket in this case was around my heart. Kal Ho Naa Ho is by no means perfect. It has its share of illogical moments and cliched scenes. But while watching Indian films, one must get over such hurdles to appreciate them. Or like Naina, we'll be left criticizing everything in sight and forgetting to enjoy the moment. Also we must remember that although its important for the film industry to grow and evolve, its equally as important not to lose what is inherently our Indian identity which is apparent in the songs and the emotional quotient of hindi movies.That said, for me Kal Ho Naa Ho will go down as one of my all time favorite movies. The performances were wonderful. Shah Rukh Khan gives another performance that will be remembered. He may not be the greatest actor who ever came out of Bombay, but he is one of the few who manages to create characters who seem so friendly and lovable, you would think of him as your own. No one else in the industry has this knack of creating an atmosphere of 'apnapan'. Preity Zinta as Naina is wonderful and a perfect choice for the role. I have no idea how Dharma productions even considered Kareena Kapoor for the role of Naina. Saif Ali Khan is also incredible. Rohit is very similar to Sameer in Dil Chahta Hai but with a lot more emotional depth. I don't care how many times Saif plays that character, I still love him for it and I don't think I'll ever tire of seeing it. Jaya Bachchan who plays Jenny, Naina's mother is incredible in this small role. This character is very real and you can really sympathize with her because of Mrs. Bachchan.\nI was very disappointed with the music when it was first released. But the songs grew on me after watching them on screen. The title song is especially good as are Pretty Woman and Mahi Ve. Kuch To Hua hai is also much better on screen. Cinematography is wonderful, another aspect that makes this movie magical. Direction by Nikhil Advani is surprising to say the least. He did an excellent job bringing the story to life. And I will look forward to his next movie. It must have been hard for Karan Johar to give away his story, but Nikhil justified Karan's confidence in him and possibly made a better film than Karan might have. One of the many things I loved about the movie was that it was quite funny. Even during the dramatic moments, I was either laughing or smiling. The screenplay and the dialogues were excellent. Nikhil Advani must have a real talent for comic scenes because they were terrific.And finally I'd like to commend Karan Johar for writing such a wonderful story with characters that are very down to earth and real. Even though I loved his previous films (Kuch Kuch Hota Hai & Kabhi Khushi Kabhie Gham), Kal Ho Naa Ho is definitely my favorite. I hope we get to experience many more of his wonderful stories that are hopefully made with SRK :) because they are the dream team. If I ever meet Karan Johar, I will shake his hand and give him a hug for creating such a heart warming film.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" YAY! What a pleasure!","review":"Well, it is always a bit difficult in Western countries to get to see Bollywood movies with English subtitles, and though I have made a bit of an effort to spot them in the last few years I wouldn't call myself a Bollywood expert - and of course I've grown up with Western rather than Indian aesthetic standards ingrained. Although as a fan of Baroque Opera, I don't really have much difficulty with the basic premises of the Bollywood style!Having said that, this was possibly the most interesting Bollywood movie I've seen to date - especially in its attempt to incorporate elements of Western pop culture, including several blatant references to American movies, from Grease and a spoofed James Bond to Brad Silberling's City of Angels, which evidently contributed a lot to the way Shahruk Khan's character is handled (including him starting to see things in black and white when he is near dying - that one goes back all the way to Wim Wenders!).The soundtrack is stunning, and again it's great to see the way the New York setting gives opportunity to mix in some Western elements in an intelligent way. The dance and song numbers are a true joy, and it doesn't hurt that they are better integrated into the plot than in most Indian movies I've seen.Shahruk Khan is nicely parodying himself - at least, I thought he was... maybe I'm wrong??? :-o - I also particularly enjoyed the running joke about Aman and Rohit being a homosexual couple - one could indeed ask oneself who is really in love with who here? And why exactly does Aman prefer to love vicariously rather than going for the girl himself? It's also perhaps significant that it is Rohit rather than Naina who stays with Aman to the last. I am sure the filmmakers are intelligent enough to be aware of these undercurrents, even if perhaps most audiences aren't!In any case, watching this movie (with a very sympathetic audience at a foreign film showcase here in Wellington, people who actually laughed in most of the *right* places!) was a pure joy and it makes me happy to see how Indian cinema is finally beginning to be perceived as a legitimate part of international film culture even by Western audiences, rather than just an exotic oddity - something that Chinese and Japanese movies, for instance, have already achieved to a much greater degree!And now I'm off to buy the soundtrack...","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Live a lifetime.in every heartbeat (..and in every scene)","review":"Being one of the first person to watch Kal Ho Naa Ho in my group, I was constantly battered by the same questions: is it worth it? what would you compare it to? whats it about? etc.To answer these and other questions:Was it worth it: well depending on your perspective of what an entertaining movie should be like, then the answer would either be: 'yes definitely' or 'you will be mad to miss it'. It is so worth watching and with it Karan Johar has confirmed the he is indeed a milestone in Hindi Cinema history. The movie is definitely directed by a another (Nikhil Advani), but it is a Johar camp movie. With the Johar camp you associate a good story, good production, good songs and the 'King Khan'.What would you compare it to? Well to be honest .nothing. It has the originality of `Kuch Kuch', the splendour of `K3G' and the freshness of `Dil Chaata Hai'; but it cannot be compared to any of these or other movies. It is in a league of its own. The story may start as the run-of-the-mill hindi-cinema story, but just when we begin to get comfortable with it, it takes a turn down another path. Don't get me wrong, it is not a complex story at all - but it is unique and compelling.Would you watch it again? Well to be honest, I am writing this after having watched it a second time. What is so rare about this movie is that even the second time round I laughed at the jokes, tapped at the music and got emotional in the sad scenes.What's it about? Well it will not be fair to tell you about it, as it's an experience you should have first hand. But it has its plus points: the comedy is great (both in the gujju digs as well as the 'kantabein' scenes); the music grows on you (maahi ve being the best); the guest appearances of 'charmed' actresses; the acting - excellent all round from SRK to Zinta to Saif to Jaya; along with good direction and production. It also has its negative points - but then so do other movies and I would rather not get into those.It may not be the DDLJ or Lagaan of hindi cinema, but it's the best movie of the year and definitely a movie that will entertain me for years to come.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Warm, subtle and deeply moving.","review":"I just can believe that I had opportunity to enjoy this. Kal Ho Naa Ho (If Tomorrow Never Comes) is an energetic tale about love, love and LOVE!  The plot somewhat predictable (and I better not to rehash it) but Nikil Adhvani as a director made it with a sense of love and that make this as a warm, subtle and deeply moving, a great entertainer indeed.The chemistry between Shahrukh, Preity Zinta and Saif-Ali Khan is so strong. What a fun-tastic acting fiesta. The songs are ear-catchy and added a plus point, not a waste like many Bollywood's movies. I know KHNH is a good movie when I first read the premise, but I don't realize that this is a very good movie. Just can't believe that this is Nikil Adhvani directorial debut.  Okay, enough comment, just watch it and experience the wonderful journey of life and LOVE.10/10","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Terrific, emotional film","review":"Karan Johar has done it again.  This movie is absolutely wonderful.  It has it all--comedy, romance, and deep emotions.  You have been warned:  this is a tearjerker.  Don't bother watching it if you hate sensitive films. Shahrukh, of course, is the show stealer.  Nobody can ever replace this brilliant star who can transform perfectly into his character.  Saif , the underestimated star, is great with comic timing as he was in Dil Chahta Hai, Na Tum Jaano Na Hum, etc.  Preity Zinta was good but wasn't as great as she was in Koi Mil Gaya.  Jaya has a nice role.  Songs are excellent and, in my opinion, the best soundtrack of the year.  The portion of \"6 din, ladki in\" in the second half was a bit of a drag, however.  The best part of this movie, though, is its theme.  Carpe diem!  People are so concerned with their futures that they forget to live the present.  God only knows where we'll be tomorrow.  Enjoy today before it's too late.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" What an introduction to Indian films","review":"I would like to start this review by saying something personal. This film was my introduction to Indian cinema. And what a film to start my love for Indian films with. The story is about a serious girl Naina who's life changes when a new neighbor moves in. Just like Naina these chains of event changed me as well. I loved just about every minute of this film; its fun, its funny, it has great song and dance number, and can actually be dramatic and serious. The acting is pretty good, and stars of course the King of Bollywood Shah Rukh Khan. With great humor,fantastic song and dance numbers,and good acting; this 2003 Indian film is my absolute favorite Indian film. And who knows maybe it could be your new favorite Indian film.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Great movie!","review":"This is by far one of the best Hindi movies ever made, in my opinion. The acting is superb, and this is probably one of Preity's better movies. All the actors give a very moving performance. This movie can make you laugh and cry all at the same time, and the storyline isn't the same old things you see in Bollywood films. The main reason I like this film is because it contains modern elements in it. Its set in NY, and its has Western culture blended into it also. Being a teenager living in the US, I personally enjoy being able to relate to the movies I watch and I don't really like movies that are too traditional. I think if you like modernized Hindi movies you'll love this movie. Even if you don't, its most definitely worth watching.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Awesome!!! You should Watch!!!","review":"For all those who want to know whether Kal Ho Naa Ho is a remake of Hrishikesh Mukherjee's Anand, the answer is yes. And no. Shah Rukh Khan's character (Aman) is largely inspired by Rajesh Khanna's happy-go-lucky charmer in Anand. But on the whole, Kal Ho Naa Ho is as different as they come. The film kicks off with Manhattan resident Naina Catherine Kapur (Preity Zinta) narrating the story of her life over her daily morning jog. Don't Miss! The characters in Naina's life are introduced with the same energy that Naina puts into her jog. There is her mom Jennifer (Jaya Bachchan in jeans), who shares a love-hate relationship with her mother-in-law Sushma Seth (at her loudest Punjabi best). Mommy runs a flop restaurant. Grandmother is a flop singer. Together they are chaos. Enough reason for Naina to turn into a boring, bespectacled spinster type who takes life too seriously. The only interesting person in Naina's life is buddy Rohit Patel (Saif Ali Khan). He is uncool with women but thinks he is cool. He is also a typical Gujarati, whose father (Satish Shah) runs a business called Dial A Dhokla. Enter funny guy Aman, who turns out to be the proverbial angel in Naina's life. He is Dale Carnegie-Jim Carrey-Richard Gere-Deepak Chopra all rolled into one. He zooms into Naina's neighbourhood singing Pretty woman and woos everyone in sight, including uppity Naina. Naina hates him at first sight, but can't help being overwhelmed by Aman's charm. Even Rohit takes tips from Aman on how to be cool and influence people. Life is a song and dance till the interval. And After that everything is mystery, lol what?This is indeed a breathtaking movie! Go and watch instead of watching silly bollywood movies!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Entertaining","review":"What can you say about this movie? The makers have ensured that they have greased the wheels properly before the turkey was served.Lets look at the few aspects of the movie::01. Story: Nothing new but well-presented. And obviously the \"Anand\" factor was a diversion. 02. Characters: All of them etched out well. Be it talented Jaya Bachchan, Sushma Seth, Lillette Dubey, Sweetu, Rajpal Yadav or the highlight Kantaben. Simone Singh was good as well - she attempts a bit of skin-show, desperately wanting to break-free from the Heena image.03. Comedy: Comedy tracks have been really worked upon. There are many pokings at Gujju's directly (the audience on both my sides appeared threatening!) - but in spite of that the G.U.J.J.U. song makes up for all the damage. Clever, very clever. Kantaben was good and so was Satish Shah (and his English). 04. Location: The movie is a proper New York Darshan bus. The trivial mistakes about jogging to Central Park from Queens can be easily overlooked in the age where the scripts have crater sized holes. 05. Music: S-E-L have given one of their best compositions to date. Be it the title song or Mahi Ve - all of them stay with you for a long time. My favourite is Its the time to disco, Vasundhara Das rocks (she bring out the voice of Nazia Hassan). 06. Lyrics: The title song is definitely Javed Akhtar caliber. For the rest he should give the credit to a pseudonym.07. Spl. Appearances: Sonali Bendre and Sanjay Kapoor have extended special appearances. And in blink-an-miss appearances by Kajol & Rani (lucky mascots of Karan Johar), Uday Chopra and Jugal Hansraj. 08. Protagonists: SRK plays his part extremely well in the author backed role as \"the good Samaritan\", however does succumb to a bit of his usual hamming. Saif proves yet again that he is a dependable actor and at times can steal the show right under the nose. His performance at the restaurant (proposing scene) is wonderful. Preity does full justice to her character (Kareena - sour grapes! sour grapes!).09. Tracks: In fact the movie is full of tracks but interesting ones. Be it Kantaben, Simone Singh, the wrong house, 7-day proposing, Sweetu, revamping of the restaurant or Gia's adoption track. The director has just done a good copy-paste of it.The makers have ensured that there is maximum utilisation of resources at all fronts. For a first-timer Nikhil Advani has done a commendable job, obviously under the baton of Karan Johar who ensured that Yash Johar films flag remains high and rising.Definitely worth a watch.... with family.PS: Its interesting to see that from time to time, SRK acknowledges Aamir Khan in his movies (here the Lagaan song and in K3G the Ghulam matchstick).","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" I loved having my heart broken.","review":"I am NOT a sap for sad movies...maybe I will cry a tear or two. I didn't even lose ONE tear during Titanic that so many raved about as a \"great love story\". THIS movie? I cried for 45 minutes straight! It is like an Indian soap opera...but better. Shah Rukh Khan portrayed the sacrifice of this man with a certain nobility that really got to me. I know he is often said to be \"overacting\" but his portrayal of this character and the pain and sacrifices he went through really swept me up into an emotional state. There may be times when you are in the mood for a story about someone without the modern \"I,Me,Mine\" attitude, about someone who knows that the real meaning of love often carries with it the need for making sacrifices and may mean caring more about the other person's needs than your own.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" The best Hindi Film of 2003","review":"Har pal yaha, jeebhar jiyo, jo hai samaa...kal ho naa ho...It takes a special person to apreciate a great Bollywood movie.  There's the constant melodrama, the endless love triangles and dress changes, the randomly inserted songs and hammy dialogue...not to mention the age-old desire to be everything to every viewer. There are so many Hollywood-esque problems that threaten its quality, so many qualms that any self-respecting American critic would feel compelled to point out, that loving it seems like a chore.  If anybody can do so, however, it is an Indian.And I LOVE being an Indian.KAL HO NAA HO (\"Tomorrow May or May Not Come\") is the third film involving writer-director Karan Johar and Dharma Productions, an Indian film label that has become synonymous with box-office and critical gold.  Their first two productions, KUCH KUCH HOTA HAI and KABHI KHUSHI KABHIE GHAM were both , in their respective times, the most popular Hindi films of all time, and with good reason.  They were the ultimate crowd pleasers: a perfect mix of comedy and drama with compelling stories, masterful performances, catchy music, and impeccable direction.  They hit every emotional high and low possible in the typical Bollywood audience, and the end results were magnificent.  KAL HO NAA HO continues this tradition in grand style.Naina Catherine (Priety Zinta) is the eldest daughter of Jenny Kapoor (Jaya Bachchan) and a father whose suicide has wreaked havoc on the entire Kapoor family.  The constant bickering among the members of her household has transformed Naina into a pitiful bore who has \"forgotten\" how to smile. Her best friend is Rohit (Saif Ali Khan), a fellow MBA student who has seen Naina through all her troubles.  The two have never been more than just friends.Along comes Aman Mathur (Shah Rukh Khan), a charasmatic man who enters the Kapoors' home and changes their lives for the better, much to Naina's dismay.  Aman helps every member of the family with any problem and seems to have all the answers - he is perfect.  Aman eventually wins over Naina and changes her into a smiling young woman once again, but not before she begins to have feelings for him.  What's more, Rohit soon reveals that he loves Naina.Yet all is not as it seems.  There are secrets to be uncovered, pasts to be mended, and futures to be made, and what the trio find out may suprise them.This is, firstly, an immesnly pleasing film.  The first half jumps right into the act with some wonderfully comedic scenes showcasing the talent of all three leads and the flair of first-time director Nikhil Advani.  A particular scene involving a housemaid who suspects Aman and Rohit of being gay is among the most humorous Hindi film moments I've seen.  Karan Johar's forté with dialogue really shines here -everything is quick-witted and funny, yet never insulting to the intelligence (many Hindi films can be). We grow to love and care about these characters quickly, but thankfully characterization does not bog down the forward motion of the marrative. The first 90 minutes literally flies by.The most noticable aspect of KHNH is the tone the writer and director bring to the film: it's incredibly energetic and light, and takes chances with material that worked for me.  Many times, the characters seem to speak one-on-one with the camera in an interview style to convey personal feelings or thoughts, an interesting tactic.  There are other little touches: the \"Day 1\", \"Day 2\", etc. introductions stand out in particular (see the film to find out what I mean).  There is an incredible scope and vibrant feel to the movie, as in an Dharma production.The second half of the film gives all involved a chance to really shine. Once the twist is revealed, things take a downward turn and the climax begins. Much of the light tone from the first 90 minutes creeps its way into the second half at all the right moments, but there are some truly heart-wrenching scenes toward the end of the film. This is to be expected, but their impact is heightened by the skill of the filmmakers.  In most cases, Hindi films pile crying scenes on top of one another in the hope of eliciting some, if any, reponses from the audience, but KHNH succeeds due to solid characterization and wonderful performances.This is clearly Shah Rukh Khan's film, and he acts his heart out.  It's the same performance we've seen a million times from him, but his skills aren't broke so they don't need any tuning.  His screen prescence is unmatched in this industry, and he captivates you during both the comedic and emotional scenes.  This was a chance for him to paly a different type of character, and his natural charisma lends itself well to what the part requires. Priety Zinta finally steps into the limelight as Naina with a wonderful performance that reveals her true potential.  Watching her onscreen transformation is as unexpected as it is alluring.  Saif Ali Khan essentially echoes his character from DIL CHAHTA HAI, but the magic has not worn off.  He has a knack for playing the straight man with unfulfilled, and still unkonwn, desires.  Supporting performances are from the usual Johar suspects and are accordingly wonderful.Shankar-Ehsaan-Loy finally enter the Johar ring with this entry and certainly hold their own.  The title song is my choice for song of the year - a gently sung ballad about living life to the fullest, complimented by wonderful lyrics from Javed Akhtar and great singing by Sonu Nigam.  The other romantic song, \"Kuch To Hua Hai\" is a very contemporary song with an international flavor that manages to please with an unusual beat and interesting composition.  \"It's The Time To Disco\" is the loser of this disc, although its film picturization is likable enough, and the much hyped \"Pretty Woman\" (yes, based on the classic American song) is surprisingly upbeat and entertaining.  The obligatory BSMDGC (Big Set, Many Dancers, Good Choreography) dance number is \"Maahi Ve\", a very catchy tune that bears some resemblance to the hit \"Shava Shava\" from KABHI KHUSHI KABHIE GHAM.  Farah Khan's onscreen choreography for the song does not disappoint, and the art direction is simply marvelous.This film marks a new standard for Hindi film editing, and shows just how much Bollywood has learned from its L.A. counterpart.  We have quick cuts, new wipes, and even splitscreens...all used wisely and not for cheap effect. The editing really brings the first half of the film to life, giving every song a \"get up and dance\" feeling that never hurts.Above all, this is Nikhil Advani's film.  Remarkably, this novice helmer shows no signs of being a rookie.  In true Johar style, he handles all the film's emotional scenes, a perennial marker for directorial excellence, with confidence and talent.  Having served before as assistant director to Karan Johar and Aditya Chopra, Advani pulls out all the stops here, giving us epic, dramatic camera direction, eliciting great performances, and near-perfect pacing.Sure, a good 10 minutes shaved off the finished product would be in the film's favor, but it is a minor qubble in a sea of compliments.This is ultimately a story about hope and love - the hope to keep moving and beliving, the love to keep surviving.  It is a story about the choices we make for love and the effects those choices have on our loved ones.  It is about living life to the fullest and seizing the day, for Kal Ho Naa Ho?","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Bollywood with a twist","review":"Well, if you are as new to the Bollywood phenomenon as I am, you will be as confused by this movie as I was (... and if you are a Bollywood expert, you should skip this review). To Eureopean tastes, and probably also to American tastes, many aspects of the movie seem to be implausible. The male lead, Shah Rukh Khan, THE Indian Top Star, seems not be able to act, but nobody seems to care; the story is outrageously simple and pure kitsch; the movie is extremely long; the actors tend to break out in song and dance for no reason whatsoever; etc. However, the movie is quite charming in its way. The actors, Khan included, are lovable and do not even try to display any skills at the Robert de Niro-type of method acting. The overly emotional acting is highlighted by dramatic panning and freak breezes that even turn up in closed rooms, but it is exactly what the audiences want, and it goes hand in hand with the over-the-top lavish extravaganza of the sets and the well-choreographed song and dance sequences, since ENTERTAINMENT is all the movies aim at. So, if you are a purist, if you cannot accept kitsch for all it is worth and if you want psychological drama instead of bright sets and sentimental love stories, DO NOT WATCH THIS MOVIE. If, however, you occasionally indulge in something that is neither intellectually challenging nor deemed high art, but that is clean, bright and bubbly fun, you will enjoy this picture. There I will not bother you with a synopsis but I will only point out that you will probably want to watch one or two other movies to understand this phenomenon. The chances are high that you will see the same actors again, playing the same roles again, only with different names.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Some loopholes, but overall a great film, a landmark in Bollywood history.","review":"Okay I will not give a summary of the film. Enough of that already. Straight to the point: Kal Ho Naa Ho is a fantastic film....definitely worth seeing, and worth seeing over again.Shah Rukh Khan does a great job...as usual. I guess nobody else does emotional scenes AND comedy as well as he does. Saif Ali Khan is great. Again as usual, since he plays that role in many of his films, but he holds the story together....!! And Preity...well, it's her year. She rules Bollywood this year. After Koi mil gaya, she comes back in KHNH, with a much stronger role, probably her strongest role since Kya Kehna....and she excels in it. Yes, why was Kareena Kapoor even considered for this role??? Jaya Bacchan is also worth a mention. Nobody else could have played this role. She is fantastic!!! The special appearances make the film...well...special!!!Some of us would go see any film for 5 seconds of Kajol....especially next to Shah Rukh!!! And all credits to Karan Johar and Nikhil Advani. To Karan for coming up with the film, trusting Nikhil and making it happen, and to Nikhil for a first-class job in his first direction... And the music is wonderful...Shankar-Ehsaan-Loy definitely establishing themselves further in Bollywoodland. And Farah Khan plays her usual magic with the choreography, especially for the song Kuch to Hua Hai, which will keep you giggling in your seat...Now the loopholes: Why do all Caucasian looking people in America speak Hindi (with an awful accent as well), especially when some of the Indians sometimes afford to speak English!!??!! Why could they not spend some more time and effort to make Shah Rukh mime his rap words well in the Pretty Woman song?? Why, when Saif and Preity find out about Shah Rukh, they both seem more worried about their love lives than their friend's....well...LIFE!!! Why did I leave the cinema feeling that if Shah Rukh was given a dialogue full of hope before then end of the film, I'd have felt better...coz surely that was the point of the film: hope. I felt that the last 20 minutes were not well-explored enough...and too sketchy. One second SRK and Preity love each other, and the next she's still getting married...Why are we not shown the process that goes in between. It would have been good, emotional, and more realistic...But maybe I'm just moaning about details. Maybe I am being a bit of a Naina Catherine Kapoor....So, I'll end on this note rather...Seen in the broader context of Indian Cinema, this film is a proper landmark....It's a perfect blend of the East and the West. After rather unsuccessful attempts at copying American Pie-style comedy in Indian films, SOMEBODY finally showed us what it takes to make a success of this kind: A modern comedy (hilarious jokes) with modern direction (cool style of story-telling, I thought) in a true Indian setting. Modern music, but perfectly blended with Indian melody and lyrics. This film will take Indian comedy to new heights. And takes the East-West blend to new heights. And it takes a great film to do that...And it will leave u, not just proud of being Indian, but of being a Western Indian. Perfect blend....","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" wonderful, watch it; tommarow may not be....","review":"Hands down this is the best film of the year, and deservingly so. Although Nikhil Advani started off in the backseat, it looks like from now on his job is in the director's chair. With the support of Karan Johar and Papa Yash Johar, it's almost impossible to go wrong. With such blockbusters as Kuch Kuch Hota Hai and Kabhi Khushi Kabhi Gham to his name, Karan Johar is ready to add another feather to his cap with his beautiful and heartwarming Kal Ho Na Ho. Kal Ho Na Ho is directed by Karan Johar's associate director Nikhil Advani and produced by Karan Johar, who has also written the screenplay for the film. Nikhil Advani was Johar's close assistant in all his films including Kuch Kuch Hota Hai, K3G, and Aditya Chopra's Mohabbatein.. The main cast has Shah Rukh Khan, Preity Zinta, Saif Ali Khan and Jaya Bachchan in the lead, and a plethora of others, including Sonali Bendre, in support.Kal Ho Naa Ho takes place in Manhattan, New York, and is the story of three friends, Aman (Shah Rukh Khan), Rohit (Saif Ali Khan), and Naina (Preity Zinta), who travel on a journey that teaches them the true meaning of friendship. It teaches them to discover themselves, and to find the courage to live through times of happiness and times of sorrow. With the constant arguments and bickering in her semi-Punjabi/semi-Christian family, Naina, 23, is completely distraught by the conditions which surround her. In addition to this, she is bombarded with the responsibilities of taking care of her younger brother and sister, as well as helping her mother, Jennifer (Jaya Bachchan) handle the family's economical complications. Between all these burdens, Naina never has time for herself.As far as the technical performance of the film goes, it is almost impossible to create a more perfect film. The editing skills are extremely sound and the cinematography shows the viewers what a difference a few angle adjustments can do for a film. The overall effect of the film is merely jaw dropping, for a lack of a better term. To put all rumors to rest, Kal Ho Na Ho is NOT a copy of Hrikesh Mukherjee's 1970s classic, Anand. Although Nikhil and Karan have adopted a shade of the film, by no means is it a copy, and should be regarded as a purely original story, written by Karan himself.The greatest asset that Kal Ho Na Ho has is its cast. The magnitude of chemistry between Shah Rukh Khan, Preity Zinta, and Saif Ali Khan is mind blowing! Adding Jaya Bachchan to the mix creates for an even more awesome effect. It's safe to say that this is one of Shah Rukh Khan's best performances ever. He breathes so much life into his character, Aman, and literally has you feeling for him as if he was your very own. He puts on a mesmerizing performance and will definitely earn himself many awards.Shankar, Ehsaan, and Loy are a major part of this film as well. There music, which has been topping the charts ever since its release, brings a beautiful touch to the film. Their soft yet mellifluous melodies compliment the film wonderfully. To top it all off, Javed Akhtar's mastery of the language creates for some heart warming lyrics.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" awesome movie!","review":"W0w, This movie is great, I watched just bit of it when it released, It was real sad, that I couldn't finish it, but now after about 1 year I determined to watch it no matter what, and I really loved it. Its a great awesome heart touching movie!. Loved Kal Ho Naa Ho.!! both its story and the songs are good. All the songs rocked. Its a perfect movie for a family to watch. Except some scenes which might be disturbing for some people, in one of the scene which Saif Ali Khan's home keeper maid thinks that Saif Ali Khan and Shahrukh Khan are gay. It was real funny tough. I'd vote it as 10/10. It's worth watching! I don't understand that why people didn't like Kal ho Naa Ho as much as Kabhi Khushi Kabhi Gham and Khuch Khuch Hota Hai...","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" a flawless movie","review":"WOWNikhil Advani, Karan Johar and the amazing cast of this movie have come together to make only the second flawless Bollywood movie of this generation.What can I saw about Shah Rukh Khan, an actor who even today manages to mesmerise and captivate his audience.  In the majority of his movies, even I (a die-hard) find that he over-acts, but in this movie, his is at the pinnacle of his craft. His control is admirable, and I fell in love with him all over again.  Saif Ali Khan, who started his career as a callow youngster shows that he has finally come of age, and his heartbreaking performance in this movie is astoundingly mature.Preity Zinta is wholly believable as the woman they both fall in love with-- I almost fell in love with her myself (except my heart belongs to SRK!!)The supporting cast, full of stars in their own right, gave exquisitely balanced performances, with not a gesture or moment of screen time wasted.Nikhil Advani, I salute you.  You have managed to create what I didn't think was possible in todays world-- a Bollywood film that makes you laugh, cry, feel sad and yet happy at the same time, and also doesn't make you ashamed to take your non-indian friends to.  The only other movie that has accomplished that recently was DDLJ (and even that had one scene too far).The songs, which were disappointing on first listen, fit into the film so well that I will cry every time I hear them.  They now make perfect sense (in the same way that the songs of KKHH also improved after watching the movie)The look of the film, the humour, the choreography, the set direction, the cinematography, the everything of this movie are outstanding.In years to come, I will watch this movie with my kids (I hope), and hope that they will learn what I have today-- that the Bollywood movie is not dead, indeed it is alive and kicking, and Kal Ho Naa Ho, this movie will be a perfect monument to 2003 Bollywood cinema.Anyone who doesn't like this movie must truly have a heart of stone.WOW","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Good, though could have been better","review":"When I first saw \"Kal Ho Naa Ho\", I was surprised by the extremely modern way that was used to illustrate the film. I liked to see the Indian actors walking through New York's streets, and having an ordinary life of American, or at least Indian-American people. The film was a wonderful comedy/drama about NRIs, which makes it very special, because none of the Indian films about NRIs in the past have done it as convincingly as this one. It portrays the life of New Yorkers in a rather satirical, but realistic way.The first part of the film was very nice, funny and entertaining. I liked the well-written characters. Naina (Zinta) is an angry insecure and square girl who has no life. Her friend Rohit (Saif) is a cool guy with a gold heart, but without self confidence. Jennifer is a weary working woman, while her mother in-law Lajjo is a typical Punjabi mother in-law. The film is interesting and flows well, and then suddenly from nowhere comes Aman (Shahrukh), a happy-go-lucky guy who seems to have no problems in life, but he does want to solve the problems in Naina's family when he meets the rather complicated girl, whom he falls in love with the first moment he sees her. The character of Aman adds a lot of comedy and humour to the film. Aman tries to get close to her and then, when she finally understands she is in love with him, he rejects her! It is weird, but then we get the real secret disclosed. Aman knows he cannot be with Naina so he tries to serve as a matchmaker between Naina and... Rohit, who also fell in love with her! A typical \"Karan Johar love triangle\" indeed. But it is not, it is done in a very different and charming way.Up until that point I really loved the film. The really big problem comes in the fourth quarter of the film: It is so so slow! This is a realistic, but overly cheesy and probably the longest sequence of its sort to have been made in recent years in Bollywood.Anyway, the direction of Advani is very good. The music is out of this world and every song contributes to the film in its own way. The dialogues are nice, intelligent and never go over the top, which is great. Cinematography is terrific, editing is good, sound is superb (mainly because it's live sound), and acting is natural throughout. Shahrukh Khan is OK. His comic timing is fantastic, but in some moments he overacts. Saif Ali Khan is the film's biggest surprise. After Dil Chahta Hai, he makes it big one more time with a terrific performance. Note the scene when Naina tells Rohit about loving Aman and his expressions. Preity was brilliant, and delivers a great performance. It goes without saying that she is the best choice for this role. She had given better performances than this one before, but she comes with a very credible performance all through, especially toward the end. Jaya Bachchan shows how much this industry missed her and what a wonderful actress it lost during the two past decades. She is natural, and slips into her character in an extremely convincing way. There were undoubtedly too many emotions, but Kal Ho Naa Ho works wonderfully as a complete entertainer. It has a nice, quite innovative script in terms of writing style and the background of the characters. The makers paid attention to the American style and environment of the film, and I found the contradiction between the bright, free of worry New York and the tear-jerking proceedings of the story toward the end very interesting.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" A Reminder of a classic, filled with Wonderful Performances. In all a nice entertainer!","review":"Despites of all denials from Karan Johar, the movie does have a quite a resemblance to Indian classic Anand. Srk playing Rajesh Khanna's role, Priety playing Amitabh Bachchan role, Saif Playing the lady who was the love interest of Bachchan. I repeat it has quite an resemblance. The Performances were great, maybe sharukh get the praises but I personally appreaciated 2 performances. One of Priety and Saif's. Saif is really funny, and the best thing about him is he doesn't overact to make people laugh. I am just wondering how long does he have to wait till people start giving him credit for what he deserves, Saif carries his role wonderfully. Priety is like Julia Roberts of Bollywood, Preety woman. She could act, she proves yet again that she is not just a cute girl with a dimple on her cheek. The highlight of the movie is the funny moments of the movie, and it is filled with them. Shahrukh was good, yet again but Saif is the surprise. The movie was specially interesting with glimpse of all the stars; Sonali Bendre and Sanjay Kapoor, Rani and Kajol, Uday Chopra, Farah Khan. The supporting cast was very good too. Jaya Bachchan proving as her husband Bachchan that despite of her she still one of the best actresses. Lillete Dubey is a M.I.LF. Rajpal Yadav should overtake Johnny Lever any time in Bollywood top comedian slot. Sushma Seth, Dara Singh, the eternal macho man. Reema is nice. Satish Shah and Katki Dave are delight to watch as Gujus. Harry Potter look alike kid and her baby sitter were cute and ofcourse THE KANTABEN, homophobic maid was very funny. It was nice entertainer, nice fun, more funny then emotional. 7/10","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Fantastic","review":"Only 1 word is enough as written above,'fantastic'.SRK nails every role and did the same in this also.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Heart-wrenching! Be sure you have tissues!","review":"This movie was excellent! From the very beginning of the movie, you couldn't help but find Aman Mathur (Shah Rukh Khan) charming and lovable! His cheerfulness and big smile was contagious! Preity Zinta did a wonderful job as Naina. Saif Ali Khan was excellent portraying Rohit Patel, Naina's best friend. All three actors played their parts very well. The friendship between the three of them was quite touching.Half way through the movie I realized I was going to need a box of tissues, especially when Naina's baby sister thought she was the trouble for the family. When she asked her Mother when God would send an angel to them, I found myself wanting to cuddle her and tell her it would all be okay. Even though Naina seemed to be a negative personality, you had to learn why she had become the way she was. Eventually, you knew that Aman and Rohit were both drawn to her. You just assumed that one of the men would likely fall in love with her, but with all the twists and turns in the story, you weren't able to decide what was going to happen. Just when I thought I had it all figured out, something different would occur and throw me off track.The \"other woman\" in the movie caught me completely off guard! I thought for sure that I had her pegged correctly and knew what she was all about, but I was wrong.Like I said, there are many unexpected twists and turns in this movie, but as for the ending, well, just watch and see!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Now, that was long!","review":"As someone who's a huge fan of any movies at all, I'm so glad to have seen such a beloved Bollywood movie. It seems like the only ones most Westerners have actually seen are the Panther Panchali films of the 1950's. Of course, they still release great ones today. This film was 187 minutes and just so happened to be the longest movie I have ever seen online! It was certainly worth it to see the whole thing, though. I heard that most movies in India are three hours long. I guess they just have longer attention spans than us! This actually seemed pretty long even by their standards.It was weird that this took place in New York City for such a completely Indian film. Of course \"Slumdog Millionaire\" did the opposite and it was technically a British movie. What I love about this film is how bright and colorful everything is. We get great dance numbers and just so much movement going on. It's hard to keep up with all these characters. They really do work hard to make them all unique. With a population as big as them, it's easy to get a lot of people! There was in fact an intermission albeit quite brief. The second half is when it really starts getting serious. I can understand how such a long film would change in tone so radically. Whatever nationality, you should watch this movie. ***1/2","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" One of the masterpieces of the Indian cinema.. Excellent!","review":"Right from the point where the movie starts,this movie grips you all the way till end.kal ho Na ho happens to be another melodrama-love story from the director,but unlike the other movies,this one has a lot to teach. The star cast of the the movie is simply the best out there.Shahrukh khan once again proves us all why he is the king of Bollywood, by playing his character of a happy go lucky guy with utmost perfection.priety adds that lovable character to the movie which makes it sweet over all.Saif in his usual cool boy attitude seems to be perfect for the role of rohit.All in the movie is star studded with all the stars in the right places.Had this movie been only a musical,i am pretty sure it still would have been one of the best! The songs composed by shankar-eshaan and loy are a complete masterpiece.The songs completely meld with every situation in the movie.Not to forget,choreography of the songs just add to the icing and makes all the songs so beautiful and mesmerizing.Certainly,one of the best songs of Bollywood are present in this movie. For all the folks out there wondering if its worth watching,then i would say yes! the movies got all the elements be it comedy, spirituality,drama or romance,its a whole package. finally to sum it up, its a movie you don't wanna miss, but beware, its a real tear jerker!","imdb_rating":9,"our_rating":0,"algo_label":0}]