[{"heading":" An Almost Perfect Masterpiece","review":"What is the definition of a good movie? Has there been any movie ever made that satisfies everyone's definition of a good movie? Perhaps not.My definition of a good movie is something that commands my attention from start to end and that helps me exercise my intellect. A good movie makes me feel good when I talk about it.A good movie can belong to any genre and can definitely have its own style (sometimes completely original). The Rising did not have a focus on the character development of all of its lead roles, like a typical movie, but that seems to be intentional. It was a little frustrating to see some movie experts dwelling on that issue.The rising is about the character transformation of an idealistic but confused man called Mangal Pandey. It shows how he realized the true meaning of freedom and how it was passed on to an oppressed nation. The minute details of his personal life did not need any depiction in the movie. That could stir up even more controversy especially for some people in our subcontinent who need so little to feel offended and create chaos. The movie also shows the genuine remorse of a great soul like Captain Gordon who constantly tried to bring balance between rule and fairness. Hundred years old history became alive in the remarkable performances of the crew and the cast in this movie.The movie is a masterpiece in almost all aspects. I sincerely have not seen many Indian movies of this standard. The only criticism I would have is the placement of the holy festival which could have been discarded in favor of showing more development of mutiny preparation, politics of the Indian kings and above all some more drama. The last 15-20 minutes seemed to have hasted a bit. The dance sequence of the two gypsy girls also felt a bit out of place.Overall, I must say that I felt deeply satisfied after watching this movie.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Truly Inspiring !","review":"I watched this movie on the first day of its worldwide release. The theaters were full and understandably so. There has been much publicity done for the movie besides scheduling a worldwide simultaneous release and bringing back a \"new look\" Aamir Khan after a long sabbatical. And the 18 months Aamir spent growing his hair , has come to full fruition with an acting performance like the one in this movie.The sedition of 1857 which signaled the inception of the Indian Independence process and the eventual exaltation of Mangal Pandey is a much sought after theme in mainstream Indian cinema. There have been a couple of very good adaptations of this theme in the past. What distincts this one from the rest is probably the inspiring presence of Aamir Khan. Aamir Khan's acting is stupendous. Classically portraying the unnerving bravado known to have been a distinct possession of Mangal Pandey in Indian history books, Aamir Khan sports long hair and a lengthy moustache , while he abuts cannons, crafts uprisings and inspires the audiences. Although adhering a lot to the quotes of history, Ketan Mehta has exercised some freedom. In fact, Aamir Khan himself was found quoting something to this effect in an interview to a certain magazine.The movies shortcomings come from a vain effort to include the quintessence of Bollywood cinema in this movie - song , dance and color. Also , there is the superfluous sleaze. Ketan Mehta seems to have had a itching inclination towards resorting to song and dance at the turn of every climax. This movie could have been a masterpiece if only they would have lost the couple of female \"leads\" to oblivion and lessened some of the \"color\".","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" An epic that shouldn't be missed!","review":"Mangal Pandey  The Rising is a film that has enormous expectations (probably no other film in recent times has been awaited to this extent). And the main reason for this hype and huge expectations is Aamir Khan  the superstar makes a comeback to the silver screen after 4 long years Mangal Pandey is a story set in the year 1857 when India was in the grasp of the East India Company. Mangal Pandey (Aamir Khan) is an ordinary sepoy (soldier) who serves the Company's 34th regiment. We see the story through the eyes of Mangal and his superior officer William Gordon (Toby Stephens), who share a deep friendship. The Company introduces a new rifle called the Enfield that requires the sepoys to bite into grease that supposedly contains cow and pig-fat, and that is where all the trouble starts. It becomes a religious issue as cow is sacred to Hindus and pig is taboo for Muslims. This incident transforms Mangal from an ordinary soldier serving the British to a rebel who sacrifices his life and in turn, provides that spark to begin India's independence movement. So the story of Mangal Pandey is not about the actual Uprising, but the hero whose sacrifice sparked this whole movement. The film depicts the situation prevalent in Barrackpore in 1857. Scriptwriter Farukh Dhondy has taken cinematic liberties and he blends fact and fiction. Rather than giving the audience a history lesson as documented by the British, writer Farukh Dhondy and director Ketan Mehta introduce fictional characters and fill the narrative with folklore. To both Mehta and Dhondy's credit, all this is shown without sounding like a boring documentary or a history lesson. However, the script has its pitfalls and could have been a lot better. The biggest problem of the film is that it does not have a smooth flow. This is partly due to Dhondy's script, partly due to Mehta's direction and mainly due to Sreekar Prasad's inconsistent editing. Many scenes seem like they were cut and pasted haphazardly. Many characters are introduced and then later they are nowhere in the narrative. Songs (except Mangal Mangal, Main Vari Vari and Takey Takey, to an extent) are forced into the narrative and appear at wrong points. Most characters seem under-developed; even Mangal Pandey's character could have been developed much better.Why, then, did I like the film, inspite of so many flaws? That is because the film has something magical to it that it endeared to me despite all its obvious flaws. At the end, I left the theatre satisfied. The film is technically, a world-class product and epic in scale. Scenes like the war in Afghanistan, the torch scene with the sepoys and Mangal surrounded by a massive army are shot so exquisitely that they give you the goosebumps. Himman Dhamija's dazzling camera-work and Nitin Desai's impeccable art direction take you back in time and convince that you are in 1857. On the whole, the film manages to stay rooted in that period and achieves that late-19th century feel very well. The visual effects of the film are a treat despite minor hiccups. Costumes by Lovleen Bains are good overall, but some costumes like those of Tatya Tope and Rani of Jhansi shown at the end seem straight out of a fancy-dress competition. Action sequences by Abbas Ali Moghul are aptly designed. The sound effects are superb..the sound department has done an outstanding job. A.R Rahman's music is disappointing except for the rousing title track Mangal Mangal and the 'mujra' Main Vari Vari; Rasiya is also good to hear, but it has no use in the movie. But the background score also done by Rahman is impressive. The dialogues of the film range from a few mediocre lines to excellent ones. Generally, the dialogue is good..sample this \"Hum apne hi desh mein acchut hain (We are untouchables in our own country)\", says Mangal to Gordon. Now to the performances..a superhuman effort was expected of Aamir Khan and the superstar-actor does not fail to deliver. Though he's let down by the script.as I said before, Mangal Pandey needed to be fleshed out better, Aamir gives his soul to his character. Be it the drunken scene with Toby Stephens where they play a prank on a British officer; or the rage he displays when he's beating up a senior officer; or the calm intensity in his eyes when he walking up to face his deathAamir shows his tremendous range as an actor. But still, his brilliant performance does not seem as glorious as it should, because his character is somewhat diminished by the script. Toby Stephens is the biggest surprisehe matches Aamir step-for-step as the kind and sensible Gordon. He's worked hard on his character as well as his Hindi and he's also helped by the fact that Gordon is the best-written character of the film. Rani Mukherjee as the nautch-girl Heera is in top form in the 'mujra' Main Vari Vari and she shines even in her short, underdeveloped role. Amisha Patel does not have anything to do at all. The supporting actors are almost like cameos. However, Mona Ambegaonkar as the nurse and Mukesh Tiwari as Bakht Khan leave an impact. To be frank, the film is inconsistent all along the way..but despite all its obvious flaws, it is still brilliant, magical cinema. There is too much of candy-floss in Hindi cinema at the moment, and we need more films like Mangal Pandey, Swades and Sarkar which are easy targets for criticismbut these films show you what cinema is all about. Ketan Mehta's epic is a tad disappointing, no doubt and it could have been a lot betterbut this is one film that should not be missed. Check it out at least once..as for me, I'm already thinking of watching it a second time because I'm sure I've missed out on quite a lot of finer points in the movie.Mangal Mangal Ho !","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" must watch","review":"I just watched this movie today and it was so good that I had to write something about it. We have all waited for Amir Khan movie for long and now we know what took him so long to complete this one, its probably his best after Lagaan, awesome performances, very thrilling sequences and superb direction/ story. Its worth every penny and every minute of your time.\" All up MANGAL PANDAY-THE RISING is hands down one of the BEST films to come out of Bollywood Cinema in one time and is a film that commands respect while arousing patriotic feelings in full blast without being jingoistic. While watching the movie the viewer appreciates the very fundamental thing that we have as a Indian today-FREEDOM. A standing ovation to the entire team of MANGAL PANDAY...and I would even go as far as to call it a Modern Day Classic!\" source : website","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Impressive, Inspiring and truly amazing!","review":"The first thing you would want to do is stop comparing it to movie like Lagaan and Bhagat Singh. This movie brings a new freshness and perspective to Indian Cinema. It's the story for a SIPOY called Managal Pandey who began the first revolt against East India Company rule in India. The story is not very gripping but that's were it makes a big difference. Aamir Khan who plays the role of Mangal Pandey is so much into the character. It's not being a Hero or how he inspired the freedom movement. Moreover, it's about how a man realizes the true meaning of freedom, self respect and courage. This movie completely revolves around Mangal Pandey and William Gordon (Toby Stephen who plays the role of Captain in the East India Company). Toby has quite a role and he lives up to it. Rani Mukhurjee and Amisha are more like guest appearances as they don't drive the story. Rather they are very aptly used in the movie. This movie is a must watch. The look in the eyes of Aamir Khan and Mangal Mangal Song is what you would take back home. Aamir khan is a legend in making!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Sweet amazing surprise","review":"I went to see this movie with a friend of mine from India. I was going because of her, expecting to be bored to death. I was wrong! The Rising is one of these movies that are larger, bigger than life. The amazing powerful music sets the tone to a legend of a great folk hero for Indians. The acting, in most cases, was haunting. The cinematography was breathtaking and the songs, and I am not a big fan of people singing and dancing in movies, were magical and helped move the story along. Of course, it was a big history lesson form me (though the producers warn you that some of this is fictionalized), but I have a better understanding of the Indian culture now. I finally get to see Toby Stephens\\playing a role that doesn't involve him being mean, a villain or plain evil.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" The Rising Rises to Unprecedented Heights!","review":"I saw The Rising on Saturday at the 3p.m. show at Naz8 in Lakewood,Southern California. I loved it so much that I went to see it again at9.30 p.m. show at Cinema City in Anaheim Hills which is nearer my home in Yorba Linda.This time I loved it even more.On Sunday I saw it for the third time with my son and his wife and a cousin of mine.That is three times in two days. I plan to see it again tomorrow with my wife and some friends.I do not want to describe a scene or give away any part of the story because I might be accused of being a spoiler.My point is to inform my readers that finally a film has emerged from India that takes us back to the golden era of movies, when dedicated filmmakers like MehboobKhan, when geniuses like Naushad and Majrooh Sultanpuri,when committed filmmakers like Guru Dutt touched our hearts and our souls.When K.Asifmade Mughal-E-Azam which retains its magic and luster even forty-five years after its release.The Rising is that kind of movie.It tells us, in no uncertain terms,what a movie can do and what movie magic is all about.After MehboobKhan, Ketan Mehta is another gift from Gujarat to the Bombay film industry.He has directed The Rising with amazing dexterity and professional competence.His cameraman Dhamija is almost as good asFaredoon Irani, Jal Mistry or R.D.Mathur.And they as everyone knows were giants.The art direction, the editing, the choreography is topnotch.And as far as performances are concerned it will be a long time before somebody even comes close to Aamir Khan.He has stretched himself to the limit and then gone beyond it.Toby Stephens gives him excellent support.Rani and Amisha in their small roles are effective.The team ofJaved Akhtar and A.R. Rahman are once again at their very best.Rahman'background score, though unobtrusive, is awesome.This is a movie that keeps you absorbed from start to finish.It is gripping, entertaining and what's more enlightening.And with each viewing you like it more.It deserves to be India's entry for the Oscars.If it is sent by India,it will definitely be nominated in all eligible categories and win inmost categories, especially in the best foreign film category.The entire team behind the creation of this great movie deserves to be applauded and congratulated.They have made India proud.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Bollywood comes of age!","review":"I saw the movie Mangal Pandey yesterday and the images are still quite vivid in my mind. I attribute this to the wonderful cinematography and the colourful canvas that Ketan Mehta uses to unfold the story before his audience.The madness in Mangal Pandey's, roughly translated as \"junoon\", can only be portrayed by a great actor. A. R. Rehman's music is so good that it can make your hair stand on end. The four story tellers atop an elephant visiting villages as they tell their story is a great narrative technique.The reviews of the film in the Indian film media shocked me. I fail to understand the motive or even the thought process behind them unless it is that we are all in the danger of succumbing to cheap cynicism when feelings or ideas of patriotism come up in a creative form.People have complained about the colour and the song and dance that Ketan has used. I believe this is because of two reasons--one is that Ketan has a theatre background and this is a part of folk theatre -to use music and dance to convey messages. The other reason is that in a movie dealing with the tragic consequences of brave actions it is important to to provide some kind of relief.Even the presence of the two women which has has been criticised, is important to give the feel of the time. Mangal Pandey had to be shown as a real living human being not some flat lifeless character unearthed from dusty history books. One of the female characters brought to light the repugnant practise of Sati whereas the nautch girl was used to depict the presence of pleasure houses for the company employees. Both are necessary to give us a realistic picture of that era.A comment was made elsewhere that the younger audiences found it hard to connect with the historical character. Is it easier, then,for the youth of modern India to connect with MTV and reality shows with no content? And if this is so then does it not become even more important for our film makers to produce films with real content that may inspire pride in our culture and history? Mangal Pandey is a great film. From the first scene to the last you can see the immense amount of hard work that has gone into its making. The only thing that rankled was the voice over provided by Om Puri. It was unnecessary.I think the movie deserves great accolades.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A magnum epic 4 years in the making","review":"Kudos to Aamir Khan for the dedication he put into the production of The Rising, an unfairly over-hyped film, that sets out to deliver the story of Mangal Pandey.The fact that Aamir took 4 years to make this film complete with growing his locks and that awesome moustache along with tons of research is an anomaly in the Bollywood film industry. Films are churned out 3/day at the last estimate, but Aamir being the professional he is, waited years to make this movie after the unprecedented success of his Oscar nominated Lagaan.Without a doubt Aamir carries the film on his shoulders. There were many naysayers about the fact that Aamir may have been a bit lacking in the height department for the role of a freedom fighter, but when you see his towering performance on screen, his small frame is all but forgotten.The man is Indian Cinmas answer to Edward Norton from Hollywood. A great actor for his generation who is going to continue to bring Indian cinema (not bollywood masala flicks) to the international audience....i think it's his calling. Amitabh Bachchan seems to have chickened out of this task of elevating Indian cinema to an art rather than a mockery that it usually is.Without a doubt another actor who comes close to stealing the film away from Aamir is British actor Toby Stephens... i was under the impression that his role would be quite small. Instead he has a fully fledged three dimensional character who is in the entire movie. And on top of that, he acts the entire movie in Hindi. A best supporting actor nod is in order.This film could theoretically get an Oscar nod (unfortunately a win maybe a hard sell). The songs are probably distracting for a Western audience, but they'll have to live with them.The film does fall short of being an all time classic. But i think we may have to wait for the initial hype to settle down, because the movie is without a doubt the best one of 2005.The film is slow to start, with the first half being an introduction of all the characters. But pre-interval, the story and Aamir Khan rev into the 6th gear, getting ready for the inevitable Rising post interval.Get this. I think the movie could have been a bit longer. A little more development was needed with some of the glossed over aspects of British rule.But, all in all, a magnificent effort from all involved, especially Aamir Khan and Toby Stephens.8/10","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Great Film! Better than most Bollywood Historicals, though not completely accurate","review":"I am amazed at the negative comments about this film, especially from India. I'll address those criticisms later after providing a summary of the film.Set in 1857, the film tells the story of Mangal Pandey, a sepoy (private) in the 34th Native Infantry regiment of the Bengal Army (the army of the Presidency of Bengal, governed by the British East India Company and recruited largely from upper caste UP and Bihar stock). Mangal is depicted as an ordinary soldier who is offended by the introduction of the new Enfield rifle cartridges which were greased with pig and cow fat (the former anathema to Muslims and the latter sacred to Hindus). The movie shows him changing from a loyal Company sepoy who saved a British officer's life, to one who ends up questioning the logic of British rule. Other themes include his friendship with the same British officer, the officer's rescue and subsequent romantic relationship with a sati - a widow expected to burn herself on her husband's funeral pyre,and a prostitute who exclusively services the English brothels but falls for Pandey. The movie brings opium cultivation, corruption within the Company, the growing distance between English and Indians, as well as backward, traditional Indian attitudes into sharp focus.All in all, the film is highly entertaining, a good story - well told, with powerful performances by the main characters. Aamir Khan is in his element, living the character of Pandey and conveying a fantastic portrayal of the soldier who realizes, bit by bit, that his loyalty to a foreign army makes him as \"untouchable\" as the low-caste man or prostitutes he scorns. Toby Stephens performance as the outsider in British India (Scottish, poor schooling, too fraternal with the natives) was brilliant and his chemistry with Khan was the high mark of the film's dramatic impact. The music by AR Rahman is louder than usual and some of the beats are frankly out of sync with the times ( the lesbianish gypsy dance number was a bit much!!).The strength of the film was in conveying a sense of the time period - costumes,hair-styles, sets, manners ( the English officer's \"Koi Hai\"), were exactly what one could expect. The historical background was fairly accurate (sati was outlawed, opium cultivation was forced, the Company was beset by corruption, the English did have European only brothels) though the exact interpretation of events may have not been supported by history.Which brings me to the criticism of the film. these seem to be of two variants - one, the film was not entertaining enough, and two, the anguished howl of the historians who decry its historical illegitimacy in the hope that no one may turn nationalist by seeing this film.I will dismiss the first criticism, since that may be a matter of taste - certainly, desi (Indian) audiences raised on simpler story lines and poorer production values (see Asoka and n number of Indian period dramas) may find The Rising a bit heavy to digest.Historically, the film may be inaccurate in the sense that Mangal Pandey may not have been the nationalist as portrayed, the relationships with the English officer and the prostitute are probably fictitious. But are they impossible? NO. The film has a paragraph disclaimer about inaccuracy at the beginning but this does not satisfy the history lobby. Why is it not possible that the official version about Pandey - that he was under the influence of bhang ( a hallucinogen) when he shot and killed an officer and then tried to shoot himself - is dressed up to cover the Company's stupidity in introducing the greased cartridges? Its not as if such \"doctoring\" of history has not taken place - witness the designations of \"Mutiny\" on the British side and \"First War of Indian Independence\" on the Indian side - when it was something in between? Secondly, why is The Rising being targeted when virtually every Indian film plays merry with historical events and characters? Akbar and Salim did not go to war over a dancing girl (Mughal-e-Azam), Shah Jahan was not the devoted son depictd in Taj Mahal but an ambitious usurper, one hopes that Ashoka was not the ghastly caricature depicted in Shahrukh Khan's film, and certainly India was not administered by ARMY officers as shown in Lagaan b ut by a civil ICS administration.Similarly, Hollywood glosses over the fact that getting the German Enigma machines in WW2 was a purely British affair (U-571 shows us otherwise), and of course America won the war (no mention of UK/Common wealth forces, or more importantly - Soviet forces).What I am saying is that films always distort history a bit - and so long as they are not conveying a completely different story - that should not matter. A purist on the matter of history myself, I am surprised by the vehemence of the historical community's attack on the film. My guess is that they do not want a false sense of nationalism to emerge on the basis of the Mangal Pandey story. They are a hundred and fifty years late in stopping the myth from taking hold.In the end The Rising is a great film, a great story, well shot, with a few excusable omissions.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Mangal Mangal Mangal","review":"I liked the whole atmosphere of the movie and the professional outlook. There should be more movies like this rather than the same soapy mushy mushy romantic movies.The story built up nicely, from the point where Mangal (Aamir Khan) was just a normal soldier to the point of him fighting for freedom and leading from the front. The Foreign cast in the movie such as Toby also did a great cast in making the movie professional rather than a joke.Heera(Rani Mukherjee) and Amisha did a good job although their roles were small. But it was needed since the emphasis was not them but Mangal.All in all, a worthwhile movie. Although many dispute its originality and historical facts, with the amount of historical facts available, the movie was well directed and shot. Inspiring and the ending made my heart heavier .","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Good, but fails to enthrall","review":". Memo to the filmmakers: If you are going to make a film called Mangal Pandey please concentrate all your energies on the central character, Not on his friend Capt. Gordon and other insignificant characters/events. Is it me, or Toby Stephens had more screen time than Aamir? .No need for the bookending/flashback structure. Movie could have been told in a fairly linear fashion up to the hanging. Narrative, as it is, seems to disjointed/distended.. Om Puri's voice-over narration was redundant. (It came to my attention that he was there to narrate the events to non-English speaking Indian audiences, but that only goes to show that the script was not well thought-out -- not enough was shown VISUALLY and Dialogues and situations alone should have been enough anyway.) . Why make the central P.O.V., Capt. Gordon's? The movie centers around Mangal Pandey, yet we spend too much time around Gordon, which results in a certain lack of focus. The film takes too many tangents. I would have loved to learn more about Mangal Pandey the Man, not about his life and interaction with people as seen through others' eyes. Again, he should have been the focus -- and that would have required a first person POV -- i.e. the camera sees what HE sees. How much more effective it would have been if the camera had been in his head (figuratively speaking) and at the hanging scene for example, shown us what he sees -- i.e. the people massed around him at the last moments of his life -- and not the people and Gordon looking at him die. It removes us too much from the central experience. Damn.. Like the use of imagery/symbolism/metaphors  (i.e. black man/white man, Brahmin/untouchable, white baby feeding off the Indian nanny, etc) though too much is made out of them sometimes. Also like that it's emphasized that Gordon is a Catholic Scot, thus an outsider among his own peers.. The romance angles were too incidental to the story -- they felt tacked on like an afterthought, and literally go nowhere. 30 minutes could easily have been trimmed off the total running time without the Suttee incident.. Rani, Amisha, and Khirron Kher have nothing to do. Liked Rani's Main Vari Vari, but it doesn't come anywhere close to Madhuri's mujras in Devdas for instance -- lacks oomph -- and it's further spoiled by the director's decision to cross-cut with Aamir toward the end of the song (to mask Rani's lack of dancing abilities perhaps?) . Songs are randomly placed, picturization is average. Apart for the Mangala Ho and Maula songs, this must be one of A.R. Rahman's least memorable score in a while. Was the HOLI song necessary? . Aamir makes up for what he lacks in stature with sheer presence and gravitas. However, I cannot help but feel that he's been short-changed as Toby Stephens is given more opportunities to out-act him, lack in that court trial scene for instance -- Aamir doesn't have a big stop-the-movie-in-its-tracks scene, though that changes after intermission when his character is (finally) given prominence. That the \"rising\" happens after Mangal's death is a double-damn as it robs Aamir the chance to pep talk the masses and show himself a true leader (that said -- those Braveheart type scenes have been done to death, so maybe it's a blessing in disguise as it saves us another 20-minute battle. Couldn't have taken it so late in the film.) . Movie fails to generate much excitement for and stir feeling from audiences the way Lagaan did -- though both have a theme in common, i.e. ALL Indians (regardless of faith or caste) unite against the common oppressor -- cricket as a sport had that populist appeal that had audiences root for the heroes, something that doesn't happen here.. Hate the inclusion of flag-waving newsreel footage at the end. Makes the movie shamelessly more bombastic/patriotic than it already is.Verdict: the film Feels substantial, has some gorgeous images (Aamir rising from the water, etc...), but overall, conception/treatment/execution of film is too pedestrian/ancient. For these kind of historical epics, one needs a fresh angle to explore the story -- a unique perspective of events that would make it stand out, the way APOCALYPSE NOW stands out from all the other Vietnam pics. It merely makes the film good, and not the great epic one expected.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" May not live up to its astronomical expectations, but still delivers.","review":"My Review: No Hindi film in memory (mine at least) has had as high expectations as Mangal Pandey. Mainly due to Lagaan, which is quite unfair. Granted, Lagaan is a masterpiece in every way, Mangal Pandey is not a sequel, prequel, or in any way shape or form related to Lagaan. Therefore while it may be difficult, it should be looked at as its own entity.Mangal Pandey starts off with a blast and starts out engaging the audience. However most reviewers and viewers alike have complained about the pace of the first half. I did not find this to be a problem at all, in fact I believe the first half is superior to the second.Aamir does a fantastic job as Mangal Pandey, as was expected of him. I wish he had spoken in a deeper tone in the film, as I imagined Mangal Pandey with a stronger voice. Although that cannot be held against him as very few actors take the risky plunge of slightly altering their voice. Toby Stephens is excellent as Mangal's friend William Gordon. His commitment to speaking Hindi as naturally as possible is evident throughout the film. Aamir and Toby have great chemistry and are quite believable as best of friends. Amisha Patel surprisingly did not go overboard in the film, and was happily part of the back-story. Rani Mukherjee does an acceptable job as the prostitute Heera, although she really needs to work on her emotional crying scenes. The rest of the cast also does a great job. The only acting complaints I have are that most of the British actors playing officers did not seem to put as much effort into speaking Hindi as Stephens did.The direction and editing of the film were very questionable. The film has a very amateur editing, and is it by FAR the biggest flaw in the film. The scenes and songs are all sloppily placed together, completely messing with the flow of the story. The songs are downright unnecessary and the film would have been much better without it. The story, and the feel of the characters start to get into your mind, and then all of a sudden comes a song and takes you right back into reality. On the topic of music, the background score of the film also is not very well done. It does not flow well with the film, often conflicts with the visuals in terms of moods. Where there should be aggressive music, there is a mix of heroic and happy music. It just doesn't help the film for the most part.Despite all the flaws in editing and direction, Mangal Pandey is still an enjoyable watch. It runs at a slower pace than most Hindi movies, and that may be a turn off for most Hindi movie viewers as they are accustomed to redundant love stories or nonessential action films. However, I believe that a movie does not need to be fast paced to be engaging.Congratulations to Aamir and the cast and crew (save the director and most especially the editor) for making a film of such gargantuan scope for Hindi cinema, even if it does not live up to it's unbelievably enormous expectations (but then again, could anything ever live up to those expectations??).Definitely worth a watch, go and see this film.7/10","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" The Best Film I've seen for a long time! Oscar Material","review":"A must see - Go watch it! Color, Music, the Human Spirit - Best foreign film ever and best movie and acting of this year! YES ITS IN English! NEEDS AN Oscar!Why am I writing a long review on the web for people I don't even know? It's the most amazing foreign made film I've ever seen! I'm a big De Niro and Pacino fan but this Indian person (logged on to check on his name) is a magnificent actor! I wonder if he's like the character he's playing in real life! He surely gives my De Niro and Pacino's something to write notes about! The story is based in India in the 1800's when they were a British colony. The story revolves around a character who becomes their first freedom fighter and is based on true history. This is no slow paced Ivory/Merchant movie and kept me on the edge of my seat for the whole length of the movie (Its almost 3 hrs. long!). Remember the Civil War movie 'Glory'? This movie (its cinematography) reminded me of that (didnt realize those Indians made such large scale movies).The Indian actor was superb - no dubbing, spoke excellent English and amazing acting! Toby Stevens plays the lead's friend and a captain in the British forces. He's the same guy from the last 007 flick. What an actor! This movie is about the human spirit - its about simple pleasures - its about the vivid colors of India. This movie is so good, its hard to explain! I've got so many thoughts in my head - the only way to know what its about is to go and watch it! Best $10 I've spent all year!!!Carla Kaczmarek Pittsburgh, PA","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Fusion of history, colour, romance, mythology, love and heroism","review":"This epic tale of the first Indian uprising (mid 19th century) has so much going for it, it's hard to know where to begin. Firstly, it documents a period of history that tends to be airbrushed under the carpet in British history lessons. Germany and Japan are still constantly reminded of the atrocities their countries committed, but we have to go back a bit earlier to look at the British East India Company - the most successful business enterprise in history, controlling one fifth of humanity, and having its own army. The value of being reminded brings a certain sense of humility. It maybe even helps to explain some of the feelings one can sense just walking about Delhi today as a white person.It's also a rare treat to have an epic of this scale, told from an Indian point of view, in English (or mostly in English). It successfully merges factual history with cultural norms, mythology, song and dance, grand battle scenes, touching romance and heroism.The British East India Company was subject to the uprising or 'mutiny' largely because of a failure to understand and respect local customs (from a purely military point of view, George Bush should consider bringing more or better historians to the White House). Having been subjected to abominations and still helping the Company fight wars, Indians rallied over a deeply held religious insult and attacked the British rulers.It is a great credit to the filmmakers that the British have not been demonised. There is no dwelling on the greatest excesses and neither are the Indians portrayed as flawless. For instance, we see a British soldier preventing a local (forced) sacrifice of a young wife at the burning of the corpse of her 60yr old husband, and the excesses of the British depicted are those common in most armies where power has led to degeneracy. We see not only the forced cultivation of poppies, but shady dealings with the resultant drugs and the Indians always coming out the losers. We see houses of prostitution set up to 'keep the troops healthy'; Indian soldiers treated as second class citizens with brutal punishments for minor slips handed out by self-important British officers.But whenever it gets too grim to watch, it springs the Bollywood trick of bursting into song and dance. The only other genre that routinely manages such a happy switch is grand opera. The slave courtesans sing joyously with double edged lyrics about being a slave to love. The spectacle of glorious colour and wonderful dancing spectacle entrances us.Many great conquerors have been also ruthless and uncaring to those they abused. The British East India Company was perhaps no different, and at worst should perhaps be judged more by the morality of the time than present day international law. But that way of thinking is a get-out. Invading another country is almost always for selfish reasons, glossed over in one way or another according to the double-talk of the day. History usually sides with the victors.The Rising will not get the marketing it deserves in the UK: many will avoid it because of the Indian songs. But it is a film well worth catching.My main quibble is that India is constantly portrayed in movies (including this one) as incredibly clean. I have never found this so, except in 5 star hotels enclaves. There is a great water shortage and most streets are pretty unhygeinic by Western standards. If Calcutta was the paradise of colour and good health depicted in The Rising, then it's gone backwards, whatever the improvements in basic freedoms and human rights. But realism it not Indian cinema's forte.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Excellent flick - Indian movies are good to watch! great family movie!","review":"When I saw the poster, I though it was a Latino flick. When me and my girlfriend drove up to the cinema, we saw many other latino's like us who ended up there for the same reason. I watched the movie expecting the weirdest of weird (i have watched some Asian flicks on TV) This movie woke us up. Me, my lady and many other latino and caucasians loved the movie. The music was weird at the start but i found myself shaking my head at the tunes. i gotta get me a cd from amazon soon.The movie wasn't Indian at all. the whole thing was in English though i couldn't catch some of the minor actor's language at times but my lady did. The story is about the Indian suppression. it isn't a 'west bashing' movie as i was afraid of - just the opposite. most important is that i had no idea about the story. it is an important part of history and so is good to watch. In addition, there was a lot of 'indian' style entertainment in the film in the music and dancing. Different but addictive. I'm going to buy the DVD if it is out alreadyFantastic movie, story and amazing acting.Mike C.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Its pumps you up in the end...honestly! It does.","review":"I saw it. I was lucky enough to find the ticket. As for the movie goes...if you are expecting a Lagaan (I mean the flair) its not there BUT B U T BUT its a really well made movie. Cinematography is excellent, it meets the Hong Kong Film industry standard in every sense(Hong Kong has become better than Hollywood in cinematography lately). Music is not bad at all Mangal Mangal song is really good and there is one Banjara(Gypsi) song which is really FRESH. Choreography is as always good ....the best in the world. One thing that surprised me was the improved special effects. A technically well made movie in every sense..no issues on that.Acting...you get what you expect of him... you know who I mean. Toby was really good but if compared quarter as good as him. Rani..not much scope...but she ended up creating an impact...every other character was good..the women in the role of KAMLA i think her name is MONA did a really good job (she was really good in that two bit role..thats what i call to make an IMPACT).How I personally judge a movie is by its impact over me when i leave the hall. And there was an IMPACT. As per my movie experience goes this is a kind of movies that will grow on any one after every subsequent viewing.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" An Epic","review":"I watched this film yesterday. I live in a small town in UK where no Bollywood film is ever shown. But luckily enough, The Rising was been shown in a near by town. I was excited. I went and watched 1st day 2nd show. My expectation was high from this film. This was because: (1) Aamir Khan in a film after 4 years. (2) Promos looked fantastic. (3) Music is very good. (4) Producer, Boby Bedi, has produced films like Bandit queen, Maqbool, Train to Pakistan etc........... List is endless!And let me tell you....I was not disappointed. This film lived well upto my expectations. This film has been shot beautifully. The era of 1857 has been perfectly picturised. Mangal Pandey was the first Indian to rise against the British and this film shows the life of this brave man.The beginning of the film when Mangal Pandey is being taken by the British soldiers starts the momentum, which is carried on till the end. Direction, screenplay, editing are excellent. Music has been composed well by AR Rahman. Mangal Mangal is a excellent song. Rest of the songs are all listenable.Even though, Aamir Khan clearly stole the show, but other actors also did a good job. Rani Mukherji was good as ever. Amisha Patel didn't have much to do. Toby Stephens acted better than anyone expected.Its a must watch for every Indian and I recommend this film to everyone else as well. I am already looking for a chance to watch it second time.It you liked The Legend of Bhagat Singh, you will love The Rising.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Boring beyond belief!","review":"With great expectations, I went to see Ketan Mehta's The Rising last night. I have always considered Mehta to be a really gifted director, right from his first critical success with Bhavni Bhavai. Then, there was Aamir Khan, a powerhouse performer. And, last but not least, how can you go wrong with such a dramatic and intense period of history as Revolt of 1857? Well, it seems Mehta has gone wrong. Big time. The Rising is an absolutely tepid piece of cinema - painfully scripted, and boringly directed. As the main character of Mangal Pandey, the inconsequential soldier who became arguably the first martyr in India's fight for independence, Aamir literally sleepwalks through the film. Even when he is supposed to go berserk with anger, the effort is blatantly obvious.While watching the Rising, two movies kept coming back to mind - Mehta's Bhavni Bhavai and Shyam Benegal's Junoon. In The Rising, Mehta seems to be going back to his Bhavai days, where he used folk elements in cinema to poetic effect. But this time around, those same folk elements come across as blotches on an already grimy landscape.Similarly, despite his apparent best efforts, Mehta fails miserably in instilling the sense of drama that Junoon had - a movie based around the same historic period and dealing with the revolt. What came across as a bloody and intense uprising in Junoon turns out to be a yawn-inducing rabble-fest in The Rising.The only redeeming feature of this movie is Toby Stephens. As Pandey's friend and senior, Toby gives his heart and soul to the character. His unshakeable belief in the coda of a soldier, his cynicism at the corruption of East India Company, and his frustrated helplessness against the system make Toby's character by far the most complex and well-rounded of the whole lot. I stopped short of giving this movie one star simply because of Toby.","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" The Rising.........Mangal, Mangal........., Mangal........Mangal hoooo........","review":"***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING *****Yes Finally, i got to watch the much anticipated Ketan Mehta's Aamir Khan starring THE RISING on 14 August at 3.30PM show in UCI cinemas, Trafford Centre.But honestly, after watching the film, my anticipation was left unfulfilled!!! There is a no doubt about the movie's character. It's a very very good movie but just not great!!! It's near clouds but doesn't touch em!Aamir was perfect as Mangal Pandey but all was not well around him in the movie!!!! What was the need of Rani Mukherji's prostitute character and Amisha Patel's Jwala character, i cant understand! The music was, i am sorry to say, absolutely boring!!!! Apart from that item number song and the mosque song!!! Even these two were not something special!!!You enter the cinema expecting some thing that you had been waiting for 3 or so years but the movie just doesn't deliver. Although i must admit i am really grateful to Ketan Mehta and Aamir Khan for at least bring the name of great great Mangal Pandey to viewers again and all those who hadn't heard of the legendary fighter for Indian Freedom movement.Another thing which i didn't like about the movie was all the unnecessary skin showing!!! Why o why so much cleavage was shown, i cant understand!!!!But all these bad-bad features of movie are forgotten when you reach the climax of the movie!!! The point where Mangal Pandey is facing hundreds of British soldiers, fearlessly, makes the movie worth watching!!!!People, you may not agree with my review, don't just believe me and trust my words!!! You must must watch this movie!!!!***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ***** ***** YOU MUST MUST WATCH THE RISING ********** AVOID VIDEO PIRACY ***** ***** AVOID VIDEO PIRACY ***** ***** AVOID VIDEO PIRACY *****","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" folklore, not history, and solid entertainment","review":"This is only the second Bollywood I have seen and was not quite what I'd expected. (I've probably heard too many stereotypical summaries about Bollywood cinema.) I was impressed. This film was very good, solid entertainment and I'd rate it among the best films I've seen in the past few years. I'd agree that some of the song-and-dance routines were superfluous to the plot and could be left out without harming the film, but not all of them. The itinerant players on the elephant were right for setting the scene in the opening sequence and at relevant points throughout the film.I also like the use of 'real' actors for most of the crowd scenes and minimal use of CGI. (I'm no fan of CGI, whatever its convenience for film makers: it often looks cartoonish, doesn't fit in with the live action, and spoils the illusion of the film.)As to the historical accuracy, I don't look to films for historical information and this doesn't interest me so much as whether the story is well told. This one is!As a history graduate, I know that dominant versions of history change periodically, and strict \"accuracy\" is of more concern to the academics than to people in general. Historical accuracy is for the textbooks, films need to have room for myth and folklore. How many rather good films would never have been made if we were always \"historically accurate\" about Robin Hood and King Arthur?","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" The Rising: Mangal Pandey","review":"The Rising is an amazing movie. It shows us the struggle faced by the Indians during those days. Aamir Khan is simply the best. So is Rani Mukherjee. Amisha Patel looks great in the movie without any makeup. Kirron Kher is also as usual good. Om Puri gives authority to the narration in the movie. Though Toby Stephens is definitely the best (after Aamir Khan) in the movie. A fine actor of today's times.The movie has enough for winning away most of the awards next year. Though with entries like Black, it would be tough for the judges to decide!!!The movie definitely touched the core of my heart. Salutations to all the actual heroes who helped my country (India) to gain Independence.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Mangal Pandey","review":"I saw this movie and personally thought that this is an excellent piece of cinema!WHat you actually see is Mangal Pandey and not Amir khan the star.4 years is still a long time,but you gotta admit for bollywood standards, this is still a pretty decent movie!The story flows,characters act natural, and for once, the director does not take the audience for being retarded simians. Released around 12th August (15th August Indian Independence Day) and centering around India's first Freedom fighter,what does the viewer expect, if not patriotism!Even take that aside, Amir Khan and Toby Stephens do a top notch job in their acting! I'd say this to be the movie of the year for bollywood and could very well be a powerful competitor for this years Foreign movie Oscar nominees!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" What a SHAME in the name of Indian Revolution!!","review":"I was surprised, not only to watch the worst movie ever on the first Revolution of India against the East India Company, but also by the Ketan Mehta and Co. for daring to change the course of history. Well, if this is democracy and right to amend the history, what will the children of tomorrow learn from this movie?Mr. Ketan Mehta should have watched a couple of finest movies on \"REVOLUTION\". The list should have been THE BATTLE OF ALGIERS, GLORY, or Emir Kusturica's UNDERGROUND.It seems the director and the screenplay writer tried to build on BRAVEHEART and ROBINHOOD: Prince of Thieves, not concentrating on the portraits of the rebellion or revolution but too much on the romance!Every country boasts of their movies for the struggle of Independence, and if this the one we have to boast of, it's really a shame! Where from the character of Rani Mukherjee rise is still an enigma! Are we compelled to bring in romantic songs and dance numbers in a movie which depicts revolution? I doubt the authenticity of the movie script. And it is just that the descendants of Mangal Pandey have files a case against the production of this movie.If they can relate a prostitute with Mangal Pandey, a day will come when we have to see Mahatma Gandhi as a Calvin Klein model, Lala Lajpat Rai as a drunkard and Subhas Bose as Casanova who goes to bar to dance with bar girls!! Who knows what are other reserves!!Isn't this a mockery in the name of independence? Democracy doesn't mean you can do anything else, like changing history. This movie really sucks! Mangal Pandey, thank GOD you are not alive to see it by yourself, at least me and my friends (all Indian) could not!Please, enough is enough, at least Bollywood is good for entertainment, now don't play with the sentiments of Indian Revolution. There are still people alive who fought for the freedom, don't belittle their struggle and pain.Shame on you Mr. Mehta.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" A movie worth every penny, and some more","review":"A movie about India's first mutiny against the Englishmen then ruling the country. Its is a story everyone is well versed with but for the benefit of those who aren't, it is about Mangal Pandey who started the Sepoy Mutiny because he and his fellow soldiers were asked to bite of the cover of cartridges made by cow and pigs fat. Cow being religious to Hindus and pigs being banned for the Muslims, the soldiers refuse to use the cartridges which sparks off the mutiny. The Director and the scriptwriters though didn't have much freedom with the movie(as the story is true) the have done absolute justice. Aamir Khan who portrays Mangal Pandey does a brilliant job. This being his second consecutive patriotic movie the emotions are visible even in his eyes. Rani Mukerji's and Amisha Patel though have done their part their roles seemed a tad unnecessary. Toby Stephens playing William Gordon does an excellent job at his role. He stands out as the best performer. The fact that the language of the film is one he is not familiar with doesn't stand in his way. He is simply marvelous. All in all definitely a movie to be watched. In fact it is a movie not to be missed!!!!!","imdb_rating":9,"our_rating":0,"algo_label":0}]