[{"heading":" Good one","review":"I know from one of Manish Koirala's (lead actress) quotes that she enjoyed doing this role. I think more Indian movies as such should be made in Bollywood. People can get lost in the songs of the movie if they are accustomed to the usual style of bollywood movies. But aside from the music, the plot is very good and manisha koirala's acting is more than satisfactory (her acting in \"Agnisakshi\" was the best). It is a good portrayal of how women were imprisoned by Taliban more than men in the whole population in Afghanistan. Very believable as opposed to the usual Bollywood plots and good character development. It is a must see in order to understand the relief that people (especially women) must have felt when Taliban was captured. It is also a good example of how God's name can be misused and religions sculpted to suit man's desires.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Sushmita Banerjee killed ! No escape from Taalibaan !","review":"I am shocked to read the news of Sushmita Bandyopaadhyaay's murder in today's newspaper. The Indian authoress who wrote her true life story in the shape of a novel - Kaabuliwaalar Bengali Bou (Kaabuliwaala's Bengali Wife) was shot dead by the Taalibaani militants outside her residence in the Paktika province of Afghanistan. Sushmita had fallen in love with an Afghan businessman - Jaanbaaz Khan and shifted from Kolkata to Kaabul in 1989 after marrying him. After the emergence of an Islamic fundamentalist militant organization titled as Taalibaan (students) in 1993 and its capturing administrative powers, reducing the formal political regime to almost naught, life became hell for Sushmita there with certain very painful truths about her husband also coming out to fore which were hitherto unknown to her. She managed her escape from there through a lot of toil, hardship and struggle and penned down that phase of her life in the form of the above-mentioned book. This book got used as the basis of a Bollywood movie which is Escape from Taliban (2003).Directed by Ujjwal Chatterjee, Escape from Taliban features Manisha Koiraala in the lead role and Ali Khan in the role of her husband. The lady protagonist, i.e., Sushmita marries her Afghani lover despite opposition from her Bengali Hindu family but when moved to Afghanistan with him, she is horrified to see humanity being butchered in every particle of the land where it's a crime to be a non-Muslim and it's even greater crime to be a woman. She is rechristened as Sayeeda after conversion and gives birth to a baby child while living with her in-laws. Her humanitarian heart weeps for the oppressed innocents in this barbaric land. Some hidden truths about her husband also get revealed to her. Now she wants to be back to her motherland, i.e., India with her daughter but it's a Herculean task. How she is able to make this great escape happen forms the remaining part of the story.Over the past two decades of their reign, Taalibaan seems to be willing to take the world to the medieval era and convert it into Daar-ul-Islaam (the land of Islaam) where everybody is Muslim and leads his / her life according to the Sharia rule (as interpreted by them). They do not believe in giving the basic human rights and the bare minimum respect to the non-Muslims as well as the females (of all categories and communities) as well as those who do not support their ideology. They are cruel. They are insensitive. We have the latest example of a little girl Malaala Yousufzai who was shot by them because she was promoting education among Muslim girls. And quite unfortunately, their biased and condemnable ideology is directly / indirectly supported by several Muslim leaders and organizations all over the world including the so-called secular India. Sushmita vividly portrayed the pitiable condition of non-Muslims and females (of Muslims and non-Muslims alike) in her book and Ujjwal Chatterjee who has written the screenplay of this movie also, has done the same by making the celluloid version of the book with sincerity and honesty.All the same, the movie is not an excellent one. It depicts reality and does not digress from its motive, nevertheless it's to be acknowledged that it could have been a much better one as the heart-tearing reality has not been portrayed with the amount of passion required for the purpose. The movie thrills more, moves less. With a better star cast and a better director, it could have been a masterpiece. At several places, the film appears to be just something above average which is sad considering the strength of the plot which is the much acclaimed book. The movie is technically okay though.Vanraaj Bhaatia's music and Mehboob Kotwaal's lyrics have not created any chartbusters but all the songs are meaningful, admirable and perfectly in sync with the mood of the movie.Manisha Koiraala has done well in the lead role. Ali Khan as her husband and the other members of the cast in various supporting roles have done justice to their work.While recommending this movie to all those who take interest in watching realistic, meaningful and purposeful movies, I wonder why Sushmita went back to that country after making such a daredevil escape from there. Perhaps because she was a sensitive lady and a true humanist and she went back only to help others like her. Ever since her return to the cursed land, Sushmita was ceaselessly busy in social work especially pertaining to women's healthcare and upliftment and that's what's not acceptable to the beasts who want to keep the half of the mankind as enslaved to the other half for eons to come.Sushmita could manage an escape from Taalibaan during the nineties but now she has succumbed to their cruelty with little hope that this great sacrifice of hers will bring about any positive change in Afghanistan or the thinking of the fundamentalist Muslim brotherhood at any place. While paying my tribute to the brave Indian authoress, I take this opportunity to make an appeal to all the humanists of the world to rise up against this barbarianism and imposition of the outdated thinking and inhuman practices on the world. The so-called secular Indians may still not break their silence (they are ready to adjust to anything undesirable done in the name of Islam for the sake of their secularism which is nothing but maintaining of double standards for Muslims and non-Muslims). However all the humanists should join hands to save humanity and innocence from Taalibaan and similar outfits.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Cheap copy of \"Not without my daughter\"","review":"Yes it is a heart-rending story, and I'm really sorry if this really happened to this lady. However if you have seen the movie \"Not without my daughter\" this is just a cheap copy of it. Some of the scenes are straight from that movie. E.g. The slitting of the throat of the lamb when she gets off the car. The direction is really bad, the acting skills of the extras was really bad. The way they shout when they needed to celebrate or show anger was rather comical. Especially the bad guy who was working twice as hard to make his voice sound rough. I felt bad for Manisha Koirala,being a mature artist the kind of people she had to act with was saddening. She did a pretty good job. Otherwise the editing, direction and music was pathetic.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" A bold hard-hitting realistic movie......","review":"\"Escape from Taliban\" is based on the true life story of Sushma Baneerjee, a Bengali lady, married to Afgan, who reaches Afganistan, just to witness the atrocities in the land. She has to face stern hardship including humiliation. beatings, and even life threatens from the Talibans, which leaves no other choice than flee from Afganistan. She can't directly contact her house in India or has a passport to cross the borders. The film revolves around her helplessness and her determination to escape from the Talibans. She's captured and faces further torments from her family and the Talibans.Through out the film I was stunned by the story of atrocities and endurance ladies go through in Afghanistan. Perhaps very few movies have come along with such a riveting and bold true life story on the screen. Perhaps a bit weakly scripted and lacking commercial values, the film may appear slow at times; but at the same time, the film has a certain rawness in its presentation and looks realistic. The songs were unnecessary and were mediocre. The greatest strength of the film is Manisha Koirala's performance, for which the film remains compulsively watchable. Through her character, the film portrays a fearless lady who refuses for any intimidation. Besides, the film projects a realistic and fearful setting of Afgan lands during Taliban insurgency. Overall, such bold and hard hitting movies are rarely made in Bollywood but are sadly unnoticed. For me, it was one of the different and bold movies from Bollywood I've watched in years; and would like to recommend it to anyone who are fond of watching real life stories.Rating: 2 stars out of 4","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Manisha Koirala's acting saves the film","review":"Escape from Taliban is a terrible movie with a terrible direction. The movie is based on a true story of an Indian female author named Sushmita Banerjee who escapes the wrath of her husband and in-laws who reside in Afghanistan during the nineties. The only thing good about this film is Manisha Koirala. She emotes really well and is superb in almost every scenes of the film. However, I think her voice is dubbed by someone else. Escape from Taliban also seems inspired by the Sally Field starrer 'Not Without my Daughter,' as few scenes are just a replication of this movie. There are many implausibilities in the plot: I don't understand why do the Afghans in this movie converse in Hindi and Sushmita (Manisha Koirala) hails from Kolkata but converses in Hindi with her family. Wasn't she supposed to speak Bengali? The music is really bad and unnecessary, especially in a film with a serious issue like that. Though one song that I really liked is 'Titli si ud chali' which aptly describes the state of Sushmita's mind as she is going back home with her daughter. However, this song's placement is all wrong. Who would even stop to sing when his or her life is on the edge?Nawab Shah is strictly okay but appears wooden in most of the scenes and speaks his lines as if he is reading from a cue card. Prithviraj Zutsi as the only man who supports and sympathises with Sushmita is okay too. Aly Khan looks wooden as ever and doesn't appear menacing at all. The other supporting casts are nothing worth writing about. My heartfelt condolences to Sushmita Banerjee's family. Sushmita got shot down by the Afghans last month. Seems like there was no chance of a second escape this time around for the poor woman.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Name study for Muslim countries","review":"the prefix \"Sayed\" is dedicated to Muslim male who has the family tree leading to Muhammad (PBH). And the name Kamal is for sure a male name. I would like to suggest the movie makers and writers to study a regions regular names for women and men prior to starting making a movie. The color yellow which causes symptoms in Rizwan khan is not a \"must be\" color. it can be anything like a voice, a color, a scene, or a smell. The movie is a bit of double cutting knife. in some scene it shows how a good hearted person can change the consequence and in some, it cuts back that prayer cant stop an incoming worse. in a scene when Rizwan buys sport shoes for his son, after his death, he wears the same shoes, i wonder how can both size of a mature man like Rizwan and a 10-12 yo boy would match.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Well made movie","review":"Based on a true story, this movie offers a peek into the ghastly and depressing world of women (and men) living in Afghanistan. The suffering of women is shown without getting too gory or vulgar. The discerning viewer will certainly be able to connect through the visual cues left open to interpretation.Manisha Koirala is superb, so are some of the cast. The Taleban cast could have been much better.The realistic, non-mushy ending keeps the plot and the storyline credible. It will be very interesting to find out what happened of the characters in real life. Maybe a sequel is in order.This should have been a contender for the awards.","imdb_rating":9,"our_rating":0,"algo_label":0}]