[{"heading":" Delayed Disaster","review":"Maseeha was Sunil Shetty's last release in December 2002. The film didn't cause Shetty much damage because he only has a guest role in the film. But, Shetty was the only part of the movie I preferred. The rest was either messy or nonsense which was pushed from the late 90's to the early 20's. This film took 4 years to make and you can see how long they take to make a crap movie. The movie shows the same old formula of college romance, some crude and cheesy scenes which were used as comedy back then. The film then suddenly moves to violent themes and revenge. When Inder finds out his dad was tortured in jail and his mom was almost molested, he goes to the station and tries to kill them. However, he himself is tortured and beaten in prison. The sudden realisation and the violence is wasted. Shetty besides the good action, does a sloppy job with his parts. But, its not his fault, its the screenplay. Shetty somehow reaches to the right place at the right time and fights for the good. It's so stupid and unrealistic. This thing only happened in 90's action movie but this is the first and last to explore this theme. There is another solid clue proving this to be from 1998-1999. But, Shetty's part was shot after 2000 because his look is from the ealry 20's with a small beard. Similar to the current flop Loot, Shetty has just done his average guest role again. Overall, this movie is another nonsense movie which was rejected and forgotten. Music was bad but Kuch Karle stands out. That was the best part of the movie, the one song!","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Crap","review":"In 2002 Suneil Shetty had 3 releases in subsequent weeks of December KARZ, MASEEHA and KAANTEMASEEHA was in making for 3-4 years perhaps considering Inder Kumar's look which changes and also the presence of Manik Bedi(brother of Rajat Bedi)The promos showed Suneil Shetty and his song KUCH KARLE only and some action scenes but in the film he only has a guest role Another e.g. of misleading publicityThe film has a story done to death Mukesh Rishi owns a bhasti and wants to make a hell of it or whatever Suneil is some messiah who reaches at the right time to save peopleThe main characters are Inder Kumar and Manik Bedi who are childhood friends(oh god) Mohan Joshi(father of Manik) in the film is the reason of the death of Inder's mother and father.etcAfter many years there are college students.etc etc Suneil reaches at the right place every time somehow, even when someone is bathed in petrol and abt to be burnt he reaches and catches the matchstick in his hand, phew! and he keeps saying- DUSHMAN JAAN KA BHI MAAL KA BHI and fightsThe film is a typical commercial film which flopped Direction by Partho Ghosh is bad Music is badAmongst actors Suneil in a guest role does his usual stuff Inder is awful, Manik Bedi too is awful Both are wooden Namrata is the heroine Mukesh Rishi overacts, Rajpal comes and goes Mohan Joshi is as usual","imdb_rating":1,"our_rating":0,"algo_label":0}]