[{"heading":" First Time Seeing an Indian Film","review":"The story was a fantasy, not plausible in any way - yet this movie was fun. This was the first time I'd seen an Indian film, at the urging of someone who has already seen it twice (she is a big Shah Rukh Khan fan). It's quite different in every way from the American films I've always seen, but very entertaining and had almost every type of movie one can imagine all rolled into one film: action, drama, romance, musical and comedy. Some of the acting was a bit \"hammed up\", but was still right for the material. The woman who played Lucky's mom was quite good. I liked the Matrix references and how it was done in an obvious way, more of a fun \"hats off\"(let's look like what they did in Matrix) instead of merely copying. Even though I speak English and no Hindi, I easily followed along with the story and had no problem with the subtitles. This was a long movie (3 hours), yet time flew. The end of the movie was touching with the exchange (don't want to spoil it) and loads of \"real people\" cast in the parts. At the very end the credits were fun, too, with the cast and crew holding up different signs with their names - if these people didn't have a great time doing this film, they fooled me! I'd say this film is good for most all ages. Even though there are loads of pretty girls, nothing seems too suggestive and seemed more in fun. I left feeling good and as if I had honestly been entertained. Good work!","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Pass the popcorn, please!","review":"Major Ram Prasad Sharma (Shah Rukh Khan) is a straight-laced military man walking in the footsteps of his father, General Shekar Sharma (Naseerudin Shah). When the General is killed by terrorists, he reveals on his deathbed that Major Ram has a half-brother, and gives him a dual mission: to protect a fragile peace initiative with Pakistan, called Project Milap, and to find his estranged brother and heal his fractured family.Major Ram is assigned to protect the daughter of General Bakshi, the commander in charge of Project Milap, which takes him undercover to St. Paul's College in Darjeeling. By an amazing coincidence that only a true Bollywood fan could swallow, the Major's younger brother Lakshman Prasad (Lucky) Sharma studies at the same college. After having his career emasculated by Karan Johar, I am happy to see that first time director Farah Khan has made a man of SRK again. How ironic that it took a woman director to give Khan a role he could finally get down and dirty with, after playing the teary-eyed lover-boy for so long.Main Hoon Naa is a great summer time masala entertainer. It has dollops of action, romance, family angst, and a little medicinal dose of patriotic preaching about peace (estranged brothers Ram and Lakshman neatly symbolize India and Pakistan, separated by the folly of their leaders and elders).But its greatest strength is that it doesn't take itself too seriously. The action could best be described as The Matrix meets Jackie Chan, with special effects that are one minute thrilling and the next minute laughable. But it's such fun to see SRK back in action, after his much publicized neck troubles, and encouraging to see Hindi filmmakers experimenting with cutting edge special effects technology.The comedy revolves around the obviously over-aged Major Ram as a returning college student. Shah Rukh plays it just right, and not only neatly parodies his college role in Kuch Kuch Hota Hai, but also does a fantastic job of remaining in character and keeping his ram-rod straight military bearing whether he's doing comedy, drama or action.Newcomer Zayed Khan (Lucky) has a way to go with his acting craft, but I found that he grew on me as the movie progressed, and he just sort of meshed with the elder Khan. They have a nice chemistry together. Amrita Rao (the general's daughter) is talented and gorgeous, and a great dancer. See her in Masti, where she also sparkles. Suniel Shetty does an excellent job underplaying the villain, and resists the urge to go overboard in his scenes. I loved the way Farah emphasizes his sexy badness by blaring heavy metal music whenever he makes an entrance. It made me chuckle every time.Unfortunately the classy and sexy Sushmita Sen has little to do, but she and Shah Rukh fairly set the screen on fire in their few scenes together. Her seductive chemistry teacher is the perfect foil for his shy, sexually naive character. I'd love to see them in another film together, where she gets full screen time. She has a strength and maturity about her that plays very well off of his vulnerability and boyishness.First time director Farah Khan takes the skills and creative genius she has displayed in her choreography (the Chaiyya Chaiyya dance atop a moving train in Dil Se alone has earned her a place in Bollywood legend) and demonstrates an exuberant love for the films of her youth. Main Hoon Naa either parodies or pays tribute to dozens of other Bollywood films, from Sholay to Kuch Kuch Hota Hai. The running gag where Major Ram bursts into uncontrollable singing whenever he sees Ms. Chandni, the chemistry teacher, is hilarious and endearing. And the outrageous chase scene with Ram on a rickshaw in hot pursuit of a jeep is just great. As a relative new-comer to Bollywood myself, I know that a lot of the references were lost on me, but I got a lot of them, too.If you prefer Karan Johar three hanky tear-jerkers, this isn't for you. But if you want some thrills and comedy and family drama with your romance, then see Main Hoon Naa! Even the closing credits are fun. And Farah's director's commentary in the DVD special features is one of the best I've ever heard.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Wholesome Bollywood entertainment","review":"Main Hoon Na is a completely crazy and an extremely entertaining flick. Done with much comedy and funny action (and a little bit of insignificant drama), this one is a film that can be watched again and again and still be an absolute treat. The film has a story, and the greatest thing about it is that it actually does not even matter. This film is made for fun, and succeeds thoroughly for that purpose.And what does it have to work as much as it did? Well, it has a Shahrukh Khan (sorry, The Shahrukh Khan), two cool youngsters (Zayed Khan and Amrita Rao), a sexy and classy chemistry teacher (Sushmita Sen), a hilarious spit-spraying teacher (Satish Shah), another funny elderly teacher (Bindu), and a motherly, warm Kirron Kher. Shahrukh is as always great and is fairly restrained in this role, Sushmita is damn too hot to handle, Zayed and Amrita suit their parts, Kirron is lovable as usual, Satish Shah and Bindu will have you floored, and Sunil Shetty will annoy you as he does in most of his films. The film has an amazing soundtrack with many catchy songs composed by Anu Malik. It has a twisted, messy and senseless story that manages to provide utmost fun and pastime, and it has many great and heart-warming moments. It flows very well throughout with all the nice songs and the rather humorous proceedings. Films are made mainly to entertain us. This film does not take itself too seriously and it is not to be taken seriously. It has some inexplicable and genuine sense of fun, and as such, can be rightfully called a successful, special and very profound Hindi entertainment.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Smart, funny and best of all - Entertaining!","review":"Amar Akbar Anthony, Naseeb, Sholay etc. Why do we love all these films? Yes, they are extremely entertaining but more so because they have action, romance, comedy, drama - EVERYTHING! In today's time, we don't get films with all that together. Farah Khan's Main Hoon Na doesn't ask you, but tells you to chill, have some popcorn and cola and have the time of your life for the next 3 hours.Major Ram Prasad Sharma is a tough army officer who plays no games and is very serious about his work. He and his father have a dream, project Milap - to set free all Pakistani prisoners of war to put forward a hand of harmony and friendship towards Pakistan. Due to circumstances, Ram's father Shekhar is killed but before dying, he tells him that he's not his only son and he wants him to re-unite with his family. Ram asks for a temporary leave to fulfill his father's wishes, alongside that, he is asked by General Bakshi to protect his daughter who goes to the same college as Ram's brother. He wants him to protect him from Indian terrorist Raghvan.So then starts Major Ramm's mission. To find his long lost mother and half brother, to protect Sanjana from Raghvan and to complete Project Milap which is opposed by Raghvan.The best part of Main Hoon Na is the story, It's refreshing and unique. The viewer knows that Ram will win in the end but the going-ons in the movie are extremely entertaining. Farah Khan, Abbas Tyrewala and group have come up with an excellent plot.Main Hoon Na has everything in the right place in terms of plot. Thee's action at the right time, songs do not stop the plot, the comedy is perfect.The film does dip a bit in the second half but that's hardly noticeable. In fact, this is one of the few Indian movies that does not slip completely in the second half. Indian filmmakers usually put so much energy in the first half that the second half starts to fade. Not this time.As mentioned before, the writing is nearly flawless. Screenplay keeps you awake and dialogues are first rate. Production values, sets, locales etc. All perfect.The music is out of this world. Anu Malik's best work. All the songs are brilliant and beautifully picturised.Farah Khan's direction is top stuff. Hard to believe this was her first film and her best. Sorry to say, I liked Om Shanti Om and hated Tees Maar Khan but I do not think Farah will make a better film than this.Main Hoon Na would be incomplete without Shah Rukh Khan. SRK puts the right energy into the role and is perfect in every frame. The scenes with Kirron Khere, the scenes with Sunil Shetty are all terrific. Even the light scenes are excellent. A superior act! Another actor that stands out is Sunil Shetty. He's first rate as the baddie. Zayed Khan can't act better than this, seriously. Sushmita Sen, Amrita Rao don't do as much but are efficient. Kirron Kher is terrific. Satish Shah and Boman Irani are hilarious. Kabir Bedi is good. Naseer makes a significant appearance.On the whole, Main Hoon Na is fun, crazy, and most of all - it isn't the type of film that asks you to lave your brain at home, bring it with you. Recommended!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Farah Khan is a genius!!!","review":"Farah Khan is a genius!!! That's the only way to describe the incredible job she has done with her debut film. One expects this kind of a film from a pro who's been at it for a great many years. But from the first frame to the last, she has held it together better than most pros can. Main Hoon Na is a great example of what a great director can accomplish. Farah Khan deserve many awards and accolades for this film. Nothing seems out of place, everything is perfect. The Chemistry between Shahrukh Khan and Sushmita Sen is electric, it's a wonder that no one ever thought of pairing these two earlier. But I'm sure now we'll see a lot of them together.The Dialogues (Abbas Tyrewala of Munna Bhai MBBS fame) are excellent throughout the film. If Munna Bhai was the funniest film of last year, then MHN will give any comedy a run for its money this year. The Cinematography and Choreography is eye-catching and beautiful. The songs are perfectly placed through out the film.The Performance: Shahrukh Khan has given one of his best performance so far (and that too with a bad back). He's the undisputed King Khan. If there is anyone who stands out more than SRK its Amrita Rao and Sushmita Sen. These girls are just incredible, Amrita Rao will take your breath away. She's by far the best newcomer in recent years and sure to be a Superstar. Sushmita Sen has never been so good, her performance as well as her look is quite extraordinary and fresh. Zayed Khan has played his character to the T, he will be well like by all.Boman Irani and Bindu are excellent in their performances. Bindu's performance is up to par with her performance in Hum Aapke Hain Kaun. Boman Irani shows how talented he really is, in an unforgettable role. Satish Shah will shower you with great comedic moments. He's excellent. Kiron Kher does full justice to her performance. Suniel Shetty as you have never seen before and Naseeruddin Shah in a memorable role.Overall, MHN is an extremely well made film with excellent performance. I have bought the 2 Disc special edition of the film and its loaded with bonus feature. A must have for all film lovers. Up and coming directors can learn a thing or two from Miss Farah Khan.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" An exceptional and very pleasant treat!","review":"Wow! What can I say? I've never really paid much attention to Bollywood before, but my increasing dissatisfaction with the kind of garbage that Hollywood churns out caused me to sit and watch this on TV last night. Normally (especially at 1.30 in the morning) I'd have just given it a miss. I'm glad I didn't.MHN is a rare treat for me. I see so many films and most of them entertain a little, or in places are great but in others crap. So MHN, which entertained me thoroughly throughout its 2.5 hours or so, is a priceless gem.The combination of dance/song with what is essentially a simple action-comedy film left me stunned. I know this is how many Bollywood films are formulated, but seeing the reality of it just left me stunned (and in a good way, for once!) I don't think there was a minute of this movie that I wasn't smiling through.If you've never seen a Bollywood movie then I recommend this one. I can't comment on the rest of Bollywood offerings, but if they are half as good as this then they'll be fun.The action/comedy/love story/family drama/musical aspect of this film would not, at first thought, seem to work. There must be too much going on for any of it to work properly, right? Wrong! The film carries off it's multi-genre and multi-threaded plot with ease. You never fail to know what's going on and to who, or where you are in the story.Add in a few special effects (subtly, and intentionally, humorous in places) and the movie has something for everyone. The subtitling is extremely well-done and clearly by people who have a firm grasp of both Hindi and English (something that is seriously lacking in many Eastern films). In addition, the odd phrase or word spoken IN English just add to the subtitles in ways I can't even begin to describe. You just have to see it (and hear it) for yourselves.There's a lot of rib-poking at western movies (in particular, The Matrix) but it is all well-done and has you in hysterics. The \"spittle-time\" (yes, it is as ridiculous as it sounds!) scene just has to be seen to be believed! All in all a great film that is well worth the time to watch. Go ahead, broaden your film appreciation horizons. I dare you!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" View From A Casual Audience","review":"I am not into Bollywood movies that much, but I really enjoyed watching Main Hoon Na ( I asked my friend, and she said it means \"I'll be there for you\"). As you would expect from Bollywood movies, there is a mishmash of genres in this movie: romance, drama, comedy, action, political thriller, and the odd musical number now and then. Imagine True Lies meets Grease meets Toy Soldiers meets Never Been Kissed meets Matrix. I know it has been parodied so many times, but that slow-mo back ward flip when Shar Rukh Khan tried to evade the Spitty teacher's bullets ala Matrix really cracks me up! I also liked the characterisation of the female characters in this movie. They really stand their ground against the male leads.They are not clingy and naive as I find some Bollywood movies portrays women... And no wonder... it was directed by a woman. I also enjoyed the soundtrack. Like the movie, it aims to sound contemporary while paying tribute to the traditional styles. With tongue firmly in cheek","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Entertainment At Its BEST!!!","review":"After the not-so-impressing promos and posters, one doesn't expect much when walking into the theatre to see Main Hoon Na. But Farah Khan makes a sensational debut in direction with the movie. Main Hoon Na is a 3-hour rollercoaster ride. It has everything in the right place. It has Action, Comedy, Romance and all the other ingrediants in perfect proportions.The story is Indian. But the packaging is western. The movie is not recommend for those who think while watching movies. It has a touch of those movies of the 70s where content took a backseat and entertainment was all that mattered. The presentation of the movie is one of its key asseets.Another asset is the music. Anu Malik's score is easy on the ears. What compliments the songs is their picturisation and placement. The title track and 'Chale Jaise Hawayein' are the picks of the lot. The tributes to R.D. Burman are clear and effective. Production is grand. Sabu Cyril does a fantastic job with the sets. Allan Amin's action is top notch. Specially the scenes in the beginning and the climax have been executed with panache. Though some of the effects are a little hackeneyed, they are better than most Hindi movies. Abbas Tyrewala's dialogues are sure to earn him another nomination next year. With this he proves that Munnabhai was not a lucky chance.Now to the performances! Shah Rukh gives yet another fine performance. Like wine, he gets finer with age. Also, this movie should shut those mouths which said that he could not do action sequences. His stunts in this film will surely multiply the number of his fans. Another great performance is that of Sushmita Sen's. In fact, people here are calling her 'Discovery of the Year!' Never has an actress looked so ravishing in a sari. Zayed Khan also gives a decent performance. Amrita Rao is another rising sun. Her performance is sure to be noticed. In the smaller roles, Kirron Kher, Kabir Bedi and Nasseruddin Shah impress.In one word, Main Hoon Na can be called a 'must-see'. 10/10","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Great Farah Khan Debut!","review":"Farah Khan, who brought us the best dances moves ever, has taken up making pictures! Great move on her part I must say! As a dancer I always looked up to her for amazing steps (Dil Se, Kuch Kuch Hota Hai, Kaho Naa Pyaar Hai, recently Bombay Dreams, to name a few!) and when I heard she was producing a film, I was a bit \"iffy\"...Main Hoon Na, is \"Grease\" meets \"Kuch Kuch Hota Hai\" meets \"James Bond\" (I think I read that somewhere online, and thought, that is so true)!The music is amazing! The title song, \"Main Hoon Naa\" is superbly sweet and really reflects the \"I'm here now\" that the film conveys... \"Chale Jaise Hawain\" is a true campus song, and reminds me greatly of \"It's Time to Disco\" from \"Kal Ho Naa Ho\" (another Shah Rukh Khan-er)... \"Gori Gori Gori\" is very 1920s meets present day, with flapper-esq dance moves and scat-sound, reminds you of those zoot suit-ers... \"Tumhe Jo Maine Dekha\" is suppose to be the major love song in the film for Shah Rukh and Sushmita, it's very catchy and if you don't like it the first time, don't be surprised if it sticks in your head and eventually grows on you... \"Tumse Milke Dil Ka Jo Haal\" is the other love song of the film and features all four characters, it's the song that most of the promos for Main Hoon Na feature, it's another cute catchy one that'll have you humming without knowing it... and lastly, there is \"Yeh Fizaein\" which is the last song of the film, and is during the credits (which are done very unique!!!), the song is catchy and the video is totally \"Grease\" meets \"Kuch Kuch Hota Hai\".Amrita Rao is excellent in the film. If there were any doubts about her before, this should seal the deal, that she is a up and coming Preity Zinta.Zayed Khan (Suzanne Khan-Roshans's brother and Hrithik Roshan's brother-in-law) proves only further that he can surely act, although I think his dancing needs a bit of work. But he's definitely by far better off than his cousin Fardeen (who paired with the other Amrita (Arora) in \"Kitne Door Kitne Paas\"). Zayed is keeping the lineage alive! Check out \"Chura Liya Hai Tumne\".Sushmita Sen was incredible, I was very surprised because usually she has a awful habit of letting Aish cast a shadow over her and chooses very poor and corny roles. The last time I can honestly say I've seen Sush this good was in \"Fiza\" for her guest role, and before that \"Biwi no.1\". Way to go Sush!Shah Rukh Khan is as amazing as always. Totally a slap in the face for Filmfare for giving his Best Actor to Hrithik for \"Koi Mil Gaya\" rather than his \"Kal Ho Naa Ho\". In this film, he just keeps on proving further that he's a extremely versatile, trendy and class one actor!Great movie! I bought the double disc DVD! Fantastic Job Farah Khan!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" This is one kickin' flick!","review":"Great flick that was a blast from start to finish!  When the \"Red Chillies Entertainment\" logo came up at the start, I had no idea this film was going to be such a celluloid party! Farah Khan delivers one mega punch after another.  The song \"Chale Jaise Hawaien\" is priceless -- reminiscent of K2H2 -- but her choice to shoot the song in two long-take sequence shots was phenomenal --> exhibiting some of the best human and camera choreography since Welles's classic opening to Touch of Evil.  All the songs shine in the film, but the qawaali \"Tumse Milke Dilka Jo Haal\" -- coming right after the interval -- is an absolute showstopper; the choreography, set design, and costuming come as close to Hindi cinema perfection as any mere mortal can get!  Shah Rukh kicks as an action hero, and ALL the actors play their characters with conviction and just the right amount of tongue-in-cheek! And the comic punch of this film is brilliant --> when Satish Shah first appears on the screen (no spoiler here), I laughed so hard I had tears streaming down my face (appropriate, I guess....).  There are also some absolutely amazing digital effects shots, particularly during some of the Shah Rukh-Sunil Shetty fight scenes (I don't think anyone has ever had so much fun lampooning The Matrix [thanks, Farah!]).  Finally, Anu Malik delivers what I think must be his absolutely finest pop-Indian soundtrack. The songs are totally addictive and immensely hummable.  I am looking forward to snatching up the DVD when it's released so I can hear the songs in a proper surround-sound mix.Overall, this is an incredibly entertaining mix of all that is wonderful in contemporary Hindi films -- great story (inspired by the Ramayana), terrific choreography and acting, rib-splitting comedy, just the right amount of pathos, stunning cinematography, catchy songs, and dynamite directing. Both thumbs up!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" If this is typical Bollywood I am a devoted fan starting right now","review":"New to the Bollywood genre, I was curious so got this DVD to see what it was all about. In the next several hours I had wept repeatedly, laughed hysterically, wanted to join in dancing, and caught myself with my mouth hanging open more than once in stunned appreciation of the shift between moods on screen. And I was amazed the entire time at what a good time I was having, and spent the rest of the evening humming the songs from it.This film is really evidence of a completely different mindset and world, and one that I find that I like so much! There was no swearing, no blatant sex, no sneering or nastiness, which I am so tired of; all was color, music, beautiful saris, people of all ages participating, silly support characters, appealing leads, lots of action, and all set against a poignant story line about a peace initiative between the traditional enemies,India and Pakistan. I am SO impressed, and want to see many more of these Indian films from now on. I recommend it!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Hot stuff! Lucky in love.","review":"Major Ram promises his father to find his long lost brother, Lakshman. He's asked to go undercover as a high school student (they call him Uncle, he's so much older than then) to protect the General's daughter from evil bad wig wearing terrorists. Ram discovers that Lakshman also attends this school, as this is what convinces him to go. From then on, I can't tell you any more; that would give away the joy and excitement that this film surprises you with. You will fall in love with Shah Rukh Khan once you see this movie! Has all the elements that make a great Bollywood film. Great songs and dance sequences that made you want to boogie in your seat. Laugh out loud funny without sacrificing the good solid story about family and love. A must see.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Love it.","review":"SRK really delivers in this one and the songs are really catchy. Just a great fun film to watch that will remain timeless forever. The acting is typically Bollywood but any audience will enjoy this one.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" face-paced action movie that is chock-full of love, lust and a military man turned college student.","review":"One of the major themes of this movie was combat and warfare;therefore many scenes involving violence and fighting were portrayed using various angles. One shot in particular that stood out to me was when Ram dived off of the roof onto the helicopter. There were flames and explosions erupting behind him as he ran and jumped off. While in mid air, Ram was frozen and the view we saw was from beneath him, looking up. In that moment, the viewer is not sure if Ram is going to make it safely to the helicopter. The director took this extreme instance as a chance to use camera angles to intensify and already spell-bounding moment. It leaves viewers on the edge of their seat and really exemplifies the overall power of this movie. This movie will leave a better taste in your mouth than a Thanksgiving dinner can. The combination of action shots and intense love scenes is spell-bounding. The actors will take you on a ride as they give you some insight into their own worlds. It is normal to make assumptions at the start of a film as to what the ending might entail. I can assure you that all of my expectations were completely wrong and i was left with my jaw on the floor at the conclusion of the film. I walked away with a sense of comfort and hope that things that are meant to be, will eventually work themselves out in the end. I was left wanting more, and I think that is the best compliment a director can get.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" Feel-good film!","review":"As Farah Khan well-stated in one of her interviews, these days all the films are splitting into specific genres, whereas Main Hoon Na revives the old Bollywood masala formula of some action, romance, comedy, drama, suspense, and big stars.  There isn't any breakthrough story or anything extraordinarily special about this movie to make it \"hatke.\"  This is just out-and-out a feel-good film.  I haven't seen a movie like this in a long time, and Farah has done an excellent job of making the movie feel very fresh, whether it is through the creative cinematography, an interesting starcast, melodic tunes, or a good script.  Songs are great.  Shahrukh, of course, is awesome.  After a long time I'm seeing Sushmita.  She also adds to the freshness.  When I first found out that Zayed Khan was in this movie, I was like, That guy is weird.  Surprisingly enough, he was perfect for the role.  Lucky Farah--she's got a superhit!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Gotta See this movie","review":"Excellent film by Farah Khan. Shahrukh, Sushmitha, Amritha and Zayed acts so well in this film. But there are lots of camera tricks when action begins. I have seen this movie for 3 times and could recommend it to anyone as it is quite nice. All the songs especially Chale jaise and Kiska Hai yeh are great. The dances are also great. The story which is selected was quite admirable. You can get lots of advice from this film. Romance, Brother love is shown and friendship in college is shown in this movie. Everyone acted so well and could watch this over and over, Sanjana, Chandni teacher, Major Ram and Lakshman makes a family together. Can award 9 stars out of 10","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" I'm Here Now","review":"When I first previewed this film I was on a family trip.This was truly a great movie course the sound was a bit lousy and in the fight scenes, you couldn't see the kick ass moves.But recently I borrowed it from a cousin and I experienced what I once felt, this time bigger and better.A first I didn't know what to expect from the film cos I had given up Bollywood films for a bit, but every couple of years a great film comes along and this is one of them.The film is many Hollywood films thrown in, for example \"She's all that\" \"True Lies\" \"Matrix\" and many other inspirations.Shahrukh for me was Bollywood's best but this film truly makes him a versatile actor, he selects films that contain the highest bollywood standard of action, certain hings were overdone in the fight scenes for example towards the end when sunil shetty spins around and elbows shahrukh while he still is in the air but truly magnificent bollywood fight scenes.But for me the highlights are Sushmita Sen and Shahrukh, I knew what would happen during the second time watching but I laughed out loud seeing Shahrukh's expressions.Overall a great bollywood film.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Watch this movie when you're feeling' blue","review":"This is a true feel-good movie. It has all the right elements - action, tragedy, comedy, romance....I loved it. Farah Khan handled this movie with extraordinary creativity and precision, for a first-time film-maker. She exhibited a true love for Indian cinema, and as far as I'm concerned, has given all those 'established' directors out there a run for their money. I also liked her story, and the way she interpreted it was delightful. It never lagged, or dragged on too long as some Hindi movies do. It was perfectly paced and just a gem to watch. For me, this was one of Shah Rukh Khan's best performances. He really breathed life into the character of Ram, playing action hero and disciplined soldier (as well as lover-boy) with amazing aplomb. I know SRK has a lot of haters, but for me the boy can act! He really puts his guts into it, and he always entertains.(And he's hot too, but that's another story.) Amrita Rao also puts in a very believable performance. I also enjoyed Zayed Khan and Sushmita Sen, as well as the rest of the cast, but for me SRK and Amrita had the stand-out performances. I really think SRK should've won the Filmfare Award for this role, but I guess he has enough on his shelf to make up for it, anyway. The music in the movie is absolutely great (charmingly done), as is the choreography (guess it always is, with Farah Khan at the helm). Watch out for the closing credits! They are so much fun. Truly a great movie, one to watch again and again. I will give this movie 9 out of 10, only because I was annoyed by a triviality.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Fun does not get any funnier than this!","review":"Take a superstar who is typecast as the college boy romantic hero, take every genre of movies from comedy to drama to action, think of outrageous moments from many popular films, add over the top slapstick and shake really hard, OK you can stir a bit too! What you end up with is a comedy that never takes itself seriously and is a barrel of laughs. Farah Khan is known as an excellent choreographer - but this is also one savvy lady. She takes her romantic hero, decides he is too old to play college boy, but wouldn't it be fun to have him do it anyway. Thus is born the character of Major Ram Prasad Sharma (Shahrukh Khan). He is overly straight-laced, non-nonsense and socially untested having studied in military academy through out. But he has to go back to school undercover to protect the army chief's daughter Sanjana (Amrita Rao) from the terrorist Raghav (Sunil Shetty). As an added bonus his estranged step mother (Kirron Kher) lives in the same town and his half-brother Lucky (Zayed Khan) is in the same college. Major Ram is like a fish out of water in the college, he is the gawky misfit, and his only friends are the other misfits. But he does slowly win hearts and friends and even gets to be the paying guest in his step mom's house. However he is thrown for a toss when he encounters the stunning chemistry teacher Miss Chandni (Sushmita Sen) and turns into an idiot every time he sees her. In the meantime Raghavan is playing his own game and trying to stop the implementation of a prisoner exchange program between India and Pakistan. Major Ram has to step in but Raghavan has many an ace up his sleeve. In the end will good triumph over evil? The story is put together very well and the situations are hilariously contrived. Things kick off with Ram's arrival in the school and the the fun never stops. Many a moment is plucked out of some popular film or other and seamlessly blended into this palette of situations. Ram's first meeting with Chandni is something I can laugh over again and again. Shahrukh is not afraid to parody himself as the singing romantic hero - arms uncontrollably raised in air, his rendition of Ek Ladki Ko Dekha to Aisa Laga had me in stitches. He gets into the spirit of the comedy really well as the college student who is goody goody, but has no sense of fashion or style, and has no smooth moves on the ladies. Sushmita is hot! She looks exactly like you would expect a stunner to look - someone who can make men tongue-tied if she happens to walk by. Frankly her role does not demand any more and she does the job well! Amrita Rao is very good as the vulnerable Sanjana. Zayed is a pain in the behind, but I happily suffered through that as everything around him was great. Satish Shah as the spiting teacher was hilarious, Boman Irani as the forgetful principal was very funny, Bindu ji, Naseer Shah and Kirron Kher were great as expected. The surprise package was the bad-ass Raghavan played by Sunil Shetty - the heavy metal accompaniment every time one saw him helped a lot too! Hey, and I liked Rakhi Sawant as the chocolate eating Mini!Anu Malik made some excellent tunes for this movie - the title track is amazingly good, Tumse Milke Dil ka Hai Jo Haal reminds me of why Qawwali was so popular in the yesteryears, Chale Jaise Hawaiyen has wonderful choreography with the longest shots in cinema to date, Gori Gori is catchy and infectious, and Tumhe jo Maine Dekha keeps with the overall spoof feel as the lead pair walk right out of college into an exotic locale while the walls segue around them from one place to the other. The movies spoofed are too many to count - Sholay's Basanti rickshaw, KKHH dance moves, K3G bhajans and aartis and the whole rice on the doorstep thing, Matrix moves, every romantic song SRK has ever sung on screen, countless Jackie Chan films.. The list goes on and on.Some have made the mistake of thinking this is a serious action flick - you would rather be better off finding seriousness in Mel Brooks films! There is nothing serious here, just a lot of irreverent poking fun at everything and a barrel of laughs. It helps that a lot of times the lead man is poking fun at himself! Kudos to Farah for her smarts and her sense of style. Many will not get it but this is one intelligent film.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" The perfect 10!","review":"But what was up with Zayed Khan's hair? And who thought to cast Rakhi Sawant as a college sex symbol! She looked truly miscast in that role.But anyways, this was a wonderful film, I very well nearly laughed myself into a coma at the comic bits. I can't believe I postponed seeing this film for so long.Shah Rukh Khan (Ram) stars as an Army major who endures a personal tragedy at the beginning of the film, then is ordered to go undercover to protect the commissioner's daughter (played by Amrita Rao) from being assassinated by rebels. When he gets to her college, he poses as an over grown students and instantly becomes the butt of many a joke by his classmates, one of whom is his unknown step brother (played by Zayed Khan). Sushmita Sen makes her appearance more than an hour into the film, just like Kate Winslet did in Titanic. And thankfully so, because she only adds more element and grace to the film from here on. Suneil Shetty in a very bad hairdo(his actually makes Zayed's look like a very good fashion statement) plays an army soldier turned rebel who is on to Ram's scheme and right on his tail to try and assassinate him and his new friends. The beautiful Kiron Kher, plays Zayed's heartbroken mother, a very well, I might add.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Main Nahin Hona!","review":"For me 'Main Hoon Na' was a total waste of time. The plot is too nonsensical for my liking. Although Farah Khan's direction is inconsistent. She seems confused as to whether her film should be a family drama, a teen comedy, a political thriller or something else. Many have argued that 'Main Hoon Na' is merely a spoof of other Bollywood films. However I do not see that many references and if it is a spoof, it should have stayed that way from start to end as there is no substance. The songs are nice (except that horrible graduation song) but mostly forgettable. I liked the long-shot camera-work in the song 'Çhale Jaise' but otherwise the cinematography is quite flat. The fight scenes with are totally ridiculous. Perhaps it was intended for humour (but it didn't make me laugh). Shahrukh Khan fails to engage as he goes over the top in many sequences and seems to lose interest. Sushmita barely has a part to boast about but she, as usual, looks great playing a decoration piece. Sunil Shetty is laughable as the villain. Zayed Khan annoyingly overacts and comes across as whiny. He should be banned from films. Amrita Rao is extremely loud in many scenes and seems to not know how to act. Kiron Kher is strictly okay. It's hardly a memorable role. Naseeruddin Shah makes a pleasant cameo. If you've noticed, there's also Tabu in one scene (just for a second or two). I find 'Main Hoon Na' to be overrated. I wouldn't say this is one of the worst flicks as it is bearable to an extent and a decent one-time watch with the family (since mine enjoy this kind of films) but I do not see what all the fuss is about.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" A comedy of Errors.....what the heck, its not even a comedy!","review":"I honestly think that people from the Bollywood fraternity should think twice before venturing into the complicated and demanding field of movie direction.Main Hoon Naa is one of the most ridiculous movies ever to (dis)grace the screen. The film solely relies on the acting prowess of Shahrukh. The movie neither has a strong story line neither good action sequences. Farah Khan had tried to bake mush and brawl with sentiments and songs, but had ended up putting the owen on fire.The opening action scene sums up the clumsiness of the director. In a high profile interview of the General of the Indian army, in a building guarded like Alcatraz by the armed forces, the terrorists are able to enter as audience with guns sticking out of their butts. Great! So the profound security system didn't even bother to search the audience before letting them in! ( you get better security at railway stations ).Now once the fighting starts between Ram( shahrukh ), who like all Indian heroes goes alone, and Raghav( Suniel ),we get to hear that \"backup\" is on the way. However, Raghav after flooring Ram, walks away coolly from the building with his croonies! Hats off to our armed forces.Now the story starts to really rot, when the General tells Major Ram that to ensure the success of Project Milaap, he must go and protect his daughter, who was supposedly on Raghav's hitlist and because she is not on talking terms with him , the great General. What was the director thinking? Does she believe that international decisions for India are governed by the whims and fancies of the Indian General? doesn't government or the rest of the defence board have any say in it? killing the general's daughter will destroy the project, which means the general will be so heartbroken that he will pull it off? Ha.Then you have the usual bastard brother-legal brother love-hate drama to contend with, which in moments is humorous and enjoyable. However, the setting of the college is completely, and i mean completely, Bollywood style, with an idiotic principal, cartoon like teachers and a useless bunch of students who think study is a crime and manage to remain in the college after failing for years together. You see the faculty cheering when students engage in deadly stunts! Its a disgrace to the academic world, this movie! Hold on...the package also includes some completely moronic stunts, including one in which Ram manages to chase down a speeding SUV in a rickshaw! Really, the SUV manufacturers ought to have sued the producers. And by the way, what kind of trained terrorists can't shoot down a guy paddling a rickshaw like a circus monkey, especially when they are equipped with machine guns ans bazookas! The love stories are completely artificial and irritating as well. What kind of girl goes nuts over a guy who is a certified failure, has no money, dresses like a tramp, has no artistic skills and who considers her an ugly chick and doesn't mind speaking out his mind? beautiful girls have no taste left or what? And Ram, for all his army background, behaves like a loafer in front of Sushmita Sen.The ending is as pathetic as rest of the movie, and is so predictable that i don't want to tell it just so to see the satisfaction on your faces that you got it right. See it only if you idolize shaharukh khan.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" One of the Worst Movies on Indian Screen","review":"I don't know, why I see many positive comments here, but the movie is in word \"awful\".When I went through the reviews on Indian movie sites, they said just see and enjoy don't apply logic. What !!!.. When other stars make such kind of movie which defies logic, people just trash the movie I mean Govinda.. Midhunda..etc. But when this SRK does that.. its pure entertainment.And what is the issue with India-Pakistan peace process in this.. Its foolish on part of Farah( \"Fat\" ah) Khan to touch such sensitive issues in her illogical film. She doesn't have capability to to handle such subjects. She should have just made the movie without that..And for the movie she just created a new breed of Terrorists who hate Pakistan. which I never heard of anywhere.. when we have huge problem of Pakistan supported terrorists who hate .. India as a whole.. I don't know.. what she wants to prove.Anyway I hated the movie a lot, and will never suggest to any one to see the movie.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" This movie really sucks","review":"Okay, so if you want to see a really bad movie, and have some good laughs over the ridiculousness of the plot, this is a must see... beginning from silly clichés to bad acting to horrible fight sequences / special effects, this movie has it all! Possibly the worst movie i've ever seen... the climax is particularly hilarious... shah ruck removes the trigger from the grenade, walks around for a cpl of minutes, delivers his punchline before jumping off the roof into the hands of his half-brother waiting in a helicopter... if you can think of anything that could have been worse in this movie, please do let me know... some people might like the sound track, but it was too formulaic for my taste... dialogs were super-cheeky, and the movie on the whole was way too predictable. Picking an adviser from the army would really have helped the movie... i grew in an army background as my dad and my grandfather were both in the army, and the inaccuracies about army lifestyle and 'dressing' were just inexcusable... including officers wearing hats at the burning of a pyre! yeah... really bad movie.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" absolutely the best movie I have seen in 25 years","review":"I bought this movie at an Indian supermarket in Barcelon for 3 auras, some months ago.I had seen before \"Kal Hoo Na Ho\" in the Oriental Film Festival one year ago, and I was so impressed and disturbed that such a MASTERPIECE of the modern cinema(I couldn't believe this movies haven't a commercial career in Europe) wasn't shown before on screen, that I bought a new one directed by the girl who made the choreography in the first one (Main Hoon Na). I have no words to comment about \"Main Hoon Na\", for the first time in years I have the sensation of something so wild, absolutely a masterpiece of musical movies comparable to the classical movies in USA in the sixties. I was so excited as when I saw \"West side story\" in my life for the first time. Bollywood are the future of musicals. All the actors are super, the movie is a prodigious of filming and foot age, the plot is crazy but involving, choreography is incredible, the sound is dazzling...well...everything is crazy in this movie. I don't remember to have such a feelings since I saw \"Millie\" on DVD. Well lucky I didn't have words!","imdb_rating":10,"our_rating":0,"algo_label":0}]