[{"heading":" Had the potential....","review":"DVPV is a story of 3-couples, sorry 3 1/2 with immortal melodies of R D Burman interlaced between them: Couple #1: Typical Mills & Boon love-story between Jimmy Shergill and Hrishitaa Bhatt Couple #2: Condensed form of Abhimaan and Akele Hum Akele Tum with Madhavan and Namrata Shirodkar Couple #3: Windower coming to terms with life with Sanjay Suri and Sonali Kulkarni Couple 3 1/2: Love out of pity story with Rakesh Bapat, Bhavana Pani & Riya Sen Obvious overdose of characters with inadequate screen time to justify their existence in the storyline. And add to that, the songs are like unwanted pop-ups surfacing every 5 mins interval (14 songs!!! Are we competing with HAHK?). Admist this the story takes a back-seat and the script gets loaded with loose ends.Songs - Kavita K was a good choice while Hariharan isn't.Obvious references are drawn to Jhankaar Beats which was a tribute to R D Burman as well. But Dil Vil Pyar Vyar appears dwarf in comparison.Anant Mahadevan should restrict himself to acting (and voice-over for Maddy) - direction apparently isn't his cup of \"chai\".","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Not the greatest of films but watchable...","review":"Unlike a lot of films right now I found this film watchable, it brings in great old songs of Bollywood and places them in new settings with new characters and it works.The plot is weak its about three couples or something...Each have there own problems and work through it and eventually get back together but the truth is the songs thats the only reason as to why a lot of people watched this film, the songs are brought to a modern settings, 'WOH Haseena!' is brilliantly done and 'Mere Samneh Vali Kirki Mein' is another favourite of mine...Overall the songs are the only thing that will keep you watching.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" A good tribute to old songs but overall flat","review":"Anant Mahadevan turned director with this film, the film has 4 stories which was not tried those days and also tried to reuse old songs with different singers, a good experiment sadly the film comes across as slipshod. The stories seem done to death, Lets analyse in parts Madhavan-Namrata - similar to ABHIMAAN but yet does have it's moments, Madhavan is good, Namrata too does a good jobJimmy-Hrishita- a decent story though had better potential, some scenes are well handled and humorous. Jimmy Shergill is a delight, Hrishita is okaySanjay Suri- Shonali-Rakesh Bhapat- Bhavna stories are not as convincing Sanjay Suri is okay, Shonali is good, Rakesh Bhapat disappoints, Bhavna doesn't get scopeDirection is okay Music is decent but the original compositions still remain a benchmark yet it's a pleasure to hear the old songs again but they lack the zing the original have.Amongst rest, Gulshan Grover is likable, Kiran Kumar is good, rest are okay","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Love, with a serious theme.","review":"Nice movie. 3 love stories inter-woven together. The movie also approaches serious themes like ego wounds and deep love wounds. The pace and editing is well done and the different stories bled well together.SPOILERthe loves stories represent a varied range. The first one is a love story involving different castes, social status. It is treated differently than usual. The second one is between an already married couple who love for each other is put to test by events. The other 2 stories are on 1 theme. Falling again in love when the previous woman they loved has died. It shows how different people deal with their loss and how they manage to get over their grief and fall in love again.SPOILERIMHO, the best love story is what happens between the married couple. A young musician couple, and singing team, loves each other dearly. The tension arises when the wife becomes a star overnight. The husband is very happy at first, but progressively becomes jealous of the success of his wife. He is wounded in his ego, since he can no longer be a traditional husband. As a wife, she earns immensely more than him and as an artist she is a star while he is still unknown. This theme is extremely well treated. There is a huge conflict between his ego and his love.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Worth watching","review":"This is a decent movie about 3 friends and how they meet, etc. It is pretty similar to Mohabbatein and Dil Chahta Hai. The acting wasnt too great but most of them are new people so it was acceptable. The music isnt the best but the movie makes up for it. Recommended. 7/10","imdb_rating":8,"our_rating":0,"algo_label":0}]