[{"heading":" Emotional Movie","review":"What a movie, Its been a long time since i enjoyed a movie, but this was excellent it brought tears to my eyes. Arjun Rampal given hes fullest skills to this movie, so cute and handsome or always feel sorry for him its like you can see into hes heart. Bobby Deol is alright he loves playing this roles as a Rich kid just like DOSTI. Amisha Patel needs a bit more training in her crying scenes was dull scene where she was about to get raped, but she is beautiful as ever always likes to play romantic movies where she gets involve then gets hurt. heart. Actually this movie reminded me of HUMRAAZ where Bobby and Amisha fall in love. ANYWAYZ GOTO GO, Love the movie 10 out of 10 for me.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" excellent .. film","review":"well .. i had no expectations when i got the DVD .. but after watching a few minutes .. i realized this films gonna be great and it does that ... if the publicity of the film was made properly it would have been biggest romantic flick of the year..Arjuna was wicked .. what can i say about him he is a brilliant actor .. he proves again !! Amish .. wow .. SE is a beauty .. Arjuna and Amish one day this couple will be No#1 no doubt .. what a eye - popping performance Amish ..Arjuna and Amish the best couple i have seen in years .. until bobby ruined the movie ... anyway he did good not bad..but akshay would have been better.the music is just wow .. an-and raj an-and is back again on his track .. he is not a loser like Ainu Mali .. no doubt an-and raj an-and tried his best in this film and he got like that well done man ..the story ... very good story .. damn the character placing was good too.. my tears we're falling .. after when Arjuna lefts Amish .. even i didn't cried during EKG and khnh ...a film like humko tumse pyar hai comes in generations .. its a must watch ! if you are a romantic film lover you will absolutely love it .. not you you're family will love it too ...buntysoorma this dude needs chance he is a brilliant director & writer.and yes no more yashraj and karan craps plz ..","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Great Movie","review":"this is one extremely awesome movie, and so romantic, and such a beautiful story!! definitely very emotional, a MUST WATCH.Arjun Rampaldoes a really good job, and he looks very handsome too!This is also a very nice role for Amisha and Bobby. Seriously this movie kept me on the edge of my seat, it is classic! can be watched again and again. the music is also very catchy and definitely perfect. this movie will just make your heart melt and cry at times! 10 out of 10! This movie will keep you guessing and is not predictable, but it does contain some cute and traditional bollywood elements, and i love it!","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Good story more than makes up for below-par technical effects","review":"They say that the story is the backbone of a film, and so it is in this case as well. Humko Tumse Pyaar Hai is the story of Amisha Patel, a blind girl who just attained the gift of sight but, along with it, also lost her reason to live. The film deals with Amisha's struggle to find a love for life, her tragedy, and a twist in the story. Characters have been developed well. There aren't any gimmicks, clichés, or unnecessary drama--just a simple film with a nice story. Arjun gave a great performance. Bobby was decent, and Amisha was OK. Songs weren't impressive. The technical effects such as editing and most especially the sets are quite pathetic. For example, a painting is used to show the entire sky and horizon instead of an actual overlook. Supposedly taking place in Rajasthan, the actors keep randomly switching between the local dialect and Hindi. Nonetheless, the satisfying story lets the audience overlook these flaws.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Worth watching and listening","review":"Humko Tumse Pyaar Hai is a nice movie. Even though you might hate some of the actors/actresses, the movie is very nice to be frank. I spent S$10 on the CD and it is worth watching it. I watched 2 times a day after buying it. About the musics, they are not bad... I really liked it so much! There was a meaning to it too. Nice twists (my sis got punk'd by it) because, she said Durga (Amisha) married to Raj (bobby). Can't spoil it... You watch it yourself.... LOL... So... yeah... it is worth watching and worth listening to the songs. In my point of view, the movie is the BOMB! Laugh out loud! If you disagree with me, well, that's fine with me.In my point of view, these are the songs which are nice: Bajne Lagee, Humko Teri Ishq, Yeh Mehndi Ke Boote and Humko Tumse Pyaar Hai. They are so nice!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" humko tumse pyaar hai","review":"This is far the most worst film I've seen this year from Bollywood so far. I may not lie, my wife liked this film very much. It was not Bobby Deol or Arjun Rampal what made this film become unbelievable, but it was Amisha Patel. She performs the role of a blind woman who get in trouble when she almost fall from a mountain where (luckily for her) the hero Arjun Rampal comes to rescue her (in the middle of nowhere). It amazes me here how a blind girl is aware of danger when she is about to fall from a mountain, because she cannot see her environment. From this scene I started to watch the movie very closely and in every scene there was a flaw in the acting of Amisha Patel. The way she plays a blind girl is very bad. The only way she does that is by not to look into the eyes of the person she talks with. When I saw this film, I respected Rani Mukherjee more with her performance in the movie Black. Amisha will never reach this level in performing as an actress.Anyway, she falls in love with Arjun Rampal. It is the cliché story. Sudden Arjun gets killed by a man who is madly in love with Amisha. Amisha is in despair, but then Bobby enters the movie. He also falls in love with the blind girl. Bobby Deol is a great actor in my point of view, but he cannot pull the film to a higher level where Amisha Patel buries it deep into the ground. I must say Bobby deserves better roles in better movies than he got so far. Bobby grew in acting from the first movie his lovely daddy gave him. He was so bad in acting in Barsaat, but when you see him acting now, you get the shivers and believe every word he says. Only a movie with high potential like a Yash Copra film has to meet his way.Okay, when Amisha also falls in love with Bobby, someones enters her life. Arjun Rampal is not dead! Who believes this crap? I don't. Why didn't they give his role to one of the ugly guys from the movie family (Shushant Singh or Aryeman Ramsay) and give Bobby a role in one of the blockbusters with Amitabh Bachchan? I'm sorry if my comment sounds like a cry for an actor like Bobby to give him a great role, but he deserves so much better than a movie with Amisha (bigscreen t.v. face) Patel. This movie was so awful, that I regret buying it.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" A Film about emotions, with very FANAA-ISH undertones!","review":"Amisha Patel wants you to know that she has been taking dance lessons, and she showcases that very well in this film. She plays Durga, a blind village girl whose brother one day looses control of the cart she is riding in and sends her careening off the side of a cliff only to be saved by Rohit (played by Arjun Rampal, her serial partner in crime -- see Vaada, Elaan etc. etc. somebody has figured out that they look good together). And for a second, I was thinking that Rohit was some kinda Brad Pitt A la Meet Joe Black type character but breathe easy because it's far from the case.Initially, Durga's mother resents Rohit's affections towards her daughter because she feels he just wants to take advantage of a blind girl but when she sees that the man truly loves her, she eases up. Everything goes well for a while, that is until Durga's serial stalker boyfriend wanna-be is released from jail and he comes a knocking. He terrorises Durga to no end and ultimately contributes to the death of her mother as well as the disappearance of Rohit. Durga on the other hand survives it all and is taken by Switzerland (believing that Rohit is dead) by a good Samaritan doctor who wants to help her rehabilitate. There in the Swiss alps, and in one of the most beautiful restaurants I have ever seen in any movie, she meets a stunningly handsome looking Raj (played by Bobby Deol and I give many a props to the stylist who has him looking like Arjun's clone in this film) who instantly falls in love with her. Much of the romance instigation is done by Achint Kaur who plays Raj's assistant and before long, Durga who has now undergone eye surgery and can now see, falls in love with Raj. When it comes time to marry, they both return to India, where surely enough, they run into a newly resurfaced Rohit which puts a damper on things. To complicate matters even further, Durga doesn't recognise him because she was blind during their romance. Fanaa anyone? Hehehe!","imdb_rating":7,"our_rating":0,"algo_label":0}]