[{"heading":" A movie that grows on you..","review":"Bhagam Bhag,released in 2006 is a bit ahead of its time and difficult to comprehend first time around.Although,the more number of times you watch this film,the more hilarious it gets.What doesn't work with the audience is the pace and the numerous plotpoints it introduces which can get confusing for some people and back in 2006 it was all about slapstick comedy whereas this movie doesn't belong to that category.Still it caters to that part of a crowd who enjoy no brainers.But if you watch closely all those plotpoints are justified and doesn't feel out of place.In fact it makes a lot of sense!Hence this is one of the very well made films by Priyadarshan which is supported by good writing and epic comic timing from the awesome threesome I.e Akshay Kumar,Paresh Rawal and Govinda.I feel if Bhagam Bhag was in the theatres now,it would've gained wider appreciation only because people have started to understand films much better.They look at all the aspects of what goes in to making a movie and in the case of Bhagam 9 out of 10 are spot on yet I'll rate this an 8 as I don't want to crush the expectations of the viewers.But I highly recommend it to Akshay fans and who like Priyadarshan's way of doing comedy.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Much underrated comedy. Critics bashed it then public beg for such movie now.","review":"My actual rating is 7/10 but after seeing other reviews and critics reviews I made it 8. Bhagam bhag is an entertainer of all time. One can't change the TV channel when it's Bhagam Bhag on the screen. Its a film which is connected in all aspects. It needs to be watched with attention and dialogues need to be heard carefully to understand this movie. Each and every scene in this movie is very well acted funny and entertaining. BGM is the powerhouse of this movie its one of the best BGMs of all time. Locations are very nice. Editing is done very well, there is no scene extra. There is no scene you can say why is this in film because everything is interconnected so well. Performances are like when it comes to Priyadarshan Comedies its obvious that you just can't sit without rib tickles by some actors. I will go by order of best performances I felt. Paresh Rawal is master of this film. Manoj Joshi is simply amazing. Then comes Akshay Kumar then Rajpal Yadav, Govinda, Shakti Kapoor, Lara Dutta, Jackie Shroff, Asrani, Sharat Saxena and others. The suspense part of the film is gripping. Comedy starts from starting of the film till the end. The police chase scene is the highlight scene and shows acting class of the actors in that sequence. Climax could have been better. Some scenes you can consider illogical but they are taken in a comic way. Dialogues I would say people haven't heard them well and they are really awesome, appreciable and making us laugh very much. The suspense and Comedy are mixed is a very nice way by the director. And if this is considered lame comedy by critics then Jim Carrey, Mr. Bean and Charlie Chaplin comedies are lame too. It is one of the best comedies ever made. Overall Bhagam Bhag is a joyride and is an all time entertainer by all means.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Run with less fun...Bhagam Bhag!","review":"Everybody was damn excited about this film. More than 22 crores of budget, perfect star cast, Priyadarshan and amazing promotions. But Bhagam Bhag doesn't go well compared to all the above mentioned jazz. Govinda is back after a very long time but there is nothing much to do for him! He is the biggest star when you call for an effortless dancing and perfectly framed comedy but look at him in this movie. There's no solo dance no. for him, no perfectly timed comedy and he is looking old and fat. We all know, for Priyadarshan movie, don't use your brain to find out some logic in that movie. You just enjoy the trail-rail of all the comic scenes lined-up just to make you laugh! But here, nothing so great and nothing to title 'perfect comedy'. Akshay Kumar has repeated his same old comic style that has been done and re-done in Hera Pheri, Awara Pagal Deewana, Garam Masala, etc.Still, the movie has lot to offer. The first half is fast and you'll hardly have time to understand what's going on! Govinda still has that charm and Akshay, Raghuvir Yadav, Shakti Kapoor have done justice to there roles. Not to forget, king of all comedies, Paresh Rawal! Doing all villainous roles in his earlier days and now, full-fledged comedian and character artist Paresh has also got his own space to lead some hilarious scenes. To be honest, he could've performed better. Lara Dutta is looking pretty and has some moments.The confusion scenes between our heroes and the funny underworld guys are too hilarious and one of the highlights of the movie. The combo of Govinda and Akshay goes well all together and in spite of lesser footage value to Govinda, they both look funny and equal all together.The music is totally in. The title song, 'Signal' and 'Tere Bin' are major hits already and ruling all the music/ video charts. Though there was some controversy with the music and story of the film. Bhagam Bhag is a re-make of a famous Tamil movie and the producer Sunil Shetty, famous Indian actor, faced a law-suit on not taking the permission before re-making. Sunil ended-up paying 75 lacs to the producers of that original movie. The music director, Pritam, has been charged of copying an English song and using that melody and tune in 'Bhagam Bhag'-the title song. In fact, all of Pritam's so-called original compositions in movies like Dhoom, Gangster, Garam Masala, Apna sapna money-money, Chocolate, Who lamhe, Pyar ke side effects, Fight-club, etc., have been lifted from other international music groups! All said and done, the movie is a good time-pass and watch-able for once. So please, do not hesitate and watch 'Bhagam Bhag' without finding any logic in it!","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Brilliant!!! Brainless Comedy Yet Quiet Enjoyable","review":"When there is Akshay Kumar with priyadarshan !!! THAT MUST BE A FUN-FILLED comedy.Well this is One!!! Priyandarshan Came back with a bang with Bhagam Bhag The Long Awaited movie was certainly worth it Priyadarshan is the only director which is the funniest...It's a Very nice movie with lots of Twist and Turns Govinda Looks Stupid as Always He Shouts a Lot than he does acting but he executes his jokes brilliantly!!! but No way is he Better than Akshay. 6/10 Akshay Always Original, straight forward actor The Acting of Akshay was simply Exquisite he should win awards for his comic actings.. 10/10 Lara Dutta, 3 Roles in one film but She is always acceptable, she is easy on the eyes and ears,,,, well not on ears due to her Heaving Voice.. but she Faired Nicely 7/10 Paresh Rawal is only HAHAHAHAHHA with his Attitude and Acting, He is Certainly the Most Funniest Actor around in Bollywood. 9/10 The Movie is Great but Brainless, if you try to understand the Plot of the movie just think thats its a Movie without a PLOT LINE that will be more fun to amaging Go Ahead a Must Watch for Comic-Liking Audience its a Clean Movie watch it with your family!!! The Movie Rating 7/10 but my rating is 10/10 Syed Shabbir Aly Naqvi from Pakistan","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Quite Enjoyble","review":"First Of All, if you are going to watch this movie because you think it has a plot! And a good thrilling story, then this is not the movie you should watch. But then if you just want to have a good laugh at how miserable can one's life get,(especially in a foreign country) then go in. You'll find this movie enjoyble.Paresh Rawal owns a dance and music performance troupe and is very much in trouble to find a new Heroine for his next show, comes in Akshay Kumar & Govinda. Performances were O.K. But Govinda should now think of retiring from his acting career.(He Was looking aged on screen). Akshay Kumar did well in portraying his role, but the real class was Paresh Rawal. Music by Pritam Was good, but could've been better!The Suspense Plot was only there to Hold the story together, so you need not think about it too much. Just ease in, take your seats, and enjoy this movie with real intentions to enjoy a mindless comedy!! And you won't get Disheartend!","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" It's a Good movie","review":"Go and Watch it. It's not as bad as it's been portrayed by our friends.When we learn Bhagam Bhag is been directed by Priyadarshan then expectations are too high, but we should understand not every Comedy Flick can make it as big as Hera Pheri.so guys don't expect and watch Bagham Bagh, since it's a OK or i should say Good Movie ( because of some moments in movie ).As every one were expecting this movie to be a rip roaring comedy, since * Akshay, Govinda, Paresh and Directed by Priyadarshan ( Who provided us great comedy hits like Hera Pheri, Hungama ), I was little disappointed when i watched Bhagam Bagh, since Story was not convincing, as he had compromised comedy to murder mystery ( Comedy gets faded at every stage), There are few funny moments to tickle your rib's. Akshay as expected was good with his comedy timing, Govinda was looking too OLD or should i say Horrible, Paresh Rawal didn't had much to act. Lara Dutta has substantial role, she tried to enact well. Jackie role was wasted.Songs are good, Some of the scenes where picked from south Indian movie.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Laugh till you die!","review":"Its VERY difficult to make a murder mystery with a comical theme, and priyadarshan created it successfully - perhaps his best film to date. The story revolves around 3 main characters - Govinda and Aakshay who play main leads in Paresh Rawal's theatre group. the group of around 30 strike lucky when they're called to London to perform, but due to Aakshay and Govinda's flirtatious nature they lose the heroine! What follows is the mad search for a heroine, bhagam bhag from police, bhagam bhag from gangsters and bhagam bhag from underworld dons! Govinda's comeback is sweet - only he could portray the character with such excellence, and the reason behind the movie's comic nature is due to mostly him and Paresh Rawal. Rawal, as usual, is gold. His timing is perfect, and sometimes you're on the floor in laughter (for example the bomb joke). Aakshay followed suit with a loverboy/leader attitude, his emotions sometimes made you feel sorry for him, but also laugh as the movie progresses....all in all, a laugh riot, and a thrilling ride keeping you on the edge!","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" By the forgetful for the forgetful","review":"After three hours in the Cinema hall,the strongest impression garnered was that their is something amiss. What was clear was that the Directors forgot to direct, the actors to act and most importantly the script writer to write. Evervbody shouted without reason and made one cringe. The script moved on and on with lots of avoidable twists and turns ending in now, too familiar Priyadarshan theory of Converging actors at a single point. This theory worked well in Hera-Pheri and Hungama but somehow managed to irritate this time, so did the habit of every actor's incapacity to answer asked of them directly. Simplest questions such as \" what is your name would be repeated N times\".Finally what was amiss was that the director forgot that his audience have something called intelligence.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Thrilling comedy","review":"Govinda may be second hero of this movie but his presence is great. His comic timing is great as usual. Akshay did good also paresh rawal and rajpal yadav done well.\nIt's of course a movie ahead of its time. In youtube it's released by shemaroo in july 2018 which gained over 12 millions views in 3 months.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Run amok in London","review":"Its Priyan movie dude and nothing short of a full time-pass entertainer.Akshay Kumar:: Wherever humanly possible Akki delivers more than 100%. In layman terms, he overacts. If you ignore, with the assumption of signature style, then he is full-two.Govinda:: Makes his presence felt and surprisingly get adequate screen time too, considering the fact he is pitted against Priyan favourites namely \"editing notorious\" Akki and \"cat-o-nine lives\" Paresh Rawal. And Sunil Shetty would have been a bad choice definitely.Bunty and Babla? Any references to Bunti & Babli? Sorry just thinking aloud! Lara Dutta:: Doesn't leave any impact, hence its safe to say that she was miscast. And her suicidal tendencies part was not fleshed out adequately. In fact Tanushree Dutta in the cameo was far more convincing.Paresh Rawal:: If you don't expect a reprise of Hera Pheri, he is spot on in its own right. Any deficiencies... blame the writing department.Jackie Shroff:: Its good to see a Priyan's old timer this time around and being London MetPolice Chief is nothing short of creative liberties.Other regulars just chip in with special mention to Rajpal Yadav (spot on!), Sharat Saxena, Manoj Joshi (howls again!) and Asrani.Sorry I forgot about you Arbaaz. Bhagam Bhaag is a remake of Malayalam movie which was sequel to Hera Pheri. As usual Priyan and his team customised the recipe to suit the palette. Needless to say, moving the story-base to London, capturing the English summer and yet not losing sight of the plot has translated into a decent show. And for those who are crying foul, never forget that everything Hitler did in Germany was legal... then.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Really Great a Complete Package","review":"This Movie has everything thing Comedy, Drama, Thrill, etc you should must watch it out.\nGreat movie as of 2006.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Unfortunate under-rate.","review":"U mutch under rated movie. With a brilliant comedy timing.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Another gem from Priyadarshan.","review":"One of the best comedy movies in India. Great story line, great acting especially from Paresh Rawal, great music too. The story grows flawlessly throughout the movie. Comedy scenes are still laughable in 2019. The movie should have been in top charts, it's a shame that it isn't.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" But...I expected more...!","review":"I saw this with high expectations. Come on, it is Akshay Kumar, Govinda, and Paresh Rawal, who are all amazing at their comedy, I was really hoping for a laugh riot. Sadly, that is not what I got at all...Unfortunately, nothing in this movie really made me laugh out loud. There were times when I chuckled at one or two things, but nothing really made me laugh. In short, it was badly attempted comedy, and in a way, a bit of a Hera Pheri wannabe.Out of the three main guys, I think Paresh Rawal's role was the most powerful. It wasn't the biggest role, but it certainly stood out more than Govinda or Akshay. Their performances were okay I guess. Nothing special, just mediocre. Though Govinda stole the limelight from Akshay in more than a few scenes. Lara Dutta and Tanushree Dutta also make appearances in this film, and both of them were pretty bad. Lara's role did not move me, or make me laugh, and Tanushree Dutta's character just got on my nerves! The music seems to be the only good thing about Bhagam Bhag. My favourite song is \"Tere Bin\", followed by \"Afreen\", which I really liked. \"Signal\" and the title song \"Bhagam Bhag\" are also worth a listen.You either will like it or you won't. And judging by the poor comedy and lack of direction, I don't think you will.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Nice Sparks but no BLAST!!!","review":"Think of it. Comedy King GOVINDA, Comedy Champ Paresh Rawal & Comedy Star Akshay Kumar. Then Priyadarshan is the Director. What else can you look for, what better combination can you make! Of course expectations have to be high, higher, highest.Bhagam Bhag is a nice movie with lots of its own moments of laughter, some very funny dialogues, nice scenes and beautiful song & music. But is that just enough when we have the Champions around. Don't we expect more, a BLAST may be? Its story of Champak Chaturved (Paresh Rawal) who has a theatre group in India and he performs shows all over the country. Bunty (Akshay Kumar) and Babla (Govinda) are actors in the group who are very naughty natured guys who never miss any chance to flirt with girls, even the girls in the group. They Go to London for a series of show but there heroine runs away. They discover a girl Munni (Lara Dutta), who suffers from amnesia to act in their drama and just as Bunty and Munni fall in love, her memory returns and it brings chaos into their lives, including a murdered husband! A series of funny event start which lead to an unexpected climax. Initially it seems Arbaaz & then the Commissioner (Jackie Shroff) who is behind all the mystery which further leads to strange ending.So its an OK movie with OK storyline & concept. Of course all of these are not major elements of a Priyadarshan movie. The major element is laughter, which doesn't seem as strong and powerful here. Akshay, Paresh & of course Govinda rock & roll. It's a nice come back for Govinda but again it could have been better. Same with the whole movie.Priyam Sir, we expected more, a lot may be...","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Could it BE more tasteless?","review":"Rs.30/- is all I paid as rent for the DVD of the movie and believe me it is not worth it.Bollywood directors think that showing fools is funny? well it is not. Please grow up.Here goes a dialog from the movie -'AGAR TUM LADKEE KO IJJAT DOGE TO LADKEE TUMHE APNI IJJAT DEGI'.Plot is useless, criminals and police alike running after fools. That is it. BHAGAM BHAG.Well it lived the title, I had to run away from it. :) I switched over to Star Movies and watched Home Alone 2 instead, and had a good laugh.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Trying too much. Achieveing little.","review":"Move on Priyadarshan. No doubt you gave us one of the best comedies ever made in Hera Pheri, but its enough now. Accept the fact that you cannot create another Hera Pheri. Its time to try something new.The biggest issue with Bhagam Bhag is everyone is trying too much, just too much, while comedy should as effortless as possible. The storyline is haphazard. In race of making a comic thriller, the end product was neither a complete comedy and remained far from being a thriller. Pitching comic line in most tense of situation dilute the grip of thriller and could not manage to grab the comic timing totally either.Another problem lies in the fact that Akshay Kumar is over utilised while Govinda is almost wasted. Its high time for Akshay to change his comic style. Of course he possesses probably the best comic timing in the current generation of lead actors, but excess of every thing is bad. He should give it a break, may return to action flicks for a while. Govinda proves he still has it in him, in the limited screen presence and unimaginative script.Its a typical Priyadarshan type film. Some good laughs in the start, some twist in the tale and chaos in the end. Not that its bad, just nothing new. But still some really funny sequences in the start makes the first half entertaining.But again, its time Mr. Priyadarshan. Move on. We hear that David Dhavan is giving finishing touches to some of his ventures. Move on before David recaptures his throne of Comedy King.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Not a Comedy of Errors............but an Error of Comedy.","review":"The very reason I had for seeing this movie is now questionable, I've said it many times before but Neeraj Vora is the bane of Indian Comedy and if I had known that he has written this movie I would have never seen it.Anyway I'm sure his expiry date is near and sooner or later the Indian audiences will reject his brand of inspired humour, and hopefully unlike Indian Cricket, Priyadarshan to will be rested till he comes back with something original. Both of them have contributed nothing new to movies in the last 5 years and have instead relied on the narrow exposure of the Indian Audience to rehash every successful movie from anywhere in the world.In this case the movie in question are ITS A MAD MAD MAD WORLD (1963) and would you believe it AJNABEE (which I'm told was inspired to) Haha much like his earlier movies that are a blend of English movies and a Hindi one (mainly Govinda's).Still I had my doubts and had the good sense to see it in a single screen theater at cheaper rates.This movie starts of promisingly enough with the original story and the identifiable concept of the Indian Troupe, which is always on the lookout for funds and the Big Foreign Break, the competition between the protagonists is hilarious.Towards the second half of the movie the copy mode starts and then no movie is left sacred once again he rehash's the stories and even copies the last 10 minutes exactly from Its a mad mad...Till the last 45 Min's or so of the movie you are laughing and smiling but its all down hill from there and your not really able to leave the movie with a good feeling.Even the stalls (which really makes or breaks movies, who cares about me who's watched 100s of movies on DVD and in multiplexes), was bored and the laughter index was on a constant downfall.Direction and technical aspects were not important although the film had a couple of good sets.The acting was very good and predictably so, but Akshay, Paresh and Govinda (who seemed like a supporting actor after a while) have delivered similar performances in at least a dozen movies in fact of the lot Govinda gave the most different performance so you know how boring their performances are becoming.Lara Dutta still cannot act she always looks like she is about to smile, RAJPAL YADAV HAS CROSSED THE LINE he has crossed Johny Lever in the annoyance department in less movies then Johny took to be annoying.The songs were bad and you hardly felt like singing along with any of them (another low for priyadarshans films).The Indian setting is once again sacrificed to extensive benefits doled out foreign countries so that they can promote tourism, and the fact that filmmakers feel that foreign locales are much better, and preferred by Indian Audiences.Still the comic performance of this movie is unquestionable, there are scores of hilarious scenes and dialogues.Some brilliant ones are Ladki Ki izzat, the bag exchange in the park, the stuffed car etc.You are laughing quite often especially for the first 2 hours of the movie, but the downhill journey from there and the feeling that you've been had, and watched a sub-par movie purely based on the past credentials.Overall despite the stellar performances and some good scenes this movie falls way short of expectations (this is govindas comeback film even).A trip to the theater at multiplex rates will guarantee disappointment and so will buying the DVD, this movie is better watched at low matinée rates or better still in parts when it comes on TV.-s pathetic script, bad supporting cast, bad songs, steep downhill journey at the end.+/-s Govinda, Akshay and Paresh doing what they do best (seen to many times?....i think so),London setting (not London actually though).+s bunch of hilarious scenes.total (5/10 after factoring in expectations and on absolute scale, the fact that Neeraj Vohra wrote it has not been considered).","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" A Chase Worth Missing out on","review":"This movie is crazy. Now that's acceptable for a comedy but what is Priyadarshan trying to do.Though he is quite innovative in creating a few scenes - on the whole he fails miserably in delivering a well packaged ride. I saw this movie albeit after a delay and expected a lot. After all getting to see Govinda join the fun-fare and great promos of the movie were very promising.But it turned out to be a damp squib. The director fails miserably to conjure up the magic of 'Hera Pheri,' and this time around he seems to have totally lost the plot.Govinda is wasted since even the best actor requires a script, Akshay Kumar is passable and does what's necessary, Paresh Rawal is nowhere half as humorous as he was portraying Baburao Ganpatrao Apte (Hera Pheri- 2000), the females are there to be forgotten.The plot or what little there is to it, revolves around the desi stage troupe of Champak Chaturvedi (Paresh Rawal). His lead pair is Bunty (Akshay) and Babla (Govinda). The troupe gets its best break when Asrani offers them a chance to tour London for a month. Alas the heroine (Tanushree Datta) runs away having had enough of these two who keep coming on strong.So the troupe reaches London and the chase begins to find a leading lady. Akshay meets up and enlists Lara Dutta despite her suicidal tendencies and affinity to fling herself before speeding cars. Crazy enough hold on.It gets crazier with these two getting all mixed up with criminals thinking them to be the police and vice-versa  plus there are a few local goons headed by Shakti Kapoor who is also after them to extract revenge for his fractured limbs. Rajpal Yadav is good as a taxi driver and Jackie Shroff struts along occasionally as the local police chief.Hold on there is still something more, this chase gets now real complicated with a murder mystery attached to it. This comes across as a real spoiler... and I need not say more. Left the way it is a crazy senseless chase with all the misconceptions, the movie shows promise with funny moments to tickle the audience and dialogues to boot. But this mystery angle comes along and simply spoils everything.Sanjay Dutt is supposed to have a guest appearance so watch the first 30 minutes closely.. I for one sure missed out on him. And for some reason the climax seems inspired from - It's a Mad Mad Mad Mad World (1963) Once done with, I am confused whether to call it a comedy or a tragic comedy. Watch it in the theatre if you really have nothing better to do. Or else wait for the DVD release and watch it at home better still borrow it  cause though this chase is humorous on occasions  most of the time it gets to you with its unnecessary complexities and simply not worth spending much on.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Comic Mystery","review":"After 36 Chinatown, we now have Bhagam Bhag, which is a mixed genre film, namely comedy/mystery/suspense.It starts off great, with very natural performances (the Sync sound helps here), original dialog and an an interesting introductory phase-in of the characters. This is one thing the film doesn't stop till the end. Each and every character is introduced slowly and the audience then has to piece that character in with the rest. Good, because the audience gets to think a bit.The film provides great laughs, many of which are non-slapstick (thus a treat for the slightly intellectual).Govinda stands out like a shining star. He's back. And he's brilliant. Akshay Kumar isn't far behind. These days, Paresh Rawal's performances seem to be based on a character he's already played. Rajpal Yadav is decent. Jackie Shroff does what he needs to. Lara Dutta is okay. Tanushree Dutta, in a special appearance, manages to look rather slutty. The rest of the cast does their job well.The movie has a great pace, up until the last 30 minutes or so, where, once again, the screenwriter and director have run out of ideas on how to end the movie, and it becomes an ensemble of the entire cast involved in mindless buffoonery. Someone's got to come up with a better ending for these Priyadarshan films.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Bhag.......................","review":"Like the name all the characters in the movie keep running till the movie ends. I wonder how come the audience sticked to their seat till the end. I can not say this is the best Govinda movie I have seen till date as long as there are movies like Hatya & .... I don't remember anymore.This is a much hyped comeback movie of Govinda. But will it be a real comeback for him or he will have to come back again and again till one more decade only time will tell.Critically speaking, the movie is horrible. But the movie has been a hit among masses. On an average a nice attempt by Priyadarshan to revive a sinking career of Govinda.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Boring","review":"I was all in awe of the film looking at the promos and went to watch it FDFS The film was horrible to say the leastThe first scene is good and till they go to London things are funny but slowly the pace slackens and they is nothing funny about itThe Manoj Joshi subplot is funny at places but is unwanted and adds to the boredomThe drugs part is funny especially the monologue of GovindaThe film goes on and on aimlessly just like a small kid has written itThe interval brings a twist in the story but by then i lost hopeThe second half starts okay but the way things are handled makes a mockery The entire Arbaaz- Jackie angle is half baked Also how come people don't identify them?The climax is quite funny though stupidPriyadarshan is not at all in his elements, from this film he started doing craps and his films got bad and bad Music is good, SIGNAL, TERE BIN stand out and AFREEN too Camera-work is goodAkshay Kumar has white in his stubble and looks old but he acts well though this role he has done many times yet thanks to his natural comedy acting things look bearable Govinda looks out of shape, bad and his act except monologue is boring too surprising from Govinda seems too much pressure on him to comeback and Priyan fails to utilize him Paresh is okay in parts but overall just repeat act Manoj Joshi is funny at places Sharat Saxena is okay Shakti Kapoor is great Jackie Shroff looks overweight and acts in his sleep Arbaaz Khan is bad Lara Dutta shrieks to glory but fails to act","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" It was a one-man show","review":"This film brought two great actors together for the first time - Govinda and Akshay Kumar. Akshay Kumar was fast becoming the new comedy king while Govinda was making a comeback after some time out of Bollywood to concentrate on his political career.This movie was about a couple of theatre actors Bunty and Babla (presuming these character names were inspired from a film Bunty Aur Babli released in the previous year) who visit the UK to perform but end up embroiling in a murder incident.The film was mainly Akshay Kumar's with Govinda unfortunately playing his sidekick. Paresh Rawal had great scenes and Lara Dutta had been OK.It was a shame that Govinda was restricted in this film. I still cannot understand why he chose to act in such a movie. His role would've suited Sunil Shetty or someone who would suit better to play second fiddle to Akshay. \n Govinda was truly wasted in this film. When this film released I was really hoping Govinda would play a top role with Akshay Kumar but perhaps Priyadarshan was more in favour to give a better role to Akshay than Govinda. It was a shame that this film treated Govinda like a below average actor.Akshay Kumar did brilliantly in this film and had some comic scenes. He had more screen presence than Govinda.It is unlikely that these two will be in another movie after this (although they were in Holiday but Govinda in a small role) as Akshay Kumar is now in a different league while Govinda is trying to resurrect his fading stardom and career.","imdb_rating":2,"our_rating":0,"algo_label":0},{"heading":" Only if it's on TV.","review":"This film was a hit, it's supposed to be a no brain popcorn entertainer but there are far to many times that this film fails to do what it set out to achieve. The problem lies within it's writing, direction, and to a lesser extent - it's acting. But there are a few positives, there are certain scenes that may induce a chuckle but not a laugh and there are also moments where the actors shine. Unfortunately, the script never allows for the film to reach it's full potential.Akshay Kumar heads the ensemble, he works competently with what the script and the direction have given him. But he by no means shines, he is the Akshay that we have seen before. He is suited for physical comedy but has not been able to harness the magic that could possibly help elevate him in the eyes of others. There are certain scenes he manages to reach beyond the script and entertain but ultimately the is dragged down by poor direction and a poor script. Govinda, however, manages to work well with what he has and dare I say it, manages to outshine the rest of the cast which includes Jackie Shroff, Lara Dutta, Paresh Rawal, Rajpal Yadev and Shakti Kapoor. The problem with the acting is there is almost no direction given to the actors, it's almost as if Priyadarshan has given free reign to them but they are not capable of handling that freedom.The script is ludicrous and has no rhyme or reason to it. Even if the film functions as a no brainer popcorn flick, there still has to be an underlying aspect to the story for it to function properly. The film contains shades of noir but is to hollow to be regarded as noir and instead we get a mystery that is never fully explored and a comedy that doesn't live up to it's potential. Granted, I had low expectations to begin with - and this film did not even live up to that, barring a few amusing scenes (which included the film's climax), but not once did I laugh. Instead I groaned, moaned, and continued to watch because I'm the type of person who sits through a film all the way through.The music is horrendous and like the film - has potential but does not live up to expectations or go beyond anything sub par.The direction is horrible and unrestrained, even for a comedy there needs to be restrained in the direction - one singular vision that can help bring everything together, but Priyadarshan does not live up to the hype that once surrounded his name and because of his direction, he manages to bring the entire film down with his fledging career.5.5/10: The film has it's moments but in capable hands it could have used several re-writes as well as another director for it to succeed.","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Ridiculous and Hilarious!","review":"Or ridiculously hilarious, whichever you prefer, you'll still get side splitting pains from laughing so hard. Bhagam Bhag is Indian slapstick comedy in probably it's purest form. The writer Neeraj Vora (the writing brain behind the Golmaal, Phir Hera Pheri, Hera Pheri, Hulchul, Rangeela, and Hungama) clearly is no stranger to the genre but obviously was either smoking something serious or had a screw or two lose while drafting this sometimes hard to digest mega mêlée.Govinda (in his welcome back from hiatus role) and Akshaye Kumar play competitive entertainers working together in a traveling stage company. They compete over everything including the unsolicited attention of whomever or whoever is playing the female lead in their shows (we meet Ms. Tanushree Dutta in the current role as the film begins but later come to understand that many women have filled this role in the past). Blink and you'll miss her (Ms. Tanushree that is, em...I'm going to refrain from referring to her as Ms. Dutta as there are two of them within the same film as you will see later on). Ms. Tanushree's character gets caught up in a fake-love-triangle-confusion between Babla and Bunty (Govinda & Kumar respectively) which forces her to quit the show in the wake of an overseas travel gig. This sends their boss (Played by Paresh Rawal) into a tizzy. Since Babla and Bunty were responsible for the leading lady's resignation, the boss makes it their sole responsibility upon arriving in the UK to scout around for a new leading lady. And to make sure that they don't take the assignment lightly he tells them that whomever finds the most suitable leading lady by the deadline will play the leading man opposite her. This sends to the two into a competitive overdrive that lands them more than they actually bargained for. Personally, the plot twist that is introduced after this, is where the film started to go wrong for me. I was fine without the introduction of Lara Dutta's character, her multiple identities and all the drama she brought with her.Bunty and Babla get mixed up in a international drug ring operation the eventually reveals that every character that you've seen in the film so far has some kind of past history that connects them to the next person. When Lara Dutta's character is introduced as a suicidal witch-like figure in the middle of the night, it's no doubt who is going to fall in love with her (Bunty for those of you who don't already see the cliché), she over-acts most of her scenes and lacks genuine emotion in the ones where she doesn't over-act! This film did her no justice at all, except for in the one song number she appeared in 'Tere Bin' which also happens to be arguable the best song in the movie.Jackie Schroff plays a police commissioner with a secret of his own, Sharat Saxena \"Yes Bosses\" his way through his goon role, Rajpal Yadav is honest and quite himself as Gullu the Cabbie, Shakti Kapoor plays a drunken street thug who inadvertently helps Bunty land Munni(Ms. Lara), Manoj Joshi and Arbaaz Khan round out the cast with co-starring roles. Yes it was funny and yes it's worth a watch but it wasn't worth all the hype at all. C+","imdb_rating":5,"our_rating":0,"algo_label":0}]