[{"review":"This movie felt like an attempt towards making an Indian version of Step Up movies. After seeing the lead actors/dancers and a lot of supporting actors/dancers performing in DID and knowing what they are capable of, all the extra flashes and light effects seemed more distracting, than embellishing the dance acts. Since it is Indian version of the Step Up movies, it would have been interesting to see the lead female dancer doing a fusion of Indian classical dances, rather than the ballet. It is a ...MORE","label":0},{"review":"This movie felt like an attempt towards making an Indian version of Step Up movies. After seeing the lead actors/dancers and a lot of supporting actors/dancers performing in DID and knowing what they are capable of, all the extra flashes and light effects seemed more distracting, than embellishing the dance acts. Since it is Indian version of the Step Up movies, it would have been interesting to see the lead female dancer doing a fusion of Indian classical dances, rather than the ballet. It is a very good attempt, though!","label":0},{"review":"Best movie ever... Watching again n again..very big fan of D sir.. Remo sir.. Raghav bhai.. Punit sir... Its truly an inspirational movie.... N d songs r bst bcoz whenever v hear it, it motivates us to follow our dreams by hardwrk...Kuch toh jaadhu hai... Amazing dance steps... Pyaar bhi hai, passion bhi hai... Dis film is really somethng special 4 me.","label":0},{"review":"this movie is great i'm proud with all the india that they not give up when they get disqualified in the part of the movie they not stop dancing even their member is leaving to their group until one guy help them that have a nice and whole good heart that is the only i can say and I'm proud with all pilipino because your your team is idol pilipino and i'm pilipino too.","label":0},{"review":"Best dancing typed movie dude its amazing and the best thing is you can watch it emdless times cause it is a dancing movie so you will not be bored also . Ihave watched it atlesat more than 200 times","label":0},{"review":"It was a nice movie. i enjoyed every bit of it but cried a lot when Pintu died.Otherwise nice movie that i cant get tired to re watching again and again","label":0},{"review":"I love this movie, this is outstanding, and his team are very excellent work ,i watch this film every time , anytime anywhere. I love all careacter","label":0},{"review":"All dancer is very good dancer I love this movie and mayur resh and all dance mambar big thank you for Ramo disuja","label":0},{"review":"This movie was awesome . I watch to like again and again . I'm a big fan of dharmesh sir and Prabhu Deva sir","label":0},{"review":"Woww!!!  Nice movie and i love Remo D'souza and dharmesh and punit and all members of abcd. Suparb movie.","label":0},{"review":"Abcd movie is an inspiration movie for all of us and it helps us to do our strong work .....!👍","label":0},{"review":"I love  this movie  because  Iam big fan of song and dance \n☜☆☞","label":0},{"review":"I think all the paople taught a lesson from this movie it's amazing","label":0},{"review":"I  enjoyed it. A touching story told through dance. Well done","label":0},{"review":"My favourite movie in ABCD:any body can dance and ABCD 2 i love it","label":0},{"review":"I am a great fan of Remo Sir.\nWhen Remo Sir is there any body can dance","label":0},{"review":"Awesome movies with all kinds of entertainment which keeps u hooked","label":0},{"review":"Wow what a movie brilliant I love u Varun Dhawan","label":0},{"review":"Nice movie I like this movie my favourite movie abcd and abcd 2","label":0},{"review":"It's a inspiring film who choose dance as a profession","label":0},{"review":"Love a lot all the casts of abcd family","label":0},{"review":"Superb! Great film","label":0},{"review":"its a goood movieee !! \nsome1 kindly give names of all the actors known and unknown","label":0},{"review":"India ka best dance and dancers filme","label":0},{"review":"Excellent work of Dance","label":0},{"review":"Superior movie","label":0}]