[{"review":"Raja Menon has lifted the label of Bollywood movies by brilliant script and awesome direction. Akshay has delivered one of the best performance from his career. Lunchbox lady Nimrat has good chemistry with Akshay. Small performances were surprise package because Prakash Belawadi(Irritating George), Kumud Mishra(Devoted Officer), Purab Kohli(Lost lover) and Inaamulhaq(Unique Dialogue delivery) have done terrific job.\nWe have seen war-torn Russia in Lucky: No time for love but Airlift give you bro ...MORE","label":0},{"review":"Raja Menon has lifted the label of Bollywood movies by brilliant script and awesome direction. Akshay has delivered one of the best performance from his career. Lunchbox lady Nimrat has good chemistry with Akshay. Small performances were surprise package because Prakash Belawadi(Irritating George), Kumud Mishra(Devoted Officer), Purab Kohli(Lost lover) and Inaamulhaq(Unique Dialogue delivery) have done terrific job.\nWe have seen war-torn Russia in Lucky: No time for love but Airlift give you broader and more realistic picture of war and its sequence. As title suggest, Raja Menon must cover Flight take off and landing sequences so that it will add more weight age to this drama. Music is so good. Airlift will remember as high voltage drama of Patriotism and Humanity.\nMy Rating: 4.5 out of 5","label":0},{"review":"Performances:\n\nInaamulhaq impresses in his role of Major Khalaf Bin Zayd.\n\nPrakash Belawadi is Awesome as George Kutti.\n\nNirmat Kaur is first rate, this is her yet another excellent performance after the much acclaimed 'The Lunchbox'.\n\nAkshay Kumar is in great form as he brings the fictional character of Ranjit Katiyal alive on the silver screen. This is one of his best work till date.\n\nRecommendation:\n\nMust Watch for those Indian citizens who stay abroad. Some important lessons on how things co ...MORE","label":0},{"review":"Performances:\n\nInaamulhaq impresses in his role of Major Khalaf Bin Zayd.\n\nPrakash Belawadi is Awesome as George Kutti.\n\nNirmat Kaur is first rate, this is her yet another excellent performance after the much acclaimed 'The Lunchbox'.\n\nAkshay Kumar is in great form as he brings the fictional character of Ranjit Katiyal alive on the silver screen. This is one of his best work till date.\n\nRecommendation:\n\nMust Watch for those Indian citizens who stay abroad. Some important lessons on how things could change based on political scenarios of the world around you. It also tells you what it takes to become a leader. Awesome!","label":0},{"review":"I just love this movie , it's one of my favourite bollywood movie. And if you are an Indian then you should definitely watch this movie. Also acting of akshay kumar is very realistic. \nI have alread watched this movie thrice and my favourite scene is the climax scene which I have watched thousands of time. In my opinion if you are a nation loving person you should go for it , also akshay sir's movie never dissapoints anyone so give it a go!","label":0},{"review":"Airlift is a film which will make you proud. Airlift is Akshay Kumar's finest work till date. Airlift is a film which has atmospherics and a genuine tension which is much needed in this kind of film. Raja menon pulls off a brilliant real  life story, and forgotten incident to the screens. Airlift is a must watch. And specially the flag scene at the end, it's a great one I'm going with 4.5/5","label":0},{"review":"Great acting and script.  Amazing story and actions by Kumud Mishra who deserves the Nobel prize for his diligent roll. Very honorable acts in such a critical time from the businessman to take the leadership and risks to arrange the transaction to assist his country men. \n\nAll Indians should honor the businessman, Kohli and Mr. Mishra who planned and engineered and most of all risks their lives to save hundreds.","label":0},{"review":"Beautiful Silver screen adaptation of Indians & Other nationals rescued in Gulf War. Characters shown are fictional but Script is based on Real Event. Great Work by everyone involved especially Akshay Kumar. Very inspiring & Heartwarming Rendition for National Pride & Cultural Ethos & Humanitarian Unity.","label":0},{"review":"First of all  I didn't know this film once upon the time I here the \"soch na sake\"song that time  I really  love that song so  in my  curiosity was triggering to  see this film  that was I get see this film  but  in  this  film  really  make it  crying  moment in each scence because they suffocated a lot  from the Iraq and  akshay was fight against to get them to India but  that  main part is that  flag started to fly from that  one phone call  it's  make me cry and  this  film direction  so  to ...MORE","label":0},{"review":"First of all  I didn't know this film once upon the time I here the \"soch na sake\"song that time  I really  love that song so  in my  curiosity was triggering to  see this film  that was I get see this film  but  in  this  film  really  make it  crying  moment in each scence because they suffocated a lot  from the Iraq and  akshay was fight against to get them to India but  that  main part is that  flag started to fly from that  one phone call  it's  make me cry and  this  film direction  so  touched,  realistic,  and akshay was Amazing acting in our career👏👏👏👏 I really happy to see this film 😍❤grateful heartful thanks to gave this film to us.......🙏💘","label":0},{"review":"Very well made movie. There are factual errors which can be glossed over under the cinematic licence.\nAkshay has done a stellar role. Prakash Balewadi as George hogs many a scenes with his great acting.","label":0},{"review":"I like your this movie it is very super star movie\ni gave 5 stars for this movie.\n\n\n\nAMAZING MOVIE IN THE WORLD YOUR THIS MOVIE SIR \n  WORLD THE FAMOUS MOVIE  \nI REALLY LIKE YOU SO MUCH AKSHAY KUMAR SIR MY NAME IS  HAJIRAH ZADRAN.\n2018 November 11.","label":0},{"review":"This movie is my favourite hero's movie. Hats off to the one who has really done such a dreadful task of saving our country people during the war between Kuwait and Iraq. it is appreciable movie and should've got awarded with Oscar.","label":0},{"review":"4.5 / 5 Rating\nOne Of The Best Ever .....After Watching I Just Feel To Salute ...Must Watch Movie...Akshay Kumar Had Done A Great Job In this Movie...Wish Indian Industry Would Produce Such Movies....\n\nNo words To Express.....\nI am 100% Satisfied.....","label":0},{"review":"mind blowing movie.hats off to akshay kumar sir he did acting with such versitality and it was so realistic.One of the best of bollywood which will make you feel proud of being an indian.Such a mind blowing screenplay with such amazing story","label":0},{"review":"It is one of the best movies Akshay Kumar has done in his life. Air India pilots have done such a remarkable job which most of us didn't even knew till this movie was released.","label":0},{"review":"One of the best movies that I have seen....akki sir delivers an awesome performance....super duper hit ...hats off to the director and supporting actors and actresses .. believe me you can't stop your tears by watching the climax...jai hind","label":0},{"review":"Ever ever.....good one\nNo.......not good......it's just a very good one movie.......;\nInsan jesa bhi ho......musibat ki wakt agar uski manufacturing defect Aisa ho to Bhagwan se dua he ki......sabka defect karwao yar.....sudhar jae thoda ye Insan\n\nJust enough.......good work by all airlift team\nAwesome..........& Thank you to create such a sensation truth among us thank u","label":0},{"review":"this is my favourite movie bcoz THE story of this film was amazing nd AKSHAY KUMAR is my fvt star in BOLLYWOOD..\n\nAND SONG OF THIS FILM IS TOO GOOD","label":0},{"review":"A heart touching film. Hats off to Mathunny Mathews & Sanjeev Kohli. Strong acting. Thanks to the Director for giving us an opportunity lto know the real fact in 1990.","label":0},{"review":"This like epic movie heartbeats are so cases annacious paper work ,acting of ak are,profiun justice it's ever all time best acts of department best wishes making movie,or himself indian","label":0},{"review":"Really nice movie Kuwait city outside very beautiful, and ranjith katiyala take risk people really heart touching,and Saddam act super , cinematography very very good, Arabian style background scored nice,last song and claimax feel good","label":0},{"review":"Airlift is the movie which is definitely worth watching. it has such a good story about Indians who are stuck in Kuwait and want to return to the country.","label":0},{"review":"The movie is drama and thiller akshay is rolling on movie the realising date on 22 January 2016 the movie like it kidanappers on attacking on city people injuired and death so i requesting a movie coming soon i like its movie so  plese come movie and watching it 2 hr 31 min \nThank you......","label":0},{"review":"DAMNNNN wonderful moviiiee !! Proud to be INDIAN !! Salute you my DHARTI MAA !! I am glad to know the story of my country.","label":0},{"review":"Osm movie I love it  . Their story , acthing  osm very proudful movie,\n great job Akshay Kumar sir.  we love you","label":0},{"review":"This is the best movie I have ever watched great work by Akshay Kumar the message he wanted to convey was directly and strongly delivered.","label":0},{"review":"Brilliant gorgeous film I am so proud to known\nAbout Ashkay Kumar how as actor is doing very well do well keep progressing","label":0}]