[{"review":"This movie makes me remind of my childhood's memory.. The days when people used to have VIDEO CASSETTES instead of CD. I bought this movie VIDEO CASSETTE on my 15'th birthday ..Although movie was released 2 years back... Very heart touching movie.. not only shows the sweet relation between young couple as husband and wife but also the relation between father and 7 year old son.. The movie has perfect blend of Emotions and family drama... I had watched this movie more than 200 times.. and yess... ...MORE","label":0},{"review":"This movie makes me remind of my childhood's memory.. The days when people used to have VIDEO CASSETTES instead of CD. I bought this movie VIDEO CASSETTE on my 15'th birthday ..Although movie was released 2 years back... Very heart touching movie.. not only shows the sweet relation between young couple as husband and wife but also the relation between father and 7 year old son.. The movie has perfect blend of Emotions and family drama... I had watched this movie more than 200 times.. and yess... MOOLCHAND shopkeeper was also very good in acting ... I give 9.5 / 10 ...","label":0},{"review":"This movie is just beyond awesome! I would like to thank Anu Malik ji & Majrooh Sultanpuri ji for giving the never - forgetting songs & background score and what can i say about Aamir khan & Manisha Koirala... They are my favourites! They also did very appreciative roles in 'Mann'!","label":0},{"review":"It's a great movie. But I can't guarantee that if I see Amar Koushik in front of me, I would not hit him like a bull. Don't he felt ashamed when some oher man's songs credit is taken by him . Mera samne a te Tera face jala dunga","label":0},{"review":"This movie along with rajesh khanna movie Adhikar, ashiqui. All these are based on same plot where heroine is a singer and instantly becomes famous and rich and hero remains where he was there only then differences, misunderstanding about her prestige and fame but at end every thing is fine..\nSongs are 💓 💓 💓 💓 💓 💓. 04 /06 /19","label":0},{"review":"Very nice movie I have seen 25 times I loved the story and Manisha koirala was looking beautiful this movie released when I was in college. I bought the audio cd and I use to listen songs.but I don't know why the movie was flop.","label":0},{"review":"Super movie.. Amir khan acting is Fantastic.. and manisha koirala also acted very well... Music is very melodious songs are very beautiful.. Totally this movie is very heart touching.. Very good movie.","label":0},{"review":"Nice movie. I have watched this movie more than 5 times in TV and I love this movie very much....I just want to download  a song named Dil mera churaya kyu.....","label":0},{"review":"Plot of film is best, dialogue which makes outstanding in the film. Every characters role played at best . Music and lyrics always refreshing.","label":0},{"review":"Akele Hum Akele Tum\nUdit Narayan - Akele Hum Akele Tum\n\n\n\n\n\n\n\n\n\ni like this song too much......................\n\n\n\nthis is story of two lover...............\n\n\nbut this is also story of a boy................who is seprate from mother father's dut to them ambitions...........\n\n\n\n\nis it ok or not ?\n\n\n\n\ni mean every human being just leave everthing just in the name of there child......................\n\n\nwhat you say friends....................","label":0},{"review":"So beautiful movie, very heart touching, this movie shows that love never dies, and father is as important as mother to a son.😌","label":0},{"review":"I can't see this but I like this song very much and I love it and this songs singer voice was awesome both male and female voice","label":0},{"review":"I cant hold my tears.. while watching this movie. Every time!! Lovely songs 😊 Lovely Movie 😊👍👌","label":0},{"review":"Great movie of the older times it is not possible but I will be waiting for its second part","label":0},{"review":"Its a great movie reminds me of my adolescence and first approach to likes and dislikes; love and hatred; please and displease; pleasure and pain; happiness and sadness; joy and sorrow; cheerfulness and grief; affection and agony; attractions and repulsions and last but not the least friends and foes.","label":0},{"review":"Heart winning music. Awsome story. Superb acting.","label":0},{"review":"Fully copied from the hollywood classic Kramer vs Kramer, but I still appreciate the director, that how he mould the movie according to Indian Audience with a great music by Anu Malik","label":0},{"review":"24 years old movie\nbut the music and lyrics of this movie is still fresh","label":0},{"review":"Awesome movie...must watch movie of older times and the movie has nice songs too","label":0},{"review":"i like these movie song. i love nice music and lyrics","label":0},{"review":"Most and popular song,I am very happy, when i hear this song","label":0},{"review":"Awesome songs!! Hats off to Sanu da , uditji and Alkaji","label":0},{"review":"It was a very nice movie with lovely songs.","label":0},{"review":"I like it suçh a heart touching song","label":0},{"review":"It is a very nice movie and nice song","label":0},{"review":"Super movie and excellent melody songs","label":0}]