[{"review":"FUN FUN FUN- GREATEST HILARIOUS  COMEDY MOVIE OF WORLD .What Aamir khhhan-salllman khan  performed,  I've no word!!! I can watch it 10k times  with comfortably,  but  by now just 23 times only. Donb and Donberwali unlimited comedy.\"do mastane'  my best funny song;  each tym  I laughed heavily. AAA is a option of applied psychotherapy for depression patient; no doubt. Each scene-dialogue  consists full laughs smile on face.Thnx  piyush changde for wonderful story idea. Dr Raj santoshi  managed we ...MORE","label":0},{"review":"FUN FUN FUN- GREATEST HILARIOUS  COMEDY MOVIE OF WORLD .What Aamir khhhan-salllman khan  performed,  I've no word!!! I can watch it 10k times  with comfortably,  but  by now just 23 times only. Donb and Donberwali unlimited comedy.\"do mastane'  my best funny song;  each tym  I laughed heavily. AAA is a option of applied psychotherapy for depression patient; no doubt. Each scene-dialogue  consists full laughs smile on face.Thnx  piyush changde for wonderful story idea. Dr Raj santoshi  managed well. Well praised for  dialogues ( aditya sohoni  Dillip shukla) .mainly  Ammu-sallu  pair forced me  for laughing  & created a illustration  in comic world. Today both r powerful  superstar- Activist-  intimate fr each other. Hope its sequel  with this two legends up next.87 millions  approx. Collected  at Box office  & identified  as an iconic  stressfree  -fresh  evergreen picture  forever.  Govinda juhi  as guest artist in it.  Other cast  raveena karishma paresh  shakti viju  shehzad tiku  javed deven mehmood jagdeep  performed as best. I'd like to prescribe  AAA  4   being tension free  -- as possible as keep up with  outstanding heart  touching  AAA. Team AAA zindabad. \n  As amar  Ak proved  he is master of  all kinds of role  ( act rom fun trag)   versatile. His aim is giving  immortality  to own career  ( Artist  -social Activist  ) .salute with pride and honour  to  \"the No 1   Global  full of surprisable  artist  mr. reliable Aamir khan. \"\n  Here in,  amar-prem  r day dreamer  positive minded  belongs to  middle class family  have a rich aim  to go ahead  having crossed all barriers  at their path.  In last, two ambitious  achieved  success. Romantic Prem gained wealthy lady whether sharper romantic  Amar gained  loved-one. In the course of  amazing daring journey  crime master Gogo  - multi billionaire  teza  defeated  by  A-P intellectuals. Nice msg lies within-  Be obstinate  for achieve  ur passionabl  dream; success 'd kiss  ur foot definitely. Stop not till the goal or result of strong willpower  is reached.  \n UNFORGETTABLE  movie  - alws EVERGREEN. JEWEL OF INDIAN CINEMA!!  Thnx 2 entire team of AAA  (tripple   A)  4 completing  25 ys  successfully  .Let's watch quick and laugh heavily openly.  All've stored  in my mind card. Very unique  incomparable   extraordinary  really... frs, dekho  aur mazaa luto. Be happiest alws. 😁🤓👌👌✍💕   Dhamaka chudiyan zaahil Goal Radio Goli. Gum ka sathi rum sikka sita aur geeta.newyork Thobda oranges  aaila uima  police police Ribbon Danda kidnap Mark  plan swargwasi aunty. Pakda gaya. Yaddas bapas suraj kaan purse  very-smart  teza teza kya hai cycle  Dhanda  wo-ho  khusath vascotigama  paplu Gadbad   10 paise  Galti se.30 cr mogambu roshni Mistake Dekha hai Char admi Counting Aapas carpenter  khurana Andhi 717 Ullu  Utha pata. Sakkar Ek piyale Tu hara kidhar. Choudhury Angur Mamujaan Hamara bajaj. Main sochunga sholay zaakas Anand-akela  out of order. Sarbat  Do minute Really Chicken Gotiyan Dil ki waat Rabbit 22k Bidi  Uthata hun  yamraj Ramanand Judwa bhay Maaro Bati suspense  Godiwale  safed ramu Namaste Taplu Heere khamosh Move sit Panchhi  Antaryami  kissa karza 36 hajaar Allow me Band-master Hands up Game Bloody joker Bloody dirtyman shampen smart boy Dard kam.Time to time Murkh pagal Hitler Nikamme HMT Furfur  5 lakhs DO DO  JAWAB  3MS LATE Goga khandani start  Ram ram 50cheques stop Nimbupani chuhe paazi uthal puthal chay Gang karname Budhiman Bewafa Khudkhusi Bhopal Kachcha khiladi DO DO UNCLE Paultry farm muhn na laga khus hua Gyani Bakery London musiwat  Uncle kaun  Mahapurush shaktiman  Asli papa kahte hain  50 lakhs Bhatiza sawal Jawab Aaila juhi chawla. Majbut kandho. Tan man dhan se Pit sakte  ho ... Bach sakte ho...","label":0},{"review":"This movie deserves Rs500 million box office collection. This movie is the greatest of all time. This movie will make it to 22nd century very easily. People will never get bored even after watching it for 100 times and I can easily bet. My entire family members enjoy this epic movie everytime they watch. We have a great time with family when we watch this movie during weekends, bake popcorns, lemon juice in summers n chicken soup during winters. Only wow moments. I would request the producer to  ...MORE","label":0},{"review":"This movie deserves Rs500 million box office collection. This movie is the greatest of all time. This movie will make it to 22nd century very easily. People will never get bored even after watching it for 100 times and I can easily bet. My entire family members enjoy this epic movie everytime they watch. We have a great time with family when we watch this movie during weekends, bake popcorns, lemon juice in summers n chicken soup during winters. Only wow moments. I would request the producer to make the movie once again with the same casting if possible :)))) A kind request sir. Uii maa.... bhalla mere plan ke mutabik. Robert- galti seh mistake hogya... gogo- crime master gogo funny funny simply funny... shyam bajaj- game kar dalunga... Aamir sir- aap to gyani hai, mai toh kehta hoo ki aap purush hi nahi....😂😯 maha purush maha purush hai 😂🤣😂🤣😂🤣","label":0},{"review":"I did wonder how could someone write such hilarious scenes one after another but Rajkumar Santoshi and Dilip Shukla did it. What a movie it is! A hilarious roller coaster ride. It deserves to be watched multiple times in a lifetime and you can never get bored of it. I have even laughed writing the review just by rembering the dialogues. Characters like Amar, Prem, Bhalla, Shyam Gopal Bajaj and none other than crime master Gogo will stay forever with you.\nI must say that this cult classic is an e ...MORE","label":0},{"review":"I did wonder how could someone write such hilarious scenes one after another but Rajkumar Santoshi and Dilip Shukla did it. What a movie it is! A hilarious roller coaster ride. It deserves to be watched multiple times in a lifetime and you can never get bored of it. I have even laughed writing the review just by rembering the dialogues. Characters like Amar, Prem, Bhalla, Shyam Gopal Bajaj and none other than crime master Gogo will stay forever with you.\nI must say that this cult classic is an epitome of comedy in Hindi cinema.","label":0},{"review":"Aaila.... o teri.... ui maa.... The best comedy movie of 90s Bollywood, and yes, I admit watching a no brainer movie can be fun only when you will rest your brain aside. \nThe movie has one of the best performances by its starring. You will enjoy the duo of aamir and sallu very much. And all this along with some beautiful soundtracks set in the romantic Ooty.\nIts a full fun pack... Enjoy.","label":0},{"review":"One of the most humorous movie so far. Nothing can replace the one liners used in the movie. I still laugh so hard whenever i watch this master piece. Amir khan being the naughtiest and salman khan the dumb one.. what a hit pair they made. Songs were amazing too. Twist and turns were very well planned. One of the best entertainer.","label":0},{"review":"One of the most classic comedy movies of bollywood. This movie was a box office flop yet it has a cult following and i bet most people have seen it more than once. Definitely a must watch.","label":0},{"review":"Out and out entertainment, fast moving and good healthy comedy.\nThe best part is its music by Tushar Bhatia. Its typically styled like our good old maestro O.P. Nayyar .\nYou can never get tired watching it a 100 times over.","label":0},{"review":"You can watch this a thousand times but would never get bored. A cult classic, best of dialogues, amazing funny acting. Some movies can never go wrong. It is one such.","label":0},{"review":"This is one of the best movies to come out of Bollywood. Period. You'll never get tired of seeing it. Every time you see it , there is some new joke or situation to laugh on.","label":0},{"review":"I don’t know for how many times have seen this movie since it’s release in 1994. One of the all time favourite. Scene by scene, dialogue by dialogue, the film has been absorbed at the cellular level!","label":0},{"review":"The best comedy movie in Indian cinema. A cult for sure. Those expressions at every moment. Not even a single shot can be missed. A must watch.","label":0},{"review":"Very nice and comedy movie of 90s and the acting of Salman, amir, raveena, karishma was beautiful but I can't understand why this movie was flop nice story, comedy, funny I love to watch this movie again and again.  In childhood I use to watch this movie many times.","label":0},{"review":"A rare gem of screw-ball comedy in Indian Cinema... the makers have nailed the genre... it's silly and very funny... a  film that demands repeat viewing on the account of laughs it generates every time.","label":0},{"review":"Declared as Classic Cult, this movie is a must watch. Story line, dialogues and the acting is far ahead of its time. Although it got flopped at screens but it remains as a Blockbuster till date...","label":0},{"review":"Only and only fun.  No social message,  no sadness at any point of time.  Just enjoy up-to the end.  Greatest of all time comedy","label":0},{"review":"So I just discovered this movie on Netflix, and I know its a favorite of Shaheer Sheikh, so I can say, its one of my favs now also, its funny and a lot of talented and great acting #the best!","label":0},{"review":"This is the our  most favorite movie, for my brother and sis and mi😇our childhood memories, we like so much best movie ever, all character is superhit, grim master gogo, bhala, robat, Amar, prem, song also supperb, 🤗🤗👌👌👌👌👏👏dialogue also superb .,.....aliala........ Uui maaa...........","label":0},{"review":"Amazing movie..nobody can ever remake it\nD moments d dialogues d sequences..noo.. can never be recreated unless d actual characters play there part in d sequel too..best of d best comic movies ever seen in hindi cinema..which I can watch everyday..a great stressbuster 😚😚😚","label":0},{"review":"It was a time when the bollywood movies really used to be fun , a great comedy movie with 2 of the best actors amir and salman ,must watch","label":0},{"review":"It is full of comedy all the characters are too funny. Overall i fully enjoy my time watching duo khan on screen.","label":0},{"review":"The most hilarious bollywood comedy. . \n Comedy timing between Aamir and Salman is great \n But it was a box office disaster","label":0},{"review":"My friends had suggested the movie to watch. I watched it..and I loved it. Awesome comedy and stars..SALMIIR KHANS..did excellence..","label":0},{"review":"Funniest movie ever made in India. Acting superb. All Characters did their job very well. Full entertainment family movie.","label":0},{"review":"Amazing Amazing just Amazing full package of unlimited fun all the cast is hilarious talented .A must watch movie never-ending fun Just loved this movie☺️👍","label":0},{"review":"This movie was awesome. Super comedy till the end. Aamir proved that he can do best comedy with this movie","label":0}]