[{"review":"Actors acting were very good . Now I don't have faith in any sports man it's all about real life incidents . For example ankit chauhan rajasthan royal player in 2013 he was suspend for taking bribe purpose . You should never cheat with your country your earning money you are paying income tax , you are eating food you children's getting education your families are getting health benefits  railway transportation airline   transportation etc when you people are taking bribe that means you dont lov ...MORE","label":0},{"review":"Actors acting were very good . Now I don't have faith in any sports man it's all about real life incidents . For example ankit chauhan rajasthan royal player in 2013 he was suspend for taking bribe purpose . You should never cheat with your country your earning money you are paying income tax , you are eating food you children's getting education your families are getting health benefits  railway transportation airline   transportation etc when you people are taking bribe that means you dont love your country .   One think we had learned from this movie that honesty is the best policy.","label":0},{"review":"Azhar is a film that glorifies Azharuddin as an underdog. For a fan of Cricket or Azhar, it comes as a huge disappointment due to mediocrity of the content. You could give this one a miss! Azhar could easily be said to be one of the weakest films when it comes to portraying a real-life character on-screen. The writers have a great subject at hand and there is so much to explore but what they stick to is an overly commercial approach.Music of the film is above average and full marks to DJ and nar ...MORE","label":0},{"review":"Azhar is a film that glorifies Azharuddin as an underdog. For a fan of Cricket or Azhar, it comes as a huge disappointment due to mediocrity of the content. You could give this one a miss! Azhar could easily be said to be one of the weakest films when it comes to portraying a real-life character on-screen. The writers have a great subject at hand and there is so much to explore but what they stick to is an overly commercial approach.Music of the film is above average and full marks to DJ and nargis fakhri for recreating \"Oye Oye\". Azhar is a complete misfiled. It neither captures the spirit of the game nor the personality. A 2/5 for the film!","label":0},{"review":"Worst direction! I have seen in my entire life. Could have been a way better movie if the direction and casting was done properly. Worst performance given by almost everybody. Even with a story as good as this, the movie fails to make a positive impact and you come out of the theater feeling sorry for yourself. This is why you should chose a movie based on its 'director'.","label":0},{"review":"One of the best movie. Far better than useless Dhoni Movie.\nImran is really hardworking and under rated. Better than hehehe laughing Akshay and waste Saif.","label":0},{"review":"This film is very good and actors also good. Prachi Desai , emraan hashmi also good. Prachi Desai looking nice , sweet , simple and beautiful. All are people should nice role. This film is very good","label":0},{"review":"This movie was made to show how Mohammed Azharuddin one of the most successful captains of Indian Cricket rose quickly but was also left alone when his name cropped up in the match fixing controversy where many big players were involved. Till then we read only in papers or watched videos as presented by the print or visual media.","label":0},{"review":"Movie is sheer image cleaner of Azher at last he says i took money so that i can save india from losing ,else some one else might have taken that money and india can loose 'Such a childish statement' there were other ways as well he whould have reported police /BCCI after all movie is ok ok","label":0},{"review":"Eventhough IAM a Dhoni fan  , I found this movie far better than the film Dhoni untold story . Songs are also gud . I would rate 8/10 .😘😘😘","label":0},{"review":"Movie was really good,Worth watching. \nAlthough i don't like cricket but still i enjoyed watching it.","label":0},{"review":"Nice movie .... And all songs are really awesome love the movie and emraqn hasmi style😄😄😄","label":0},{"review":"This film is good and based on real life of mohd. Azharuddin. Nice movie","label":0},{"review":"Its awsm I would like if the marriage life r divorceof sangeeta bijlani was includes","label":0},{"review":"I just got to watch the song from AZHAR, Bol dou na zara and was wondering how come they had cell phones at that time😧?","label":0},{"review":"Very good movie but the kissing scene should not directed because it is a biopic","label":0},{"review":"Its a good movie to watch. Imran played Azhar well. Watch this movie for him.","label":0},{"review":"Indian movies developed a lot and the credit for this goes to democracy and equal opportunity","label":0},{"review":"Best movie.... Better tha Dhoni... Underrated","label":0},{"review":"AZHAR is a good movie according to Azhar bin Shabir","label":0},{"review":"Nice movie...story is good.all songs are Fantastic.","label":0},{"review":"💐 Azhar is the best cricketer of the world 🌷","label":0},{"review":"nice moviee..nice songs..love u emraan haashmi...the hit machine","label":0},{"review":"Good movie and goog work by imran","label":0},{"review":"I like this movie but azhar is a pakistha cricketer but in this movie azhar is a indian cricketer .........","label":0},{"review":"Nyc songs and great indian movie","label":0},{"review":"Not well depicted Azhar biography....nargis failed miserably in acting in this movie.","label":0}]