[{"review":"My Review (27th Movies Review):\nVerdict - Super Hit\nStoryline - The main plot of this movie is about that in india, the king needs an new prime minister, however they call this peshwa, however they need to find the right one and ranveer singh managed to become the prime minister in india, however his name for this movie is bajirao, however soon he took majority of the land in india whereas they did many wars and they have win these wars as well, however he does have an wife and an kid, but some  ...MORE","label":0},{"review":"My Review (27th Movies Review):\nVerdict - Super Hit\nStoryline - The main plot of this movie is about that in india, the king needs an new prime minister, however they call this peshwa, however they need to find the right one and ranveer singh managed to become the prime minister in india, however his name for this movie is bajirao, however soon he took majority of the land in india whereas they did many wars and they have win these wars as well, however he does have an wife and an kid, but some people complain that peshwar people does murder to other people, however soon there is another character in this movie which is deepika, she plays mastani and she is muslim whereas bajiroah is hindu and the war he has fought from the past were Mughals who were probably muslims, however she asked them for help because her land is in danger and ranveer singh agreed to help her for this war of their land, but they managed to win this war, however deepika got injured, however soon he is about to return to his land, but before this happens, you will see the conservation between both pairs as she starts  to feel in love with him, soon he came back and had spend time with his wife and deepika decided to go to his town because before he left, he gave her an sword, but what this represent that they are married, this is weird way from those days, however soon she arrived there and the family who lives in this place decided to make her as an court dancer because they do not like muslim people, however they know that something is mysterious about her relationship with ranveer singh, but soon he starts to find out of why she is there and he agreed her as an second wife, but soon the family starts to find out these information and the kingdom as well,  because both time, two wifes became pregnant and they were also born, but his first wife is played by Priyanka chopra and she knows that something is suspicious about her husband whereas most time she has been as an shadow for him, but soon she knows this fact, this is before she deliver her baby, however in this movie, you will see there is argument of what this prime minister is doing which is wrong, however soon there is another war left of which they need to take over, however he asked help from other land in order to fought against them, but one day when their children grown up, he brought deepika back to his home, because before this, they live separate, but the family decides to kill his second wife, but she survived and soon ranveer singh feels betrayed and he left this job, but now it is time for final war which they need to take over because they could be in dangerous if I say in this way, so he leaves home to go to war and the family arrested deepika and soon he fought other people in the war, however he got badly injured and his health is bad and he knows that family arrested her and he want her to see her of where he is because he is injured and unwell, however soon he sacrificed himself as well as deepika because they want to be together when they are heaven, this is what you call it true love. Extra Information - In this movie, you will see that, the other reason of why family hates deepika because ranveer singh was planning for her to be prime minister for other lands, also in this movie. Songs - The background music was good especially the action sequences, however two songs was good for this movie which was deewani mastani and mahlhari, but other song were okay like pinga and others were not interesting songs. Performance - Ranveer singh and deepika were outstanding in this movie and Priyanka chopra alongside other actors were good.","label":0},{"review":"Saw Bajirao Mastani yesterday. Reflected on the movie and came up with this version of my take on it.Thought, is it relevant? Does it hold any water? Nonetheless, here I go.\n\nIt has been a down time for me for quite sometime, and I really was looking for something crisp which can alleviate my mood. Did the movie help me? It did, to an extent. It transported me to a world, which must not have been that exquisite as it is shown, but a world which was captivating and seemed real. The characters wel ...MORE","label":0},{"review":"Saw Bajirao Mastani yesterday. Reflected on the movie and came up with this version of my take on it.Thought, is it relevant? Does it hold any water? Nonetheless, here I go.\n\nIt has been a down time for me for quite sometime, and I really was looking for something crisp which can alleviate my mood. Did the movie help me? It did, to an extent. It transported me to a world, which must not have been that exquisite as it is shown, but a world which was captivating and seemed real. The characters well etched and their growth palpable. Was shuddering with the thought that the Director might have spoofed the characters. But unlike Mr. Dutta, who slaughtered Umrao in his interpretation, Mr Bhansali is a painter and master of nuances. He recreates the atmosphere, and the passion flares up in every frame, and has been able to seamlessly integrate the bygone era with modern look. The movie draws inspiration from the Classics like Pakeezah, Mughal E Azam and Umrao Jaan, and for a good valid reason. These movies(few others would be Shatranj Ke Khiladi, Anjuman, Gaman, Garam Hawa,Junoon(not the one where Rahul Roy changes into an animal in a jiffy!!!!)) are landmark in depicting the rich and mesmerising Muslim culture and could be considered as subtle representation of a certain segment of the society. The diction , the whole persona and the mood have been rightly captured by the Director. People who have subsisted on movies like Mughal E Azam will straight away see the sister of Anarkali from Mughal E Azam emerging from the screen as a maid of Mastani. The amorous eyes and sonorous voice of Meena Kumari with her tresses floating in a small pond like structure, and a reptile fleeting around lifted the tone of the movie Pakeezah. This movie has that type of feel and It is these moments which uplift the movie to a different pedestal altogether. Unblemished acting from each and every actor. When movies like Mughal E Azam and others mentioned earlier were created, the recreation of an era must not have been that big a challenge, as the era had not died its death. But this is a different time where lot many aspects of our earlier societal values have become either irrelevant or have been dumped in the backyard. Imagine Deepika Padukone, the alpha actor who has been lauded for Cocktail and Finding Fanny and Piku, coming up with this act to sweep you off your feet. She looks mesmerisingly beautiful and acts the part with great sensitivity. That is hallmark of a great actor. The same for Mr. Ranvir Singh. What an act. He rightly drew an analogy between him and the Director vis a vis De Niro and Scorcese.\n\nThe downside. First, for good reason, the gifted Director who also has given music for the movie, could not retain all the songs.The movie, after all the pruning, stood at three hours.So I missed seeing picturisation of sonorous and full of dramatic content laid songs like “Ab toh Jaane na Doongi”. I guess the song would have the mood of song “Na jaao saiyan”from another path breaking movie Sahib Bibi Ghulam. i wish the Director’s cut DVD will have all the songs in entirety.Secondly,the externalities of characterisation( for Bajirao and Mastani) gets upperhand to the internal relationship dynamics between the protagonists. Thirdly, the movie had the opportunity to give blindfold moment, which could have made it a little edgy, which it missed.\n\nNonetheless, the movie is a painting, and a painting worth seeing.\n\nQuite a job to write up with sincerity about a movie!!!","label":0},{"review":"Excellent movie, amazing sets, brilliant cinematography, classic songs with classic cinematography, wonderful work by all actors except for Deepika Padukone..Perhaps this is the worst acting ever by her. Priyanka Chopra with her expressive eyes moves you in certain scenes with excellent dialogue delivery.And the star of all is Raveer Singh which amazes you with outstanding performance so much that you cant imagine anyone except him as Bajirao..\nKudos to Sanjay Leela Bhansali for this magnificent ...MORE","label":0},{"review":"Excellent movie, amazing sets, brilliant cinematography, classic songs with classic cinematography, wonderful work by all actors except for Deepika Padukone..Perhaps this is the worst acting ever by her. Priyanka Chopra with her expressive eyes moves you in certain scenes with excellent dialogue delivery.And the star of all is Raveer Singh which amazes you with outstanding performance so much that you cant imagine anyone except him as Bajirao..\nKudos to Sanjay Leela Bhansali for this magnificent historical drama presented so well on screen.A must watch movie for all.","label":0},{"review":"I have watched this movie on TV with my friends. Its very interesting  to watch a movie based on history. In the movie Priyanka Chopra has done amazing work, Deepika Padukone has also done amazing job as Mastani and Ranveer Singh rocked the stage as Bajirao with his acting. Though he didn't dance well and looked in the panic state. \nBrilliant cinematography, classic songs and amazing sets. Must watch movie!","label":0},{"review":"Bajirao Mastani tells the epic lovestory of peshwa Bajirao and Mastani.The way Mastani and Bajirao undeterred prove their love and how Kaashibai,Bajirao's first wife pines for her husband who's now loving Mastani.Sanjay Leela Bhansaali has beautifully brought the lovestory to us ,the purest way he could .The music within the movie,its just fantastic specially Deewani Mastani.Deepika has done fantastic job along with PC And Ranveer.The whole lovestory proves their love and determination to tell t ...MORE","label":0},{"review":"Bajirao Mastani tells the epic lovestory of peshwa Bajirao and Mastani.The way Mastani and Bajirao undeterred prove their love and how Kaashibai,Bajirao's first wife pines for her husband who's now loving Mastani.Sanjay Leela Bhansaali has beautifully brought the lovestory to us ,the purest way he could .The music within the movie,its just fantastic specially Deewani Mastani.Deepika has done fantastic job along with PC And Ranveer.The whole lovestory proves their love and determination to tell the world that they will not budge from loving one another.","label":0},{"review":"The love story between mastani and bajirao is just beautiful. How a brave warrior who is an winner on the ranbhoomi loses himself in front of circumstances In between his love and him. \nAn amazing amazing movie. Ranveer's acting is just astounding. No words. Hats off. Deepika and Priyanka  both are just so beautiful and wonderful. AMAZING. TRULY BLESSED.","label":0},{"review":"A periodic movie shows how powerful Indian Ruler like the great Peshwa Baji Rao was who could challenge Mughals & Nizam. This movie also shows his personal side that he fell in love with a Princess whose name is Mastani. They both were made for each other & left for heavenly abode together.","label":0},{"review":"Shocked to say how blind and dumb we can bear to such an undermined acting over a horrible story telling... It feels like the country had to pay for an imbecile's love triangle..\nThough Sanjay Leela Bansali has offered so much more in his prior descriptions but this one is simply sad patrioticly as well dramatically..... Shame that people are overeating it as a family timepass","label":0},{"review":"I have watched this movie on tv with the family. It's has a interesting plot which based on our history. \nIn the movie , deepika padukone has done amazing work. Though I didn't like the dance of ranvir . He looks in the panic state. \n\nI would recommend this movie to all viewers. Singing deepika padukone is delight to watch.","label":0},{"review":"All SLB movies end in a tragic scene which makes the anticipation and the feel at the end very painful to watch. All the while his movies are absolutely worth watching more than once for the beautiful Sufi like songs and the visuals. Loved the movie albeit fictional.","label":0},{"review":"Very nice movie nice directions historical \nStory visible showing period interesting movie\n\nGood looking forward to hearing from industry association happy romance cool movie and handsome man strong man.ranveer Singh\nDeepika Padukone Priyanka Chopra \n\nPeriodically famous movie nice directions \nRoll pictures good\n\n\n\n\nHard working individual very much appreciated this position side good day once again I like your movie nice work intelligence rocking","label":0},{"review":"Priyanka Chopra was excellent. I couldn't stop starring at her. The pain, love, innosense, jealousy, angry, cuteness every emotion was portrayed perfectly. Ranveer singh was also marvelous. Deepika's dance was good but acting was average. Sanjay Leela bansali made another masterpiece. Music was great. Totally crushing it. 💖","label":0},{"review":"Nice cast with amazing dance numbers definitely a treat to watch especially the potrait played by priyanka chopra and deepika padukone... screen play is quite okay and same can be said about direction  but what stone millions of heart is the part played by ranbir singh...definitely the biggest start of younger slot of bollywood.","label":0},{"review":"To know our history must watch it atleast once.\nSanjay Leela Bhansali is known for these kinds of movies. But epic acting, music and drama showcased. Unforgettable experience by watching it.... Must watch on YouTube @ ₹25/- only","label":0},{"review":"It was truly an experience. Throughout the movie it was like an emotional roller coaster that left you even more intrigued than before. The storyline was quite thoughtfully done and the messages portrayed shows the extent of how strong influences can truly be. 10/10 would watch again.","label":0},{"review":"I get that it is based on history......I just do not like the characters bajirao or mastani. The story just glorifies infidelity, didn't think it deserved to be made into a movie.  \nActing however is really good! Movie is well made too. CGI towards the end does not look too good either.","label":0},{"review":"A great movie. I watched many times and I loved it. Ranveer Singh, Deepika Padukone & Priyanka Chopra's act are superb. Sanjay Leela Bhansali did a nice job.","label":0},{"review":"It's an amazing movie that I have ever seen. Excellent acting by all the actor and actress. And I want to greet thanks to Bollywood for making these type of topping movies.","label":0},{"review":"Nice love triangled historical based movie... Stunning sets and costumes bring  me to the ancient India... Especially the acting of Priyanka acting was really superrrrrrrrrrrrrrrrrrrrr.... Ranbir and dipika also acting good... Songs are very nice...","label":0},{"review":"Another best movie of Sanjay Leela . The Ranveer is awesome and Story is base on Bajirao. The climax not good as whole movie because Bajirao got mad so, this part is less impressive but all round is nice.","label":0},{"review":"one of favorite director and actors...thank you so much giving me a beautiful movie...bhansali production,and ranvir depika selute just..i haven't word to say but i'm die heart fan on this movies nd couple..respect director ..thanks a lot..","label":0},{"review":"BEAUTIFUL. VERY GOOD FILM AND STORY. AMAZING ABOUT TRUE LOVE AND LOYALTY. SAD AND TRAGIC FOR BOTH LOVERS. AS ONE CAN NOT SERVE TWO MASTERS.","label":0},{"review":"One of the best movies I have seen based on the life of finest peshwa. His skills, personal life, war scenes & true love have shown in a very elegant & classic way.","label":0},{"review":"This is one of the finest movies created ever. All the things in this movie are great whether it is direction, dialogues, songs everything. A must watch movie.","label":0},{"review":"Nowadays, people literally strive searching to watch such films, though some scenes might be flawed however this movie as a whole is fantastic! I will never get over this film!","label":0}]