[{"review":"Bollywood and Salman have mostly been associated with method films that guarantees success and fame almost always. But with Kabir Khan it is not same, even his perfect method films aren’t really those typical ones you see every other day.\n\n“Bajrangi Bhaijaan”, this year’s big Eid release, is a perfect emotional movie and makes for a perfect viewing. A god-fearing, Hanuman worshiping earnest Bajrangi who thinks even eating meat is a sin and entering mosque is taboo. The child actor Harshali Malho ...MORE","label":0},{"review":"Bollywood and Salman have mostly been associated with method films that guarantees success and fame almost always. But with Kabir Khan it is not same, even his perfect method films aren’t really those typical ones you see every other day.\n\n“Bajrangi Bhaijaan”, this year’s big Eid release, is a perfect emotional movie and makes for a perfect viewing. A god-fearing, Hanuman worshiping earnest Bajrangi who thinks even eating meat is a sin and entering mosque is taboo. The child actor Harshali Malhotra plays a mute six-year-old Pakistani citizen who accidentally strays into India and it’s her character that brings out the best from Salman Khan or Pavan as he is addressed in the movie. Lost, hungry and lonely, Munni aka Shahida sticks to Pavan and unable to shake her off, Pavan takes her home not knowing anything about her. The mute one communicates all her feelings through her poignant eyes.\n\nTheir bond is charming and their chemistry is mind-blowing. The innocent face of Harshali and vibrant expressions while leading him to India are some of the best moments of the movie.\n\nAs the movie progresses and Pavan starts looking for her parents and while he greets the crowd with Adaab instead of Jai Shri Rama while entering the Indian soil towards the end of movie, each of the moment are soul-touching. There are few moments where the peace angle is shown, the romance between Pavan and her school teacher Rasika. But the movie mostly focuses on the relationship between Pavan and the mute child Munni. You can sit back and let the plot take you for a ride into an area in world whose existence Indians don’t even acknowledge, POK. As Om Puri, playing a wise ‘maulana’ in the film, tells the hero: ‘thoda sa Kashmir hamaare paas bhi hai’.\n\nNawazuddin Siddiqui as the Pakistani TV scribe nearly steals the show with his story on the little girl lost in border. Flashes of Gaddar shows when Bajrangi decides to unite Munni with her parents across the border. This was highlighted much before the release of the movie. There is nothing really in the first half, the film starts in the second half when the character enters across the border. At 2 hours and 20 odd minutes, the picture is cool and entertaining. Climax is a bit stretched but the reasoning is logical and go with the flow. The movie has heart, its winsome, the picturesque scene based on POK are way too good.","label":0},{"review":"Amazing movie. Storyline direction was real good of this movie. Songs were real good specially chal bhaiya selfie lele re one my favourite song. Actors acting were superb specially nawazuudins Siddique character was superb as a journalist Chand nawab chawra reporting from Karachi . In real life also their is Chand nawab chawra. Real good movie. They have given message to us that we should always help that person when he or she is in trouble we should never make fun of that person. But other pers ...MORE","label":0},{"review":"Amazing movie. Storyline direction was real good of this movie. Songs were real good specially chal bhaiya selfie lele re one my favourite song. Actors acting were superb specially nawazuudins Siddique character was superb as a journalist Chand nawab chawra reporting from Karachi . In real life also their is Chand nawab chawra. Real good movie. They have given message to us that we should always help that person when he or she is in trouble we should never make fun of that person. But other person think that it's a burden to help that person but he don't no that if we help somebody we fill good and God will help us to. But we Indians are illterate that's the main reason\n.","label":0},{"review":"This is undoubtedly Salman Khan's best movie ever! What a masterpiece of a movie with: 1) one of the best stories presented on the big screen in the past decade, 2) unbelievable acting by each and every member of the cast, particularly Nawazuddin and the little charming girl - Harshaali, 3) some of the most soulful songs heard in the recent past, esp the one sung by Adnan Sami \"Bharde jholi mery\", and last but not the least 4) Salman Khan being at his best in all forms of acting, especially his  ...MORE","label":0},{"review":"This is undoubtedly Salman Khan's best movie ever! What a masterpiece of a movie with: 1) one of the best stories presented on the big screen in the past decade, 2) unbelievable acting by each and every member of the cast, particularly Nawazuddin and the little charming girl - Harshaali, 3) some of the most soulful songs heard in the recent past, esp the one sung by Adnan Sami \"Bharde jholi mery\", and last but not the least 4) Salman Khan being at his best in all forms of acting, especially his best emotional scenes ever. Salman Khan, aka Bajrangi will blow you away in this smoothly paced and highly entertaining + engaging drama - with Shahida by his side. A must must watch movie for each and every member of the family, friends, siblings, kids, partners etc etc.","label":0},{"review":"Salmaan: Bajrangi madad karegaa.....\nNawaazuddin: Pakistaan mein bhee..!!!!  \nNawaazuddin: Ab tho thoda nazaakath se chale janaab (asked salmaan to walk accordingly as he was acting as a woman in burkhaa) \nNawaazuddin: Ab is baar taaron ke neeche se nahee...visaa ke upar tappa lagvaake aanaa....!!\n\nGood films are being made always.  But...sensible films are made, very rare and the BB is the one best among them.   Actors are pushed behind the screen and the characters are stumped on the real grou ...MORE","label":0},{"review":"Salmaan: Bajrangi madad karegaa.....\nNawaazuddin: Pakistaan mein bhee..!!!!  \nNawaazuddin: Ab tho thoda nazaakath se chale janaab (asked salmaan to walk accordingly as he was acting as a woman in burkhaa) \nNawaazuddin: Ab is baar taaron ke neeche se nahee...visaa ke upar tappa lagvaake aanaa....!!\n\nGood films are being made always.  But...sensible films are made, very rare and the BB is the one best among them.   Actors are pushed behind the screen and the characters are stumped on the real ground.  Each and every character has been taken care of in the making of the film, very minutely, including the rickshaawala who shows the place where Munni is taken. All the crafts of the film proved to be the feast to the viewer.   The senses of the viewer are touched and moved.   What else the viewer needs to thoroughly enjoy the film...?? That is why, the film has become the favorite irrespective of all artificial barriers created by the Politics.","label":0},{"review":"I'm not a fan of Indian movies (In fact I hate them for personal reasons). The reason I came here n posting my first ever comment on a movie is that I ridiculously loved it... About a year ago, I caught a cold n couldn't go to work. My mom said now that u have a day off why don't u come over n I'll make garlic soup. I went n there wasn't any wifi, so had to watch what my mom was watching. At first, I resisted to watch but little by little I liked it n I tell u guys, it's a must watch movie befor ...MORE","label":0},{"review":"I'm not a fan of Indian movies (In fact I hate them for personal reasons). The reason I came here n posting my first ever comment on a movie is that I ridiculously loved it... About a year ago, I caught a cold n couldn't go to work. My mom said now that u have a day off why don't u come over n I'll make garlic soup. I went n there wasn't any wifi, so had to watch what my mom was watching. At first, I resisted to watch but little by little I liked it n I tell u guys, it's a must watch movie before u die :)\nIf I have to describe this movie for u, I just say one simple sentence:\nPURE LOVE\n11/10","label":0},{"review":"Amazing movie. Inspiring and touching. Songs are very melodious. Subtle and sensitive movie on Indo-Pak relationship, and highlights how these 2 countries with different cultures can peacefully co-exist. It is a relief from typical Bollywood mainstream movies, which usually have a romantic relationship as it's central theme.","label":0},{"review":"I know this is very hard to believe topic in real. But after all this is just a movie and what a movie this is Awesome!!!. Everyone in this movie has done justice in the acting department. All the songs are superb I personally liked Tu Jo Mila..... Over all a great package of entertainment. The last scene will make a stone to cry, it's that emotional. It's a must watch movie. Great job @Kabir Khan. Highly recommended.","label":0},{"review":"I have seen the movie with my parents in theatre. It has a very interesting story line. \n\nThe movie revolves around kareena kapoor \nand Salman khan. I enjoy the way kareena kapoor dances to the music chicken cuckoo coo. \nThe film makes me sad when daughter goes missing in the woods. \nHowever, about us , we enjoyed a family outing after a long time.","label":0},{"review":"🙏Bolywood star salman Khan's all movie I really like. I hope this movie will succee to learn people what is real mankind one day. There is no any religion in the world frist time. Only people make it among there. All Hindu, Islam, cristan and other religion is same because we are same boat brothers. The main religion is that \"Halps other \".\n  And I specially thanks flim maker kabir khan and his team and all the cast of this movie.\nAt last I request to kabir khan that make an another movie with  ...MORE","label":0},{"review":"🙏Bolywood star salman Khan's all movie I really like. I hope this movie will succee to learn people what is real mankind one day. There is no any religion in the world frist time. Only people make it among there. All Hindu, Islam, cristan and other religion is same because we are same boat brothers. The main religion is that \"Halps other \".\n  And I specially thanks flim maker kabir khan and his team and all the cast of this movie.\nAt last I request to kabir khan that make an another movie with a good sins.\n🙏🙏🙏","label":0},{"review":"Good films are being made always.  But...sensible films are made, very rare and the BB is the one best among them.   Actors are pushed behind the screen and the characters are stumped on the real ground.  Each and every character has been taken care of in the making of the film, very minutely, including the rickshaawala who shows the place where Munni is taken. All the crafts of the film proved to be the feast to the viewer.   The senses of the viewer are touched and moved.   What else the viewe ...MORE","label":0},{"review":"Good films are being made always.  But...sensible films are made, very rare and the BB is the one best among them.   Actors are pushed behind the screen and the characters are stumped on the real ground.  Each and every character has been taken care of in the making of the film, very minutely, including the rickshaawala who shows the place where Munni is taken. All the crafts of the film proved to be the feast to the viewer.   The senses of the viewer are touched and moved.   What else the viewer needs to thoroughly enjoy the film...?? That is why, the film has become the favorite irrespective of all artificial barriers created by the Politics.","label":0},{"review":"I have not seen a better film than this before. I have seen the film over 5-6 times, still the ending of the film makes me cry. Just one of those perfect movies which do not let you disappoint. Surely the best of Salman Khan, I even find it more entertaining than 3 idiots, Dangal, Chenai Express, PK and Secret Superstar. Harshaali Malhotra delivered one of the finest performance as a child actress. Hats off to the team.","label":0},{"review":"This is undoubtedly Salman Khan's best movie ever! What a masterpiece of a movie with. one of the best stories presented on the big screen in the past decade n  unbelievable acting by each and every member of the cast, particularly Nawazuddin and the little charming girl - Harshaali..some of the most soulful songs heard in the recent past, especially  the one sung by Adnan Sami \"Bharde jholi mery\".really liked the movie n everybody must watch it atleast once.","label":0},{"review":"Nothing to say about this movie ... The best film ever made in Indian Cinema... Just one word Goes For This film 'Beautiful' ... Salman Khan Is the Huge Megastar Of Indian Cinema And He Generally do Masala Movies But This Was Something Else.... We Can Call It A Magnum Opus ... a Film That Changed The Concepts Of Indian Cinema","label":0},{"review":"Heart touching Movie.. One of the best movie of Salman.. As I am Not Salmans Fan but still just love this movie.. Superb and fantastically directed.. Each and every characted , edition, Music, lyrics, Story Superbly Designed..","label":0},{"review":"SS. Rajamouli's father Vijayendra Prasad deserves credit for such an amazing storyline. The film did entertain us till the last breaking all box office records.\n\n The Qawwali performance by Adnan Sami is a special treat for Sufi music lovers like me !","label":0},{"review":"Salman's one of the best movie of his career. Deserves all the accolades. Can watch again and again, has a great repeat value. Movie excels in every department be it music, story, direction or acting.","label":0},{"review":"No doubt it's an all time blockbuster from Bollywood. Salman Khan has proved that he has gained a lot of experience since last two decades acted beautifully. Nawaz nailed with his character.\nSuperb movie. \nA must watch.","label":0},{"review":"Honestly I can tell you, I'm thinking a lot about this movie. #BajrangiBhaijaan is not just Movie, it's a gratitude of sweet gesture. It's a Humanity. It's a True revolution toward Brotherhood 👏👏👏👏👏 One of Best Bollywood movie ever ⭐⭐⭐⭐⭐\nAmazing performance of all Cast & Crews, especially #SalmanBhai ,#Kareena & Nawazuddin & Harshali 👍✌️👏","label":0},{"review":"Bajarangi Bhaijan was the Best movie of Salman Khan with a heart touching story. Munni's( Harshali Malhotra) acting was superb. Actually Salman Khan is not special for me but I love his realistic acting in this film. Must watch film!","label":0},{"review":"this movie is pathetic no story whatsoever\nacting zero \ni cant understand why indians show pakistani as \nbetter human beings than indians even tho they never miss a opportunity  to kill us or hurt indians \ni dont understand how that little girl started speaking \nEMOTION=CURE\nwhy are doctor in this world present \nanother illogical movie \nif my sister cant speak suddenly im leaving for school \nshe started speaking its that type of story and logic","label":0},{"review":"I have been a salman fan for ages and loved each one of his movies.   But with BB I felt he has done a wonderful and wise decision of his life by doing BB.  This is one classic of sallu.","label":0},{"review":"Its a very good movie. Its a movie about how a man help a little cute girl who is deaf and dump and miss from her mother. Really its not a story but its a alive history for all people. Help others especially like munni.","label":0},{"review":"This is one of the best movie done by salman khan♥️story of the movie is different coz now a days we only having those bf gf type and fighting movies but this movie gives a message \nWhenever I saw this movie I feel a satisfaction,a peace♥️♥️♥️love salman khan ,kabir khan💐💐💐","label":0},{"review":"Awesome. Probably the best acting skill ever displayed by salman after dabaang. He fits himself into the role of a innocent kind hearted man who takes the little girl back to Pakistan. Heartfelt story.","label":0},{"review":"Undoubtedly one the best movies of recent times. Salman Khan has given his best performance. A movie need not show hatred towards our neighbour to garner success. Love bonds all...","label":0}]