[{"review":"It is a very heart touching movies. Whenever I watch this movie, I start crying. The story and the song is very emotional.\nThe movie tells that a girl's childishness can ruin a person's career and the person who love that girl can consider you a cheater. I request everyone especially girls to watch this movie.","label":0},{"review":"I love this film bewafa sanam very much. And the songs of this film are very good. I like the songs  accha sila diya tune mere pyar ka and yeh dhoke pyar ke dhoke very much.","label":0},{"review":"I think is film k Actor ko or movie bhi bnani thi.Good actor.\nGreat msg.for our society for prison to make a good man.","label":0},{"review":"I like this movie songs music . and songs compose according to movie script as well as composition of music is super and it make it ever green and unforgettable .","label":0},{"review":"Krishan Kumar maybe a good actor with good scripts and a producers brother. But he really needed a good haircut & eyebrow job. Which really put me off in looking at his face.","label":0},{"review":"I love this movie, songs are amazing\nActor also amazing\n\nVafa na ras aai\nTuze oh har jai\n\nLove u guys\nWe have to remake this film","label":0},{"review":"This film is really heart touching every body . Their climax is super . when I I watch this movie really we can feel something.","label":0},{"review":"One of my favourite movie. Today's romantic movies should learn something from this masterpiece.","label":0},{"review":"The songs are quite emotional and impressive.. Love it.   The name of the movie indicates everything..","label":0},{"review":"About this movie i would like say that the songs were beautiful who has sung by sonu nigam","label":0},{"review":"I like this movie and it is very heart touching movie and i am looking for part 2","label":0},{"review":"WHAT TO SAY THIS FILM AND THERE SONG VERY VERY VERY GOOD SONGS AND NOW I LIKE THIS FILM SONG SO MUCH","label":0},{"review":"Awesome movie.  1st movie in the world. Movie story is awesome nothing to say!","label":0},{"review":"Very nice film.very heart touching songs .\nI like this  film very nice.","label":0},{"review":"Great movie... Awesome acting,  superb songs, mind blowing 🎤.","label":0},{"review":"Awesome  movie  songs are  so nice really heart touching songs i can't forget  this movie  songs","label":0},{"review":"This is a very good and emotional movie \n       I love this song and film","label":0},{"review":"There is no any alternate of this types of Indian Bollywood movies in the world.....\nDivine...\nThanks...Bollywood","label":0},{"review":"This movie is owsem and story of this movie is  very nice I love this movie very much this movie is emotional","label":0},{"review":"I love your film bewafa sanam  and her songs are all good very good songs","label":0},{"review":"Fantastic love story movie. My all time favourite.","label":0},{"review":"This movie vry good and heart you touching movie.  I like this","label":0},{"review":"This moives story was outstanding and songs lyric s are excellent","label":0},{"review":"I like most dis song becoz it is related in my lyf","label":0},{"review":"Seen the movie.. It got released today.. 23 yrs back.. Songs of and for love...","label":0}]