[{"review":"This film has everything in it ... COMEDY, SUSPENSE, DRAMA AND ENTERTAINMENT. A MUST WATCH FILM. 5 on 5 ratings from me. Just watched it for the 200th time on Zee Cinema. Still makes me laugh out loud. Never makes you bored 😁","label":0},{"review":"seriously, the best comedy movie i have ever seen. All the characters were so good, i don't know why bollywood stop making comedy movies like this. Nowadays, only overacting is spread not a natural acting.","label":0},{"review":"Superb movie... I think best jodi akki and govinda with paresh sir and rajpal yadav.. Pradarshan sir best comedy director in Indian cinema... Fantastic movie..","label":0},{"review":"Fantastic movie. One of the greatest hilarious movie ever made . Kudos to Priyadarshan & his all team members.","label":0},{"review":"I have a special talent for this movie. I can watch it for my whole life and still never gets bored. MUST MUST MUST watch movie!!","label":0},{"review":"Another classic comedy flick... Movies like these aren't made anymore. A true reminiscent of the good old days of Bollywood.","label":0},{"review":"Very very entertaining movie.\nDialogues are superb.\nMind-blowing comedy.\nI love this movie.","label":0},{"review":"One of the evergreen movies. Watched many times, never gets bored. Comedy and bit suspense","label":0},{"review":"Must watch movie. Very funny characters. One of the best comedy movie. 5 out of 5.","label":0},{"review":"This is the first movie I have watched in hall. Full with 😂comedy and 🎭drama and suspense.","label":0},{"review":"Fantastic movie... Funny intriguing dramatic... Overall it can be watched again and again...","label":0},{"review":"If u wann see real India must watch, this definitely inspire u motivate u inlife, full comedy .","label":0},{"review":"Badi vulgar comedy hai isme not a family film but one of the most entertaining film...","label":0},{"review":"Very nice movie, movie is full of suspense and comedy you can surely watch this movie.","label":0},{"review":"Comedy- 100%\nSuspense- 99%\nThrilled-99%\nMusic-100%\nDirection-100%\nI waiting Priyadarshan direction with Akshay Kumar, Paresh rawal, Rajpal yadav, and others.","label":0},{"review":"One of the must watch comedy movie... Climax was very funny...","label":0},{"review":"It's a very good comedy movie, I liked it very much","label":0},{"review":"An awesome comedic, good dramatic​ & nice Mysterious movie.","label":0},{"review":"My one of the best comedy movie ever","label":0},{"review":"Amazing movie... govinda and akshay done the fantastic job","label":0},{"review":"One of the most appriaciable comedy film for all generation.","label":0},{"review":"Full time pass movie. London streets were nicely shown in the movie.","label":0},{"review":"What a hilarious movie of all time","label":0},{"review":"Nice movie jokes romantic super Hills movies","label":0},{"review":"Akshay Kumar is outstanding love you AK","label":0}]