[{"review":"One of the besttt moviee everr😍.. Still in 2019 we love to watch it..🤗 Many memories are with this movies.. From Childhood to now..😊 Bhool Bhulaiyaa Is Love❤️.. Akshay Kumar Nailed It🔥😘.. No One Can Replace Akshay In This Series/Movie❤️.. No matter how much you watch you will gonna entertain..😉","label":0},{"review":"One of my most favorite movies. Awesome thriller. Suspenseful. Horror. Very good comedy. Akshay kumar ❤. You can watched over hundred times but you can't boar. Although it was remake of Malayalam movie Manichitrathazhu (1993) starring Mohanlal and Chandramukhi (2005) starring Rajnikant; it was more entertaining & good than originals. In childhood I was too much scared 'manjulika'....","label":0},{"review":"It is a wonderful film.Akshaykumar ,vidhya balan and all other actors do their jobs 100 percentage well.But some of them are saying this movie is better than its original.it is wrong.This movie is technically better but watch it's original version in malayalam (plz don't in Tamil they destroyed it.) 'Manichithrathazhu' starting Mohanlal , Suresh Gopi,Shobhana and directed by fazil .It's so natural and watch the amazing acting of Mohanlal and Shobana","label":0},{"review":"Amazing scarey movie. Storyline direction was very good of this movie . Actors acting were real good speciallys vidiya balans  ghost acting was very scarey and too good.  When I watch this movie in television I can't able to sleep at night properly.  It has been shooted in  Raj palace hotel jaipur in Rajasthan.  Nice movie. Her character was a mad person . But she played the role of  ghost character was truly good. Songs were real good. 100 out of 100.","label":0},{"review":"I remembered watching this movie with my family.. We enjoyed it thoroughly... But as a Bengali.. I should mention this that this movie has a great similariity with the movie called 'Rajnandini' starring prosenjit chaterjee,1980.i watched the latter recently.. And I was taken aback by such similarities. I don't know exactly whether it was mentioned or not.","label":0},{"review":"It is a must watch film. Such a fabolous work done by Vidhya Balan and Akshay Kumar. The film have every flavor to make it a blockbuster.  It has Comedy, Suspense,Drama, music,fear and dance. A little Action in the end...! What else do you need other than this.","label":0},{"review":"This movie is really awesome,and a little bit scary. I watched this movie every time when it comes on TV. The story of this movie is really good. And I want any director made sequel of this movie. Although this is copy. Many people think that this is copy of south movie Chandramukhi, but in real this movie is copy of Malayalam movie manichitrathazhu which was also a very good movie. But no comparison with bhool bhulaiyaa.","label":0},{"review":"Awesome movie and a must watch. Everyone has played their character perfectly.Especially vidya balan and akshay kumar. Vidya 's acting of manjula is commendable.Mystery is also very good.The soundtrack is also very intriguing.\nLOVED IT☺️☺️","label":0},{"review":"Wonderfull movie in every aspects..it has comedy,horror,emotions etc all in one..It is a remake of one of the best malayalam film \"manichithrathazhu\",and does not even give hopes for comparison as the orginal is far way better in all aspects..may it be direction,musics,narration,dialogues everything..thats why even the dialogues are copied in to this..but for one who didnt watch the epic manichithrathazhu ,this will be a wonderfull movie..","label":0},{"review":"It's an awesome movie.... I have watched it a million times and I know the story by heart but still it never fails to scare me....  Love it👍 Its my all time favorite movie","label":0},{"review":"This may be categorized as a horror movie but it is actually the most scientifically accurate movie bollywood has ever made without all the nonsense hindi movie ingredients but has good enjoyable light humor . This is an excellent psychological thriller.","label":0},{"review":"Akshay sir and vidya balan sherlie nice movie style handsome you can use this email address has changed from your side effects are not in use to the inbox so much for taking great weekend of June is very good afternoon love my thoughts good luck in finding best to keep you updated resume attached my updated profile photo gallery registered","label":0},{"review":"labon ko labon s.....well wht can i say about this song...this is my all time best song...movie is great i have watched it dozes of times.....masterpeice of Akshay comedy with royal palaces locations....and  k k  and shaan songs wht else u could need form a muvie","label":0},{"review":"As we know there are rare movies which we can watch again and again such as 3 idiots, 1920,etc...Bhul Bhulaiyaan is one of them and is the movie...jise kitne baar dekho bore nhi hoge...\nBest horror film..","label":0},{"review":"One the best movies I have ever seen. It's really amazing and a must watch. Inspire of watching it so many times, whenever I see it, the feeling remains of watching it for the first time","label":0},{"review":"I could not sleep when I saw Manjulika dancing towards the end.Her face,and her reactions,they were totally dangerous. I could not see the movie again after the release,until I grew up a bit. Totally amazing,I must say","label":0},{"review":"Terrific movie, keeps you glued to your seats until the end with mind blowing suspense and thrill.... I don’t even remember how many times I’ve watched it .. awesome movie..","label":0},{"review":"This movie is a unique one in terms of suspense movies. Although it has nothing to do with ghost or any ritual but the state of mind a person can get into & how to overcome it.","label":0},{"review":"This is a lovely movie combined with both comedy and horror. Amazing acting by AKSHAY KUMAR and VIDYA BALAN \nWatch this movie","label":0},{"review":"Blockbuster movie🎬,  strong acting by vidya mam,  akshay sir’s comedy,  best supporting actors,  best thriller+comedy.\n\nFormula of an amazing film = best thriller+best comedy,  and,  best thriller+comedy= BHOOL BHULAAYA....","label":0},{"review":"Superb! Comedy Horror film! Music, Story, Direction, Acting and so on. Definitely One of the best films of the decade.","label":0},{"review":"well,i like this movie especially Vidya balan's character.Her character is claimed to be suffering from a Multiple personality disorder\" which in fact IS a psychological disorder and is also coupled with \"split personality\" where a person does not recognise the identity one \"creates\" in a state of split,and acts on a story\\delusion.","label":0},{"review":"This movie have packed of everything  like comedy thriller etc. One of the best  movie I ever  taste","label":0},{"review":"Mere Dollna excellent song. It energetize our soul. Hats off to Priyadharshan. Best song to hear during Travel.","label":0},{"review":"I remembered watching this movie with my family in 2007. From that point, the excitement and the thrill has never changed.😍😍","label":0}]