[{"review":"Twenty minutes. That’s all it took for Bodyguard, the BBC show that debuted on Netflix the other day, to get me hooked. And I presume I’m not the only one, if the rave reviews and ratings the show garnered on it’s original release on the BBC network are anything to go by. In fact those very twenty mintues are all it took again for none other than Theresa May to switch off the show too, as she herself told the Press. Now, that should add some perpsective if you’re looking for some. Whatever you h ...MORE","label":0},{"review":"Twenty minutes. That’s all it took for Bodyguard, the BBC show that debuted on Netflix the other day, to get me hooked. And I presume I’m not the only one, if the rave reviews and ratings the show garnered on it’s original release on the BBC network are anything to go by. In fact those very twenty mintues are all it took again for none other than Theresa May to switch off the show too, as she herself told the Press. Now, that should add some perpsective if you’re looking for some. Whatever you have heard or read about the show is entirely justified I vouch, now that I have binged through the six seaons of some very  British intrigue and thrills. Come to think of it, from Sherlock to Line of Duty to The Night Manager, the BBC have proven time and again that when it comes to the very serious business of classy thrillers and gritty police procedurals, they are past and reigning masters.\n\nFor a show that moves at the pace it does, Bodyguard  touches upon on a range of issues from PTSD to xenophobia while telling a decent tale of intrigue. Hollywood has used all variants of PTSD to set the cash registers ringing right from the Vietnam War days  to the American campaigns in the Middle East and around but it’s not everyday that you get to see a troubled British war veteran on screen. In fact I’d go so far as to say that David Budd, the central character played passionately by Richard Madden is nothing less than a modern British version of  John Rambo, that quintessential poster boy of PTSD, on celluloid. Bodyguard was fearless too I felt for most part as it did not stick to stereotypes and shunned prejudice early on but it has to be said that it turned out to be a deftly played card of a plot twist which was indeed disappointing to an extent. Reminded me of the regular Dan Brown template for thrillers where every major instituition as we know it is attacked  and portrayed as agents of evil but the actual acts of crime turns out to be the doing of one deranged  mind. The writers have obviously heavily borrowed from current day British politics and the PM in Office currently was interestingly the Home Secretary too earlier, who is one of the main characters here, played by a short-haired Keeley Hawes. In a curious gender reversal of sorts the incumbent PM in Bodyguard resembled Boris Johnson and the Home Secretary is the one who is after his job here, deft sleight of hand by the writers indeed.\n\nApart from the writing, much of the intensity on the screen owes it to the performances of the lead actors, namely Madden and Keeley Hawes. Richard Madden who made a name for himself as the short lived but much loved Robb Stark on HBO’s Game of Thrones is the mainstay here and has delivered a moving and engaged performance. Keeley Hawes plays a character that has shades of the one she played in Line of Duty, to an extent and is most probably the reason why she was cast in the role of Julia Montague, the Home Secretary. Other actors who make more or less silent entries early on go on to make their mark towards the end. Nina Toussaint-White, Ash Tandon and Anjli Mohindra stands out in their roles and something tells me we’d be seeing more of them in the future as actors. Recent BBC shows have displayed active engagement in the cause of diversity when it comes to casting and is essentialy a reflection of the British society at large too I feel. Bodyguard is not without faults entirely but it makes for an engaging and intelligent watch. One thing I like about the BBC shows is that they are short but intense affairs in contrast to epics like Breaking Bad. Unfair, unnecessary and pointless comparision I agree but that’s just me and trust me I’m not complaining.","label":0},{"review":"Finished the whole season in just 1 sitting... Superb acting by the lead actors, Keeley Hawes and Richard Madden. I love each episode and I really cried and brokenhearted on the 3rd episode and almost died on the 4th episode........ Please bring back Julia Montague!!!  I made my own story for the next season 😂\nFirst the woman who stood there on stage wasn't Julia, it was an impersonator set up by the security services to protect Julia. The real Julia left the building already with her belonging ...MORE","label":0},{"review":"Finished the whole season in just 1 sitting... Superb acting by the lead actors, Keeley Hawes and Richard Madden. I love each episode and I really cried and brokenhearted on the 3rd episode and almost died on the 4th episode........ Please bring back Julia Montague!!!  I made my own story for the next season 😂\nFirst the woman who stood there on stage wasn't Julia, it was an impersonator set up by the security services to protect Julia. The real Julia left the building already with her belongings... That's why they were missing on the last episode. Then, while the 6th episode was happening Julia Montague was just watching and observing, she couldn't do anything because the security services were the ones manipulating the situation since the bombing really happened and Julia was again terrified, no matter how much she would want David to be by her side, she couldn't do anything because the security services was telling her that David was also a suspect, because having found out that David was connected to the shooter, Andy Apsted, the security services wanted to find out first if David was really innocent. On the second season, the above mentioned made up story will be revealed. Then, once again Julia will request that David Budd will remain her bodyguard/PPO and they will continue the investigation, and this time leading to Anne Sampson and what she is capable of doing. On this season, Julia is not the Home Secretary anymore, maybe she'll be the Prime minister or what... But Julia and David will continue their relationship and they will become the closest ever while they continue to fight for their lives for the sake of the ambition of Julia Montague as a successful honest politician. After that  maybe the producer can now think of something to eliminate Julia if they want... But not this second season yet... Please!!!! We want/I want more of Julia Montague. Bodyguard will not be the same without her character.","label":0},{"review":"From the get go it captures your attention and honestly I didn't breathe for first 15 minutes as it has such a nervy opening.\n\nRichard Madden who acts brilliantly and melts into his role which translates perfectly into pixels on the screen and **bonus points** he is as British/Scottish as the mighty queen.\n\nThe storytelling is very engaging (edge-of-the-seat) and it wouldn't be a stretch to call this one of the best thriller TV series of this year, so far.\n\nThe protagonist's (Richard Madden) eti ...MORE","label":0},{"review":"From the get go it captures your attention and honestly I didn't breathe for first 15 minutes as it has such a nervy opening.\n\nRichard Madden who acts brilliantly and melts into his role which translates perfectly into pixels on the screen and **bonus points** he is as British/Scottish as the mighty queen.\n\nThe storytelling is very engaging (edge-of-the-seat) and it wouldn't be a stretch to call this one of the best thriller TV series of this year, so far.\n\nThe protagonist's (Richard Madden) etiquette, charisma, tormented soul, mannerism and cool demeanor has a very James Bond-ish flavor.\n\nKudos to BBC one  for bringing this on.\n\nVery Highly recommended.\n\nP.S - I love the way he says Ma'am, it's truly captivating.","label":0},{"review":"It was fantastic!\nProbably the best british TV show I have ever seen.\n\nThe adrenalin rush you feel when watching is addictive  and the plot is faultless!\n\nI love that the main character , David Budd , had both outer ( his devotion to the case causes him to take career threatening actions) and inner conflict (a severe case of PTSD and emotional instability.)\n\nIm also pleased to say that it had a real solid season ending.\n(Most season endings are disappointing )\n\nIt is a bit overwhelming so make s ...MORE","label":0},{"review":"It was fantastic!\nProbably the best british TV show I have ever seen.\n\nThe adrenalin rush you feel when watching is addictive  and the plot is faultless!\n\nI love that the main character , David Budd , had both outer ( his devotion to the case causes him to take career threatening actions) and inner conflict (a severe case of PTSD and emotional instability.)\n\nIm also pleased to say that it had a real solid season ending.\n(Most season endings are disappointing )\n\nIt is a bit overwhelming so make sure your emosionaly ready before watching it.\n\nAnd the way he says ma'am","label":0},{"review":"Just finish watching this show, OMG this is amazing, it will take only few minutes to love this show and each episode is literally breathtaking and full of suspense. I don't get why people don't like its last episode or keep saying that it was becoming boring with each episode, all they are wrong. Infact it has become more interesting with each episode. This show is amazing and breathtaking political drama. Actors have done a great job everyone but specially i had never imagined king in the nort ...MORE","label":0},{"review":"Just finish watching this show, OMG this is amazing, it will take only few minutes to love this show and each episode is literally breathtaking and full of suspense. I don't get why people don't like its last episode or keep saying that it was becoming boring with each episode, all they are wrong. Infact it has become more interesting with each episode. This show is amazing and breathtaking political drama. Actors have done a great job everyone but specially i had never imagined king in the north in this kind of stuff, but madden's acting skills are superb. Don't avoid it by getting idea of it being a stupid romantic show, its a hardcore suspense drama. ❤️","label":0},{"review":"Masterpiece... Due to a tremendous plot It was catchy throughout all episodes. And brilliant performance given by Richard Madden shown every emotion in detail and well deserved to receive golden globe.. Apart from him, there are great supporting performances as well... Loved this series and waiting for next season eagerly.. With new assignment of BODYGUARD🙂","label":0},{"review":"(SPOILER ALERT)\nPossibly on my own here, as I know this is highly commended, but after all the hype was pretty disappointed with this series. \nFelt it was easily 3 episodes too long - granted not the last 3 as they were the only ones that had some suspense and intrigue.\nGeneral unlikeable characters and poor character development throughout. Attempts to give them depth or show compassion were pretty lame and underdeveloped - Julia, Chanel, Dave, Vicky. \nStrange and unbelievable relationships - D ...MORE","label":0},{"review":"(SPOILER ALERT)\nPossibly on my own here, as I know this is highly commended, but after all the hype was pretty disappointed with this series. \nFelt it was easily 3 episodes too long - granted not the last 3 as they were the only ones that had some suspense and intrigue.\nGeneral unlikeable characters and poor character development throughout. Attempts to give them depth or show compassion were pretty lame and underdeveloped - Julia, Chanel, Dave, Vicky. \nStrange and unbelievable relationships - David and Julia, Chanel and Aikens. \nThe whole plot was unraveled and too quickly and conveniently wrapped up in the latter episodes through rushed and implausible scenarios - giving viewers little time to relish in the reveal - organised crime link, Craddock, Chanel, Nadia etc.\n\nI’m all for gender equality in TV series as much as in the real world, but avoiding gender or cultural stereotypes became too much of a subtext here to the point of distraction, which culminated in Nadia’s reveal.","label":0},{"review":"BBC has done a commendable job. The plot is enthralling and the visuals, locations, technique, and acting are all top notch.\n\nStorytelling could be a little tighter - with a bit more emphasis on certain parts. Even so - it's an edge-of-the-seat thriller that keeps you engrossed.\n\n8/10. a brilliant watch - but there was scope to make it one of the best :)","label":0},{"review":"The advertising for this series, made me think that it was a kind of romantic drama. I took my time before watching it, because I really didn’t think that I would like it. Giving the series a chance, I found that it was nothing like I expected. The Body Guard, is a really well done political drama. The acting is good, and the cast is made up of some very familiar faces. I enjoyed the somewhat complicated plot, but unfortunately. There are some of those scenes, where it is obvious, that tension i ...MORE","label":0},{"review":"The advertising for this series, made me think that it was a kind of romantic drama. I took my time before watching it, because I really didn’t think that I would like it. Giving the series a chance, I found that it was nothing like I expected. The Body Guard, is a really well done political drama. The acting is good, and the cast is made up of some very familiar faces. I enjoyed the somewhat complicated plot, but unfortunately. There are some of those scenes, where it is obvious, that tension is artificially ramped up. Characters seemed to\nalmost gleefully jump to conclusions, and enjoyed being pretty obtuse. There is one scene, where I said to myself, “Why doesn’t anyone just tape the whole hand!??” All and all, this is a fun drama, and I understand why it got so much positive attention Internationally.","label":0},{"review":"At first, I found 'Bodyguard' difficult to understand, due to the English accent.  But within ten minutes, I was enthralled with the acting, the cast of characters and of course the MAIN ACTOR.  It is rare when a series ties up all the loose ends in a manner that is not contrived and novelle.  I especially liked the ending, which I will not share with those who have not yet viewed it. It's a first rate thriller with some very tense moments where I helled my breath.  In short, it's an excellent a ...MORE","label":0},{"review":"At first, I found 'Bodyguard' difficult to understand, due to the English accent.  But within ten minutes, I was enthralled with the acting, the cast of characters and of course the MAIN ACTOR.  It is rare when a series ties up all the loose ends in a manner that is not contrived and novelle.  I especially liked the ending, which I will not share with those who have not yet viewed it. It's a first rate thriller with some very tense moments where I helled my breath.  In short, it's an excellent addition to Netflix.","label":0},{"review":"This is one series you can binge watch to finish in one sitting although I'd recommend against it. Because it deserves your time and wont waste a bit of it I'm sure. Not binge watching will be hard as it would hook you up and will keep you on until you find those plot answers. Its riveting with drama, non-lame action, quickly raising heartbeats, very good twists and I don't have anything bad to say about it.","label":0},{"review":"Absolutely loved it. Made well, superb plot which all comes together in the end. BBC continues to prove their series on crime are way ahead of others in this genre. Richard Madden was perfect as the troubled soldier who struggles to deal with his personal strife while on duty..the Scottish accent is just so engaging.","label":0},{"review":"It grabs you in the first episode Luke nothing else. The ending however was very contrived. I couldn't be more disappointed by the way things wrapped up. That said I'm glad I saw the performances. The early lines were great. But someone tell me what happened at the end. Was it funding. Were there hopes for a second season. I don't want to spoil it but maybe everyone should stop at five episodes and make it all up themselves.","label":0},{"review":"Very unique yet seems all familiar in the beginning. But as each episodes and story progresses you are torn whether you want to root for David/Dave or crusify him for lying or withholding the truth. \n\nThe scene where he woke up and was wearing the bomb until detonating the bomb himself was very, very thrilling and next level nerve racking..... I couldn’t keep my eyes open!!!\n\nThe scenes were made as realistic as possible and the acting wasn’t cheesy or melodramatic. The characters were all compl ...MORE","label":0},{"review":"Very unique yet seems all familiar in the beginning. But as each episodes and story progresses you are torn whether you want to root for David/Dave or crusify him for lying or withholding the truth. \n\nThe scene where he woke up and was wearing the bomb until detonating the bomb himself was very, very thrilling and next level nerve racking..... I couldn’t keep my eyes open!!!\n\nThe scenes were made as realistic as possible and the acting wasn’t cheesy or melodramatic. The characters were all complex and non-traditional hero/heroine type.","label":0},{"review":"I honestly did not know what to think going in. Despite that, this show got me hooked instantly! Complete with so many plot twists with massive payoffs. the good guys are the bad guys are the good guys. I loved it, and the season ending really brought things to a spectacular close! With a nice heart warming happy ending to boot. I definitely recommend this show without a single hesitation!","label":0},{"review":"I just finished watching all 6 episodes, I couldn’t stop. I got hooked within minutes and enjoyed the show immensely. If you like Richard in GOT, you will love him I n this role, really showed off his acting.  The supporting cast is superb. but I’m a little bias.  I love British shows, excellent writing,smart, well acted, and respects audience/viewers. And this show lives up to all that, thanks BBC. Hoping for maybe a season 2?","label":0},{"review":".I just have finish all 6 episode.last episode is awesome..  On of the best tv thriller show of 2018. Brilliant performance by rechard madden and keeley hawas nd supporting staff also done great. you cant predict anything about story till the end... I absolutely impressed by the quality..highly recommended...","label":0},{"review":"It is a fantastic show from start to finish and superb ensemble of actors and actresses.  It makes you suspect so many different characters throughout and at the end you are so surprised by how and who is the traitors are. Jed Mercurio who wrote the series is a fantastic writer that he keeps you guessing all the way through the show.  Well done for a great show hope there is a season 2","label":0},{"review":"This show is awesome and I hope there's more to come! If you like political dramas, cop shows and the like; binge watch the Bodyguard! They also tackle ptsd in this show via the main character which is a noble thing to do. The acting is top notch by all involved. Entertaining from beginning to end! Britain, you've done it again!! Cheers!","label":0},{"review":"Fine entertainment, enjoyed this series very much. Richard gives a remarkable performance as the Bodyguard. Met him today at the BAFTA party in LA, very nice Scots Lad with a good heart. His Mother was reminding me of my Scottish Mother too .  the Bodyguard is a addictive show . I'm hoping they will film more.","label":0},{"review":"The first episode gets you hooked on the show, but things start to slow down gradually until the pace picks up again towards the end. A very short series, only 6 episodes, but with each episode almost an hour long, there's a lot of time to build the story. A very thrilling finale where all the questions are finally answered.\n\nA good show for people who like thrillers or political dramas.","label":0},{"review":"I checked this series out because it popped up on my Netflix screen not knowing anything about it. Then I lost an entire day! Could not drag myself away from the action. I love this genre and can say to anyone like me this series is one of the best I've seen. At no stage did I feel the sense of.. 'I knew that was going to happen'.. even up to the last scene. Looking forward to series 2. Though somehow I can't imagine how this can be topped.","label":0},{"review":"The best till now for me .\nPlease give a shot. 1st 15 min ,you will be highly thrilled ,you can't even blink.the way David budd dealed with situation is amazing and his acting makes you fall in love with him.\nMa'am - pleasing word when he said .\nMust watch if you are a thrill loving person.","label":0},{"review":"Had me at the edge of my seat the whole bloody time, I was absolutely impressed by the quality of this show and the genuine feelings it made me feel. In most shows, you know the character is going to end up completely alright and unscathed but in Bodyguard I didn't entirely know where it would turn. The drawn out intense sequences amplify the anxiety felt by the viewer. \nCan't wait for the next season!","label":0},{"review":"Honestly, I loved it. After the void that money heist left, this is the first show that filled it. The story is very carefully built and you cannot stop watching even if you try. Richard Madden is a revelation on screen and your eyes are glued to ever micro-expression he makes. I couldn't stop binging on this even though my eyes ached with sleep. Every time I decided that it was the last episode happened, something happened that left me too numb to discontinue. It was a 6 episode extravaganza an ...MORE","label":0},{"review":"Honestly, I loved it. After the void that money heist left, this is the first show that filled it. The story is very carefully built and you cannot stop watching even if you try. Richard Madden is a revelation on screen and your eyes are glued to ever micro-expression he makes. I couldn't stop binging on this even though my eyes ached with sleep. Every time I decided that it was the last episode happened, something happened that left me too numb to discontinue. It was a 6 episode extravaganza and people need to watch this.","label":0}]