[{"review":"Though I watched this movie at least 30 times.. several questions trouble me every time I watch. Below are the questions that trouble me and I feel the answers aswell indeed are correct to my opine.\n\nI feel, this movie should not be watched as a relaxation of 3 long hours and then forget the emotions that aroused while watching.\n\nInstead feel the pain, emotions, eagerness for the families of Army personnel who are awaiting with tonnes of hope for their safe return from unforeseen circumstances.\n ...MORE","label":0},{"review":"Though I watched this movie at least 30 times.. several questions trouble me every time I watch. Below are the questions that trouble me and I feel the answers aswell indeed are correct to my opine.\n\nI feel, this movie should not be watched as a relaxation of 3 long hours and then forget the emotions that aroused while watching.\n\nInstead feel the pain, emotions, eagerness for the families of Army personnel who are awaiting with tonnes of hope for their safe return from unforeseen circumstances.\n\nThis movie is a Great Welcome opportunity to Individuals as well the Government to Eradicate unemployment to a Maximum extent.\n\nFor Individuals, who say they are not getting enough job for their talent or Salary not satisfying their present employment then at least support the Nation in any Cadre instead of being idle and atleast with this you'll stop giving idiotic comments..which are truly not worthy..because you do not know the pain the Army men and their suffering families.\n\nFor the Government, when the Government has a capability to grab the land and pay compensation, then why not the Government can't go ahead and take one child from family On Demand and pass the Ordinance as such to join ARMY based on their Qualifications and Capabilities...irrespective of the parents capability whether Minister, Business man, etc.. as every individual who born as human being possess knowledge in some nor the other activities and Everyone who born have to face death one day. Isn't it???\n\nCorrect me if you think that I am wrong in my statements.","label":0},{"review":"Border is one of the best action war film in indian film industry. Actors have performed well in army uniforms. This movie also tells us the emotions and sentiments of war heroes. Music was melodious,lovely & soothing to the ears,songs like sandeshe aate hai, aye jaate hue lamhe & my foe, my brother are nice & melodious.  Jackie dada was like a quintessential Indian air force officers & I liked the way Sunny paaji, Suniel anna, Kulbhushan sir & actors played the role of army men. The dialogue sa ...MORE","label":0},{"review":"Border is one of the best action war film in indian film industry. Actors have performed well in army uniforms. This movie also tells us the emotions and sentiments of war heroes. Music was melodious,lovely & soothing to the ears,songs like sandeshe aate hai, aye jaate hue lamhe & my foe, my brother are nice & melodious.  Jackie dada was like a quintessential Indian air force officers & I liked the way Sunny paaji, Suniel anna, Kulbhushan sir & actors played the role of army men. The dialogue said by paaji \" hum hai toh kya hum hai, tum ho toh kya tum ho\" to dada was the best dialogue in the film. A cliffhanger  showing the entry of IAF in the  war was  my favourite scene in the film.","label":0},{"review":"Fantastic yet heart wrenching. Challenge you to find me a better Bollywood movie than this. This movie has successfully stood the test of time. Even after 2 decades of it's release, it keeps us gluded to the screen.\nThis is the best depiction of 1971 war. Everything orchestred in movie is taken from real life. The Indian military won the war despite many odds. The end of movie didn't glorify the victory but it bluntly and softly criticizes the war. It even acknowledges the lost Pakistani side. T ...MORE","label":0},{"review":"Fantastic yet heart wrenching. Challenge you to find me a better Bollywood movie than this. This movie has successfully stood the test of time. Even after 2 decades of it's release, it keeps us gluded to the screen.\nThis is the best depiction of 1971 war. Everything orchestred in movie is taken from real life. The Indian military won the war despite many odds. The end of movie didn't glorify the victory but it bluntly and softly criticizes the war. It even acknowledges the lost Pakistani side. The song by Hariharan \"mere dusman, mere bhai\" is a perfect harmony for peace. It demands peace for Pakistan as well as India.\nIn the course of movie you get so tangled into the personal life of soldiers that you literally cry at their death, be it an Indian soldier or a father cum soldier from Pakistan.","label":0},{"review":"Was in the 3rd standard when I first saw this movie with my family the very day of its release. Still get goosebumps on watching it. Possibly the best Indian war film ever made. All the actors were fantastic. Sunny Deol, Suniel Shetty, Akshaye Khanna, Sudesh Berry, Puneet Issar, Kulbhushan Kharbanda, Jackie Shroff, Pooja Bhatt, Sharbani Mukherjee, Tabu, etc. The songs still seem fresh and tickles those emotions which are closest to our heart. Wow. Love the movie.","label":0},{"review":"I am speechless about the movie. At the time of realese of the movie my hindi knowledge was not good and even l was not in a position to watch that movie, but after watching that one can realise the life of our soldiers. I just want to say that I have no words to pen down here. It has been impressed me a lot. Several times I have watched the movie and the movie is in my storage. the song sandese a..... is marvelous and I wish there should be a chapter  about   the dare devil briegediar Kuldip Si ...MORE","label":0},{"review":"I am speechless about the movie. At the time of realese of the movie my hindi knowledge was not good and even l was not in a position to watch that movie, but after watching that one can realise the life of our soldiers. I just want to say that I have no words to pen down here. It has been impressed me a lot. Several times I have watched the movie and the movie is in my storage. the song sandese a..... is marvelous and I wish there should be a chapter  about   the dare devil briegediar Kuldip Singh Chandpuriji in their studies. Bharat matha  ki jai ho. It is a fantastic movie that should be watched by every  indian.","label":0},{"review":"A breathtaking movie, which will give the watchers goosebumps. This true story will depict the Kargil war in which India lost many of her heroes..... I bet tears will fill the watchers eyes at the end. And Indians will be proud on their army  and heartbroken for the loss. The songs are beautiful, filling emotions in the heart. It's important for the coming generation to watch this to understand the power of emotions. This mover is beautiful......give it a watch.....","label":0},{"review":"Actors acting were very good and realistic . Really hats off to our indian soldiers . That time they didn't take care about their own life they were caring about our life seriously they are our real heroes and inspiration for us . Today they are there that's why we are relaxing under ac air conditioner . 7 th November is very important day armed forces day .","label":0},{"review":"Iam watching this over and over.   \nSongs are too good. In think it's underrated movie. Some Anti nationals dislike this movie because they exposed Pakistan.\n💯% true story so Pakistan banned this film.\nIf this films is released in 2019 it surely breaks all records of Indian cinema.\nThe casting is soo good .\nEvery actor deserves natinal award. Sunny Deol and Khanna deserves Oscar.","label":0},{"review":"My first ever movie i watched in theatre.  Still my most favourite war movie.  I still feel goosebumps wahile watching it. I have seen it mire then 50 times but still made me cry. Its amazing.  I love this movie and every emotions aroused.","label":0},{"review":"Border Movie is very best movie A band of 120 Indian Soldiers in Longewala region defend their post all night 2000 Pakistani Soldiers Servive they assistant for the Indian air force The next morning And With movie Actors Sunny deol , Jackie Shroff , Sunil sheety , Akshaye Khanna , In 19971 The border region of Longewala a small battalion of the Indian Soldiers \nGenres - Action , Drama , history , war\n\nBorder Movie Release date 13 Jun 1997 India\n\ndirector - J.P Dutta","label":0},{"review":"A must watch movie for the Generations.\nA legendary story based on 1971 Indo-Pak War. The film well describes the human feelings & humility with a message that war never benefits.\nAlso describes the life & sacrifices of the Soldiers for their respective Countries.","label":0},{"review":"This is the first Movie that I watched , when I understood what movie was ,in theatre, and probably because my father wanted to watch it because - Sunny Deol, this movies\nIs an awesome Movie with unforgettable music , emotions, and packed with feel proud scenes, also sacrifices losses of soldiers life personally.","label":0},{"review":"A movie full of patriotism. Explained every aspects of life of a soldier in Indian army. The beauty of this movie is its simplicity. The songs are full of emotion specially - (sandese ate hai )and (To chalun). Dialogue are motivating and energetic.","label":0},{"review":"There is no better movie for me than this . Right from the actors to the scenes to the setting everything was perfect . Just that when you see the stats where only 2 soldiers died during the battle , we may think it was overdramatized but without it the movie would have been too bland.","label":0},{"review":"Border is my one of the bestest favorite film in my life the great patriotism raised in my heart💜❤ after watching this film🎥🎬👀 love to jp dutta Sir and all actors of border including sunny sir who played the role of major KULDEEP Singh","label":0},{"review":"This is one of the best movie. This movie was watched by my father and now I am now wathing it , Still my and my father's favourite movie. At the last of the movie we can't stop our tears. I love this movie...","label":0},{"review":"A special movie that touches heart like no other movie perhaps because it is based on the 1971 war. A masterpiece from JP Dutta. All the actors involved were exceptional.","label":0},{"review":"It's not just a movie......It's a real victory of every Indian.....I salute to the real hero whom sacrificed for Our Country Specially the Brave Heart man Major Kuldeep Singh n further it is it was n it vl be the Best Favourite Movie of mine all the time❤🤘","label":0},{"review":"The Best Part of this Movie is its ending song, which says... Wat is not the good thing for anyone... Ultimately it gives sorrow.. Loss... Hope our neighbour watch this movie and get some gud thing from this movie...","label":0},{"review":"Think about the soldiers and their lives every time and love your nation. That's all I want to say \nLove the movie \nProud to be an INDIAN\nJai hind","label":0},{"review":"Everytime it comes on tv, everytime i watched it. To realise importance of will power, this is d best source. No need anyother thing. Jai Hind Jay Bharat","label":0},{"review":"Getting tears in my eyes ...loved the movie very much...i feel from the heart...the soldiers r fighting for us ...respect those men whether he is a sepoy or major or brigadier or general...all r ready to gave up their life","label":0},{"review":"One of the best actio-war films I had seen till now.\nThe film is very dear and heart touching to me especially because it's real.","label":0},{"review":"this was my first movie which I watched in theatre at Rajasthan, even my dad served 26yrs of service in Indian ARMY, wonderfull super heart touching best of the best Bollywood movie ever I am from bangalore","label":0},{"review":"Old is gold movie..still weep when i see this on tv. The harsh reality our army face in Border during war and how there family keeps hope for there well being.. salute to these people..","label":0}]