[{"review":"I have a lot to say about this film. \n\nTo start off at the obvious, Siddharth Malhotra has just the same appearance as that of Uri Boyka, if only they could imitate the fight sequences from Undpisputed II/III as well as the hairdo. \n\nThere is uncanny similarity in the whole storyline of the script to that of Warrior(2011). It goes as far as to keep the details of the last fight of the film the very same. One might think the writers of Brothers weren't very creative when it came to plagiarising s ...MORE","label":0},{"review":"I have a lot to say about this film. \n\nTo start off at the obvious, Siddharth Malhotra has just the same appearance as that of Uri Boyka, if only they could imitate the fight sequences from Undpisputed II/III as well as the hairdo. \n\nThere is uncanny similarity in the whole storyline of the script to that of Warrior(2011). It goes as far as to keep the details of the last fight of the film the very same. One might think the writers of Brothers weren't very creative when it came to plagiarising smartly. \n \nThe characters are the typical overly-used archetypes. If you've watched a few Hollywood mixed martial art movies, you will tire at the unoriginality of this film. \n\nThe fight scenes do not add up for the most part. Protagonists survive the worst of blows without almost any consequences while the opposition, despite obvious strength and weight superiority find themselves struggling helplessly by the end of all fights. \n\nAlso due to it's commercial-bollywood nature, the film overly invests in emotional dilemmas even when it is, arguably, completely unnecessary.\n \nIn conclusion, it is produced by Karan Johar.","label":0},{"review":"BROTHERS\n(sport/drama)\nToo much drama in a sport movie, they just kept on stretching the scenes which were unnecessary. Actually there was only one scene which will give u the motivation,the adrenaline rush you expect from a fight movie. They could have gone Easy on the emotional part of the movie.\nThe cast has done wonders in making this movie good.\nOverall above average.\nMy rating 3","label":0},{"review":"It's a very good movie. It has a good story that will make you sit and watch this movie till end plus it has good action scenes. Akshay and Sidharth have  played the brother rivalry very beautifully. The other actors have also played their roles very nicely. The songs are also good. This movie is a must watch!","label":0},{"review":"Bro nice work intelligence rocking the best film nice work good movie and handsome man strong enough to be able you are so many people as possible because just be happy romance cool movie and nice work intelligence rocking Monty and David \nSiddharth Malhotra and Akshay Kumar \nGreat thanks very much appreciated your efforts and very happy gym is perfect role action really appreciate for your help and support to the first time cool and dry cleaning services and products","label":0},{"review":"Striking movie....made me so emotional...one of the best movies of Akshay Kumar and Siddharth Malhotra... expressions on Jackie Shroff's face were so natural.... Siddharth Malhotra just pushed his boundaries of his acting for this film.... honestly never thought he would do so well....well made...and yes songs my goodness... brother's anthem, gaaye jaa, sapna jahan...all are still in my playlist....man must watch.","label":0},{"review":"We can see it with so many expectings iam a big fan of akshay kumar by seeing rowdy rawthore brothers is a good movie we can see it don't miss the take the site and download akshay Kumar's and siddharth mahalorta's performance is very good the film 's +point is story and the film is a 100%entertaiment rate of story 5.4/5.5 rate of screenplay 5.3/5.5 rate of performance 5.5/5.5  film rate 5.4/5.5","label":0},{"review":"I feel very bad that how i skipped this movie all these days.i highly recommend watch this movie. Just beleive me and go on. I am sure that by the end of the movie you will appreciate it.i had a great time watching thos movie.","label":0},{"review":"Avoid the movie. Especially if you have seen Warrior before or if you are a fan of Mixed Martial Arts or movies about MMA. The fight scenes are garbage and the acting is pretty bad too. The editing is also really choppy. Watch Warrior. Thats a movie and a half.","label":0},{"review":"It was the best movie of my life it was kind of emotional at the end because of Monty who is siddharth I wanted him to win I was supporting him but he lost but Monty who is siddharth is stronger then david unreal life as well","label":0},{"review":"This  movie are awesome because in this movie show to learn  today generation don't fight your brother for property and and other reason if u r younger then care your smaller brother and you r smaller then respect  your elder brother in any reason and condition.","label":0},{"review":"Well it involves a great deal of emotion in this film..No matter how tough can u be there is always a soft spot in anyone.","label":0},{"review":"Some people may not like this movie as much as warrior but both the movies are equally good you cannot expect Hollywood level in Bollywood but this movie has surely increased the level of acting.","label":0},{"review":"Directed did what fewer he could , but what can you do more with a copied ( Warrior)plot , nothing  , not even 1% of original \"Warrior\" , that's why bollywood stinks ,can't they come up with original concept,rather than copied plot ..Shameful .","label":0},{"review":"Some people don't like it cz the original was better but take it as a Bollywood movie and u started realised it's a perfect motivational masterpiece movie 🙏","label":0},{"review":"A very good movie. I am quite surprised that it flopped at the box office. Garbage movies like Race 3 do 150 crore business and movies like brother flop. Seriously??????????????????","label":0},{"review":"The only reason this movie is praised is because it's bollywood's version of a movie called 'warrior'. If you were to compare the two, this does everything worse than its english counterpart, which is very disappointing.","label":0},{"review":"Absolutely terrific movie edge of your seat kind of movie, really enjoyed it, love, emotion, drama. Bollywood should make more movies like this.","label":0},{"review":"I found it better than Sultan....... May be the movie was npt publicised much.....or else it could have done much better performance at boxoffice","label":0},{"review":"Its a lovely movie about family emotions. Wonderfully played by everyone in the movie. Worth watching.","label":0},{"review":"It's my best and 1st movie on cinema hall\nWhich memories my 1st meeting with girl friend","label":0},{"review":"I am motivated from this movie \nAnd I like fight so this movie  is very good of every Indian","label":0},{"review":"this movie is copied from the hollywood movie warriors and added some bollywood overaction masala.\nbetter watch warriors movie","label":0},{"review":"BOLLYWOOD REMAKE OF TOM HARDY'S MOVIE WARRIOR.\nNO REAL KICK IN THIS REMAKE.\n2 STARS OUT OF 10","label":0},{"review":"This movie is replica of Warrior 2011 movie there is ni new story it's like cheating and making fool of audience.","label":0},{"review":"I have watched both the film warrior and brother But brother is very close to my heart.","label":0}]