[{"review":"Thinking in leftism is not bad, But if you want to be a revolutionist atfirst read more books ask more questions, \nIts a great movie indeed based on true fact. [A revolutionist is not against the country they are against the system]","label":0},{"review":"I have an deliberate questions to all who supporting this ism .The question is have you people ever make any changes to tribal life other than giving them weapon training. You people have enough money you can capable to make them self reliance. Instead you people making them killer .Killer of own country people.","label":0},{"review":"It was really a good drama. Its like a book when ever u read, you will get pleasure. \nMy favourite movie.","label":0},{"review":"So good movie very intresting and critical subject this is very necessary to solve this naksali problem for our contry and peoples i proud of u mr prakash jha for this moovie","label":0},{"review":"It is true that this is happening in our society and our poor tribals are being removed and only and always proud of prakash jha sir beacause sir understood feelings our society","label":0},{"review":"This movie is very good and this movie help us to think about both parties and help us to understand the situation of naxali","label":0},{"review":"It is Real.movie  which is based on present situation of Indian economy, parallel economy. Socialism. Privatization, globalization, and What is difference between the poor labour and Big business man","label":0},{"review":"A story of an brave, honest, positive and good National Police Services (IPS) officer and his best friend.","label":0},{"review":"Almost Based on Reality \nGood Movie \nSuperb Acting By \nAbhay , Anjali , And Arjun Rampal","label":0},{"review":"It is completely fictional movie ... don't take it seriously..In India thinking of left parties/ naxals/ maoists is only to destroy India by attacking the mentality of people of India","label":0},{"review":"I salute humbly to those who had the gut to make this film, lal salam.","label":0},{"review":"Had our think tank /high command /government taken a lesson from d film for a strong BHARAT MATA then her sons would have got a better lifestyle.","label":0},{"review":"Awesome movie which shows the fact of backward villages...\n✊✊ Lal selam","label":0},{"review":"Puneeth Rajkumar is super duper actor.He proves that through Chakravyuh movie.","label":0},{"review":"Very nice movie that touches upon the reality of today's India","label":0},{"review":"It is good movie and article role and movie a good letion","label":0},{"review":"Good  moovie , reveals real truth in a good way","label":0},{"review":"My favourite movie .manoj bajpayee is legand actor in bollywood .","label":0},{"review":"Fantastic movie with almost true stories","label":0},{"review":"Heart touching movie.this movie realise our socity","label":0},{"review":"Unapollogically Communist movie which supports communism ☭. Didn't like the message.","label":0},{"review":"Good movie . government should take lessons from this","label":0},{"review":"Really heart touching movie","label":0},{"review":"I have seen film is very nice","label":0},{"review":"Chakravyuh a very good movie","label":0}]