[{"review":"Movie has hilarious comedy scenes which make you laugh. But the movie looses grip in Second Half and you just try to stay away from movie in last 30 minutes as story gets boring due to unwanted family drama. But for the normal audience the movie is treat and a must watch.\nSongs in the first half were also good and well presented.\nRating:7/10.","label":0},{"review":"The best comedy India has ever made, clever, witty and with a slice of life.It remans true to the genre, even with such a simplistic story, and little moments between the dialogue you can spot Rajpal yadav giving the best comical expressions. No joke is bunt or out of place and the one liners are just awesome.","label":0},{"review":"Rajpal Yadav, Paresh Rawal and Om Puri will forever remain the legends of Indian cinema. Such brilliant acting performances. Shahid is probably the most versatile actor in Bollywood. Romance and chemistry between Shahid and Kareena fall short of expectations, but overall the movie is definitely a must watch.","label":0},{"review":"Its a movie that I have watch a number of times that is uncountable. The blend of sacrifices, helplessness and purity in God is perfectly depicted through this film. \nA picture that has moral values, divine and and stomach aching comedy, has everything that a movie should have.","label":0},{"review":"The true  conclusion of this movie is an unwanted man will became a good achievable person in his life the future will changes all the problems in life and finally lam really very happy to saw this movie","label":0},{"review":"One of the best comedy movie. Actors acting were truely good. Storyline direction was very good. Dialogues were fabulous . Really fantastic movie.","label":0},{"review":"It's worth movie to watch these epic \"Emotional Romance Comedy\"\nmovie.It have lots of funny scenes to laugh and her all songs of the movie were very immensely superhit..!","label":0},{"review":"I don't know why it received negative reviews from critics despite having a good story with lots of humour, you will always enjoy watching this film again and again.","label":0},{"review":"Nice movie & Full entertainment. Heart n soul full of hap with happiness n joy  movie..    ..   i am glad to watch again n again.","label":0},{"review":"This movie is one of the best comedy movie in bollywood film industry. All the characters have played very well. Specially Rajpal Yadav....","label":0},{"review":"Me and family has watched this movie..more than times..Such a hilarious perfitmance by Paresh rawal and Rajpal Yadav..","label":0},{"review":"I think this is most underrated comedy film acting by shahid kapoor, rajpal yadav and paresh rawal is hilarious... Especially rajpal yadav","label":0},{"review":"I have watched this movie on 1 November 2017. yrrr this is the finest movie among Bollywood everything you can get this from movie 10/10","label":0},{"review":"this movie is beautiful movie \nKareena Kapoor, shahid kapoor, rajpal yadav, paresh rawal, Suniel Shetty and more\nthanks you \nkishan nishad","label":0},{"review":"IT IS THE REMAKE OF BLOCKBUSTER MALAYALAM MOVIE STARRING DILEEP IN THE LEAD ROLE.CHUP CHUP KE IS NOT ENTERTAINING UP TO THE LEVEL OF PUNJABI HOUSE BUT A DECENT WATCH","label":0},{"review":"30-45 mins ki Paresh rawal sir and Rajpal yadav ki comedy ek taraf and baaki full movie ek taraf.. the comedy portion is that AWESOME.. 💥💥💥💥💥","label":0},{"review":"Excellent Movie by Priyadarshan. One of the finest movie","label":0},{"review":"One of the best movie you can watch with family and needs sequel or remake.","label":0},{"review":"Beautiful movie. Comedy by Presh Raweil is marvelous.","label":0},{"review":"Great movie with humour full comedy made my day whenever I watch it","label":0},{"review":"Ya this movie is best comedy an acting raj pal yadav movie in openly comedy nice","label":0},{"review":"Actually this the remake of a malayalam movie named PUNJABI HOUSE (1998).each and every story line is same ,the  only difference is change in characters and language.anyway enjoyed it","label":0},{"review":"Very clean and genuinely funny movie. First class performances","label":0},{"review":"It's a great movie with excellent comedy+ great fun + good acting + good songs + good casting + good story + good ending.","label":0},{"review":"This movie is really beautifull ,i like this movie & i was watch this movie every time","label":0}]