[{"review":"I love this movie and acting done by shilpa and her parents. The story line is great and the movie has love, friendship and family drama. This is all time favorite one and love the songs which are really soothing ones. I like akshay kumar as actor and in this story he started his marriage with friendship and then it took some time to go to other level which is love. I recommend and rate it 4/5.","label":0},{"review":"Wonderful Film It has so many emotions and traditional values which lack in today's society. I think today's society should learn from the film. Songs are great I like Nadeem-Shravan for their music. So many memories of past come to my mind when I listen to the songs. Waiting for a fully traditional and good sequel with music by Nadeem-Shravan.","label":0},{"review":"This movie has been delight 2 watch for everyone.. Big big hats off to akshay kumar.. who just nailed it... Bcz in that era he was regularly doing action films.. and he suddenly turned himself towards this serious role..Wow💝his expression was awsm plus dialogue delivery... The USP💝💝💝💝💝😘","label":0},{"review":"I love this movie but I felt the ending could’ve been much much better. I hated how the movie ended it’s like it’s saying love is easy to lose. I feel that every person she have a chance even after the movie. (Spoilers ahead) Sunil Shetty chases his dream girl Shilpa and she basically tells him to stop messing with her and she is pregnant. He then gets married to Mahima Chaudhry.","label":0},{"review":"I became nostalgic during watching. How a person can love to his beloved one. Great acting from Sunil Shetty and Shilpa Shetty. Really loved the acting of both of then specially for Sunil. The story based on a true love story..","label":0},{"review":"Here are my reviews\n\nVery lovely movie\n\nAkshay Kumar has done a brilliant acting. \nHe is my favourite superstar and Sunil\nShetty  was also good but not better than \nAkshay Kumar.Shilpa Shetty was looking nice.","label":0},{"review":"Not only then but today as well  , you would love to see it. It’s an awesome movie with with lovely music and heart touching performances, specially by Sunil Shetty.","label":0},{"review":"Best Movie...Best Songs....In my college time...Loved it\ndkan is fentastic movie and it's stars have given highest level of performance with good msg to the best of knowledge to the public in general. I think good msg is given to all viewers.","label":0},{"review":"Its really heart touching movie with excellent script and actors gave their best performances especially Dev's character played by Sunil Shetty sir couldn't be better done by anyone with such emotions.","label":0},{"review":"Its really heart touching movie with excellent script and actors gave their best performances especially Dev's character played by Sunil sir couldn't be better done by anyone with such emotions.","label":0},{"review":"It was a memorable film. The songs were melodious. The actors delivered the best of their acting. \nThe film was perfect on all tecnical fronts.","label":0},{"review":"Dhadkan is fentastic movie and it's stars have given highest level of performance with good msg to the best of knowledge to the public in general. I think good msg is given to all viewers.","label":0},{"review":"Sunil Sir had stood out among all as ruthless villain. His dialouges are really piercing way throughout the movie. Shilpa is graciously beautiful. Here is Akshay Kumar who delivered a towering performance. Thanks Shetty Sir.","label":0},{"review":"This is one of great movie of Sunil shetty..\nHis great voice, dynamic personality and extraordinary acting dominance all the actor in this movies.","label":0},{"review":"Good movie..Awesome acting. I feel once the girl is married...Then the earlier boyfriend should not interfere in her life. As he should have prepared himself earlier .","label":0},{"review":"really a heart touching movie, sunil sir's character was awesome, songs are also superb, thanx to the team of dhadkan for giving us such a wonderful movie.","label":0},{"review":"I feel kinda bad for Akshay Kumar . No should stay in an unhappy marriage. What if she could never feel Same about him ? Is it Right to stay in that type of marriage ?","label":0},{"review":"The movie is fine...i mean may be when it had released the story plot may appear too new and interesting to audience.....bt since i had watched it today.....i feel like the story and plot is very very common...i mean nowadays i can watch same story on most of the films..serials..web series....so i dont find this too much fascinating and interesting but still its a nice movie...acting..dialogue..execution every thing is fine....","label":0},{"review":"Great movie. Passionate love for each other. But one lover taking wrong side to prove his love.","label":0},{"review":"Amazing movie.❤... I got too much emotional in between the movie and after watching this movie\nAll actors act outstanding!!!!😍","label":0},{"review":"nice movie.. but climax is not good. what is the purpose(intent) of the movie..???. The movie ends with \"If someone love you  so much then forgets that someone after making some love with.. nd if a nice persons meets you then  love to him..\"  means this show lost of true love.","label":0},{"review":"One of the most magnificient film ever.  I luv it. I hope god send me someone like ram !","label":0},{"review":"At that time, it was a great movie. Emotionally intense.\nAnd some of the dialogues stay with you always.","label":0},{"review":"This film was so fantastic. ...all the characters  were their best....it is a must watch film","label":0},{"review":"Best movie... Dialogue is very very nice..So gs are awesome ...All in all top class movie.","label":0}]