[{"review":"Much contrary to its poor ratings, this movie is a delight to watch. The script however not very novel still has a freshness and the good performances by Rakhee, Priyanshu Chaterjee, Arjun Rampal, Isha Kopikar and in parts Aishwarya Rai lends it the emotional depth which such stories demand. The script is convincing as Billionaires son Jai Mehta( Arjun Rampal) sees Tia( Aishwarya) and falls for her. Arjun’s charms lend the initial scenes such raw appeal. He is heartbroken when he learns that Tia ...MORE","label":0},{"review":"Much contrary to its poor ratings, this movie is a delight to watch. The script however not very novel still has a freshness and the good performances by Rakhee, Priyanshu Chaterjee, Arjun Rampal, Isha Kopikar and in parts Aishwarya Rai lends it the emotional depth which such stories demand. The script is convincing as Billionaires son Jai Mehta( Arjun Rampal) sees Tia( Aishwarya) and falls for her. Arjun’s charms lend the initial scenes such raw appeal. He is heartbroken when he learns that Tia loves an orphan Raj( Priyanshu) but is given hope by his father Paresh Rawal and best friend Isha Kopikar to pursue her. Arjun has surprisingly nailed the expressions of hope and despair in love and looks irresistibly handsome. He pursues her till he realises that she and Raj are happy together but never stops pining for her even after she is married and has a baby. \n\nEverything changes when in inebriated state, Jai’s car hits Tia and Raj’s car in which Anita and Raj die on the spot and Tia loses her memory. \nGuilt and grief striken Jai accept his fault to Rakhee and pleads for punishment and asks for the responsibility of their family. Rakhee hates him but agrees to go with him to South Africa as doctors have warned them not to make Tia remember anything as this may prove fatal to her health. \n\nJai gets the companionship of Tia, whom he always yearned for but his guilt conscience makes him stay away from her. His conflicted emotions are portrayed very well and his pain looks realistic.\nHe craved for Tia’s affection all his life and it was breaking him all the more when he was pushing her away which give some beautiful emotional scenes in the second half.\nIn the end everyone accepts Tia but Jai and all ends well when he reveals the truth to her and is forgiven. Paresh Rawal also reveals about Jai’s love for Tia from the beginning which she doesn’t remember and nobody else knows.\nAishwarya has looked very gorgeous but her acting is sub standard. Her way of acting, her over expressions were always annoying in the initial years of her career. She gave some career best performance later like Hum Dil De..., Devdas etc but this film shows her mettle only in parts. \nShe gets the most meaty role but doesn’t shines even as a daughter, mother or lover. I preferred Arjun performance so much more, it was nuanced and emotional and in a short role Isha Kopikkar shines. Priyanshu initially is annoying but later holds well and Rakhee are a stern mother is convincing. Paresh Rawal is as usual good.\nAll in all it was a nice film which I watch whenever it comes infront of me.\nI give it 3.5/5.","label":0},{"review":"it is a beautiful movie which runs with emotional and lovely story line. But it was unable to make financially well as the audience mostly connect to entertainment than emotions. It is a great movie to watch","label":0},{"review":"Truly a heart touching story &of course cryful too,d dialogues,d chemistry & d twist is beyond it.I truly loved it it's a very heart touching&  cryful story.i loved it after THE INTERMISSION....script is really vvvvv GOOD!!!","label":0},{"review":"Dil ka rishta bada hi pyaar hai....\nSimple love story becomes complicated when Arjun rampanl car hits preeti zinta husband and he dies, preeti zinta looses her memory and at end every thing is right. 03/06/19","label":0},{"review":"Such a great movie!! I wonder why the rating is so low...Arjun Rampal's acting is awesome...a great twist in the middle","label":0},{"review":"This is the awesome movie and Aishwarya Rai acting so fabulous. Amazing loving story","label":0},{"review":"Beautiful movie. And as well as beautiful heroine. Therefore I love the movie.","label":0},{"review":"It's very nice muvie and every actor had nice job specialy arjun priyanshu ash paresh tiku rakhi....","label":0},{"review":"Very nice film and the story was very emotional regarding responsibilities and love.","label":0},{"review":"There is a very good love story and a very good song, especially Daiya Daiya Daiya Re","label":0},{"review":"I like Arjun rampal movies his films touches everyone's lovers heart .","label":0},{"review":"Superb love story, i very like that type of movie","label":0},{"review":"Arjun rampal is too good in his character... \nLove him a lot 💕❤💕💕❤💕","label":0},{"review":"Musical hit, melodious king Kumar and Alka sung heart touching.","label":0},{"review":"Very touching love story...I love to watch every time on tv...","label":0},{"review":"One of the actor who is Mr. PRIYANSHU , i like him so mush more😊","label":0},{"review":"Mind blowing movie Arjun ralpal is a good acting","label":0},{"review":"I like movie he remembers always this type stories.","label":0},{"review":"She is very love story movie I liked","label":0},{"review":"Movi and all songs spr my feverit hero","label":0},{"review":"Best ever film for true lover","label":0},{"review":"I love that song ....love to see move..very very 💓 touching movie...","label":0},{"review":"Nice movie based on love story","label":0},{"review":"i like this movei i am enjoy the movei","label":0},{"review":"Love story is so nice","label":0}]