[{"review":"Dil chahta hai...my all time fvt...3 types love  showed by 3 bloosom frs. I think sid is right in his own way ; he loved truly without self .Although society may oppose. He has no any harm thought. Love is not sin atall with no bar of age status caste religion complex language regionality natlity high low level. Love creates from deep heart and soul only.But his shorttemper nature broke connection with Akash.Actually he wrongly took Akash joke. Akash had no idea of love , he is pure. \nSameer : t ...MORE","label":0},{"review":"Dil chahta hai...my all time fvt...3 types love  showed by 3 bloosom frs. I think sid is right in his own way ; he loved truly without self .Although society may oppose. He has no any harm thought. Love is not sin atall with no bar of age status caste religion complex language regionality natlity high low level. Love creates from deep heart and soul only.But his shorttemper nature broke connection with Akash.Actually he wrongly took Akash joke. Akash had no idea of love , he is pure. \nSameer : the peculiar fickle mind  turned 2 a real lover & also gave good msg 2 youth.\nAkash Casanova is my fvt character.  Bcoz he realized enchanted discovered  love theme ...THE TRUE LOVE.  They had good friendship  eachother.   This film can be watched many times anywhere  anytime..masterpiece  of  farhan. Personally I watched 16 times only till today.Aamir as akash fantastic look dacing getup .my heart cryed having watched his emotional look.l m glad as he choosed Akash role instead of sid role .l found this more interesting than other  two. Farhan idea proved as wrong.\nMusical track thrilled me.. good narration . Akash proposed dramatically. So excitement. One thing if matter is all abt propose so quickly perform it at right time. Never delay....  Nt mainstream movie  still an iconic 4ever.  The moment  sid lost her lady love and all frs became very sad ..very sensitive moment . Age no matter but sincerity impt...Nice movie ..Love is sensitive emotional natural part of life . Any way though  pvt still  TRUE LOVE  mandatory.   I learnt  many voluable  things  from it .  I must Watch it many times  .  Plz regularly  touch with this outstanding movie  ..Each time after watching  dch I found myself very stressfree relaxed tensionfree bindas. I think this is the real charm effect of Dch.That's why I can watch it 10k times without feel boaring.make ur friendship special with Dch plz guys!! Preity is so cute bubbly.Aamirkhan and  akshye khanna  both r very goodlooking charming and dynamic personality...\nTake care . Good luck 2 all viewers . Shanti shanti shanti. NAMASTE. Siddharrth  tum aur main hamesha............","label":0},{"review":"Undoubtedly way ahead of its time. Though upon releasing in 2001 it was able to achieve very word of mouth popularity especially in urban areas. Grabbed some awards and became a cult classic as in farhan akhtar's debut directorial. The part which I liked most is the casting of the movie. Aamir, Saif, Akshay were somehow a strange combination back then. But they turned out to be one hell of a trio! This coming of age, mature friendship story became so legendary that they came up with another one  ...MORE","label":0},{"review":"Undoubtedly way ahead of its time. Though upon releasing in 2001 it was able to achieve very word of mouth popularity especially in urban areas. Grabbed some awards and became a cult classic as in farhan akhtar's debut directorial. The part which I liked most is the casting of the movie. Aamir, Saif, Akshay were somehow a strange combination back then. But they turned out to be one hell of a trio! This coming of age, mature friendship story became so legendary that they came up with another one with the same concept: ZNMD! That too was very good, but to me DCH is the clear winner here. Nowadays, I have no idea why farhan akhtar goes more with acting and keeps himself from being such an awesome director!","label":0},{"review":"Definitely any1 can go 4r d movie. Lots of things feelings r related with every scenes of d movie. How with tym emotional n mental values change r  well portrayed here by 3 talented actor over d writings of Farhaan Akhtar.Friendship is d real treasure of ur lyf,u can live without family but not without true friend/s. The film might rekeased in 2001 but shows us d actual mirror of our current society. Value love friendship n ur real feelings,thats what u can learn from this coming on age movie.","label":0},{"review":"Amir as - Akash\nSaif - sameer\nAkshay khanna - siddharth\nPreety as-shalini\nWhat a movie........................... \nDil chahta hai \nKoi khahay kehta rahay \nTanhaye \nWoh ladki hai kahan \nJane kyun loog pyar karte hai.. \nThese songs were composed within a week. \nHats off to shankar - ehsan - Roy.\nSome scenes are excellent like :\n#1. Movie starts in present then goes back in past. Starts in a hospital where dimple is admitted.\n#2. When Saif pranks amir in a pub where he teases shalini (preeti).\n#3.  ...MORE","label":0},{"review":"Amir as - Akash\nSaif - sameer\nAkshay khanna - siddharth\nPreety as-shalini\nWhat a movie........................... \nDil chahta hai \nKoi khahay kehta rahay \nTanhaye \nWoh ladki hai kahan \nJane kyun loog pyar karte hai.. \nThese songs were composed within a week. \nHats off to shankar - ehsan - Roy.\nSome scenes are excellent like :\n#1. Movie starts in present then goes back in past. Starts in a hospital where dimple is admitted.\n#2. When Saif pranks amir in a pub where he teases shalini (preeti).\n#3. When Saif  is in amir home and he gets call of his gf and goes to meet her and amir says he was not with us....\n#4. Amir Khan says in aeroplane scene with preeti that we 3 are going to Sydney  i. e me, u and plane.\n#5. Amir becomes more matured when he goes to Sydney.. Preeti boyfriend breaks his heart.\n#6. There will be a misunderstanding between amir and akshay regarding dimple and akshay slaps amir.\n#7. Dil chahta hai song is fabulously being shoot while they are going to goa..\n#8. Saif follows his would be fiancé to restaurant with her BF and there will be little comedy scene when he takes other chairs.\n#9. Amir leaves Sydney comes back and finally marries preeti\n#10. Amir at end while going somewhere sees his college and recollects his memories and finally meet akshay khanna.\n#11. Dimple dies at end and these 3 friends go again to goa with there gf but akshay khanna finds his gf there and finally film ends all of them having dinner... 🙏\n13_06_19....","label":0},{"review":"One of the most compulsive movie of the 2000s. The intense -packed comedy scenes, flamboyant acting and Farhan's splendid direction has marked an astounding milestone to Bollywood back in the 2000s with this movie. With an eclectic mix of romance and post-adolescence plot along with the character's wittingly hilarious postures, this blockbuster coming-of-age drama will never fail to hold your horses once you get on to watch it. Simply one of the best family-enterntainers of all time.","label":0},{"review":"My all time favorite movie, I have visited all the locations of Goa which were shot in this movie. In 2001 we seven friends planned Goa trip after watching this movie. All the songs were played on auto reverse cassette player non stop in my friends Esteem car.Way ahead of its time, the cast, direction and on set recording of dialouges, no dubbing I think, make it class apart. Hatts off to Farhan Akhhtar for making such a wonderful movie.","label":0},{"review":"This is my all time favorite movie! I must have seen it at least 10 times!!\nSaif Ali Khan just steals the show in this! It's funny, emotional, showcases the bond between friends and really struck a chord with the younger age group!!\nThe songs are amazing too!! This was a real trend setter","label":0},{"review":"One of most favourite bollywood movie. Storyline direction was too good. It's about friendship separation for some personal crisis.songs were to good. Nice movie. Actors acting were very good no daught about that . 18 years old movie . 2019 is going on . It was 2001 . Those days rehana hai tere dil main was super hit movie , khabhi kushi kabhi gam, and dil chata hai . Three movies were super hit .","label":0},{"review":"The best thing about this movie is the freshness. You will watch it in 2018 or 2030 or 2050, you can't say that this movie is old, That is the best part of this movie.\nI think it is way ahead of its time when it released in 2001, that's why people at that time criticized that the youth seen in this movie is too urbanized, that's why it was Semi Hit at box office.\nIf it released today it will be a blockbuster.\nA movie that changed Bollywood forever.\nHatsoff to Farhan Akhtar!!!!👍👍👍👌👌","label":0},{"review":"This is one of my favourite movie of all the time, One the best movie ever made on friendship and Love. Most of the films of Aamir Khan are good but this film is timeless classic, Aamir's script sense is excellent and Farhan Akhtar's direction is second to none. Other actors of this movie also performed very well making this movie a joy to watch.","label":0},{"review":"Story line - a new vibrant story present in manner for all generations and all gender\nActors skills - starting from Aamir Khan to saif ali to Akshay Khanna to Preity Zinta , to Sonali Kulkarni and other side stars . Truly played their part\nMusic - a good peepy to romantic to sad one all flavour blended together to give a perfect platter of cuisine\nDirection , edits , everything is and will remain flawless\nStill dil chahta hai something with that theme again.","label":0},{"review":"The one movie that changed bollywood movie narrative. This movie also was a benchmark in terms of marketing and had a awesome websites. \n\nUntil then bollywood made cheap slapstick comedy like babu no1 or raja babu and similar bollywood script writing changed ever since. \n\nBollywood movies can be divided into two phase pre dil chatha hai and post dil chatha hai.","label":0},{"review":"Dil chahta hai is literally chef,s kiss🔥🥳........ a cult classic.\nIts almost 18 years till it’s release but never gets old be it the phenomenal soundtrack by Shankar Ehsaan Loy,cinematography,screenplay and performances by the cast individually ! 👏 9.5/10 for me :)","label":0},{"review":"Awesome movie.. Can watch it daily.. This is a different kind of movie. Gives you fresh feeling and remains contemporary all the time. This movie motivate to unite with old friends..","label":0},{"review":"My favourite bollywood movie of all time...no matter how much bad your mood is this movie will not fail to bring a smile on your face...no matter hoW many times you watch it you will never get bored...cannot get this movie out of my mind.....i just love it....plzzz do watch this","label":0},{"review":"My all time favorite... USP Freshness... Beautiful potratraition of Friendship & Love. Movie connects naturally n unknowingly... I dont remember how many times I saw this movie n would watch everytime venever got chance","label":0},{"review":"Good enough to keep up the status of Bollywood film industry. Perfect mixing of humour and portrayal of life's inner happiness makes it worth to watch for all the age groups.","label":0},{"review":"Best movie best story. Love, friendship everything is there. No matter how many times you watch this you'll never get bored. 10/10 ♥️","label":0},{"review":"My best movie, reminds me of early high school days, love, drama, friendship it's got all the mix and at the end love wins and friends reunion. Young farhan aktars best direction.","label":0},{"review":"One of the best movies which brought new heights to Aamir Khan's career. This free-spirited film oozes slice of life Genre and definitely deserves your attention.","label":0},{"review":"The Bible of friendship, you can watch it anytime whether it's today or after 20 years, any situation whether Happy or Sad, the movie is all about Human Emotions and Ups N Downs in life and teaches us a very important lesson in the end that No fight or Issue can break the most important Bond of our life, one which we choose on our own - Friendship.","label":0},{"review":"Everyone will definitely have deep impact of one of the original Bollywood movie , I luv the casting, story and title Dil chahta Hai. Love relesationship friendship","label":0},{"review":"Akshay Khanna's character is something which is beautifully written and  original. I see some part of mine in his character. I really love his character. It's touched my soul.......","label":0},{"review":"I am damn sure who all watch this movie, will become emotionally strong as this is a whole some package of drama, love, affection, friendly bonding and much more.","label":0},{"review":"Perfect story for to movie with friends great works from all aamir .saif ali and akshay and also pretty zinta great talented actress of bollywood all time favourate   🍹🍹🍹 all songs are nice special my favorate dil chahta hai","label":0}]