[{"review":"Today watched this movie. I loved it and Madhuri mam performance were outstanding. Aamir also good. Songs were heartfelting. Love, comedy, action etc.. ek commercial film. Nowdays there are no movies made like this. Expecting like this with different story and style.","label":0},{"review":"I liked all the fun and prank part when I was 8 back then. The troubled part still bores me. Lengthy songs. Very good movie.","label":0},{"review":"This movie is really romantic and devotional so cute together Amair maduri nd songs also heart touching oh priya oh priya Dil film is very beautiful nd Tnx","label":0},{"review":"I love this movie very much. Every time my favourite movie. Madhuri and Amir.. awesome chemistry... And all-time favourite actors.","label":0},{"review":"Today I watched this file after 29 years, first time \nI watched this movie in 1990, this is such a powerful love story as I feel the same after long time.","label":0},{"review":"this was a fantastic romantic movie of all time hit i love this movie becaause it was my first movie watched i n theatres alone","label":0},{"review":"Oh those beautiful days..whr r dey? Nice college fight Aamir n Mads..grt catchy songs..both megastars..grt package!","label":0},{"review":"Nice movie... Chemistry between Aamir and Madhuri was awesome.. Aamir Khan can still do romantic movies like Dil ..","label":0},{"review":"It's a very fantasting, amezing ,  beautiful, all over it's a very gorgious movie, i love this, song of this movie is very well","label":0},{"review":"Good and Best Performance All Stars, Nice one for Comedy and Melody Songs, Thank You So Much All Stars....","label":0},{"review":"Superb movie. I love mujhe neendna aaye song very much","label":0},{"review":"I love this movie. It's songs are amazing.","label":0},{"review":"I love this movie and songs are very amazing thanks udit naryan and anuradha","label":0},{"review":"I love movies May love avarie tinka  song may like movies May like Amir khan and Madhuri Dixit best movies and best song","label":0},{"review":"Good movie. Reminds me of my childhood","label":0},{"review":"I am rajneesh kumar Diss is my love Indian army black kamando yes","label":0},{"review":"This movie is amazing . I loved it.","label":0},{"review":"Very big fan of Madhuri ma'am and she is fantastic amazing movie","label":0},{"review":"So  dramatic  and fantacy  that  everyone  enjoy  this  movie  ao  heartly.","label":0},{"review":"one the best comedy and romantic movie of all time","label":0},{"review":"Coming on zee bollywood. Best movies of Madhuri from 90’s","label":0},{"review":"Very fantastic movies... Lead roll by amir and madhuri","label":0},{"review":"good night my friends and best practices song vermach","label":0},{"review":"I like all of movies of Madurai.hence so I am biggest fan of you..thanks","label":0},{"review":"This is my first movie in theater...& I love this movie 👌","label":0}]