[{"review":"Totally loved this movie. I love movies like this. My favourite actors in there. It is in my most favourite films list. SRK outstanding performance. I don't get why people are dissappointed in your acting. Maybe they are being enviois 😁. All in all keep going in this mood. Love to watch new movies with this attitude. The plot is amzing. Didn't expect it would turn out like that. If anyone hasn't noticed, at the end SRK says\" in big cities happen little problems, senorita\". It is a phrase from D ...MORE","label":0},{"review":"Totally loved this movie. I love movies like this. My favourite actors in there. It is in my most favourite films list. SRK outstanding performance. I don't get why people are dissappointed in your acting. Maybe they are being enviois 😁. All in all keep going in this mood. Love to watch new movies with this attitude. The plot is amzing. Didn't expect it would turn out like that. If anyone hasn't noticed, at the end SRK says\" in big cities happen little problems, senorita\". It is a phrase from Dilwale dulhania le jahange. Which was awesome! Shahrukh and Kajol perfect pairing. About Varun he7 is average actor but keep trying! Kriti Sonan was good, she looks pretty. Great tanks to Rohit Shetty. 😊","label":0},{"review":"Don't read if you didn't watch this movie.\n Characters and names\nRaj Bakshi / Kaali - SRK\nVeer Bakshi - Varun Dhawan\nMeera Dev Malik- Kajol\nIshita Dev Malik- Kriti Sanon\nKing  - Boman Irani.\nRaghav - Nawab Shah.\n  \nThe story is wonderful screenplay is thriling. Romantic Square love story with actions and stunts from crime world.\nThe rival gangsters have loved each other.\n      I forgot about gerua song is my favourite song in the movie.\nAll songs are awesome.\nI will give 4/5 stars","label":0},{"review":"Very good movie. It could be better if it had suspense in it like ppl could guess what's happening next so it could be mysterious and suspenseful sp that ppl don't know what happens next and are curious to know about the same. Songs are amazing. I loved gerua song alot.","label":0},{"review":"Diwale is so bad that I couldn't watch the full movie. I got so pissed because of Varun's overacting no offense but Varun could improve on his acting skills. I don't blame Varun for overacting I just wish he hadn't attempted it because overacting is really hard to pull off. Also, Diwale's plot line is so weak. I don't care if fans call me mad because its true even though SRK is a legendary actor. Plus if SRK doesn't want to lose his fame he better stop acting in romantic films because he doesn't ...MORE","label":0},{"review":"Diwale is so bad that I couldn't watch the full movie. I got so pissed because of Varun's overacting no offense but Varun could improve on his acting skills. I don't blame Varun for overacting I just wish he hadn't attempted it because overacting is really hard to pull off. Also, Diwale's plot line is so weak. I don't care if fans call me mad because its true even though SRK is a legendary actor. Plus if SRK doesn't want to lose his fame he better stop acting in romantic films because he doesn't have the charm he used to have in the 90s and early 2000s.","label":0},{"review":"God I loved it and the thing that got me the most was at the end when shah rukh khan was on the bed with Kajol after she got shot, and he called her “senorita”... and if you are a big shah rukh khan fan like me the you know that in dilwale dulhania le jayenge Raj aka shah rukh khan throughout the whole movie called simran aka kajol “senorita”. Which is awesome to bring back their past with each other.","label":0},{"review":"OMG this movie is blockbuster for me, I don't know why most of the people gave negative feedback of movie. I enjoyed each n every part of the movie. The 5 minute date, colourful background OMG lol Songs are too good.","label":0},{"review":"It was really a very nice movie. I just loved it. It had comedy , action and romance all in it. The story, dialogues, acting and especially songs were just amazing.\nKeep it up !!","label":0},{"review":"dilwale  is a nice movie rohit shetty and team ki movie h realise 18 12 15 ko realise hui thi movie kajol srk varun and kriti varun sharma mukeshtivari pankaj tripathi andd others h dilwale me is a love story movie h nice movie h good i like it this movie h dir is rohit shetty  production . :::::::..........\n\n\nvd srk kajol devgan kriti sanon and others .","label":0},{"review":"One of the Best Of Rohit Sir , loved his perfection , dedication towards all content whether it is about action,comedy \nand most important about stunts the stuntmen they gave their Best and blood to make this movie successful .","label":0},{"review":"Amazing movie. The story is awesome. It is interesting because Kriti is with varun. Alia sucks. The another great thing is that rohit shetty directed it.","label":0},{"review":"As usual Srk n Kajol was too good as parallel as Varun dhawan n Kriti Sanon they both r also looking good after a long time we saw a chemistry of Srk n Kajol they r looking sooo good, all songs r awesome n story r also mind blowing.","label":0},{"review":"Sorry SRK fans but i don't like this type movie \nNo dout SRK act well but story & screenplay is week . \nAudiences doesn't accept that rohit shetty make this type movie.\nYou already guess suspence while you watch movie soo you not interested high\n\nStory            2/5\nScreenplay 3/5\nDirection      3/5\nSrk               4/5\nVarun           3/5\nKriti/kajol     4/5\n\n#Overall dilwale  2.5/5👎","label":0},{"review":"It's a pretty good movie with well choreographed scenes, but to me personally the movie didn't make sense. The acting was mediocre and the story was not good at all.\n\nHonestly I would not buy this movie.","label":0},{"review":"Love this movie! It’s one of those feel good family movies. There is no crazy story line to follow. It’s quite comedic. Just a light film.","label":0},{"review":"Dilwale movie is the best movie in the world. And the releasing date is 18 12 2015 nd i love shahrukh sir nd kajol mam and thankyou rohit shetty and team","label":0},{"review":"Dilwale is a very good movie for me. So I don't want anybody to say dilwale a rubbish film . If anybody say dilwale a flop movie I think he or she is mad","label":0},{"review":"very nice movie Dilwale #15 my favourite movie i love you very much\nit is a very romantic movie i like this movie srk sir you almost best actor and rohit shetty is also great director team very nice","label":0},{"review":"undoubtedly the best movie it was the most first movie i watched and after this a love for watching bollywood movies developed . kajol is my favourite acctress","label":0},{"review":"Amazing movie. It was great. I could not stop laughing and crying at all while seeing the film. 😁😭","label":0},{"review":"ONLY ONE CAN THINK ABOUT THIS EPIC SCRIPT #ROHIT SHETTY!!!!! ......... AND ONLY THIS CAST WOULD B PERFECT FOR THIS Dashing. Intellectual. Lovely. Wadding. Amazing. Lively. Excellent. Movie....... #D!LW@L€","label":0},{"review":"Simply rubbish. I can't understand how can srk , after doing films like kal ho na ho, my name is khan and jab tak hai jaan can do such a horrible movie. Did not except this from you srk.","label":0},{"review":"Totally love the movie especially all the songs r amazing.. ARIJIT SINGH saved the movie again.. SRK,VD, KAJOL and KRITI SANON awesome performance..😘😘😘","label":0},{"review":"Its a nice movie \nSrk kajol acting is the best as always \n4/5 \nBut varun dhawans is totally a overactor like Salman Khan \nWell nice movie srk was awesome","label":0},{"review":"very nice movie and so proude of mr. Rrohit shetty and team iam bless for you are making for hit movie and so thank srk","label":0},{"review":"One of the favorite movies. Very close to my heart...\nWith such a melodious music...\nLove it...","label":0}]