[{"review":"I have really misunderstood this movie although I liked it a lot when it came in 2011. I could at that time not understand that SRK's character is written in a way that makes us feel he's overacting while actually he didn't. One of the major reasons for watching this movie was the stylish action that had caught my attention from the trailers. The car chase sequence is one of the best ones I've seen in an Indian movie till date. The plot is full of twists and turns, and a lot of that makes sense  ...MORE","label":0},{"review":"I have really misunderstood this movie although I liked it a lot when it came in 2011. I could at that time not understand that SRK's character is written in a way that makes us feel he's overacting while actually he didn't. One of the major reasons for watching this movie was the stylish action that had caught my attention from the trailers. The car chase sequence is one of the best ones I've seen in an Indian movie till date. The plot is full of twists and turns, and a lot of that makes sense now. The film wasn't even a little bit of bad that I felt initially it was at times. This is one of the best action-thriller movies by Bollywood in the last few years and is a must watch. I'm glad I know understand it fully.\n\n9/10.","label":0},{"review":"One of the best crime thriller of india. Its not a mystery, just a robbery is planned and executed in the whole movie but then also it don't let our eyes miss a single scene. This movie is really comparable to hollywood with very good  screenplay, acting and action. I suggest you to watch this movie if you are a fan of crime thrillers. Also shahrukh and priyanka are very best as always, they are the representative of bollywood in the international audience.","label":0},{"review":"It's  a complete stylized action thriller  movie. It's  my type of film thats why its my fav film of bollywood. Srk as don is damn awesome. No can match his level of acting. The movie looks like a hollywood movie. The entry of don is one of the best entry of any hero in Bollywood. The twists and turns will not allow you to distract from a single scene. To understand  the story one has to watch don 1. India has a lack of this kind of perfect films. Indian audiences  don't  understand  good films. ...MORE","label":0},{"review":"It's  a complete stylized action thriller  movie. It's  my type of film thats why its my fav film of bollywood. Srk as don is damn awesome. No can match his level of acting. The movie looks like a hollywood movie. The entry of don is one of the best entry of any hero in Bollywood. The twists and turns will not allow you to distract from a single scene. To understand  the story one has to watch don 1. India has a lack of this kind of perfect films. Indian audiences  don't  understand  good films. I hope they will be making don 3 soon.","label":0},{"review":"The best actor you would ever witness🙏🙏 ... The style and attitude that shah rukh khan carries throughout the movie is awesome .... \n\nPeople who doesn't have a good taste in acting and movies would not like it 😏😏\nas we all know that srk is the king of bollywood and he maintained that royalty of his character ... The movie is awesome and you must go for it 💗💗💗","label":0},{"review":"Wow !! This a brilliant movie !! Always liked Don Movies and SRK Did well in this movie !! It's good but I prefer Don(2006) was a lot better.","label":0},{"review":"Don3 in waiting..!! Don2 was such a treat to watch on-screen..I watched it first when it came out in theaters! December 25th of 2011...it was the best experience..the entry the songs..the SRK!! ACTING, SWAG!!!....wow!!!","label":0},{"review":"Once Again Shah Rukh Khan Proved His Potential,Why Bollywood Call Him \"KING KHAN\"?Throughout The Movies If Anyone Carefully Analyse That Specific Film,I Say He/She Must Enjoy It.NO DOUBT ABOUT THAT,What I Think.Have A Nice Feelings To Share My Views.","label":0},{"review":"Shahrukh really is incomparable, none of bollywwod biggest actors would haVe performed such role not even mr. Bachchan, forget about criminals... Achchai kabhi bhi burai pe vijay nhi pa sakti\nHope to meet u one day mr. Don","label":0},{"review":"This is a awesome movie. And srk's acting in this movie is very powerful. Great movie.\nMy parsonal rating is 10/10","label":0},{"review":"I think this is the best robbery movie made in india, I don't know why people don't remember but I really liked the movie and srk was superb, second half of the movie is amazing 👌👌👌","label":0},{"review":"Stylish srk all the way. The second half of the film was a confusion. Could have been a memorable thriller if not for the second half.","label":0},{"review":"I am shekhar sahu his son the movies Don and Don 2 both are blockbuster I love these movie and love SRK - PC best jodi and farhan sir please bring SRK and PC back in Don 3","label":0},{"review":"Very good movie...  Srk's best movie...i don't know why this movie not crossed 200 crore mark at that time..","label":0},{"review":"3.9/5\n\nNobody has ever attempted to make such a movie with some international standards.\n\nObviously SRK as Don is GREAT.","label":0},{"review":"Don 2 Movie is one of my favorite Movie list.\nSRK entry scene was awesome.\nMovie Rating 5/5","label":0},{"review":"This is the best action movie I've ever seen. Better than Dhoom3.","label":0},{"review":"The movie was awesome after all there is a reason why srk is called the king of bollywood","label":0},{"review":"The king of acting, Shah Rukh love you. The attitude,the style of Don no one can match except Shah Rukh.","label":0},{"review":"One of best movies of Srk in his career I think so by seeing don2","label":0},{"review":"I think that the shah rukh and her heroine is in orangejumpsuit. You have two options  to choose a heroine in orangejumpsuit. First is katrina kaif and second is prinkya Chopra.","label":0},{"review":"Mind blowing srk is the best actor am just big fan of shahrukh 😘😘😘","label":0},{"review":"It feels like I'm watching a Hollywood in Bollywood , specially thrilling scene","label":0},{"review":"Not a good one when compared with DON but a Don 3 can be a realistic.\nThere should be a good script for Don 3","label":0},{"review":"I can never get tired of  this movie SRK totally hit it off with that DON character.","label":0},{"review":"That cameo of Greek god of bollywood is just stole the show now u guys just guess who's that man...","label":0}]