[{"review":"I watched this film 15 X This is very Funny Film but that songs , Actress & Her scenes are discusting Maded what happen when little children will see this and what will be react on him / her Mind. Guys Plz when u Make dhammal and other part it sure may be suitable For children then can take enjoy Film & Comedy....😎😎","label":0},{"review":"It was fun, but not that kind of fun that can be watched over again and again. The location changes randomly and the end takes the movie out of track. VFX budget was clearly cheap which is why it's not properly polished. Rate 6/10 star.","label":0},{"review":"Storyline is fresh poop. I can't believe how Dutt Sir and Deshmukh Sir accepted this movie's script. \nActresses' acting were at its peak. \nIn short, I would say this movie is a \" Mustn't Watch \" as it shows cancer at its weak and makes you overwhelm with cringe (trust me).","label":0},{"review":"If you are a dhamal fan than this movie is not for your watch from the starting till end  you will feel that you are watching this movie worst movie they are doibg any thing.","label":0},{"review":"very funny movie Make ur profile pic in violet to show the unity for justice for sameer malik 786","label":0},{"review":"Overhipped movie , if u have films like uri and gully Boyz who will like to watch such irratic movie.","label":0},{"review":"Comedy scenes were good but acing of actresses just ruined the whole movie and also very bad screenplay.","label":0},{"review":"2.5 stars that too coz of casting .. \nVery bad movie disappointed ☹️","label":0},{"review":"This is comedy movie I also like the comedy movie","label":0},{"review":"ITS AWESOME BLOCKBUSTER SUPER DOOPER HIT","label":0},{"review":"It was also filled with double comedy ..a must watch movie ..","label":0},{"review":"I like comedy so dhaml is my favrote movie","label":0},{"review":"This movie is very funny so I like it","label":0},{"review":"It's so good movie for camedy","label":0},{"review":"I love dhamaal all movies","label":0},{"review":"Very boring movie, very boring, stay home and watch tarak mehta instead","label":0},{"review":"This movie is my Favourite","label":0},{"review":"Very funny comedy movies","label":0},{"review":"My best comedy movie","label":0},{"review":"Very funny movie 😂\nWhen total dhamal will release 😥","label":0},{"review":"Very good \nVery funny movie","label":0},{"review":"Very nice movi 100funny","label":0},{"review":"Nice movie","label":0},{"review":"Only timepass movie... But not as good as i thinked about this one....","label":0},{"review":"it is lovely but not so cool than dhammal","label":0}]