[{"review":"For the 1st option I want to say that this is one of the best movies that I have ever seen. I love this movie so much because it gives us a beautiful message . As well as it gives a message to save girls. They are our mother, sister,caretaker,adviser,partner,life partner as......as they are an angel. So we should  respect them. If there are someone as the same minded of the character Sam, I request them not to do this type of works that can make ruined a girls life; Please think about your mothe ...MORE","label":0},{"review":"For the 1st option I want to say that this is one of the best movies that I have ever seen. I love this movie so much because it gives us a beautiful message . As well as it gives a message to save girls. They are our mother, sister,caretaker,adviser,partner,life partner as......as they are an angel. So we should  respect them. If there are someone as the same minded of the character Sam, I request them not to do this type of works that can make ruined a girls life; Please think about your mother, sister for the one time before doing it .","label":0},{"review":"This is the best movie I've ever watched in a while! I really don't watch Indian Bollywood movies because I don't like them and I'm not a fan but this movie Drishyam was an amazing movie! I was totally mindblown I'm not gonna lie! It's a must watch for every Indian (and also if you're a fan of Bollywood movies!) The acting, the cast , the characters , everything in this movie is perfect!! The acting done by Ajay devgan and his family (in the movie) overall is so perfect and awesome ommgg and the ...MORE","label":0},{"review":"This is the best movie I've ever watched in a while! I really don't watch Indian Bollywood movies because I don't like them and I'm not a fan but this movie Drishyam was an amazing movie! I was totally mindblown I'm not gonna lie! It's a must watch for every Indian (and also if you're a fan of Bollywood movies!) The acting, the cast , the characters , everything in this movie is perfect!! The acting done by Ajay devgan and his family (in the movie) overall is so perfect and awesome ommgg and the police officer specially that guytonde(idk how to to spell his name)! The plot overall is so engaging and the suspense in it ! The way the story/plot is written is really good! My rating for this movie is 10/10!! I really want people to appreciate this movie and the plot of this movie!","label":0},{"review":"Its one of the best movie I have ever seen. Its shows the love of father and mother, who sacrifice and fight for there children in there life. Who make  million of love to give them better education and give them good civil life, so they can be able to live in civil society. From this movie I concluded and found the love of parents and secondly we should respect women. If you have a good learning , you can better implement in our society. But all of the above its awesome movie.","label":0},{"review":"This is one of those movie that Ajay sir should proud for him. Outstanding direction and performance it will keep you think till the end. I have ever seen such an unpredictable climax every body in the hall leave a deep breath as the scene ends... This shows Bollywood still have few actors who has the ability to acttract audience to make the hall houseful.","label":0},{"review":"An excellent movie of all the time it has the best script and excellent acting done by ajay devgn and other co stars.I would recommend that people should watch this movie who haven't till now. It's the best detective film made till date. It teaches us about the sincerity of the people. The film have a lesson to think about it .Don't waste too much time by reading the reviews go and watch it now!!!!!!","label":0},{"review":"The script was good. and was acting.\nBut is it sending right message.\nIn today time, when crimes are increasing a lot, the film through heroes action try to convey that if if you or your family had sone a crime, a person should try all means to save him /her. \nTruth and trust on judiciary on judging an action on the laid consequences is highly questioned.\nI did like the message, as it will not curb crimes","label":0},{"review":"In the beginning IG was seen ordering her junior to break the bones of the 2 men who lied and got 2 of her men suspended and says I DONT CARE what people say.\nAnd towards the end when she knows something bad happened with her beloved only son, and knows who did that. She decides to resign and leaves for London. Highly abrupt !\nDisappointed by the end but overall good plot","label":0},{"review":"One of the best movies you might watch. Not in the category of your normal bollywood fare (junk). No song and dance routines so probably not a commercial success.\n\nRiveting stuff.\n\nRemake of a Malayalam movie of the same name. But this one is top class.","label":0},{"review":"Normally I watch very less no of Bollywood movie compared to our present young  generation.  Out of those no of movies there are very few movies which I had to watch twice. I shall definitely like to watch the movie for 2nd time..!! The story may not be based on true events but it doesn't matter..after all it is a movie.","label":0},{"review":"It's the best movie it holds the viewers from the starting to till the end ,it's a suspicious and thrill movie and acting by each one of the actor is mindblowing all the actor gave the full justice to their characters . everything about this movie script , screening , presentation , direction ,acting by each actor in the movie everything is just mindblowing .I really insist Bollywood to make this kind of suspicious and thrill movie","label":0},{"review":"Drishyam malayalam movie version always  best. Mohan lal, Meena, Asha sarath, Kalabhavan Shajon acted  best in their career and Jithu joseph  script and direction  awesome, many scenes in this movie  we can see the brilliance of a director.These fully family entertainer and thriller.","label":0},{"review":"Loved and I mean loved this movie. It was intelligent, intriguing and nicely done. I was drawn in and unexpectedly impressed and surprised. The music was on point - dum ghutta hai. Already repeated it and still going to repeat it. I highly recommend it!","label":0},{"review":"One of the best thriller movies of Bollywood. Nice direction and awesome suspense which keeps you holding until the end of the movie. The acting was marvellous by all actors and movie was well scripted.","label":0},{"review":"we usually find at the end of these type of movies the accused is always been jailed but itz a first movie ever been made were police is helpless after knowing everything. Ajay sir's outstanding performance liked very much","label":0},{"review":"Having watched the south versions of this movie, Hindi was a miss. It was difficult to accept that Devgn's character and his family were middle class. It appeared that everything about the movie was forced make the character played by Devgn to look good. His character in itself wasn't convincing enough. If you have watched it in any south Indian language, give this a pass.","label":0},{"review":"After a very long time I've watched a movie which was filled with suspense, twists, tricks and turns, darkness and family bonding. It's Ajay Devgan's one of the best works. Hats off","label":0},{"review":"The best bollywood suspense movie ever!  Each scene is very important. The interesting fact and visual, how the man fool the police in movie and last the body found beneath the police station. Must watch for suspense lover!","label":0},{"review":"Drishyam is not a typical bollywood movie. The movie has Excellent Story with Lot of Suspence. The Movie has a Intelligent Men Who is Forth Class fail ~ interesting. I like this movie very much.It is a Excellent Movie.","label":0},{"review":"Great crime movie\nThe character portrayal by Ajay sir,Shreya mam,Tabu mam and the remaining cast was brilliant.\nOne of the best Indian movies ever made\nHats off to Ajay sir for other movies","label":0},{"review":"On the whole the movie is good but some things I don't support that officer Guytonde was beating two  ladies who are Ajay Devgan's wife and daughter and also his girl child. It's totally disgusting. It's a originally crime to give a third digree to ladies without any lady police officer and also it's a matter of child abuse.","label":0},{"review":"This movie is one of my favourite movie not only because of its remarkable story but this move gives us a passive knowledge about the father and its role for securing his daughter. This movie is a  perfect example why girls are best known for daddy's princess.","label":0},{"review":"Wow i never expected the end... Vijay really did an awesome job saving his family. The body is actually under the police station 😱 who would have thought ?? Amazing job Ajay and family 😍","label":0},{"review":"a must watch movie for every INDIAN. great storyscript.. well done AJAY DEVGAN sir,.SHRIYA SARAN was adorable..missed her from the movie SHIVAJI THE BOSS. drishyam was really agreat movie/","label":0},{"review":"Can't described in word. Best Bollywood movie ever watched. I feel bad for victim parents because they don't found their son's body😢😢. Anyways this is just a movie. Superb😊👌👌","label":0},{"review":"Well this movie might be your \"sapno ka raajkumar\" It contains a great storyline and a very hard kick in the climax . It is full of suspense , thrill and excitement , and the finishing of the movie is outstanding .","label":0}]