[{"review":"One of the best movie I have ever watched, go for it. Honestly this movie is way better than normal bollywood rom-coms .The movie showcases that love can happen after marriage too, set amidst haridwar of 1990s. The lead pair Ayushmann and Bhumi have acted superbly. The acting of supporting actors is also laudable.Songs are good and they dont come in between the movie, they are in the background and the movie flows smoothly. Generally i am not a bollywood fan but this movie is too good to be avoi ...MORE","label":0},{"review":"One of the best movie I have ever watched, go for it. Honestly this movie is way better than normal bollywood rom-coms .The movie showcases that love can happen after marriage too, set amidst haridwar of 1990s. The lead pair Ayushmann and Bhumi have acted superbly. The acting of supporting actors is also laudable.Songs are good and they dont come in between the movie, they are in the background and the movie flows smoothly. Generally i am not a bollywood fan but this movie is too good to be avoided.Every single frame of the movie is delight to watch.\nI rate it 5 out of 5","label":0},{"review":"I think it tells the story of millions of people in India who have been forced in relationship which they don’t want to go in . Story tell about how families unit control the life of their children and they have too much involvement in the life of married couple . I think story its a very clear depiction of Indian society where we have so many challenges.such as social , mental, biological ,  financial and sexual frustrations.\nA man who doesn’t want to surrender the current social and relationsh ...MORE","label":0},{"review":"I think it tells the story of millions of people in India who have been forced in relationship which they don’t want to go in . Story tell about how families unit control the life of their children and they have too much involvement in the life of married couple . I think story its a very clear depiction of Indian society where we have so many challenges.such as social , mental, biological ,  financial and sexual frustrations.\nA man who doesn’t want to surrender the current social and relationship situation but as someone said about us as Indian we are an organise chaos .\nOnce someone said “everything will be okay in the end if not it’s not an end” .\n\nThanks \nNeil Singh","label":0},{"review":"Amazing movie\nBhumi pednekar & Ayushmann Khurrana did a great work. Movie is simple but very effective in every way.\n Its complete package of entertainment, drama,romance and comedy\nSpecially for comedy and great acting credits also goes to sanjay misra","label":0},{"review":"Dum Laga Ke Haisha is deeply nostalgic about music, focusing on the period’s romantic song, at a time when Prem’s cassette shop business is being threatened by the arrival of a CD shop. Kumar Sanu, one of the most popular singers of the era, makes an appearance in the film and sings ‘Dard Karaara’ for a moment when the couple dance and romance in 1990s style\nBhumi pednekar & Ayushmann Khurrana did a great work.","label":0},{"review":"My rating is 4 out of 5 for this one... \nBest cinematography... Lovely story...Dialogues are awesome... Ayushman and Bhumi are outstanding and one more man Sanjay Mishra...\nI saw this movie multiple times... Every time enjoyed a lot...","label":0},{"review":"I am impressed by this movie ..it's characters acting marvellous melody language and above all the simplicity of the common living shown in the middle class family. It's a wonderful movie I tend to watch it again n again","label":0},{"review":"Best part of this movie is it's simplicity..it's something you see in your day to day life. That's where this movie immidiately connect with you,  script is amazing but acting of all cast looks so effortless and last but not the least music.. Damnnnnn😍😍😍😍😍😍","label":0},{"review":"Such an interesting subject and so very well made. Very respectful, mindful and sensitive treatment of the subject! Will be looking out for more movies by this director, Sharat Katariya.","label":0},{"review":"Superb movie, couple should watch to increase their love with each other. And kind of refreshing entertainment. Great Actor Bhumi and Ayushman","label":0},{"review":"A very entertaining film that teaches us a lot. Women should not just be judged by looks. A beautiful and greatly musical film. Hats Off!!!","label":0},{"review":"Superb movie . Simple yet it will keep you engaged.it truly depicts mindsets of middle class family in a very beautiful way.","label":0},{"review":"Love you Ayushman, what a power packed performance. Way to go. watching this for 4th time and i don't get bored even a bit.","label":0},{"review":"The most beautiful film in recent years. Heart touching story and wonderful performances with some good old world music.","label":0},{"review":"Nice Movie ... i see sanjay mishra is very good actor.. Very good story good scenes...loved to watch it","label":0},{"review":"This movie really touched my heart. Everything was perfect acting, dialogue, script, cinematography. Background score was outstanding.","label":0},{"review":"In simple it is DESI. This is our culture this is our real Bharat. Love this movie. No western touch no item song pure DESI.","label":0},{"review":"I loved this  movie . It's songs realy touched my heart. Nice acting . Superb dialogues .","label":0},{"review":"Awesome 🎥 great work by bhumi pednekar.. Really need guts. Love towards acting to be in that role..","label":0},{"review":"It is not a commercial movie with usual boring stuffs but an Awesome movie which everyone should watch once","label":0},{"review":"This movie is made so realistically. It shows that a long term relationship is not about look , it is about faith, sacrifice, bonding and mutual respect.","label":0},{"review":"Beautiful movie, recommended to everyone. . Bhumi pandekar is beautiful, her acting and dancing and same credits goes to ayushman khurran.","label":0},{"review":"Light hearted romantic movie. Boys should respect and understand the woman in his life. Enjoyed.","label":0},{"review":"One of the best movies that I have seen in my life. Complete entertainment.","label":0},{"review":"ayushmann proves why he is the best and bhumi and sanjay mishra just nailed it","label":0},{"review":"It is a pretty good movie. more than I expected it to be :)","label":0}]