[{"review":"Lovely movie...totally romantic movie, I can''t believe I got emotional.. BTW after a very long time Bollywood has produced such an beautiful Romantic movie. Pratik Babber is lovely ( I love him). Amy Jackson again is too cute and innocent.. I loved both. A.R. Rahman music is brilliant. it is a worthwatching movie, go for it and witness the Chemistry of new couple...I am falling ln love again❤️💕💖💗","label":0},{"review":"The movie was just good,not the best .Romantic scenes were well shot in this movie. But too many songs in this movie irritated me a bit and director could have taken any other actress for this movie. Screenplay was good in first half but could have been better in Second half. Kissing scenes in this movie were really not required . But still watch this movie if you are in a relationship. But I'll not recommend this movie to everyone as The direction of the movie was not that strong and dialogue d ...MORE","label":0},{"review":"The movie was just good,not the best .Romantic scenes were well shot in this movie. But too many songs in this movie irritated me a bit and director could have taken any other actress for this movie. Screenplay was good in first half but could have been better in Second half. Kissing scenes in this movie were really not required . But still watch this movie if you are in a relationship. But I'll not recommend this movie to everyone as The direction of the movie was not that strong and dialogue delivery of Actress didn't suit her. BGM was good.\nMy verdict:6.5/10 stars.","label":0},{"review":"I love this movie so much. I have watched this movie many time each time it's give me great feeling 😘In this movie has beautiful songs, good acting and I feel realistic. Amy jaction is too good and prateik as well. Now I still watch this movie when I feel like watching movie I choose it first. I don't know  how this  movie was flop.","label":0},{"review":"I have watched this movie so many times.....but every time I watch it...I feel the same freshness in it...it really shows how in real life love stories are like....such a beautiful love story.... amazing chemistry... don't know why it was not appreciated and didn't get audience in theatres🤔","label":0},{"review":"I loved the story i have watched it 5 times . This movie tells what a true love is . I really loved it . It is very much realistic and i love Amy . Hope I find my Jessi in real life","label":0},{"review":"Lovely movie \nRemember  my first crush, first love \n   Komal patidar that's  like jessi \n          My clg has done 2015 \n     Bt it's  nt come. \nI miss you komal \n   I like acting ammy jacson and pratik vry well.    \nLove u gayus.","label":0},{"review":"I simply don't recommended and watch the new bollywood movies.\nbut It is one of the best  bollywood love story of all time.\nwhy indian public support that type of movie.that type of realy realy needed for indian cinema.\n\" Watch this movie atleast one time.\"\nmusic = 10/10\nacting = 7/10\nstory = 7/10\noverall movie = 8/10","label":0},{"review":"It is one of the best bollywood love story movie and i dont understand why this movie didn't do well in theatres but i have watched it several times and each time it gives me a beautiful feeling that i cant describe in words.","label":0},{"review":"i really dont know how someone can dislike this awesome movie. let me tell you that this movie is a best movie with best acting with best background music with best direction with best story. really a must watch movie if youre looking for a perfect romantic movie","label":0},{"review":"I saw this movie now.. And believe me this fantastic true luv story is for those who are deeply in love! \nIt’s an Interesting Story Well delivered !","label":0},{"review":"Same Story stucked n stunned me \n..... Decided to I ll surely making a movie for my gud 1s n really for that special grl of my life....... Fantastic🤘😝🤘 movie","label":0},{"review":"I really love this movie. The movie was really good.Romantic scenes were well shot in this movie. But Only one song is too good (Hosanna) and  Other songs is not so good.","label":0},{"review":"4⭐ movie.I like this movie because story and acting of movie interested & best . BGM &song are amazing . Best love story movie of Bollywood .","label":0},{"review":"My all-time favorites movie & my first lovelies first watched with my love first &most unforgetable film even my all-time favourite film & there all songs also it's all-time awesome mind-blowing gratest gorgeous  best superb exetra exetra","label":0},{"review":"I saw this movie now.. And believe me this fantastic true luv story is for those who are deeply in love.. They are gonna love the movie","label":0},{"review":"One of the best love story.Even after watching it 4 so many times..I feel like I am watching it for the first time everytime I watch it again..So refreshing and adorable movie..","label":0},{"review":"After I watch the movie, I decided to give the 1st place in my heart touching best romantic movies list.This is the best ever romantic movie I've seen, awesome, fantastic 😍😘😉👍👍👌","label":0},{"review":"Good movie very beautifully shooted with good cast specially the puch line used by sachine sir in the movie awesome same was so sweet Parteek n all .","label":0},{"review":"Really love this simple love story with a beautiful and Curved ending. Fictional while Everyone could relate it with Real life scene.","label":0},{"review":"Its an awesome movie..i cant see this movie without crying..really touching..AR Rahman' s songs are awesome in this.but the tamil version of this movie aka vinnanithandi varuvaaya is much better than this","label":0},{"review":"Awesome movie yrr \nWhat a performance from Amy Jackson\nI become fan of her\nPrateek is also good \nBoth look good together","label":0},{"review":"In love with the movie....spcly Pratiek hes jst superb n mind blowing actor. I feel like watch the more n more.....💕💕💕💕💕for Prateik Babbar","label":0},{"review":"Best ever love story... Watched till thousand time.... As new as 1st day... Love the cast n script","label":0},{"review":"This show is very entertaining....we like the love chemistry between shiv and sharanya\nLots of success wishes \nLoving shivanya","label":0},{"review":"It is the best love story bollywood movie .see this film just one time I think u also realise","label":0}]