[{"review":"FANAA- Tere dil mein meri sason ko fanaa mil jaae.Tere ishq mein meri jaan fanaa ho jaae. Nice romance by Aamir kajol and kunal kohli .Good script fantastic narration portrayed. Full drama .Bole to zaakas. \n           Thnx to Aamirkhan sir for choosing  wonderful fanaa. Watched 28 times till .cryed a lot .very pathetic climax . How could zoonie kill her love ???  Let's back to plot --- Rehan had true love for for zooni and son Rehan . He fell in love with zooni naturally  inspite of   effort mor ...MORE","label":0},{"review":"FANAA- Tere dil mein meri sason ko fanaa mil jaae.Tere ishq mein meri jaan fanaa ho jaae. Nice romance by Aamir kajol and kunal kohli .Good script fantastic narration portrayed. Full drama .Bole to zaakas. \n           Thnx to Aamirkhan sir for choosing  wonderful fanaa. Watched 28 times till .cryed a lot .very pathetic climax . How could zoonie kill her love ???  Let's back to plot --- Rehan had true love for for zooni and son Rehan . He fell in love with zooni naturally  inspite of   effort more to avoid. Atfirst he couldn't convince properly  Jooni abt his mission,  fickle character  (little more)  taster of love  for  hurried and confuse  bcoz he knew already that  the field  in which he  had stepped  that's not a straight path never. His weakness  towards zoonni crossed  all barriers  obstacles. So it's called Love doesn't  obey anything. He became the Ghulam ( slave)   of her beautiness  , simple heart.In another side  zunni smoothly fell to him;  mainly she enchanted  by his sense of humour  sweet mindblowing word,  harmonies of touch and obviously  that happened 1st in her life  which was dream  ( shehzada)since before youth period .Ammi was a big pursuader   means she was concerned abt  beti's future. \n    Zuni and Abba jaan  were very fond of  nation,  quite patriotic. That's why  finally  Zonni had to opt better  one from  2  different right issues  and she lost her lover  forever,  not from the buttom of heart. Still Jooni  has had great love  2 him  till breathe. In here some audiences  may  make argue  -  zuni is  right in her way  than Rehan. But my opinion is   Rehan is so right  than zunni. Zoni couldn't  realize  Rehan's convincing word for past deeds and she misunderstood  & shot him having thought  of they must kill  our nation  like terrors attack  ( nuclear bomb  or missile  through trigger)   other side Rehan had strong  trusts upon self,  he had deep concern  regarding  wife and son,  \"by the help  of trigger  they can demand  freedom of Kashmir  to both Govts  and ultimately 'd get  success  with  nonviolence easily  otherwise they must kill  all of us  including beloved  wife son  \" \n   Proved that a nation lover vs lady lover.  Sacrificed  / destroyed  in love  with a blind girl;  who found  a new life  by him,  lastly could Fire  /kill  by two beautiful  Rehan-giften... on which  blessings put touch having prayed  and further once  who had known \"Discoverer'll turn into  destroyed\" .Let it, organ only...     \n      Afterall,  Entertaining Love story,  beautiful shayari,  marvellous acting by sensitive kajol  and cinematic God  Aamir sir,  fantastic background  score- music  especially chand sifarish,  mere haath,  destroyed in, dekhonaa. One song  I listened on open roof  having wet  with heavy rain  storm  for 1st time  , that's  Dekho naa only .... I liked the script  very much heartily.   Nice story telling capability  .wow!!! We hope more Bollywood films'll come  like this outstanding.  Hope, rating 10  out of 10 .\n  So friends   each bf/gf should watch  it having keen  ,should fascinate by this  magnificent storyline,  should fall in love  with \"fanaa\" . Truely  I must name  my daughter  as fanaa. Supernatural passion of acting,  dedication, zill  to give  100p.c justice  to imaginary role  ; all of those proved by AAMIR KHAN'S JOB AS REHAN. Deep respect to Mr dependable Aamirkhan sir.  Director kunal  performed well as matured.  Well support by risi tabbu kiron kher jee and  the lovable  child star. \n   Bekhudi ki zindagi... hum jeeya nahin karte...jaan dushron pe.... just finished  before 11 minutes. Best of luck  friends.watch and enjoy the living drama & loss urself in to the....✍💜🖒.","label":0},{"review":"Really, it was one of the best movie all the time. Everyone must watch this movie to know about love. I know that climax is so sad but it was the correct decision made. Despite the music is Awesome and no words to explain. No idea how many times I saw this, but always get emotional cause what a beautiful love story it was... best best best movie with superb acting of Amir and Kajol😍 pyaar me fanaa hojavo","label":0},{"review":"This is a brilliant romance movie! i would watch it all over and over again with my friends or by myself. This movie shows so much about the love aspects of individuals but to the next level. Sadly, i would have preferred a happier ending, ending was really sad for me, would have expected them to live their onward live happily while raising their child.","label":0},{"review":"i am just finishing watching it , what i can say is fnaa is a best combination of romance ,entertainment and Love •• im gonna watch it again tomorrow ◠‿◠ ,,i’ll give 4.5 out of 5 ., best act of the actors as they can make 。","label":0},{"review":"Watch today again...early morning 2am on TV....2nd half....Still refreshing with extreme Love and grief....The family  love makes bond strong...Sacrifices..Emotions....Music...Dialogues ....All perfect!!! \n\nEyes wet😭 even after back to bed...Thinking.....Fanaa or Funaa or Fan aa ❤","label":0},{"review":"Very beautiful film. Top acting of both. Want to know about Kashmir ? Then watch it. There is no fault in this film if you remember that it is only a film. You will remember the powerful acting.","label":0},{"review":"Everything is perfect about this movie. The songs, the acting skills, the emotions, the plot twist, and the love story are just perfect. Even the ending was PERFECT.","label":0},{"review":"Aamir and Kajol hit the nail on the head!!! Kajol as Zooni was phenomenal, and Aamir as Rehan really brought the piled up emotion, every Kashmir nurses for their motherland. Beautiful!","label":0},{"review":"Wonderful I can't forget this movie at all it's really a wonder today I should it to my daughter even she felt the same hands of to the director the way he took the movie👏👏","label":0},{"review":"the reoccurring dialogue of the cute kid of him saying that you don't love rehan as much as rehan loves you, it was kind of like \"why did they put that in there\" and \"Aww thats so sweet,\" BUT WHEN THEY PUT AT THE END \"rehan tuj se itna pyar kar tha hai, utna pyar tum rehan se nahin karti\" IT WAS LIKE KNIVES GOING INTO MY HEART","label":0},{"review":"Just 7.2 rating ? I can give 9 out of 10. Such a a beautiful movie. I have amused by the story.bgm were awesome.","label":0},{"review":"Story is pathetic, music is good, camerawork is brilliant, acting of entire cast is fairly good except Tabbu. She has done her job very casually. \nStory is only concern and that is too irrational.","label":0},{"review":"One of the best movie in Bollywood.\nGood Songs.....\nChand sifarish is the best song in this movie..\nStill listening to that song","label":0},{"review":"One of the best movie in Bollywood..    everything is super about this movie......... nice songs........ I love this movie........ thanks ameerkhan sir choosing best story.....","label":0},{"review":"I was completely swayed out by the movie.............. best story best cast and best music........ truly worth watching it.......love you aamir, kajol.....\nTere dil me meri sanson ko panah mil jae tere ishq me meri jaan fanaa ho jae","label":0},{"review":"I love this movie becouse i  like this story its unique film amir khan is mindblwing kajol is awsom in her role  also best songs and sayri in this movie,\" this is my favourite  movie \"","label":0},{"review":"This movie is so beautiful I love the chemistry between both the actors I watched this movie more than a 20 times I love the songs also its the best movie till now","label":0},{"review":"Very good. Also, for once you hear about Kashmiri people's right to self determination clearly, which is almost non existent!","label":0},{"review":"Awesome movie and the actors have performed wonderfully I am fan of Aamir and liked him too much in the film and the music is unforgetable","label":0},{"review":"One of the finest movies in the film industry and no film can replace its place but bad luck is people cannot download it. This film is unavailable in the internet. If anyone knows the link send me please.","label":0},{"review":"This movie good and full of romance. I see that movie aproctimate 25 times and every time ,I realised that I have not seen never.","label":0},{"review":"This movie was outstanding! I loved it so much. Nice love story","label":0},{"review":"Perfect combination of art, poetry, music, story, writing, cinematography, and LOVE. I am afraid if you say you haven't watched it yet.","label":0},{"review":"Just a word love it First half is written and directed by brilliantly but second half is slow and sometime it bore it \noverall movie is good and blockbuster.","label":0},{"review":"One of the best movie ever I seen. Kajol is my favourite actress","label":0}]