[{"review":"Akshay Kumar has yet again delivered a movie with a great message with a mixture of masala for the audience, a lot of clapping and positive hooting in the cinema on many scenes, the plot of the story is social based on corruption, but its a fiction yet in reality based aspect.... A great movie and a, great storyline with an flawless actor Akshay Kumar, apart from him other actors are just decorative which doesn't give an appealing essence yet its a movie to watch for with a great social message. ...MORE","label":0},{"review":"Akshay Kumar has yet again delivered a movie with a great message with a mixture of masala for the audience, a lot of clapping and positive hooting in the cinema on many scenes, the plot of the story is social based on corruption, but its a fiction yet in reality based aspect.... A great movie and a, great storyline with an flawless actor Akshay Kumar, apart from him other actors are just decorative which doesn't give an appealing essence yet its a movie to watch for with a great social message... Music is average, production and screenplay is something like small budget films with great story line and deserving actors portraiting their roles makes a film with meaningful aspect.... In a nutshell must watch","label":0},{"review":"The effort made is really appreciable. Acting of AKSHAY as GABBAR really draws attention, feels like character is designed keeping akshay at center. Some of the dialogues are superb but story somewhere lacks down and story can be judged. But it is important to mention great job by SUNIL GROVER. Movie is good to watch with family.","label":0},{"review":"It is a good movie , one should watch it . I  would recommend this movie.  Story is based o n a common man who is against corruption.\nHis wife (kareena kapoor) dies when she was pregnant due to the collapsing of a building.The building was made on without permission by black money transcation(Rishvat).Then Akshay kumar fights them with proofs","label":0},{"review":"Rotten Tomatoes has given 29% one of the main reasons why I don't believe in rotten tomatoes , don't believe that. This movie is fun thought provoking and Action Packed. Strong Acting. Shows the Reality of India. Best Monologues and One hell of a Story. One of the Few flims of India which is entertaining and thought provoking as well ❤️","label":0},{"review":"Storyline direction presentation was amazing but only that hospital scene was not good because my husbande is a doctor he never cheat with his patients very bad without doctors and hospitals we will all die. VIP people like sushmaswaraj removing kidney stone from doctors then we middel class people's can't stay without doctor. So please respect doctors. Doctors are God.","label":0},{"review":"Gabbar is back is a really fantastic movie cause it is based on corruption yes from this we should learn that if we if have to do something for our country then it is not neccesary that we have to be rich we know that gabbar's idea was right but performing that idea the way was wrong but we should always go against corruption and last my fav.gabbar's dialouge Rishavat Mat Lena Varna Gabbar Aa jaaega","label":0},{"review":"The inhuman practices of many private hospitals in India to draw in exorbitant sums of money from dying patients relatives has been shown in a transparent  manner which was really appreciable  since these days humanity is on the lowest Abbys these days  .\n\nHope more movies like this get created and public get to see and be more cautious  of  such happenings.","label":0},{"review":"It is a fantastic movie. You would surely feel that you are speechless at the end of the movie.you would have an amazing experience,  it is  an impeccable movie!","label":0},{"review":"Best movie everrr... i like that part which exposes the doctors. The best scene. Saale mare huye ka ilaaaj krte h🤣","label":0},{"review":"It is a great movie.I was never feeling bore to watch this movie..\n     I love Akki sir..","label":0},{"review":"This film is very good and Akshay Kumar is looking so beautiful in beard I also want this type of beard","label":0},{"review":"Akshay Kumar's movies are never disappointing.\nStrong story with clear dialogues are his key qualities.This movie clearly described how corruption can damage to the country","label":0},{"review":"Akhshay kumar is the best actor..and he illustrated his natural act in this film...everyone should watch this!!","label":0},{"review":"It shows realistic which happens everyone’s life specially with Middle level family. We cant escape from truth","label":0},{"review":"Zabardast Movie. BEST look Of Akshay So far..","label":0},{"review":"It's really causes corruption. I really like this all scene. Fantastic story.......","label":0},{"review":"All would are   not  a  my  action  the  sabbar  but  all would are  very very would so  super duper of a king  the  hero  Akshay kumar  a  would  so  handsome  movie  s   gabbar  all would are  my  very excited  a treck  but  all would are  gabbar is  back","label":0},{"review":"Would love to watch it soon , I've watched half of it and kareena's death scene made me cry 😭","label":0},{"review":"There are some movies which aren't just a two and a half hour entertainment...they are something which influences our lives and gabbar is back is one of them❤","label":0},{"review":"It is a very good movie\nAkshay gives his best in this movie","label":0},{"review":"This is was  osum movie..... Well akki sir always.... Do good movies like this...","label":0},{"review":"Akshay kumarsa performance is outstanding fantastic story line with a strong message.","label":0},{"review":"Nice movie with thanks to makers who tried to show reality behind medical treatment.......","label":0},{"review":"Fntstic movie !  A Akshay fan .... jbrdst action and that hstl scene is too good ...  9/10","label":0},{"review":"gabbar is so emotional movie . and critical . akshay this movie is so good . i like this movie .","label":0}]