[{"review":"I love the movie because\n\n1)Zombies\n2)Comedy and not comedy that involves cheap mimicry or fun regarding people's accents or religions, \n\nThey go to some adult jokes as well\n\nAlso the movie has a Desi feel to it.\nThe characters and the movie development is top notch\n\nThe film will give you perhaps all feelings\n ROFL jokes, some nice thrill,moments of pure happiness (Khushamadeeed),friendship,some flirting stuff ,some typical zombie movie tears(oh he's bit and we'll have to leave him),badass shoo ...MORE","label":0},{"review":"I love the movie because\n\n1)Zombies\n2)Comedy and not comedy that involves cheap mimicry or fun regarding people's accents or religions, \n\nThey go to some adult jokes as well\n\nAlso the movie has a Desi feel to it.\nThe characters and the movie development is top notch\n\nThe film will give you perhaps all feelings\n ROFL jokes, some nice thrill,moments of pure happiness (Khushamadeeed),friendship,some flirting stuff ,some typical zombie movie tears(oh he's bit and we'll have to leave him),badass shooting and what not\n\nSo to summarize the movie,the characters and the chemistry between them, zombies and humour would keep you entertained all throughout the film","label":0},{"review":"Genuinely funny scenes and dialogues without a lot of cheap comedy but Saif's portrayal of a biracial Russian-Indian threw me off a little bit. It was just weird because he reminded me of Chuck Norris for some reason. The accent was a bit over but I didn't mind it on the whole. You don't go into a zombie flick expecting behtareen cinema.","label":0},{"review":"It's far better than big budget comedy films and moreover film story and script writing was the top notch, n specially kunal khemu  comic timing was hilarious he is superb don't why people don't cast him anymore n saif was outstanding in his russian big muscle guy, overall movie is fab n still it's worth watching n hope they will make a sequel of it","label":0},{"review":"Rating:7/10\n\nLet me get straight to the story .Story sucks and kind of messy. But the comical relief and rom-com kind of scenerios really made me laugh. \n\nPros\n\nComedy, Action,Acting\n\nCons\n\nStory is rather loosely bounded,often depicts typical Bollywood movies saying\"protagonists won't die no matter what!\".\nIn some parts the story seemed itself flawed.","label":0},{"review":"I'm gonna say only this much.\nIf you didn't watch this movie you loose the best horror comedy of Bollywood.\nStop wasting time and go watch it now.\nLoved it . Very relatable characters🔥🔥","label":0},{"review":"The was good in terms of concept ,Screenplay,BGM, Comedy scenes. You can watch for just a time pass but keep your expectations in limit as there were most of the scenes in the movie which made the movie stretchy. \nRatings:6/10","label":0},{"review":"If asked I will rate it 4 of 5 'coz it is the only zombie movie of India and will rate 3.5 of 5 'coz the story could be more interacting...\n\nAnd I hope this is not going to be the end of the series... Will love to see if is continued from where it was paused...\n\nWant The #NEXTPART","label":0},{"review":"I watched this movie thrice and every single time i watched it i never stop laughing it’s a sheer masterpiece. One of my favourite movies love it🔥","label":0},{"review":"I didn’t like the story of the movie and ya it was little bit boring too! At first I thought the movie will be better than zombie land but no the movie is not at all better. The storyline is not good little adventure in the movie and that’s all nothing really good","label":0},{"review":"Just outstanding !unbelievable#what can I say about this charm! Just fantastic@Kunal Khemu@love you a lot handsome👏👍👌✌💑🙌🙋😀💐💟","label":0},{"review":"The movie is simply awesome. the comedy and the storyline is so powerful that you can't put your eyes elsewhere other that your screen. waiting for the sequel.","label":0},{"review":"This film left me amused.It was a bold step in Indian cinema with lots of violence and swearing.But dont get it wrong.The movie is a good watch.The violence leaves you open mouthed..While..The comedy just leaves you laughing.Watch this one..Its good.\n\nHowever keep it out of reach of kids.","label":0},{"review":"Love to watch Saif  and Kunal acting on top.\n\nSaif new look was awesome.\n\nLove to watch the movie again n again.","label":0},{"review":"its the soo fun zombies comedy and bollywood in one movie is like heaven idk why it was flop but trulyyyyy loved ittttttt","label":0},{"review":"SERIOUSLY?! After all that heist THAT'S the ending?! If Hardik had been chased by his zombie girl, in the beginning, there wouldn't be ANY movie at all. But good try.","label":0},{"review":"Awesome movie... I was seen this movie many times.. But it's not getting bored.. Acting was also good.. Funny... Movie","label":0},{"review":"If you are looking for story then there is no story in this but if you want to see 1st zombie film made in India then this is it. But it was entertaining","label":0},{"review":"super awesome movie for bachelors, all time funny. In 10 years it will get cult status.","label":0},{"review":"One of the first world movies ever made in Bollywood. The directors have gone out of the way and explored a whole new genre in this industry and they have done justice.","label":0},{"review":"Fabulous movie. First Indian jombie movie.love it so much.","label":0},{"review":"It is just an excellent movie . First zombie movie of Bollywood no Bollywood movie would be better than this","label":0},{"review":"I like this movie music n kunal comedy time. Slowly slowly song my fav","label":0},{"review":"Awesome horror comedy movie. Very funny and some good message.","label":0},{"review":"Very good movie best zombie film anyways bollywood had created only one. XD","label":0},{"review":"really liked it a lot i was waiting for some zombie  bollywood  movie.","label":0}]