[{"review":"This movie is intense. \n\nIt's not for everybody.\n\nWhether it comes to love, passion or pain, everything is shown in the most raw form possible. It's beautiful and heartbreaking at once.\nThe chemistry between Ram & Leela is charged. Their eyes speak when words don't. \n\nThere's nothing that I don't love about this film. Except the end, it was tragic.\n\nThat said, this will always be my favorite bollywood film.","label":0},{"review":"Love it! All the things that I expect from a Bollywood movie. Love Ranveer, Deepika's acting and Bhansali's perfect direction. Yes, the ending is not perfect but hey its the whole experience that makes me love this movie. all the dances, music, costumes, sets, locations - what else could you ask for. the best movie ever","label":0},{"review":"A must watch movie. Sanjay Leela Bhansali Proved that Bollywood can make more romantic/action movie then Hollywood. And again ranveer & deepika show their talents. Script, casting, locations & music specially Gujarati traditional language & dresses are fabulous. 5 out of 5 star.","label":0},{"review":"the second dance( Lahu much lag gaya) is the best thing about this movie. although Deepika and Ranveer's performances and looks are ravishing, movie lacks certain logical points! \nso if you're up to watching a bollywoodstyle epic dramatic love story, and simply feel love,  it's the right choice...","label":0},{"review":"100/10. This film is the best film someone can ever see. It made me cry a lot. Anyone who views this,  recommend u to see the film its AWESOME.  And ranveer and deepikas acting is fabulous. And slb aweskme work again!","label":0},{"review":"A must watch movie. It certainly makes you believe in love.Very good quality of acting and direction.\nMessage of the movie: Love can cherish anywhere between anyone irrespective of the circumstances and it has the power to change the people.","label":0},{"review":"Such a splendid movie! The colors, scenes, songs, humours & emotions-everything was bewitching. This movie is also able of creating a huge fascination among the viewers for Gugarat, the people & their culture.Thanks to Bansali for making this masterpiece!","label":0},{"review":"The film is loosely based on the conception of Romeo and Juliet. The only difference is the leading characters- Ram Rajari (Ranvir Singh) and Leela Sanera (Deepika Padukone) have stronger and bolder approaches. The romance is not on trust love, it is all sex. The climax leaves you feeling guilty, it is so touchy, that you be like, \"Nahi! Nahi! Maro mat. Rajari aur Sanera Ek ho gaye!\" But you know- a William Shakespeare tragedy IS a Classic.","label":0},{"review":"Actually when I saw the kiss scene I completely lost my consciousness because I hadn't seen that kind of scene in my life. It took so long time to remind my normal self. My personal opinion is censor board should definitely delete that things. It was absolutely awful.is there any necessary to kiss in more time","label":0},{"review":"A good take on the classic play Romeo and Juliet with a compelling storyline and amazing cast and crew, it's a heart wrenching passion filled tale.\nGreat movie. \nA must watch !","label":0},{"review":"What a movie!  Totally outstanding. My favorite love story movie. \"Laal Ishq\" song is Superb.✌️And Sanajy Leela Bhansali sir is one of the best Love story director ever.","label":0},{"review":"I regret the fact that I hadn't t watched it way back when it was released. A must watch movie 😀 Bhansali strikes it again with his different direction styles and the desi stories... 😘","label":0},{"review":"Sanjay Leela Bhansali is a real vulgar auterist. His films clearly give importance to style over substance but in a very spectacular manner, if you know what I mean.","label":0},{"review":"I totally love this movie. This is my favorite movie in the world. Song Laal Ishq still brings tears to my eyes. Saddest ending in the world but beautiful movie.","label":0},{"review":"Love story of this movie not simple or common. Acting of Ranveer  and deepika is 10 marks and Songs are also nice.Must watch it baby.","label":0},{"review":"Mr  bansali could written the ending in a happy mood...  why always sad ending in his film?? When everything became right then why they shot each other.... I think the ending could be different.\nAnyway nice story..","label":0},{"review":"Best thing of the movie....\n*Melodious music.\n*Mind Piercing dialouges.\n*Powerful direction\nAbsolutely marvelous acting by deepika & ranveer singh....overall movie is good....😊👍","label":0},{"review":"This is one of my favourite movie ever I seen! must watch;now Sanjay\nLeela Bhansali joined my best director's list.","label":0},{"review":"The Direction Sanjay Leela Bansali is par excellence. The acting of Ranvir and Deepika is rich and natural, which breathes a sense of freshness and emanates the fragrance of gracefulness.","label":0},{"review":"Must watch..This indian director is in the league of top Hollywood directors.Why to watch--Acting by the leads and excellent music.Colors, lighting, costumes all superb.","label":0},{"review":"EXTREMELY GOOD\nGOD MOVIE\nPERFECT TO BE WORSHIPPED\nHAS EVERY ELEMENT IN IT\n\nSHAKESPEARE WAS WAY BETTER THAN BEST,\nSLB HAS ONLY ADDED MORE TO IT.","label":0},{"review":"Ranveer is my faviourate actor and Deepika is fabulous goliyon ki Rasleela Ramleela is very nice movie I love romantic scenes in this movie and songs","label":0},{"review":"Ranveer Singh is a great actor than saha\n Rukh khan.srk is only feat for romantic movies,but Ranveer has ability to do every types of movies.","label":0},{"review":"A very heart touching love story and one the best romantic movies in Bollywood,A must watch movie. 5* out of 5","label":0},{"review":"So good movie the cast is also wonderful one of my favourite movie super good story and I like the cast mainly","label":0}]