[{"review":"Excellent movie, Akki is really talented actor. Haan Maine Bhi Pyaar Kiya  is one of the best movie of Akshay Kumar. Songs are really heart touching. Karishma, Abhishek are also performed well. Udit Narayan,  Kumar Sanu alka yagnik.... All singers in the movie makes this movie more attractive. My favourite movie.","label":0},{"review":"Great movie to watch akshay kumar had played a vital role in this he is one of the best actor in the industry","label":0},{"review":"Nice movie and we have songs about him \nKumar sanu and alka yagnik ji is very good luck with everything is OK","label":0},{"review":"Amazing movie of akshay kumar as always  hats off akki sir😍😍 superb acting & heart touching song 💗💗best movie","label":0},{"review":"Akshay kumar is my faveruit actor i am big fan akshay kumar all movies my faveruit i love u akshay sir","label":0},{"review":"Great family and romantic movie to watch...Akshay kumar is the real diamond and superstar of bollywood","label":0},{"review":"This is very good film I like this film very much song's of film are extremely touch to heart...","label":0},{"review":"I love this movie ever and ever forever there is no movie like this love emotions song everything has in this movie","label":0},{"review":"yes really a good movie .such a good content.and all star cast are excellent and briliiant.good film good story.thanks.","label":0},{"review":"Nice movie. It is a romantic movie and I love this movie.","label":0},{"review":"Nice movie.Abhishek Bachan,Akshay kumar & Karishma Kapoor have played nice roles in it.","label":0},{"review":"Akki sir  my jaan\nI love akkiis all movie\nBcz he real hero","label":0},{"review":"Karishma kapoor is a brilliant actress this film wow very innocent acting i so much this film","label":0},{"review":"Good movie but l would be happy if at last Puja would have married Raj instead of Shiv.","label":0},{"review":"Akshay kumar is my favourite actor i love u akshay Sir u r fabulous","label":0},{"review":"Karishma kapoor my fav heroin.... N i love her acting,  dancing,voice everything.... 😄😄","label":0},{"review":"BEST movie. Better than Godfather.","label":0},{"review":"Wonderful screenplay n direction with very superb perform by Abhishek bacchan..","label":0},{"review":"I didn't liked the movie coz I believed she should have gone for Raj (Akshay Kumar) coz if she really loved shiv she would have never fallen for Raj.","label":0},{"review":"Heart touching  fabulous movie depend on my love story","label":0},{"review":"Heart touching movie with beautiful songs and  good actors","label":0},{"review":"I think this is the best movie of Avishek Bachchan","label":0},{"review":"The acting of akshay kumar is very nice\nI like akshay Kumar's acting a lot","label":0},{"review":"I love  dis movie  , akshay is  my favorite  I love  him","label":0},{"review":"my fav movie ,all d songs r superb","label":0}]