[{"review":"The movie is not bad if we minus Ekta Kapoor stamp from it. The premise where a handsome rich hotelier Aarav ( Emran Hashmi) falls for a poor hotel employee is surprisingly convincing. Their journey from knowing each other to being lovers is well explored and their emotional scenes carry depth. I particularly liked the part where Vasudha is beginning to notice the feelings of Aarav which makes both of them conscious of each others presence. These scenes are emoted so well through their tensed bo ...MORE","label":0},{"review":"The movie is not bad if we minus Ekta Kapoor stamp from it. The premise where a handsome rich hotelier Aarav ( Emran Hashmi) falls for a poor hotel employee is surprisingly convincing. Their journey from knowing each other to being lovers is well explored and their emotional scenes carry depth. I particularly liked the part where Vasudha is beginning to notice the feelings of Aarav which makes both of them conscious of each others presence. These scenes are emoted so well through their tensed body language. I was most impressed with Emran Hashmi’s performance as he looked and played the part perfectly. The longing he feels for Vasudha is projected with utmost sincerity and the pain he feels after losing her feels almost real and heartbreaking. Vidya Balan looked pretty but other than that she was just another Tulsi, or Parvati right from an Ekta Kapoor show overtly obsessed with her mangalsutra and speaks dialogues straight from 1980ies movies. I was disappointed seeing her like this. Rajkummar Rao was disappointing too with grey hair and beard without a single wrinkle on the face. He played an obsessed husband who is willing to get hanged only to teach his wife a lesson or visit his doctor regularly for 20 years hallucinating his wife. This would be his worst performance and is totally worth forgetting. There are other cringeworthy scenes too which make you feel if it really is a tv soap like when the ACP himself comes to Emran to help him get his love back, or when only Emran could go to the forest alone to get the statement of the padre or when everytime he gets the fragrance of those special flowers he follows them everywhere blindly, or when he dies the flame of the oil lamp goes off but if you ignore these parts the movie strikes a chord with you. With most movies showing love superficially this one makes it look real and beautiful. I watched it in 2019 thinking its a very old movie but when i checked it was a 2015 movie from Mahesh Bhatt camp, i am still recovering from the shock. If it was an old movie from 90ies it surely would have been a blockbuster, but its still likeable. The music is very melodious and makes emotional scenes even more impactful. \nIt’s surely a one time watch. I seriously have  to watch other Emran Hashmi films after this as he surprised me with his performance in this one.","label":0},{"review":"Years long I missed this movie going with negative reviews it surrounded itself but I am glad today I watched it and felt it to be exhilarating and moving... I didn't understand why people or even popular web portals were cribbing about this movie... It is not something new which you haven't seen before but the way it has been presented is there to touch the chord of your hearts... Love is a complex feeling and can be experienced in multiple form... The core concept of this movie showcases that  ...MORE","label":0},{"review":"Years long I missed this movie going with negative reviews it surrounded itself but I am glad today I watched it and felt it to be exhilarating and moving... I didn't understand why people or even popular web portals were cribbing about this movie... It is not something new which you haven't seen before but the way it has been presented is there to touch the chord of your hearts... Love is a complex feeling and can be experienced in multiple form... The core concept of this movie showcases that love can illuminate your life or to say fill the voids in you... May be Indian Sanskari you will find it hard to digest this gem but it is beautiful story with amazing music to go with... Vidya, Emran and Rajkumar all are on the point and never goes overboard... If you have missed this like me do give it a try, who knows you may love it too... If you ever loved someone and can have broad mind this will work wonders for you😉😊  #pranureviews","label":0},{"review":"This is a good movie. Vidya Balan's acting is superb. Emran Hashmi is much mature in acting. so better than Raj Kumar Rao.\nThose who like new fresh and different climax they will like it. Its not that always a first marriage is best....In USA many accepts true feeling of love and understand even spouse's second marriage. \nSee \" the day after tomorrow\". \nOr even \"Jab we met\" although its before marriage two affairs..\n\nNeed to understand love as a touching feel..After 20 years of mental agony, Raj ...MORE","label":0},{"review":"This is a good movie. Vidya Balan's acting is superb. Emran Hashmi is much mature in acting. so better than Raj Kumar Rao.\nThose who like new fresh and different climax they will like it. Its not that always a first marriage is best....In USA many accepts true feeling of love and understand even spouse's second marriage. \nSee \" the day after tomorrow\". \nOr even \"Jab we met\" although its before marriage two affairs..\n\nNeed to understand love as a touching feel..After 20 years of mental agony, Raj kumar Rao's character could understood how his spouse's feeling of love with Emran Hashmi's character was eternal. In a travelling bus or plane, when there is no known good movies, and with unexpectedly click this movie, then its good. Those who don't think their spouse's are slave and those who believes men and women both are equal, can understand this movie's direction. One of the best of Bhatt saheb  piece of work.\nI rate this 3.5 out of 5.\nEveryone  has their rights to express their views.\nIn Indian culture with mental block of male dominance this might not be suitable to some or larger portion of the audience.\nNeed to understand that like everything  stories  also evolve over the course of time. Definition also evolving  about love and feelings and acceptance of love.","label":0},{"review":"This movie is about purest  true and unconditional love story which everyone won't understand. The love story in this movie is not  a common love story it contains high level of maturity and spirituality.  Spiritual because the love story shown in this movie is unconditional true and sacrificed! The love which will  make u cry, will gv u alot of pain, at the same time will make u strong,  will make u  fearless,will free u from every ties, n so on.  Even I was one of those ppl who believed the ne ...MORE","label":0},{"review":"This movie is about purest  true and unconditional love story which everyone won't understand. The love story in this movie is not  a common love story it contains high level of maturity and spirituality.  Spiritual because the love story shown in this movie is unconditional true and sacrificed! The love which will  make u cry, will gv u alot of pain, at the same time will make u strong,  will make u  fearless,will free u from every ties, n so on.  Even I was one of those ppl who believed the negative reviews and didn't see the movie but when I saw online after 3 yrs this movie touched my heart chords! Seriously! I hv watched this movie 4 times n I'm still not bored!  If u r planning to watch this movie keep ur tissues ready... This movie is going to make u cry alot but will touch ur soul! 😊😊😊","label":0},{"review":"FOR ME ITS A 5 STAR MOVIE \nI dont ask others to give a five star fir the movie or the plot. Still i just love the way vidhya ji and imran hashmi acted and the story too. Actually i cried for the climax and am so haply that at least in heven they got together. Such a life of vasudha, a single mom and aarav, a hotel owner and still not for fake or fantasy he actually falls for her. Now a days in most movies people just makeout and leave. Here juat show the pure love and i believe it. But when her  ...MORE","label":0},{"review":"FOR ME ITS A 5 STAR MOVIE \nI dont ask others to give a five star fir the movie or the plot. Still i just love the way vidhya ji and imran hashmi acted and the story too. Actually i cried for the climax and am so haply that at least in heven they got together. Such a life of vasudha, a single mom and aarav, a hotel owner and still not for fake or fantasy he actually falls for her. Now a days in most movies people just makeout and leave. Here juat show the pure love and i believe it. But when her husband after all this years. Shown up made everything mess. But it should be like that. And they way everyone acted. I just loved it and am from kerala and i believe if this movie was just maden in mollywood. It may be a hit.i believe because its what life and we cant just always waste our life. I loved it and i recommend it to everyone 💔❤️❤️❤️","label":0},{"review":"The best movie I have seen in a long long time.  It has flaws but it's better than most navel lint we get these days. Just experience the characters as they unfold and it is best enjoyed that way. The audit is a tear jerker to say the least. If you are the emotional types keep the hanky handy. \n\nGreat watch with you loved one for sure...screw the media reviews, those buggers can never be happy in life!!!","label":0},{"review":"I think if the director had hired someone else to write the dialogues it would have been the all time best romantic movie. Some dialogues are a bit over the top and cheesy apart from that it is most pure love story ever to be brought to the big screen. \nImraan Hasmi, and Vidya Balan, have performed flawlessly.\nSongs are divine and the story heart touching.","label":0},{"review":"After reading reviews from leading newspapers, I had not watched the movie...only today I happened to watch it by chance.It is a very beautiful movie not to be understood fully by all esp those who r in hurry to write reviews.HAK tries to portray true love-how someone's love replaces all fear n darkness...n lit up the soul.Dialogues have depth n songs r exceptional. All in all, it was a must match among 'sincere' romantic movies.","label":0},{"review":"I was resistant to watch the movie because of negative reviews with it.Today I am glad I watched the movie. Something different, cannot say timeless love but it was a true love shown.\n\nEmraan Hashmi as always was superb, so with Vidya balan. Rajkumar rao had a small role but was with full of emotions. All In all if you love a lovestory with struggles. This is it.","label":0},{"review":"The movie is amazingly done by the team of this film... This movie try to explain about the true love and how true love make sacrifice for the other one... This movie tells about everlasting taste of the love... This movie will make us cry by watching that's how the movie touch the soul of the viewers.... This movie is for everyone who believes in unconditional ND eternal love.. The music has been the back bone of the movie we can feel the emotion of the characters though the music♥... I was eag ...MORE","label":0},{"review":"The movie is amazingly done by the team of this film... This movie try to explain about the true love and how true love make sacrifice for the other one... This movie tells about everlasting taste of the love... This movie will make us cry by watching that's how the movie touch the soul of the viewers.... This movie is for everyone who believes in unconditional ND eternal love.. The music has been the back bone of the movie we can feel the emotion of the characters though the music♥... I was eagerly waiting to watch this movie ND the movie is worth for that.. The one must watch this movie ❤","label":0},{"review":"One of the best movies I have ever seen. It very much regret that I had not seen this movie in theater. The acting of all the three Imraan, Vidya and Rajkummar Rao was outstanding. This kind of acting and beautiful incomplete love story is hard to find in bollywood. Imrran Hasmai acting and Mohit Suri's work in this movie was admirable.","label":0},{"review":"Fantastic movie !! love it , what a love story. Best scene was that (a) when at last her husband had came and trying to get with come her but heroine was not in any fear. She became fearless and know the power of love . (b) when hero had get heroine to his mother and after that she told that that she don't know how to love , learn her .","label":0},{"review":"Fell in love with Imraan Hashmi all over again. <3\nDidn't watch this movie because of its negative comments, but its worth your time & tears <3\n\nThe songs are exceptionally beautiful <3 and hats off to the dialogue-writer <3\n\nMust watch if you believe in true love <3","label":0},{"review":"This is one of the best movies portraying the essence of pure and unconditional love. The connect that one has in spite of  the very odds in the real life, thrust and hunger to see your love happy and satisfied is considerable. \nBe it what ever generation it is everyone would love this movie.\nAn unconditional love! Wow! can you feel it...","label":0},{"review":"This is one of the best movies. It's refreshing to see such a beautiful movie in the days of senseless so called love stories and sex comedies. I never go by reviews given by TV channels and newspapers. Great actors, beautiful music and lyrics and a really beautiful love story. It also talks about domestic abuse and women liberation.","label":0},{"review":"It's a wonderful movie.... Watched it after a long time.... Music is soulful...... It's a love story with a beautiful message...... Emraan Hashmi is mind blowing.... The characters r perfect as they unfold..... Whether it's Aarav or Vasu or Hari.... All of them loved but their mode of expression was different.... A good break from the monotonous sex comedies","label":0},{"review":"I loved it... it shows about true love. This should have been a box office movie. It is a watchable movie. The songs are very melodious in this. Especially i loved the song 'Hamari Adhuri Kahani'. The lyrics are very nice. As Arijit singh has sang this song it is more nice.","label":0},{"review":"Too much melodrama..film makers must know that Indian audience has become much matured than before..It has a great story but too much of everything ruined it all..Same old filmy dialogues and emotions..Vidya balan is superb as always.. Emraan hashmi is not utilised well.. Rajkumar rao is the best..This movie could have been a saga in the 90's..","label":0},{"review":"Under rated. \nSuperb story narrative.\n\nI keep on watching this movie since mid this year, almost every other week. Especially the song parts. Humnava struck me deep.\nMy 1st encounter with Emran Hashmi n Vidya Balan. Could say i am looking foward to seeing more Emran in other films...\nPlease watch with different perspective about incomplete love affair... it hurts but that is reality...","label":0},{"review":"I saw this movie many times and every time it's like am watching it first time  to the matter of fact First in my life I bothered about the rating of a \nMovie n I was not able to believe the ratings given by the movie experts ,and wanted to say bhai every movie is not about some hardcore drama or action or something else but movies like this... It's a such a brilliant movie ..in one word it's WOW...do watch .","label":0},{"review":"This movie is one of the most beautiful movies. I love tragedies... Tragedies give that intense love feeling. I love You Imraan... This man is just wow in the movie. Vidhya ,ahhh!! Emotions, powerful, beautiful... I just feel sorry for myself, that I saw the movie after so long time after its release.. Now, I don't know how many times I have watched it. I love it, just love it.❤","label":0},{"review":"Very very good movie . Must watch bollywood movie way better than devdas and all . I dont the understand the bloody mentality of these reviewers.who made them movie critics .  Now i think only imdb's reviews are genuine .","label":0},{"review":"One of the best movie i have watched till today\nThey have shown the purest form of love \nEmraan and vidya just nailed their performance. I can see it again and again without being bored. Such a beautiful love story.","label":0},{"review":"A very nice romantic as well as heart touching  work piece .\nLine of the story is realistic of how one can feel love and tries to do everything for them.\nEmerging story.\nMust watch.\nLove is in the air.","label":0},{"review":"I watched the movie before some day. The movie is mind blowing .The songs are soulful. And emraan hashmis acting was perfect and overall a good movie for true love .Thank you mohit suri sir for giving us this wonderful movie.","label":0}]