[{"review":"Except acting and screenplay, everything is good specially background music. Story is very good throughout the movie and skin show is just there only in songs. Vishal Pandya could have made a better movie by picking up some good actors. This movie was like a Abbas Mustan Type movie with twists and turns and with a fast screenplay. Vishal Pandya is a talented director but he should give up the concept of giving skin show in his movie. \nBut still watch this movie one time,you will not be disappoin ...MORE","label":0},{"review":"Except acting and screenplay, everything is good specially background music. Story is very good throughout the movie and skin show is just there only in songs. Vishal Pandya could have made a better movie by picking up some good actors. This movie was like a Abbas Mustan Type movie with twists and turns and with a fast screenplay. Vishal Pandya is a talented director but he should give up the concept of giving skin show in his movie. \nBut still watch this movie one time,you will not be disappointed.","label":0},{"review":"This movie is actually good, i don't know why it didn't work out. May be because of its low budget?  Anyway, its a very different story with unexpected suspension. Usually,  the bollywood movies use to be mostly about the feminism and the other 2 parts of Hate story were also about a feminism. But this gives something different and meaningful message in a movie  like we should not ignore the male-rights  here. I know somewhere out there an innocent man or a boy are suffering too like we females  ...MORE","label":0},{"review":"This movie is actually good, i don't know why it didn't work out. May be because of its low budget?  Anyway, its a very different story with unexpected suspension. Usually,  the bollywood movies use to be mostly about the feminism and the other 2 parts of Hate story were also about a feminism. But this gives something different and meaningful message in a movie  like we should not ignore the male-rights  here. I know somewhere out there an innocent man or a boy are suffering too like we females do. For me this movie delivered a very strong message about male-rights,though in a different way but it delivered.","label":0},{"review":"Smart and passionate film shines throughout the climax.. Maybe it is a remake of some Hollywood movie but it's enjoyable. Shadman Joshi not so good Karan Singh Groveer exceptionally good actresses are good in kissing scenes not in acting but Daisy Shah is better than Zareen Khan.. climax good worth to watch.. \nFinally the Hate Story series established his company for Bollywood lovers...","label":0},{"review":"I really liked the movie. The plot,twists and turns are pretty good, I seriously wonder why it didn't work out. Karan Grover's character is amazing,and he plays it with total swag. I didn't like him during his time on TV as I found him overrated,but after watching him in the movie, I was amazed to see his acting skills.","label":0},{"review":"This movie is good, if you ignore the exotic content! Nicely written, directed, and well acted!. Not a big budget movie so you don't see big stars! But fairly good story! Ignore the love making scenes!","label":0},{"review":"Movie and suspense thriller is really awesome but intimate scenes could be shorted to make it because according to thriller it could be super hit also without these kind of scenes but still I wanna appreciate to KSG, Sharman, Zarin and Daisy for excellent performance but specially solute to KSG for outstanding Look in movie","label":0},{"review":"Wasted nearly two hours to have a painful journey through everything that can go bad about a movie. Poor acting, predictablity of the plot, misplaced melodrama, illogical progress. Even a good actor like Sharman Joshi acted like an amateur.","label":0},{"review":"Do correct job goggle..the headlines you show on the top is very important for us for some necessary information but if your team made this type of nonsense that everyone toke a incorrect information","label":0},{"review":"This moving is very nice , it's background music, characters, songs, are brilliant. I love this movie......! 😀😀","label":0},{"review":"I think google is now old.\nThe movie been release 2 years ago\nBut according to google it just release 2day ago\n.😆 \n.😆 \n.😆 \nGo home google you are drunk 😆😆😆😊😆","label":0},{"review":"Superb movie.\nWe are happy.\nVery suspense.","label":0},{"review":"Hey Google u got it wrong this time. This film has already been released 2 years back.","label":0},{"review":"Movie  songs is a very  special movie songs  sssssssssuuuuuuuupppppeeeer heart teaching songs whaja thum ho kirrak","label":0},{"review":"Why to show fake and wrong news.\nHate story 3 is not in any theatre😡😡","label":0},{"review":"The release date is wrong. The movie has already been released and is no longer in theatres.","label":0},{"review":"Is it Deja vu? Or Am I Living in the future? It's already been released years ago.","label":0},{"review":"Any one like this movie soo best review of business future idea.","label":0},{"review":"Love u nd movi is my favrt","label":0},{"review":"Superb movie \nPer scene 1 twist","label":0},{"review":"one of the most underrated movie","label":0},{"review":"The best movie I've ever seen","label":0},{"review":"I think this movie best of bollywood","label":0},{"review":"Non Sense Movie No any logic Only Sex and Hawas is here","label":0},{"review":"Super movie, One of the best movie","label":0},{"review":"Very good and interesting movie","label":0}]