[{"review":"No 1 in the list of my fav movies. Reason? I can watch it again and again and again and again and again without getting bored! Which I can't do even with 3 idiots, Newton, Special 26, Inception, Avengers, Interstellar, MI, Bourne series, Toy Story, etc. Sad that age catches up with us. Could we ever get to watch the jodi of Govinda and David Dhawan again?","label":0},{"review":"My one of the favorite actor in the Bollywood movies. Best dancer as well as humble person in the world.  L🅾️VE Y0️⃣U 🕺Govinda Ji👍","label":0},{"review":"This is a fantastic movie in ollywood history. I love to watch this movie 100 times","label":0},{"review":"Two time in theatre... & I think I have seen this movie more than 100 times on TV... Still I can watch..Govinda is Hero no. 1","label":0},{"review":"I love Govinda it is very good movie comedy, romance & songs is very nice","label":0},{"review":"Good Entertaining Movie,Govinda ji is most Talented Actor n Dancer, No replacement of Govinda.","label":0},{"review":"I saw in ajanta theater sec-bad superb 🎥 mine good 📝 memories","label":0},{"review":"It's 2018...still love to watch beyond all new movies..why it got 6.1 instead 10/10","label":0},{"review":"Thank you to all makers of this film. I always enjoy this movie.","label":0},{"review":"hero no.1 is good movie and anyone role is very good...nice and comedy movie","label":0},{"review":"Awesome movie I love to see it every time","label":0},{"review":"Very nice goods moovi hai levels the west acter govinda hi","label":0},{"review":"I lv Govinda so much....his movie is awsm...\nI like so much dis movie....lv u ..my hero👏👏","label":0},{"review":"I thing this movice very nice .AND I LOVE THIS MOVI","label":0},{"review":"No 1 in the list of my fav movies. Reason? I can watch it again and again and again and again and again without getting ...","label":0},{"review":"very intersting movie & songs also this my favourte movie","label":0},{"review":"One of the superb movie of Govinda and Karishma","label":0},{"review":"Yup I really like dis movie awesome","label":0},{"review":"No words I love dis movie alotttttttt","label":0},{"review":"I like this film very much and I had it 30 times","label":0},{"review":"Hero no.1 all songs my favourite and movie also","label":0},{"review":"Nice song very nice movie","label":0},{"review":"Excellent movie","label":0},{"review":"Awesome movie","label":0},{"review":"Superb story","label":0}]