[{"review":"Recommended. Not vulgar at all. Nothing sloppy. Hats off to Radhika Apte. The movie is all about Nature and addiction. Nowhere it showed that the protagonist, being a sex addict, has anywhere been disrespectful, vulgar, or dominating and  assaulting for his habits. He was otherwise simple, submissive and sensitive.\nGood to watch.","label":0},{"review":"Very fantastic movie.  Sex comedy and related to real life basically\nPlease hunterr director and producer... \nWaiting eagerly for the  sequel","label":0},{"review":"Some sex related scenes r there, but over all it is good movie, based on today's society condition , as well as a sexomedy ie a sexy comedy.","label":0},{"review":"Interesting movie! Loved the take-retakes where alternate narratives are held right unto the end.","label":0},{"review":"This is Gold, Hunterrr movie represent the whole reality and nice story with beautiful songs","label":0},{"review":"Superb. It just gets better with every watch.","label":0},{"review":"A very different kind of movie. Nice to watch.","label":0},{"review":"Lovely movie, Meaningful though at the end.!Wat u sow u reap.","label":0},{"review":"Very practical movie amazing and a very comedy movie.","label":0},{"review":"pankil sir has left teaching the concept of moles... (his favourite film)","label":0},{"review":"It's practical movie nice thought I like this movie","label":0},{"review":"I love this movie and its songs too","label":0},{"review":"You feel free after watching this film...A must watch film","label":0},{"review":"its not just a sex comedy it is much more which will leave you dumbstruck","label":0},{"review":"Awesome movie","label":0},{"review":"Best movie","label":0},{"review":"This movie is very interesting movie","label":0},{"review":"Best adult movie ....ever  seen","label":0},{"review":"A very good movie.","label":0},{"review":"Not good, waste of money","label":0},{"review":"Great film.","label":0},{"review":"Very nice movie","label":0},{"review":"Very interesting movie","label":0},{"review":"My favourite  movie","label":0},{"review":"Superhit movie.all should watch once","label":0}]