[{"review":"To me Ishq is lawlessness accompanied by bigoted and narrow minded public perceptions about  healthy societal relationships and it's  inevitable prognosis towards anarchydom.\n\n To me Ishq illustrates accurately, how the dices  continue to be heavily loaded against women and all those people who genuinely care for HER and how they are vulnerable and collectively  exploited, violently outraged and ruthlessly judged by a society infested by perverts. All this happen, notwithstanding so many (unenfo ...MORE","label":0},{"review":"To me Ishq is lawlessness accompanied by bigoted and narrow minded public perceptions about  healthy societal relationships and it's  inevitable prognosis towards anarchydom.\n\n To me Ishq illustrates accurately, how the dices  continue to be heavily loaded against women and all those people who genuinely care for HER and how they are vulnerable and collectively  exploited, violently outraged and ruthlessly judged by a society infested by perverts. All this happen, notwithstanding so many (unenforceable) laws  that are intended to secure and  protect a woman's modesty and citizens fundamental rights in general.\n\nA natural fall out of lawlessness in any democracy is the prevalence of one  unwritten \"law\" : \"Might is right!\"  Women and those men who keenly fight for their well being, safety or modesty (their male friends, husband, brothers, father amongst others) jointly and equally  bear and share the brunt of such systemic tyranny. \n\nIn my humble view, Ishq is not really about toxic masculinity or  about how men are raised and how they see the world, and manner in which men need to see themselves in order to presumably survive as men.\n\n Ishq transposed me to those terrible times and similar situations in my life that are all too familiar;  where I was forced to  believe that there is no right move, and consequences are severely onerous; akin to a rigged contest where in the words of Abba, \"the winner takes it all , and the loser stands to fall.\"\n\nThe characters in Ishq are  good-natured lovers with a clear thought and intent to marry in the near future and how they become a prey to the worst kind of moral policing by pervs.\n\nThis is not one of those typical Indian films  that begin with a woman's sexual assault and end with a man's satisfying thirst for revenge.  Here, both parties equally suffer (in their own way). What is the  kind of justice you can seek against rogues (these days)  where there is total  lawlessness?? .At no point did I feel  this style of pursuit  of justice to be a typical instance   of \"two wrongs making a right\".\n\nA man's  pursuit of  justice in present times, can be misconstrued easily by women who tend to operate well in the grey and are ready and willing to compromise under the popular adage \"be ready to lose a battle to win a war\". \n\nIn my view, Men need to get it into their thicker skulls that liberated woman hardly belong to anyone much less any man? They can sleep well even if compromised pictures depicting them are freely circulating in social media.Thankfully, the female in Ishq promptly reveals her true liberated nature.  The writing on the wall is clear. Don't try too hard to secure or protect  your woman's chastity. To the women who don't care  about  men who worry for them and  try and fend and protect them. Don't worry! Those days are getting over.   For those over liberated  women who couldn't care on which side of whose bed they wake up each day -  Stay blessed 🙏 and  count your blessings.","label":0},{"review":"Anuraj Manohar's brilliant direction leads from the front in this romantic thriller.1st half was added just to make people calm and get ready for the gripping thriller to come.\nAfter  Sachi(Shane)  and Vasu(Ann Sheetal) were caught by Alwin(Shine Tom Chacko), Director builds up issues, characters appearing and disappearing. Though that part was little bit long, We get to know the intensity of pain.Director  too tried  to narrate  it  visually and that  part \nwas  nice.\n 2nd half really was a nea ...MORE","label":0},{"review":"Anuraj Manohar's brilliant direction leads from the front in this romantic thriller.1st half was added just to make people calm and get ready for the gripping thriller to come.\nAfter  Sachi(Shane)  and Vasu(Ann Sheetal) were caught by Alwin(Shine Tom Chacko), Director builds up issues, characters appearing and disappearing. Though that part was little bit long, We get to know the intensity of pain.Director  too tried  to narrate  it  visually and that  part \nwas  nice.\n 2nd half really was a neat thriller when Sachi reaches Alvin\"s House and slowly unreveals his revenge.The Last shot was a bit difficult  to digest but thinking more about it, i thought it  isn't  a usual love story at all and that's the right way of thinking.\nEven Shane Nigam's eyes performed exceptionally in the helpless phase than naive phase.Ann puts up a stunning show in raising her voice.Shine roars as 'Antagonist' Alvin.Jakes Bejoy's bgm was Ok.1st song was good.Good dialogs too.\nTo sum it up,Ishq gifts a talented debutant Anuraj Manohar to Malayalam Cinema and discusses a socially relevant issue in a different perspective(All maynot accept the perspective) without preach.\nRating:4.0/5","label":0},{"review":"The movie starts with usual drama or love angle with Shane Nigam in his ever so usual self but as the movie starts hitting the mark it engrosses you totally with it. Shane and newcomer Ann has shined like shining star and every other cast also fits right into the narrative. The movie is thrilling and captivating with moral policing which is a common ground in Kerala. Shine Tom Chacko in negative character makes you loathe him and gives you chill through your spine which is through his brilliant  ...MORE","label":0},{"review":"The movie starts with usual drama or love angle with Shane Nigam in his ever so usual self but as the movie starts hitting the mark it engrosses you totally with it. Shane and newcomer Ann has shined like shining star and every other cast also fits right into the narrative. The movie is thrilling and captivating with moral policing which is a common ground in Kerala. Shine Tom Chacko in negative character makes you loathe him and gives you chill through your spine which is through his brilliant portrayal. The first half showcases how moral policing happens and a couply suffers through it whereas second half without any much of heroism Shane Nigam brings in the revenge factor. By far the filmography of Shane goes, it is his best film till date. The story could have lacked lusture but the director has brilliantly captured this movie into celluloid which is quite realistic in today's world. The climax yet again justifies everything and is brilliant. Only suggestion, I would have for the girls out there in those situation is be bold and fight them. For the sake of movie, it was important to show the character the way it is shown but many a times woman get scared and timid in those situations and you can't complaint. It doesn't overdo in any angle and that's the brilliance of director and scriptwriter. Rightly tagline said, it is not a love story it is a story to be told and effectively communicated. Try it out and you would surely love it.😍😍 #pranureviews","label":0},{"review":"The script has FLAWS at many levels and affects the minds of the future generation NEGATIVELY\n\n1. LACK OF KNOWLEDGE ABOUT LAW: Boy & Girl caught by Police/Local for sitting in the car and almost kissing and threatened to be arrested.  Section 294 under IPC, one can be arrested for kissing if they make a scene that makes people around uncomfortable. Not for a romantic gesture in the back of a car in a parking lot. Each and every child of our society must be taught to inform the police or call for ...MORE","label":0},{"review":"The script has FLAWS at many levels and affects the minds of the future generation NEGATIVELY\n\n1. LACK OF KNOWLEDGE ABOUT LAW: Boy & Girl caught by Police/Local for sitting in the car and almost kissing and threatened to be arrested.  Section 294 under IPC, one can be arrested for kissing if they make a scene that makes people around uncomfortable. Not for a romantic gesture in the back of a car in a parking lot. Each and every child of our society must be taught to inform the police or call for help or dial emergency in such situations and not worry about \"Honour\"\n\n2. BASIC HUMAN RIGHT VIOLATION: A police/local questions two adults of what they were doing in the car when it is none of their business moreover asking questions that makes accusations\n\n3. FEAR & MISCONCEPT ABOUT SOCIETY: It creates fear in minds of girls and women that one should not be in a car with a friend in the dark. And teaches the boys and men that girls who do that are prostitutes.\n\n4. SUPPRESSION OF WOMEN: The female role does nothing but sit quietly and cry. She could have gotten out of the car a million times and walked. But ofcourse she thinks if she does, she'd be raped. Either by the police/local or by others because she's out in the 'dark'. A woman should be taught to respond, act (atleast she did at the end of the movie, thankyou for that scene) spontaneously. \n\n5. MEN+NIGHT=RAPE: The fraud police threatens the hero that the Bengalis walking towards them will rape the girl if he makes any noise. It creates a concept that men are wolves waiting for a rabbit to fall into the woods. Also insults people from other states of India (I'm sure a Malayalee wouldn't take that insult). The men could have protected the girl if he had made noise. We should be taught to trust the people around us not fear them. \n\n6. OBVIOUS CLIMAX: After the behaviour of the hero from 5 min before the interval until the end, one should have guessed by now that a lead female should never a maniac who doesn't understand woman, gets easily emasculated and takes a revenge by traumatizing an innocent woman and child. I felt bad when the theatre filled with applaud to the hero's savage revenge.\nIt would have been a suspense if the woman had said yes to his proposal. \n\nPOSITIVES:\n1. BRILLIANT direction\n2. Cinematography 👌\n3. Excellent acting by each and every actor\n\nIt was an absolute torture overall.","label":0},{"review":"I just loved this movie... u may feel a lil lag but its worth watching.. Maybe that lag gives so much depth n meaning to this movie.. I felt really disappointed seeing the empty theatre.. Y do ppl just ignore such thoughtful movies n hit a house full only for all the 'vulgar stuffed dialogues' n mass entries.. Ishq is just real, simple but deals with complex notions of society.A few audience applauded for hero's heroism but wot made me happy was obviously the actress' sheroism in the end..N i fo ...MORE","label":0},{"review":"I just loved this movie... u may feel a lil lag but its worth watching.. Maybe that lag gives so much depth n meaning to this movie.. I felt really disappointed seeing the empty theatre.. Y do ppl just ignore such thoughtful movies n hit a house full only for all the 'vulgar stuffed dialogues' n mass entries.. Ishq is just real, simple but deals with complex notions of society.A few audience applauded for hero's heroism but wot made me happy was obviously the actress' sheroism in the end..N i found me n my frnd only clapping at the end..The climax could be the only reason y ppl r  coming up with ultra negative comments on the film.. Its just breaking the stereos.. Loved it.. Shane, Ann, Shine n all r just ozm.. Ishq se mujhe ishq huva..' Wow film'\nBut still.. The movie can be viewed from another dimension.. Like objectification of women is there throughout the movie n to make ppl feel good in the end,a feministic element is added..trick or wot..Maybe all those objectifications n dialogues carrying vulgar n also the words portraying that man owns a woman is used to make ppl feel get relate to the characters.. N only in the end woman becomes a person..Till then she is an object..Ppl were all the while thinking themselves in the place of Sachi(shane) n in the end its a clear slap to them...n one more thing,i cant understand being the shero y such a poster is given where she stays behind him.. Many dimensions in a single film..film needs to be discussed. Anyway a thoughtful movie","label":0},{"review":"Great movie that's well directed and scripted.  Talks about the society and it's exploitation of young couples in the name of moral policing and how something like morality  can be exploited buy human being in the name of good deed. The movie breaks all the cliched heroism where the hero takes revenge and get the girl at any cost.  Doesn't have much crazy dialogues but still each one has its depth that puts you into the mood. Realistic and evoking actors along with suiting music made this thrill ...MORE","label":0},{"review":"Great movie that's well directed and scripted.  Talks about the society and it's exploitation of young couples in the name of moral policing and how something like morality  can be exploited buy human being in the name of good deed. The movie breaks all the cliched heroism where the hero takes revenge and get the girl at any cost.  Doesn't have much crazy dialogues but still each one has its depth that puts you into the mood. Realistic and evoking actors along with suiting music made this thriller one exciting movie to watch. Also if you want to know how to gain respect and trust from woman other than beating up the villains , and vomiting some punch dialogues, go for this movie.  It got some small evoking incidents that actually (may) change your sexist mind that most of the Indian movies are portraying. Great job .","label":0},{"review":"Superb socio relevant movie..its not just a love story,its the current story as well as well needed future story of the society..Its a big lesson to all lovers who are in top of lust,to all those stupid people who themself behave like moral while sexic inside..This movie also makes a family related idea..The movie kept a thaught to the society that \"A MEN SHOULD BE MEN,NOT ONLY TO A GIRL,BUT ALSO EVEN WHEN SOMETHING HAPPENS TO HER\"..\nAs always shane was excllent..movie shown as different but sup ...MORE","label":0},{"review":"Superb socio relevant movie..its not just a love story,its the current story as well as well needed future story of the society..Its a big lesson to all lovers who are in top of lust,to all those stupid people who themself behave like moral while sexic inside..This movie also makes a family related idea..The movie kept a thaught to the society that \"A MEN SHOULD BE MEN,NOT ONLY TO A GIRL,BUT ALSO EVEN WHEN SOMETHING HAPPENS TO HER\"..\nAs always shane was excllent..movie shown as different but superb character style shine tom..Ann sheethal was awsome at the climax..\nIn short,this is an awsome piece of excellence art..","label":0},{"review":"I hadn't read the review but mainly wanted to watch as Shane Nigam is a budding young actor with great emoting talent in my opinion.. \n\nThe movie is very good and brings out many pertinent questions.. Objectification of women by men is the basic theme and though the first half seems to drag on,  the second half makes up more or less.. \n\nBarring some filthy dialogues which have become a trademark of Malayalam movies,  it is a movie which male youth especially should watch.. Superb acting by Shane ...MORE","label":0},{"review":"I hadn't read the review but mainly wanted to watch as Shane Nigam is a budding young actor with great emoting talent in my opinion.. \n\nThe movie is very good and brings out many pertinent questions.. Objectification of women by men is the basic theme and though the first half seems to drag on,  the second half makes up more or less.. \n\nBarring some filthy dialogues which have become a trademark of Malayalam movies,  it is a movie which male youth especially should watch.. Superb acting by Shane..","label":0},{"review":"ISHQ--a realistic movie , depicts one of the most intolerant issues of current society.\nIt is worth watching. Even though movie is not a regular masala , heroic film with many mass dialogues stuffed in but this movie is peculiar and the crew has thought out of box. \nShaine Nigam is a promising blooming star and Shine Tom Chacko did a great job.\nA great work by the Director Anuraj Manohar and  crew.\nSid Sriram's voice was soo captivating and awesome as usual .\nMy rating 4/5.\nThankyou 🙏 the","label":0},{"review":"A great movie, intense. Shine Chanko has done a brilliant job. He makes a terrific villain. We just hate him and feel so repulsive towards him. Shane has also done a great job. We feel his helplessness and his need for revenge! N loved the last scene. Exactly what I thought at that moment was conveyed by Vasu. Overall a brilliant movie. A great plot, narrated perfectly.","label":0},{"review":"Horrible & NOT SUITABLE for Family audience\n\nThis is not a love story, not an entertainer, not a thriller, not a movie also; but, a 10 minutes short film dragged into a two hour harassment to viewers.\nStrictly adults only, considering the mental harassment we need to face inside theatre due to horribly negative narrative of the tale. My family was telling me to go out of theatre in the first 40 minutes of the film.\nIf you like to disturb your mindset and mood, go and watch this alone. Don't drag ...MORE","label":0},{"review":"Horrible & NOT SUITABLE for Family audience\n\nThis is not a love story, not an entertainer, not a thriller, not a movie also; but, a 10 minutes short film dragged into a two hour harassment to viewers.\nStrictly adults only, considering the mental harassment we need to face inside theatre due to horribly negative narrative of the tale. My family was telling me to go out of theatre in the first 40 minutes of the film.\nIf you like to disturb your mindset and mood, go and watch this alone. Don't drag others into this HORROR. DON'T WASTE MONEY AND TIME.","label":0},{"review":"I went for the movie because of the beautiful romantic song. Yes, as they claimed it's not a love story. It raised my blood pressure.  A tensful  2hours movie,(roughly) May be the initial 15mins that was sweet.\n\nA thought provoking movie. Lite hearted People may not be able to handle the peer pressure from the movie. Actors have done their roles so perfectly. Loved their chemistry, acting and the message.","label":0},{"review":"#ishq 3.75/5\nUnexpected Climax I clapped definitely you'll also. \nIshq is really not a luv stry as in the title.Every one shld wtch tiz movie. Many movies tried to show the power of men to protect women. But here we get a new vision. \nAfterthe intervel it really made us on the edge of our seats. The best thing about the movie was the climax. I don't want to spoil it for you.","label":0},{"review":"Ishq is a must watch...It's about moral policing and how badly it affects relationships...but moreover it's the question of trust in relationship...It's thrilling, unpredictable, unprecedented story with a gripping storyline and bold script...It's a slap on the face of the whole society...Every actors performed superbly...Shaine Nigam is ever growing actor...From Bobby to Sachy...and climax comes like perfect icing on the cake even though it is against the will of common malayali masala movie au ...MORE","label":0},{"review":"Ishq is a must watch...It's about moral policing and how badly it affects relationships...but moreover it's the question of trust in relationship...It's thrilling, unpredictable, unprecedented story with a gripping storyline and bold script...It's a slap on the face of the whole society...Every actors performed superbly...Shaine Nigam is ever growing actor...From Bobby to Sachy...and climax comes like perfect icing on the cake even though it is against the will of common malayali masala movie audience including me....Hat's off to the team ISHQ","label":0},{"review":"Don’t miss this Movie 🎥.. Especially for Youngsters .. Must watch ... Till first half can’t sit in d seat 💺... so much tension... thought to walk out ... but some how sat .. it’s an special movie 🎥 & Lesson for Youngsters in kerala & Else ...\n\nKindly watch in good screen without any disturbance \nShane Nigam improving day by day ... \n\nDirector Hats of U Man ... 👏👏🔥🔥💪","label":0},{"review":"one of shane s' best performances i have ever seen since kumblangi nights eeda,and ishq\n\nteam had done lot of efforts  and hard work from midnight to day light its like an hollywood level performance from shane nigam,ann sheetal,leona lishoy and shine tom chacko.\n\nmust watch in theatres\nworth a watch ishq movie\n\nRating\n5/5","label":0},{"review":"Had begun to look forward to Shane Nigam movies after Eeda and Kumbalangi Nights.\nYes, he has indeed lived up to our expectations in Ishq too. And Shine Tom also deserves credit for his portrayal of a cool villain  . Overall an excellent movie .","label":0},{"review":"Brilliant movie... the movie starts with a slow pace and gradually swifts to extreme .. must watch movie which have two perspectives from their sides.. at the end of the movie showing middle finger indeed a question mark but has hidden continuation where two genders can resolves it themselves.. brilliant acting by both","label":0},{"review":"Anuraj  at his best delivered one of the very good different genre movie. The movie experience was really different and very good. Shane has given two different shade of performance which really elevated the pitch of the movie. Watch this for good presentation for top class acting especially from Shine Tom Chacko.","label":0},{"review":"Movie which is worth watching. It has a subject which is faced in our society, mob policing. People take the policing work for their advantage to harass and 'gain profit' out of it. Actors have given full justice to their work. And the climax of the movie is quite different from the other movies. \nThanks to the Director and technicians for such a nice movie. 👏💐","label":0},{"review":"Must watch for all generation of Malayalees. \nYou feel disturbed - if you hate anti social elements in our society.\nYou feel threatened - if you are an anti social.\nYou feel guilty and ashamed - if you ever mentally supported moral policing.\nAnd for couples - its alarming. Moral policing will continue. Preventing such circumstances is vital.\nShine tom and Shane - amazing performance.\nScript and direction - Deserves applause.\nWell done.","label":0},{"review":"ISHQ\n(drama/thriller)\nIt lives upto ' not a love story' tag. The turn of events in both half of the movie is super interesting.\nThriller movie to the core.\nThe movie succeeds in making you hate the negative character, and the events of the second half will be definitely a feast for the audience. \nThe ending brings out another view of the major social problem portrayed in the movie.\nOverall very good,4","label":0},{"review":"God...we went to see a light hearted movie and it was a breathtaking end of the seat thriller great acting as the leacherous cop by Shine Chacko Tom, shine Nigham as a loving easy going Techie who changes colours, Anne Sheetal as today's girl and the wife of Tom , Lionel Lishoy and as the tailor. Worth a show. Great direction and tight scree play...","label":0},{"review":"Though the story line is very straight and simple... Screen play and Camera work will keep every moment freezing and thrilling.\nAt points you feel you hate protagonist like anything then you change your mind....\nIt's a journey you need to experience....\nWonderful direction and actors.","label":0},{"review":"OMG! Never ever miss the movie.Highly engrossing storyline.Another great performance from Shane and Shine Tom.\nThe movie makes us ruminate about each and every characters,especially Sachi(Shane).I'm still hungover😜.Special thanks to the Director.\n\nA lot more than 'Worth it'.","label":0}]