[{"review":"Do you belong to this era when this gem was created? Yes, I am the fortunate one who belong to this era and grew up as a child. This movie, “Jo Jeeta Wahi Sikandar” is a perfect expression of love, emotion, feeling and trust which is so rare a commodity these days. And the songs are like a dose of unadulterated love and deep emotion, that you feel in its every word and phrases. It brings back those fond memories of school life, when we too had our infatuations and soft corners. A must watch!","label":0},{"review":"No words for JJWS. Fantastic movie which bring back us in the sweet memories of school and college. JJWS show the healthy rivalry between the students of two different different schools. It's a memorable movie which gives splendid experience and entertainment. JJWS shows the Dedication and Determination of two brothers to full fill the dream of his father . Situations are against us how much but finally success goes in the favor who effort with hardwork and honesty. We should never give up and n ...MORE","label":0},{"review":"No words for JJWS. Fantastic movie which bring back us in the sweet memories of school and college. JJWS show the healthy rivalry between the students of two different different schools. It's a memorable movie which gives splendid experience and entertainment. JJWS shows the Dedication and Determination of two brothers to full fill the dream of his father . Situations are against us how much but finally success goes in the favor who effort with hardwork and honesty. We should never give up and never be proudy in life. We should loyal towards the person's from whom we are associated. JJWS shows us that how responsibility can changed the nature and behavior of a person.    Aamir acted well as usual and Aysha Julka looking very cute and pretty . Khulbhusan Kharbanda is acted well as a responsible father. All the songs are melodious and heartouching especially Woh Sikdar and Pehla Nasha. Location is too good and effective. Excellent and effective direction by Mansoor Khan and his team.10/10","label":0},{"review":"I love this movie. I was born in 2002 and this Movie was released in 1992. Still, the moment I had seen this, I've loved everything about it. The plot , the cinematography, the way they've all acted their characters out is appreciably good. \n\nEach time I see this, I'm reminded highly of the India we had then which unfortunately is no more. The simple lives of people, the robust fights between the college students, the madrush for a girl , all these are well shown in the movie. It's a  good one.  ...MORE","label":0},{"review":"I love this movie. I was born in 2002 and this Movie was released in 1992. Still, the moment I had seen this, I've loved everything about it. The plot , the cinematography, the way they've all acted their characters out is appreciably good. \n\nEach time I see this, I'm reminded highly of the India we had then which unfortunately is no more. The simple lives of people, the robust fights between the college students, the madrush for a girl , all these are well shown in the movie. It's a  good one. Must watch if you haven't. \n\nI assure you, you'll like it if not love .","label":0},{"review":"i like this movie ....even though i was born on the year 2001...this movie does give me a nostalgic vibes\nthere r many reasons 2 love this movie\n1.BEAUTIFUL SONG\n2. CINEMATOGRAPHY IS BRILLIANT\n3. LANDSCAPES KEEPS THE FRESHNESS 2 THIS MOVIE\n4. STORY LINE IS GUD\n5. LEAD ACTOR (amir khan) IS REALLY GUD AND CHEMISTRY BETWEEN HERO AND THE HEROINE IS DAMN AWESOME\nif u wanna watch this movie.....u can watch it in youtube...i don't know if it is there now but anyways just try 2 watch the movie","label":0},{"review":"Honestly, I feel this is Aamir Khan's all time best movie. \nEspecially last cycle race scene,which pumps up the adrenaline rush to the highest level and is equally emotional.\n\nThis movie also has brilliant performances by Aamir's onscreen brother, Mamik Singh,, his father kulbhushan kharbanda, his 2 friends, Ayesha Jhulka and specially Deepak Tijori.\n\nI have watched this movie over 500-600 times as I have a video cassette of this movie.\n\nThis movie is one of my all time favourite.","label":0},{"review":"I was a teenager when this film was released and it still evokes in me the same feeling when I saw it at the time it was released and it is really an evergreen movie with some really soul-stirring music by the Jatin-Lalit duo.... lovely lyrics and soulful rendition by the playback singers.... a feel-good entertainer to the core...  I highly recommend to the current young teens....the aim of a movie is to evoke in you some really good feelings.... this movie serves this very purpose very well...","label":0},{"review":"Then I was a bachelor and like me and even to those married this movie came as a fresh breeze of a love story with love blossoming in school, college and neighborhood of a small town with lovely music. Both Ayesha Jhulka and Amir Khan acted naturally with great support from everyone around. One of the movies that will be remembered forever.","label":0},{"review":"Aamir Khan has always been a great performer, right from day one (qayamat se qayamat tak), his acting prowess has intensified by leaps and bounds in each and every movie of his over the years, even in a flop movie he would display his potential to the optimum. This is of course a masterpiece from Mansoor khan's production House.","label":0},{"review":"What a movie .. Awesome really . I love this movie ...Jitni baar dekho aur dekhne ka man karta hai... Really thanks to the team for making such a movie...And also the song Pahla Nasha heart touching song..","label":0},{"review":"Never-seen-before kind of cinema. Amazing credentials whichever angle you see it from. That vulnerability, portrayal of true, pure undiluted love.....reeling under soft yet severe nostalgia. What romance dear! There'll never be another JJWS.","label":0},{"review":"One of my film in my life . After watching movie I taken very much interest in sport .. \nMovie taught me about real meaning of competition.\nStill I am enjoying the last movement race of this film .","label":0},{"review":"My all time favourite movie whatever happens in this movie each dialouge from the begning till end i love every thing this picture is the tume in which i had grown so anytime one of my fav film forever","label":0},{"review":"One of my fav movie truly inspirational , when i was in class 10th i took this movie as a inspiration because i was too dumb in studies and after watching this movie i decided to dedicate myself to study. and top the exam in my class.","label":0},{"review":"what can we expect from a man who is extremely perfect as well as rellay really inspirational for Indians.\nProud to say as Indian we have AMIR KHAN........Love n Respect","label":0},{"review":"Was released on 22 may 1992 on my birthday ... However it's songs made sense when I was in class 11 in 1998 .... And then in collage the movie made complete sense ... Till date .... Just love it and miss the lovely 90ies","label":0},{"review":"Jo jeeta wohi sikander was a pioneer of sport movies in Bollywood..... relatable characthers, good simple story..... aided by good performance by Aamir khan..... Good movie to be seen by all age groups.....","label":0},{"review":"Fantastic movie all time.. Background ate just Fantastic.. To see Truly Inspirational movie.. Love & emotions n dedication was there.. Songs were just amazing..","label":0},{"review":"One of my  all time favourite movies. Beautiful movie with awesome songs!! Aamir Khan is my favourite actor and I actually like the whole star cast, story, direction and movie.","label":0},{"review":"Excellent cycling movie, to promote cycling, I was part of it as I was champion in those days, It was a wonderful experience working with the whole unit, and I still cherish those moments i spent with them.","label":0},{"review":"One of the best entertaining movie I have seen till now. Full of energy. All characters are very well placed & acted also. Must watch movie. This is a evergreen movie.","label":0},{"review":"Easily the most entertaining movie on sports ever in Bollywood. It's gold that never loses it's shine. I would always love Aamir for this one.","label":0},{"review":"One of the best movie bollywood has ever made .....it has that motivational kinda thing during the ending part of the movie. Aamir Khan played the character of a typical carefree guy to Perfection.","label":0},{"review":"The coming of age movie ....... I was in 6th std..... And still could connect to the movie ....my girlfriends and me would sing pehla Nasha song till days on end ... And we would wonder how our life would turn out would we even meet a Sanju of our lives.","label":0},{"review":"Must watch movie. A combination of a great story and great actors. Every songs and emotions and be felt deeply. Simply great.","label":0},{"review":"Very lovely movie.  A must watch for all lazy youngsters who want everything sitting only.there is no substitute for hard work.","label":0}]