[{"review":"Absolutely fantastic!!\n\nKoi Mil Gaya is a Science Fiction film which was released in 2003. The storyline is the same as that of the Hollywood flick “E.T.: Extraterrestrial”, which in turn was speculated to have been inspired from the film “The Alien” by the renowned Indian filmmaker Satyajit Ray.\n\nPlaying the role of a mentally challenged guy is not cakewalk, but Hrithik Roshan plays it brilliantly.\nThis film was a huge hit in 2003, the best one in years. Everyone performed his/her role well, Hr ...MORE","label":0},{"review":"Absolutely fantastic!!\n\nKoi Mil Gaya is a Science Fiction film which was released in 2003. The storyline is the same as that of the Hollywood flick “E.T.: Extraterrestrial”, which in turn was speculated to have been inspired from the film “The Alien” by the renowned Indian filmmaker Satyajit Ray.\n\nPlaying the role of a mentally challenged guy is not cakewalk, but Hrithik Roshan plays it brilliantly.\nThis film was a huge hit in 2003, the best one in years. Everyone performed his/her role well, Hrithik Roshan became an overnight superstar (his earlier film “Kaho Naa Pyar Hai” also set his image) and the concept of Science Fiction in films was relatively new to the fans, who accepted it wholeheartedly","label":0},{"review":"I think I was 5 when I first watched Koi Mil gays and now it is my go-to childhood film. I must have seen it over a hundred times. And I continue to watch it and show it to my little cousins. My childhood crush Hrithik Roshan kills it everyone with his beautiful acting. I know people now say this film was just a bad rip-off of the Hollywood film “E.T.” I think it’s more than that. It’s a film filled with friendship, good times and discovering  what a curious mind can find and feel. The music and ...MORE","label":0},{"review":"I think I was 5 when I first watched Koi Mil gays and now it is my go-to childhood film. I must have seen it over a hundred times. And I continue to watch it and show it to my little cousins. My childhood crush Hrithik Roshan kills it everyone with his beautiful acting. I know people now say this film was just a bad rip-off of the Hollywood film “E.T.” I think it’s more than that. It’s a film filled with friendship, good times and discovering  what a curious mind can find and feel. The music and background scores catch you in your feels. I hope Bollywood never tries to recreate this Koi Mil Gaya it is a classic and should remain untouched. Highly recommended I am amazed every time.","label":0},{"review":"My favourite childhood movie and the very first one where I distinctly remember going to the theatres to watch it with my family. I was just 7 at the time. \nMore than 16 years later and I still look back fondly to this movie.\n\nSci-fi, comedy, romance, action, emotional drama...This movie has it all. Hrithik gave an amazing performance in both the roles. \nThe songs are memorable. Jaduu is adorable little alien and the ending was beautiful. I think they should've just left it off there. The sequel ...MORE","label":0},{"review":"My favourite childhood movie and the very first one where I distinctly remember going to the theatres to watch it with my family. I was just 7 at the time. \nMore than 16 years later and I still look back fondly to this movie.\n\nSci-fi, comedy, romance, action, emotional drama...This movie has it all. Hrithik gave an amazing performance in both the roles. \nThe songs are memorable. Jaduu is adorable little alien and the ending was beautiful. I think they should've just left it off there. The sequels seem unncessary to me.","label":0},{"review":"This movie was a CGI breakthrough for bollywood, inspired by E. T. The extra terrestrial this movie was just freaking amazing, it made you laugh and cry too. Kudos to hritik for his performance i still remember i cried when they break his scooty. This movie was just fantastic!!! 😋","label":0},{"review":"One of the finest movies made, don't dismiss it as a copy of ET,  Hrihtik Roshan gives a heartwarming career best performance. \n\nHrihtik also shares incredible chemistry with the wonderful Priety Zinta and the  supporting cast includes the brilliant Rekha.\n\nA true masterpiece from Bollywood.","label":0},{"review":"Though this film was relelased in 2003, it can still break through your walls and make you emotional. The best part of the movie is, of course, Hrithik's acting as a mentally challenged person. The message of this movie is simple; unlimited love and loyalty for your friends and familly, and respecting disabled people","label":0},{"review":"I am too just 12 years when I watched koi mil gaya ..Amazed by the story,don't compare it with ET, because most of you who don't know that ET(extra terrestrial) was based on Satyajit Ray script.\nHollywood has misused the Ray's faith.stopped the production of script which he was writting. And rest is the history SPIELBERG.....","label":0},{"review":"This is a good movie. I don’t want to spoil it but basically this disabled kid meets and alien which changed his life. HIGHLY RECOMMEND even though it is an old movie.","label":0},{"review":"Koi Mil Gaya is a very good film which sets an example that who a mentally challenged youth makes an effort on how to fight with his disability and makes himself prepared to face people.","label":0},{"review":"Well its been 15 long years...but whenever it  comes on TV i do watch it. Still remember when i watched it when i was a kiddo...storyline ,inspiration & beautiful location makes this one of the best movies.","label":0},{"review":"The movie was awesome! This is one of my favorite science fiction movies. Drama, action, romance, and aliens. Loved the movie!","label":0},{"review":"Indian version of ET. But that's okay.. Hrithik's acting as mentally challenged is just superb.. A total entertainer.. Love this movie","label":0},{"review":"I loved this film truely i started crying half of the movie hritiks performance was superb he should deserve national and international awards and the movie should get oscar award","label":0},{"review":"Nothing to say wrong things about this movie. It is a heart melting film that I ever watched. Please see this film. Hrithik performance is amazing , super,fantastic and⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐. Priety zinta is queet and done her role very well. Rekha ji is always super. Her performance as a mother is also like that only. So,please watch this and enjoy this. ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐.","label":0},{"review":"I wasn't even born back then and when I first saw that movie I absolutely fell in love with it!! \nI love it!! \n\nHope you guys love it also!.","label":0},{"review":"2003 i watch this movie i m only 13 year old and this time totaly attract me this movie and then today 31/3/2018 after 15 year later i watching but \" fever wahi hai 2003 wala \" 😢😊","label":0},{"review":"One of the most interesting and a type of movie which can never bore u... No matter how many times u watch it","label":0},{"review":"It's very amazing and inspirational movie for me.Kids were played a vital role in this movie.I love so much this movie.I satisfy.......","label":0},{"review":"It's a very sad movie although it has some comedy parts the beginning is very sad. THIS MOVIE IS NOT SENSITIVE PEOPLE. AT MY SCHOOL MANY PEOPLE CRIED BECAUSE OF IT.","label":0},{"review":"Best movie I have ever seen....Hrithik's acting was fabulous.....Mentally disable child to a very handsome guy, both performed excellent","label":0},{"review":"I love this movie a lot l Love hrithik       he was so cute as rohit I love the friendship between jadoo and rohit","label":0},{"review":"Very good film 🎥 I love to watch it again and again. All actors acting 🎭 is awesome","label":0},{"review":"The Movie is nice but it is a remake with slight changes from the movie ET(Extra Terrestrial)1982. But the acting is good but Rohit Mehra (Hritik Roshan) has done a bit of overacting as I would say.....","label":0},{"review":"Awesome movie it made my childhood beautiful and it was a brave attempt of its kind, got success like a boss.","label":0},{"review":"I  watched  this movie  in  class  9 . Rohit  faild in   class  7 and  me  to. This  movie  inspired me and   Kuch  v kacha  nahi  paka  Nai. Song","label":0}]