[{"review":"The only sense this movie made was nonsense...so typical of those times...a script which was more suitable for Manmohan Desai potboiler with over-the-top performances & chest-thumping patriotism signifying nothing. Music of the film, though very popular, was more in keeping with the front-benchers' taste rather than patriotic fervour which the theme of the movie required. The movie, however, was a blockbuster & maybe that is all that counts.","label":0},{"review":"A great movie again by legendary Manoj Kumar with another living legend Dilip Kumar and other popular actors like Shashi Kapoor and Shatrughan Sinha. Very inspiring movie. Good script and songs are another assets.","label":0},{"review":"I have seen this movie when I was on class four I got very inspiration from this movie.i these types of movies try to bring a person on his dream if they think seriously.this was my favourite movie on childhood.this is the first movie which I have seen on childhood first time","label":0},{"review":"Best screenplay & story. Lovely direction by Shri Manoj Kumar. \nGreat multistarer movie with one any only Shotgun as Kareem Khan...","label":0},{"review":"A very good movie to instill love in kids for our beloved mother \nland...much much more \nbetter way of today's \npseudo nationalism was shown..","label":0},{"review":"First time ever I came to know Dilip Kumar while watching karanti movie in Kolkata paradise cinema hall.1981. the father of fathers in movie industry.","label":0},{"review":"I saw this movie in 1985 when I was in 4th standard It is revolutionary movie which raises the voice of Indian exploited people against the injustice was done with Indian people by British administration","label":0},{"review":"Good movie I saw this movie in 1982. It's a really good movie and inspirational too.","label":0},{"review":"I just want to actors are legendary actors ...suberb work ...as well as the movie is realistic","label":0},{"review":"One of the favourite film. I have seen it so many times.","label":0},{"review":"Nice movies i like this movie is great memories","label":0},{"review":"Great movie doing acting is best all 🎥 stars","label":0},{"review":"The best movie forever. I always want to see this.","label":0},{"review":"kranti is a nice film that everybody need to watch.","label":0},{"review":"My favorite and very nice movie in this world........ Thanks Bharat Kumar","label":0},{"review":"A wonderful movie of dilip sahab and manoj kumar","label":0},{"review":"Very old movie but still gold movie it's one of my favourite movie","label":0},{"review":"Inspirational movie for all the Indians","label":0},{"review":"Very best film I like it","label":0},{"review":"Great actor Yusuf khan sahab second  actor Manoj Kumar nice picture","label":0},{"review":"I love each and every scene","label":0},{"review":"Good One work of Manoj kumar","label":0},{"review":"This is lovely movie is my favorite...","label":0},{"review":"Best movie very nice movie","label":0},{"review":"Best movie of manojkumar","label":0}]