[{"review":"Really guys movie was amazing ,it was the second movie which made me sat on my chair till end even in this interval (first was Ra.one). And the best thing is that it is also the bollywood movie which is based on science fiction. Otherwise Bollywood movies would come only related to love, war, affair, politics, etc. But this movie was amazing, I just want to thanks Rakesh Roshan Sir who took the effort to male this some unic .\n          \n          And there are many illitartes who just dislike th ...MORE","label":0},{"review":"Really guys movie was amazing ,it was the second movie which made me sat on my chair till end even in this interval (first was Ra.one). And the best thing is that it is also the bollywood movie which is based on science fiction. Otherwise Bollywood movies would come only related to love, war, affair, politics, etc. But this movie was amazing, I just want to thanks Rakesh Roshan Sir who took the effort to male this some unic .\n          \n          And there are many illitartes who just dislike the movie and says it a copy. For them I want convey that if a tea seller can become a PM likewise there would be also a coincidence. You must just appreciate that Bollywood are also trying to improving and we specifically I are the audience who all are sick of this love story, suspense movie, etc.","label":0},{"review":"At first I liked this movie but recently watched the X-Men series only to realize how much this movie has copied from X-Men(2000) movie. Basically,\n\nKaal is a fusion of Professor X and Magneto, possessing powers of both. Before his treatment, he's on a wheelchair and has psychic powers like Professor X and once he gets on his feet, he's completely Magneto just with a different appearance.\n\nKaya has the shapeshifting abilities, flexible body and acrobatic fighting style just like Mystique.\nEven t ...MORE","label":0},{"review":"At first I liked this movie but recently watched the X-Men series only to realize how much this movie has copied from X-Men(2000) movie. Basically,\n\nKaal is a fusion of Professor X and Magneto, possessing powers of both. Before his treatment, he's on a wheelchair and has psychic powers like Professor X and once he gets on his feet, he's completely Magneto just with a different appearance.\n\nKaya has the shapeshifting abilities, flexible body and acrobatic fighting style just like Mystique.\nEven the henchmen of Kaal like the frog man, rhino man, cheetah woman, etc. are all ripped off from X-Men.\n\nThese are just the characters which were copied, there are multiple scenes in the movie which were copied from other movies.\n\nI'm not hating on this movie or anything, its just that we rarely ever make any superhero movies and if even that is copied from some other movie, then what's the point? We've given the world so many amazing movies, why don't we have a single decent, unique superhero movie? Robot movie was pretty good, if you count that as a superhero movie, even the predecessors of Krrish 3 itself were good, because they were original. Hopefully the upcoming parts of this movie aren't ripped off.\n\nIf anyone is supporting this movie just because this is from Bollywood and X-Men was from Hollywood, then I don't see anyone stupider than you who thinks supporting plagiarism is patriotic.","label":0},{"review":"For those who always criticise any Bollywood film for copying a single or a few particular scenes/ideas/posters from a Hollywood movie, especially in case of a sci-fi or superhero film, just take a look at my post.\na) Superman can fly and Iron Man can fly. You never said that either one is a copy of the other.\nb) Power rangers wear helmet and Iron Man wears helmet. You never called it copy.\nc) One superhero started wearing mask and then others also started doing the same. You never used the word ...MORE","label":0},{"review":"For those who always criticise any Bollywood film for copying a single or a few particular scenes/ideas/posters from a Hollywood movie, especially in case of a sci-fi or superhero film, just take a look at my post.\na) Superman can fly and Iron Man can fly. You never said that either one is a copy of the other.\nb) Power rangers wear helmet and Iron Man wears helmet. You never called it copy.\nc) One superhero started wearing mask and then others also started doing the same. You never used the word \"copy\".\nd) Deadpool's look resembles that of Spiderman, nobody criticised \n     it.\n- Why to be so partial with Bollywood then? Because of same story line or a similar character? Most of the similarities are coincidences. \n- There may be chances that the hollywood movie is itself a copy of another movie.But I think nobody is so smart to look it.\n- Even if a Bollywood film is combination of, for eg, 3 Hollywood films, so what? The problem is that you see it as 1+2+3, not as 6.ie the result (very different) which is a reality. Even if you can't help it, then still 1+2+3 makes 123 ( a different number/film).\n- If still not, then make a good film yourself and then you will understand how risky it can also be.\n- If a Pakistani stuff comes against India, no doubt you will badly criticise Pakistan and favour India. But when it comes to Hollywood and Bollywood, you will not leave any stone unturned in criticising Bollywood and favour Hollywood. Always remember, next time you critisise a Bollywood film or actor, you are indirectly saying \"Bharat Murdabaad\" and then you must think before saying an Indian a \"Traitor\". Doesn't Bollywood make a reputation of India? It makes. So, being an Indian, encourage India, encourage Bollywood.\n- If in case you think Kaal's character is a copy of Magneto or any other, is the whole storyline the same or the motive same? You may hardly find dissimilar powers of any villain or superhero.\n- Always remember, copy and inspiration are two different things. If one thing began, second's beginning was always an inspiration from the first, not copy.\n- Shaktimaan is an inspiration from Supreman, never a copy. Can you imagine or like Shaktimaan kissing Geeta Vishwas?","label":0},{"review":"Krrish 3 is pretty good enough for a Bollywood movie. It's a well made movie though it is highly inspired which I personally didn't prefered much. I loved koi mil Gaya and krrish From the core of my heart. But krrish 3 disappoints those audiences who immensely loved it's prequels. Krrish 3 is nowhere near to it's predecessors. It also disappoints in music section too. This kind of music was not expected from a gem like Rajesh roshan. Who brought magic to listeners ears with music of koi mil Gaya ...MORE","label":0},{"review":"Krrish 3 is pretty good enough for a Bollywood movie. It's a well made movie though it is highly inspired which I personally didn't prefered much. I loved koi mil Gaya and krrish From the core of my heart. But krrish 3 disappoints those audiences who immensely loved it's prequels. Krrish 3 is nowhere near to it's predecessors. It also disappoints in music section too. This kind of music was not expected from a gem like Rajesh roshan. Who brought magic to listeners ears with music of koi mil Gaya and krrish. Right now I'm eagerly waiting for krrish 4 to be the greatest movie in these magnum opus superhero series made by genius director Rakesh roshan and one of the greatest actor of all time Hrithik roshan.","label":0},{"review":"The plot has been copied from a well known comic series, now an action pack film series, the X-Men. Kaal (the villian in Krrish 3), possesses powers of both Magneto and Professor X. \nMaya was imitating Raven from X-Men.\nThe climax scene, where we see the two fight midair is a Xerox of the epic scene in Man of Steel. \nOne more, when Kaal turns the cameras towards the scared crowd, using Magneto's power, this scene was copied too. \nLike seriously guys?? \nRakesh Roshan started of so well with Koi M ...MORE","label":0},{"review":"The plot has been copied from a well known comic series, now an action pack film series, the X-Men. Kaal (the villian in Krrish 3), possesses powers of both Magneto and Professor X. \nMaya was imitating Raven from X-Men.\nThe climax scene, where we see the two fight midair is a Xerox of the epic scene in Man of Steel. \nOne more, when Kaal turns the cameras towards the scared crowd, using Magneto's power, this scene was copied too. \nLike seriously guys?? \nRakesh Roshan started of so well with Koi Mil Gaya, the first ever Alien movie to be made in India. \nAnd then he gives life and direction to Krrish 3: which has no originality of its own. \nNothing more to say. \nDisappointed. \nPlus, the climax scene was horrendous.","label":0},{"review":"This is very good movie. All actor and actress did good job in movie. I like the character of vivek oberoi most. We watched this movie with family also. This movie made my  diwali more stunning and special. I hope the  4th installment of krrish will also special and good than other installments!!!!","label":0},{"review":"This was an amazing film, hands down. Haters gonna hate, but this film was brilliant. The story made sense and special effects were brilliant. Only a song or two were bad. Else, it was great. Bollywood, grow up and venture into Science Fiction.","label":0},{"review":"Rakesh Roshan started of so well with Koi Mil Gaya, the first ever Alien movie to be made in India. \nAnd then he gives life and direction to Krrish 3: which has no originality of its own. \nNothing more to say. \nDisappointed. \nPlus, the climax scene was horrendous.\nEven the graphics used in the movie looked like a video game animation.The stunts used in krrish 3  were boring and unrealistic.Koi Mil gaya and krrish 1 were better movies","label":0},{"review":"It was actually a copy of marvel movies , specially x-men, even some scenes were the same ! For that person here who said that the Hollywood movies are a copy too, compared superman with ironman , i want to say this : do you really know anything about marvel universe?? The comics about x-men and the avengers !!??? They are all related! They have their own logic ! And they are not a copy from one another .","label":0},{"review":"I feel that Rakesh Roshan should start eating Badam so that he can have a better memory.He forgot Krrish 2 and went on to make Krrish 3.\nI am amazed by the reviews given and the movie.It is a much better movie than he first two movies.If anyone wants to see an action packed film, this is the best film","label":0},{"review":"Believe me, Krrish 3 is strictly average as a full-fledged film, with only its action sequences, visual effects and Hrithik Roshan as Krrish, as the redeeming features. The film entertains the most when its both halves are about to end.","label":0},{"review":"Krrish is more powerful than flying jatt . If their would be a fight between flying jatt and kaal then aweosly kaal would win.This is the best movie I have ever seen","label":0},{"review":"you know about krrish he is an super hero krish 4 upcoming movie 2020 this is coming soon koi mil gaya or krish and krish 3 was a great movie genuinely super hit movie in superhe\no universe is krish 3 please see the movie krish 4 I request you to see krish and krish3 and upcoming movie","label":0},{"review":"Hrithik action,looks,dance,figure,charm &energy everything is far better than any actor in bollywood eventhough he's 40+ now...I loved his films always u r a real superhero of india no one can replace u......","label":0},{"review":"Woow l love hrithik  it is the main reason for me to watch film l loved this film wonderful story waiting for krrish 4 to be released on Christmas  2020 hrithik is great","label":0},{"review":"Its a great superhero movie from bollywood at that time. kudos to krrish team for making a super hero movie in a low budget.","label":0},{"review":"I think it a great movie but only one thing I don't understand India languages if they can translate to English that is be great.May be a lot of people want to watch.Thank you.I do appreciate.","label":0},{"review":"They didn't only copy the theme from X men they also copied the theme action music from a popular anime Blood+ ... They copied the Blood+ Grand theme music which is originally composed by Mark Mancina.. they could atleast give credits... But obviously they are least bothered ...","label":0},{"review":"Kangana first I have to say that you were stunning. Priyankas acting was very good. More or less the movie was good","label":0},{"review":"Worst movie. The villain looks like a kabadiwalla using metal scraps as his costume.Even the graphics used in the movie looked like a video game animation.The stunts used in krrish 3  were boring and unrealistic.Koi Mil gaya and krrish 1 were better movies","label":0},{"review":"I love krrish series and krrish 3 is my favourite movie of 2013 .i am waiting for krrish 4 and also hrithik roshan is my favourite actor😍😍😍🥰","label":0},{"review":"I love this love soo much its pretty obedient movie!\nI am watching this movie for 3 year's now i found this page to rate this movie Krrish 3 !","label":0},{"review":"Where is krish 2 ? They should name this flim as krish 2 or krish returns but 😑😑... After 2,3 is coming but they have done something out of the world... A huge mistake of this flim nd their cast !!!","label":0},{"review":"The movie is like bollywoody its very amazing movie I have seen this 100 and overi like this so much its very interesting","label":0},{"review":"This movie's actions scenes are copied from the movie \"SUPERMAN\",\"MAN OF STEEL\",\"BATMAN THE DARK KNIGHT RISES\"\n\nAll characters are copied from,\"X-MEN MOVIE SERIES\"\n\nIn short this movie is a mixture of the many hollywood super hero movies","label":0}]