[{"review":"Krrish has been a sweet part of my childhood and it was this movie that introduced him to me and so many other young viewers. As a child I mostly saw the film from the portion the sequences leading  the protagonist to wear the mask and had not seen much of what unfolded in the first half. \n\nBut as of today, I have to admit that the first half is almost terrible. Except the first 15-16 minutes and the entire pre-interval sequence involving an emotional conversation, the remaining first half is fi ...MORE","label":0},{"review":"Krrish has been a sweet part of my childhood and it was this movie that introduced him to me and so many other young viewers. As a child I mostly saw the film from the portion the sequences leading  the protagonist to wear the mask and had not seen much of what unfolded in the first half. \n\nBut as of today, I have to admit that the first half is almost terrible. Except the first 15-16 minutes and the entire pre-interval sequence involving an emotional conversation, the remaining first half is filled with not so impressive songs and the romantic subplot is unnecessarily stretched. To be honest, if you just watch the first 15-16 minutes and jump straight to the above said pre-interval sequence, you're not missing anything. \n\nBut from the interval sequence to the end, the film's totally different. It's only then that it starts to get entertaining and gripping, although one more song spoils it slightly. \n\nHowever, if these flaws are kept aside, Krrish is a good, entertaining superhero movie that features breathtaking action sequences and an emotionally resonant performance from Hrithik Roshan and Rekha. The director has not just created a visual spectacle but also added plenty of emotional moments that make any superhero movie memorable. The CGI too is quite good for a movie that came long ago. \n\nIt's not the best superhero film ever made, obviously. But it does have some really great things many contemporary films don't have. Krrish is a great effort and even though it succeeds not completely, it still has so many positives that those flaws can be ignored after a point of time.\n\n7/10.","label":0},{"review":"Positives: The VFX and the cinematography were top notch,action sequences were designed well,Hritik Roshan did his role well and same applies on Naseeruddin,direction was good. Good locations. Comedy scenes.\nNegatives:Too many songs just seemed irritating to me, editing was not done well and that is why the movie felt long to me.\nBut still overall a good to watch and such movies with great concept should be made in India.\nRatings:6.5/10","label":0},{"review":"I think it's a great movie. At a time when almost all the film makers were going on the same track, Mr. Roshan chose to do something different. I agree that Hollywood was making superhero films way before than Krrish but to say that it is copied is wrong.\nI still remember when this movie was released and it became the first ever Indian movie to touch the 100 crore mark globally. I enjoy watching this every time and I hope you all do the same. :)","label":0},{"review":"Seen the film once again recently and made me realize how good this film was. If this was a Hollywood film, would have been a huge success,  but unfortunately it's gonna be seen as stupid just because it's a bollywood film. Great story, great acting, really good VFX considering it came out in 2006, and mostly - the music. The background music in this movie is goosebumps worthy. 8/10","label":0},{"review":"The best movie series in Sci-fi Bollywood movies. Krishh has made it with great acting of Hrithik Roshan, the charming hero with superpowers. This movie has inspired various movies and can be watched by anyone ...100%good. Good drama,story, music ,acting plot, comedy and great action thrill.","label":0},{"review":"What ever was the theam or whatever was the story, really does not matter in this techie erra  !!!\nThe theme practically goes with this techie era !! Rekha Ji , played\nperfect grand ma ! Rhitik was marvelous  , playing the part for every age group !  Priyanka as usual is kind of lost !!! Over all I give that \nMovie 7/10  !!!!!","label":0},{"review":"Im proud with the idea of the film \"koi milgaya\" and it's all series krrish cause this movie taking indian film industry to the world of superhuman power animated movies . And when we hear superhuman power movie like things , american superhuman frenchies movies came to our mind first and there is no indian charecter or director we found. And if we think deeply about superpowers india is the only country where this superpowers does exist . And if you are reading rightnow think about RAMAYAN AND  ...MORE","label":0},{"review":"Im proud with the idea of the film \"koi milgaya\" and it's all series krrish cause this movie taking indian film industry to the world of superhuman power animated movies . And when we hear superhuman power movie like things , american superhuman frenchies movies came to our mind first and there is no indian charecter or director we found. And if we think deeply about superpowers india is the only country where this superpowers does exist . And if you are reading rightnow think about RAMAYAN AND MAHABHARAT . Think about where the brahmastra word came from . Think about the rudra .","label":0},{"review":"I am waiting for Krish 4 for a years, Hrithik is very awesome actor no one can beat him. He is very cool and calm. \nThanks to the father of HrithikRoshan who are moving the generation towards science fiction movie.","label":0},{"review":"It's a horribel movie. Storyline direction presentation was rubbish I didnt understand a single story. I didn't accept this from Hrithik Roshan that he will act in these kinds of rubbish movies like krrrish 3. Just for earning 3corer ruuppeess he is selecting these kinds of movies. Westage of money time and mind.","label":0},{"review":"I loved, actually really enjoyed \n\"koi mil gaya\" ... was quite simple  but fun! \n\"Krish\" had an awesome  story too...i was shocked to learn that it was a continuation of \"kmg\" \nBut all expectations were ruined for \"krish 3\"!! Horrible story lines! Not cool! Really not cool!","label":0},{"review":"This movie gave India its own superhero!! HATS OFF!\nAt the same time, I became a huge fan of the villain Dr Siddhant Arya, played by Naseeruddin Shah. He played the role of a megalomaniac scientist perfectly.","label":0},{"review":"My love for this movie is so profound. I became a fan of Hritik Roshan because of this movie. The plot was well planned. Consider it a must watch and re-watch.","label":0},{"review":"This movie has now become a big part of my life. I live off this movie because it is so damn good. I watch this movie about 6 times a day and","label":0},{"review":"Good movie.  Hrithik roshan acting marvelous  . Tq rakesh roshan ji for this wonderful Film. Must watch and enjoy","label":0},{"review":"It's a very beautiful film. Hrithik is at his best. An excellent sequel to Koi Mil Gaya.","label":0},{"review":"It's a great movie, I've seen a lot of Marvel movies but you can't believe it is much better than the classic contemporary Marvel movie.","label":0},{"review":"it is completely package  of  X men series(popular series of Hollywood movies).i shocked when i knew that this movie cross 200 cr,, OLD Indian director like bhansali ,rohit shetty ,karan johar have no more creative mind.they just ruined the status of Bollywood.","label":0},{"review":"This Movie series having awosome songs.. some one said copied.. But what about Marvals Copy of Norse and Indian Mythological gods??","label":0},{"review":"India has only one superhero...\n\nSo i am big fan of Krrish film series.\n\nIts like Hollywood marval.\n.\nWe have our own superhero like marval and dc movies","label":0},{"review":"Such a great movie I don't have any problem that it is copy of Hollywood movie bcz thisbgavea India it's own powerful superhero great movie.","label":0},{"review":"I loved the picture.The way Hritik roshan performed his dual role It,s fabulous.I was  in my matriculation at that time.","label":0},{"review":"I am excited to hear that krrish 4 is coming.   I think it would best of the other krrish movie's.","label":0},{"review":"This movie is a great movie well i like hrithik roshan as well as The villan.  Who w likes this film will like my this comment!","label":0},{"review":"It makes my Childhood more special and I make his mask all time ThaNkyou Krrish and krishna also...😁🇮🇳❤❤❤🙏","label":0},{"review":"This is a film of mental & physical ability,how it can be used in daily life getting something unique.","label":0}]