[{"review":"Very , very nice movie\nLight comedy with fantastic acting from all actors.\nOm puri, Paresh Rawal, Rajpal yadav , Asrani, rasika all gave very good performances.\n\nCan watch it anytime and every time.\n\nThanks Priyadarshan for giving us such a nice movie.","label":0},{"review":"If you have not watched this movie, then you are certainly missing something. Hilarious and brilliant comedy, with so much girth, humour and comic timing by all the characters. Direction is superb. \n\nA must watch...!!!","label":0},{"review":"Well why it's rating is low I don't know but it is surely a good comedy film. Featuring in great artists the movie is of good humour. Must watch for all the fun loving persons","label":0},{"review":"I love this movie and the actors!! Om puri, paresh rawal!!! Such a beautiful movie...Different storyline..Rural life...So beautiful crafted with humor! I have watched it like million times! And I never get bored..Such natural acting :)","label":0},{"review":"This Film (malamal weekly)of 2006 is awesome..fantastic comedy movie .actors of this film are realy exceptional and mind blowing..director ..writer..everyone are realy good..i keep watching this movie everytime whenever on television..actors like mr.paresh rawal..om puri..asrani..shakti kapoor ..rajpal yadav..realy fantastic....i just love the movie..this movie is evergreen","label":0},{"review":"One of the funniest movies of all time... Om Puri's sarcasm and comedy was unbelievably good. Paresh Rawal was amazing too.","label":0},{"review":"All the movies of priyadarshan are my favourite and also this movie is funniest. All characters  did real acting in this film.","label":0},{"review":"Funniest movie ever!\nI've watched it a hundred time and i can watch it a hundred more without ever getting bored","label":0},{"review":"Its a true family get together movie.\nLight and entertaining. It's a must watch.","label":0},{"review":"I love this film watching many of the time with my family a excellent comedy","label":0},{"review":"My all time favourite. Beautiful location and superb actors.","label":0},{"review":"Very nice movie, movie is full of suspense and comedy once you can surely watch.","label":0},{"review":"A cult classic movie with super script and super BGM and Performance of almost all actors.","label":0},{"review":"Superb\nThe story as well as the acting of all the actors are mind-blowing.","label":0},{"review":"This movie is amazing and the most comedy movie in Bollywood cinema","label":0},{"review":"Every one on this planet should watch this movie at once.. a great comedy .","label":0},{"review":"Very nice movie I want to waiting for this movie sequels","label":0},{"review":"The star cast containing legendary actors are dominating evry scene of acting dont have wrds to describe ...","label":0},{"review":"Worlds best comedy movie must watch this film please","label":0},{"review":"Malamal weekly one of the best laughter good movie","label":0},{"review":"this is a legendary comical movie we really want priyadarshan back","label":0},{"review":"This movie is very good and comedy is tremendous.","label":0},{"review":"One of my favorite comedy movie ever.","label":0},{"review":"Awesome Comedy movie...I m wating sequel","label":0},{"review":"One of the excellent comedy movie.","label":0}]