[{"review":"Mann.. my all tym fvt romantic movie..\nMy father's fvt only. What is love ??? How many types ?? What's the reaction which takes place automatically upon lovers face? What's the trgedy melancholy & when and with what circumstances in ? \n Clearview of Love theme portrayed  by creative people of mann. Musics of it inspng by its sound of romance. Acting by Aamirkhan sir , no words 4 express ..\nVery very talented artist of globes  we ve found with us ..its our fortune to live in his period ..Really A ...MORE","label":0},{"review":"Mann.. my all tym fvt romantic movie..\nMy father's fvt only. What is love ??? How many types ?? What's the reaction which takes place automatically upon lovers face? What's the trgedy melancholy & when and with what circumstances in ? \n Clearview of Love theme portrayed  by creative people of mann. Musics of it inspng by its sound of romance. Acting by Aamirkhan sir , no words 4 express ..\nVery very talented artist of globes  we ve found with us ..its our fortune to live in his period ..Really Aamir khan saab is God of cinema .no doubt ...Every time I cryed after watching this unique movie..watched 23 times till the date. Tinak tin song is my fvt happy love song ever and chaha hai tujhko is best sad  love song forever. I found it as best love movie.  Dev karan singh  character  got  right justice  by  mr  perfectionist  Aamirkhan  sir , the legend  in world  cinema  history  .  Climax   wonderful  .very  pathetic  atmosphere  created  .story idea  is  superb  hearttouching.   Man have to think of  own inner talent  to get  easier   perfect status  & that's  responsibility  of self only.  Love has  very potential  power  to thrill  the  bigger to biggest  problem  of life.  Never can be made   another  MANN .so it's  an unique  creation  of  Team  mann.  Aamir sir  is  gorgeous  personality  herein.  I think  except  aamir khan  none  could  have  played  much better.   Dadima-  Island  sequence  is  very  emotional   & 'd  take over the audience  to  a  new  special  world  undoubtedly.  Painting  idea  in mann  is  a  indication  of  intelectual  mind  of  Indra kumarr jee  Noshir khataw jee . Ganesh jee  choreographed  fantastically  .   Shooting  in  the ship  , amazing  experience  . Kyon  chupate  ho song  is  shootless.  Rani mukherjee  played  as  guest  or sexy girl or item   having  been  very  grateful  to  Aamirkhan  jee   since  Ghulam  .  Nice  UNFORGETTABLE  evergreen  picture  forever  .plz  frs  regularly  touch  with  this  outstanding  romantic  blockbuster  movie. My first love  also was  a  lame.  Good  scenery  picturaisation  or filming  location  is more  mind blowing  to watch  on  larger  experienced  screen.   Life is Love  enjoy  it  with jolly mood  . Alws  live  as  own  terms  of life   to.... Hamesha  apna mann ki baat  sunna  to  is zindagi  mein  khushiyan  hi khushiyan  haasil  hogi  . Hamesha  ye  karo  jo  mann  kehta  hai.  Very  philosophical  movie  so  my papa watched  it     87 times till the date.     All songs are mind blowing heart touching.Really sanjeev darshan did a magnificent job 4 all of us .Evergreen music .  Sharmila  manisha  anil every body performed  mindblowing.  A journey  from  play boy to true lover .I can remember one incident  that first time I requested my papa to bring a cassette of mann movie in 1999  and papa had bought a home theatre system  with mann cassette unexpectedly. \nSo frs watch it again ..  Not only  a lovers movie  but also 4all age groupers..Alws listen 2 ur heart.. Nice msg 2 society.  True love exists  only..Alws love with own interest..Never compromise  with own love .. Love is forever. Love all serve all & develop  ur humanity as possible  as and also must be a social activist  at ur own path ...Thanku all the viewers  . Let's  enjoy ... Be a lover truly.  Bye bye.👌👌💘💋💚","label":0},{"review":"I don't know why critics always comes up with bad reviews to a good movie. I think critics really don't know how to watch a movie. I agree there might be a lot of potholes in a movie but after all it's a movie made up to entertain people. For me the movie is above average and I enjoyed it. Don't go critics. They are total shame for this earth.","label":0},{"review":"This film changing feeling love life. A very immosanal love life role play superstar ,mr perfectionist aamir khan ,mr india anil kapoor and super beautiful actress manisha koirala.music is heart toucheble and most famous of young generation and who watch this film.it is super superhit film.........man mera man tumhe kyun chahe....","label":0},{"review":"There are many romantic movies. But this movie is really hurt touching. Though the movie was a big flop.I don't know why this movie was a flop.The story line,acting of both star aamir and Manisha was really fantastic and moreove each and every song was good when we listen till now. The song was not like todays song.All in one word this is my favourite love romantic movie..","label":0},{"review":"This movie's just another reason why there's so much misogyny in India. It's outlandishly sexist, misogynistic and just promotes rape culture. Think of the number of men who watch this and get encouraged to be creepy towards women because \"she'll fall in love with me eventually\".","label":0},{"review":"This was one of my childhood favorite movies.. Who knew the accident she had, could be my destiny too in future.. Well the story still touches chords of my heart.","label":0},{"review":"It was the first movie after my engagement. We saw it together. It has been more then 17 years and even today, the music of the movie mesmerises both both me and my wife. A truly heart touching story of that time.","label":0},{"review":"generally i dont watch bollywood movies.. i am so chhosy while selecting bollywood movies... i hate the songs being inserted in movies for no reason...\nbut this movie really touched my heart... awesome movie... a must watch movie..","label":0},{"review":"You should watch the English version of the movie an affair to remember . 1957. The problem was story was damn good .Aamir and anil were good too.rest everyone was disaster . execution by director was worst . it's an excellent story.but rest everything was disaster.","label":0},{"review":"Even after 19 years still I never found this movie boring. It teaches us that love is not all about sexual attraction, its something more than that. SACRIFICE.","label":0},{"review":"If one ask about best romantic movie from Aamir Khan then it should be Mann. The I-Land sequence and climax is enough to bring emotions. Mann wasn't successful at boxoffice but it's a special movie.","label":0},{"review":"This movie was very nice i want to was this movie many more time i really love this movie its a hurt touching love story so beautyfull movei both the actress looks super must watch this movie!😊","label":0},{"review":"A heart touching, lot of emotions, wonderful story line, mesmerising music&songs above all goose bumping performances of Aamir Khan Manisha Koirala... it's just a complete package of a \"Block Buster Love Story\"","label":0},{"review":"It was a grear movie. Family is the power of any person and without family you can't achieve anything. Money is a temporary thing and family is permanent. Watch it...","label":0},{"review":"This is one of the best love based movies made in bollywood, superb, sweet, amazing, cute nice movie. Love it😍😍😍😍","label":0},{"review":"Thats called real love Story, Awesome timeline, Romantic love Thoughts and grt comedy scenes. Must Watch once in your life.","label":0},{"review":"Mann movie is really lovely movies for every movie sad love say no body only mann it is naver end all of life's","label":0},{"review":"Amir khan steal the show with outstanding performance ,music is awesome lyrics are a gem , playback singers have sung the songs with great emotions","label":0},{"review":"Its a very nice love story....n l loved it very much...dis is what we call a love and while watching it we can feel d magic..","label":0},{"review":"this movie always breaks me into tears. What a story and so great performances by Manisha ji and Aamir. Ty","label":0},{"review":"When I go to bed at night I listening  the song mera mann. It's very hart touching song and like it.","label":0},{"review":"One of My favorite movie, lovely and melodious songs, strong acting by Aamir and Manisha . Cute Story .","label":0},{"review":"This film is mind-blowing really this films story is great ...i love this movie ...and thanks for aamir khan suparstar and thanks for manisha goirala..and important thanks for this movie's director ...i love this film","label":0},{"review":"I like the song .. mera man Kyung tumhe chahe.\nAwesome n meaningful song .\nSuperb","label":0},{"review":"Best romantic movie i have ever seen and i love the innocent face expressions of manisha maam...i have seen this movie over 25 times.","label":0}]