[{"review":"Amazing and one my favourite movie I have never seen in my life superb movie.  Actors acting were too good. The theme was about that Sanjay Dutt is not a doctor he is trying to act as a feak doctor so that his parents were felling proud about him that his sun is a well known doctor of that place when they knew the reality from Boman Irani means his characters name was dr j. Asthana he was Dean of that medical colleg. And last scene it was emotion when they were hugging each other they were cryin ...MORE","label":0},{"review":"Amazing and one my favourite movie I have never seen in my life superb movie.  Actors acting were too good. The theme was about that Sanjay Dutt is not a doctor he is trying to act as a feak doctor so that his parents were felling proud about him that his sun is a well known doctor of that place when they knew the reality from Boman Irani means his characters name was dr j. Asthana he was Dean of that medical colleg. And last scene it was emotion when they were hugging each other they were crying in real   in sanju movie ranbir kapoor was telling that . Director was telling them cut but they were not listening to himmat all . But when in 2006 lage raho munna bhai released when sanjay dutt was talking with jimmy shergal about his father shri sunil dutt ji passes away that he wants to say something to him that night but in next morning he died to cardiac arrest . Yes I have still remember in each and every news channels news was spread that famous politician and actor sunil dutt pass away it was in year 2005  in regional channels they were showing gun salute was giving to him and sanjay dutt and his sisters were crying every bollywood stars were present  from starting abhishek bachan , shahrukh khan, salman khan, aamir khan , akshay kumar, pretty zinta ,  javed akhtar etc bollywood stars were present.","label":0},{"review":"This movie is one of its kind. A perfect entertainer. Each and every age group will enjoy this movie. Have seen Sanjay dutt  in a gangster role in many other movies but after vaastav this is my favorite movie of him. Each and everyone has done a great job in acting department. Music is also very good and will never get old. Sanjay Dutt will be remembered even after his death for this movie for sure.","label":0},{"review":"Such an awesome movie! We had a story/stories, well timed comedy, truths of life, how we should chill out with life!  Both the movies were Great,Wonderful messages and time well spent. We came out feeling happy and light hearted! Any troubles could be over come with the right choices we learnt!","label":0},{"review":"Very speechless to all who casting this Movie. Great Great of Greatest who fullfiling his Beloved father's dream.Sir Sanjay Dutt and his Beloved Father Sir Mr.Sunil dutt worked great in this movie and this movie proves that hard working and focusing in something is not so important rather than having a Great Heart with full of Love and Success of Dream can achieve anything in the world.","label":0},{"review":"I request Raj Kumar ji and Vinod chopra ji to please include the same cast as in the first Munna Bhai MBBS please it was such a pleasure and nice to watch u all ,just loved seeing u all together. But the next one actress changed and many others ,it was no pleasure excluding the acting part of all others","label":0},{"review":"Mindblowing, clever ,outstanding,the movie which gives me goosebumps the level of movie is blown your mind heart touching iam became fan of sanjay dutt .level of movie is same as 3 idiots or say better \nWatch it you never stop your tears at end","label":0},{"review":"Amazing movie, story screenplay and characterisation everthing perfect. One actor who actually carried the movie on his shoulder is Arshad Warsi. He's the soul of the movie. Sad that actors like him don't get much due","label":0},{"review":"many words to say....amazimg..superb...wonderful....\nthis is not just a good movie ..it is like a wonder which is  created by a human being....\nI say this movie is worth watching than ur  work which you will do in 3 hours....so watch it first","label":0},{"review":"Amazing movie...\nBaba rock it. Nd circuit bhai be always rock it..lubbb u gracy Singh..nd songs are soulful..background music is soulful nd hearttouching...all supporting cast is to good..this movie is a EPIC....😘😘👌👌👍🙏","label":0},{"review":"Superb. I have seen it over 15 times. Everytime I feel exciting so fun in the film. I salute Raj kr Hirani for making such a film. Sanjay Dutta with other actors","label":0},{"review":"Very nice and funny movie.One of the best movie of Sanjay Dutts,Arshard Warsi and Boman Irani.Great acting by all three and don't forget Sunil dutt.","label":0},{"review":"I am speechless,  this movie is  incredibal, story,   actor's,  direcshan, music just amazing, mind blowing, out standing, awesome movie,  And afcours Sanjay dutt performance is wow, brilliant.","label":0},{"review":"Very good direction with cast crew .Sir Rajkumar Hirani is very intelligent and fantastic director.i never seen like Raju sir a different thinking director.","label":0},{"review":"Absolutely loved this movie. It's my favorite Bollywood movie! I can't say how it is, you have to watch it yourself.","label":0},{"review":"It is a great movie.  A must watch..  Everyone did best in their role.  Loved Circuit...","label":0},{"review":"Amazing film........Sanju will be the best film of 2018 and Ranbir Kapoor will be awarded as the best actor because no one can act like a Sanjay but he acts","label":0},{"review":"This movie would make anyone happy and laugh with delight. It's great fun and a must watch movie.","label":0},{"review":"One of the best movies I have ever seen! So underrated. Made me a better person❤️","label":0},{"review":"Have a good comedy show in whole movie director want to show some reality of the human life OK it's a good entertainment","label":0},{"review":"What a awesome movie. One of my favourite movie. Sanjay dutt is best in this movie.","label":0},{"review":"amazing film and casting.... just love this film.. and sanju baba.. eagerly waiting for part 3 to release","label":0},{"review":"Can never get enough of this movie \nBdw trivia fact the role was offered to shahrukh Khan but he had other commitments.......\n#whatever happens happens for good","label":0},{"review":"One of the best movie of Sanjay Dutt that I like and I am writing this comment watching the movie at current time","label":0},{"review":"A wonderful movie with the best actors ever. Surely Hirani does magic with his movies.","label":0},{"review":"It is very nice movie. It is very entertaining as well as also gives us an important message.","label":0}]