[{"review":"This is one movie that is sheer perfection because it is exactly what it is supposed to be - over the top, dramatic, and a light hearted spoofy take on old world Bollywood with heartwarming characters and superb acting. Everything about this movie is spot on. Fantastic music, dialogues, and superb hamming by all actors. Hard to believe that this is Deepika Padukone's first movie as she more than holds her own against the inimitable SRK, who is at his absolute finest whether he's being silly, sen ...MORE","label":0},{"review":"This is one movie that is sheer perfection because it is exactly what it is supposed to be - over the top, dramatic, and a light hearted spoofy take on old world Bollywood with heartwarming characters and superb acting. Everything about this movie is spot on. Fantastic music, dialogues, and superb hamming by all actors. Hard to believe that this is Deepika Padukone's first movie as she more than holds her own against the inimitable SRK, who is at his absolute finest whether he's being silly, sensitive, or insanely dramatic.\nI love watching this one when I really want to remind myself that life doesn't have to be serious all the time, and that if things aren't okay as yet, it means 'picture abhi baaki hai mere dost'.","label":0},{"review":"This is best commercial movie ive ever seem... Mind blowing performance by everyone from sharukhan to deepika padukone to arjun rampal... Everything was sooo perfect... U wanna feel escastic watching bollywood watch om shanti om... Star-studded... Shah knows to weave magic...just loved it😊🤗😘😘😍","label":0},{"review":"This is one the best romantic movies i've ever seen. very unique and superb story with great songs. the cast was very good. this movie is too perfect.....the story, screenplay, songs, action, thrill, drama, emotion, enjoyment.....just loved it. this movie is AWESOME. applauds for the crew","label":0},{"review":"This is my favourite movie. The songs are soooo good!!!!!!!  The plot is complicated and cheesy. I love how at last I get to learn that Shanti was actually still breathing and she got buried that way.","label":0},{"review":"This is an amazing movie! \n\nSo emotional, I've cried that's how sad I got! As a whole this is an amazing movie. \n\nI've always loved this movie so much! I also love how this movie had some comedy in it too!\n\n10/10","label":0},{"review":"favourite childhood bollywood film!! all the songs in om shanthi om are amazing and people still listen to them today. casting is great and the music video for deewangi deewangi is very memorable","label":0},{"review":"I usually don't watch Bollywood movies, but I was watching it as my wife too was watching it and I found it to be pretty mesmerising. It gave me a nostalgic feeling. Yeah, I really loved this movie.","label":0},{"review":"However this was my first film which I had seen in my childhood days. Fell in love with Deepika and SRK at that time. Since, I started my passion for watching films after this film, I didn't understand the film om shanti om. Want to watch this again if mom allows😅","label":0},{"review":"AWESOME MOVIE!!!ABSOLUTELY AWESOME,SCINTILLATING!!!\n\nSHAH RUKH KHAN AT HIS BEST AS ALWAYS,DEEPIKA PADUKONE OUTSTANDING IN HER FIRST FILM!!!\n\nBUT WHAT SHOCKED ME WAS ARJUN RAMPAL!!HE WAS THE ONE WHO STOOD OUT!!HIS ACTING WAS MARVELLOUS!!","label":0},{"review":"After 10 yrs I have been keen to watch it again now.. such an awesome story telling. Mix of fantasy. But well portrayed 😍😍😍 Sharukh Deepika at their best","label":0},{"review":"This is an out and out Bollywood masaala movie. Great performance by SRK, Deepika, Shreyash, Kiran Kher and Arjun Rampal. Awesome Music. \n\nI just love the movie.","label":0},{"review":"All time favorite movie. It's a beautiful movie with romance, fun and etc. The songs in this movie are the best. Love this movie a lot.","label":0},{"review":"This best best moviee😊😊 . I m so likee this movie. 😉I dońt know why critic give low 😠😠ratingss but awesomee movie . I just love💝.... deepikaa in this movie💖💖","label":0},{"review":"This is best romantic movie having some emotional scenes , that i like most, and the story of this movie is very unique and deepeka padukone plays the best role...and   i can see this movie very times as compared to other movie's...and I like this movie very much.","label":0},{"review":"This Movie is a ride of emotions. It's has a good climax and it's just beautiful and exciting every scene. One part I cried, it's just beautiful.","label":0},{"review":"I don't know why critics give low rating  for this movie 5/3    only 3 points for this movie \nThis is great movie \nBest romantic \nBest story\nGreat songs \nThis is real points for this movie\n5/4.8 I think this rating suits on shanti om","label":0},{"review":"Everyone should watch this movie.. it's just mind boggling.. I cried a lot after watching it. It's the best movie I have ever watched..","label":0},{"review":"Tis is the best miovie of srk. Happy new year..chennai express and raees give a match but this is the best job.","label":0},{"review":"This movie is literally perfection. I recommend to literally everyone. The best romantic comedy I've ever seennnn.","label":0},{"review":"I would say this is the best movie which covers spirituality, love, Deja Vu, karma,  intuition and reincarnation.\n\nI give 9.8 point on the scale of 10.","label":0},{"review":"Om Shaniti Om is a fantastic movie and has a lot of meaning to it im only a 11 year old girl and i think the movie is superb.","label":0},{"review":"I think this is a greatest movie in bollywood ever...on of the best film for sharukh...i love it","label":0},{"review":"Wow,a great movie of future and past combination,a great superstar dipika and king srk super perform om shanti om,i love it and you....\nThank you","label":0},{"review":"Best movie ever.\nI can watch it million of times and it will still seem new. Deepika's acting was 👍 and shahrukh also.","label":0},{"review":"Happy 10th anniversary to this film it's on 9 November 2007 to 9 November 2017 if I m right I still remember I alone went to see this film with 4 of me friends not able to see it first day first show I was v happy I had made it","label":0}]