[{"review":"A damn good movie!\nDirector Kuku Kohli introduced veteran action director Veeru Devgan's son Ajay Devgan( though his real name is Vishal) and Madhoo(niece of Hema Malini ji) in this crime drama where Ajay plays son of a crime lord Nageshwar (Amrish Puri) who doesn't want his father's shadow in his life, he is a very popular student in his college who falls in love with Madhoo and after their infant baby is kidnapped he is forced to take arm in his hands to save his son. \nI watched this movie in  ...MORE","label":0},{"review":"A damn good movie!\nDirector Kuku Kohli introduced veteran action director Veeru Devgan's son Ajay Devgan( though his real name is Vishal) and Madhoo(niece of Hema Malini ji) in this crime drama where Ajay plays son of a crime lord Nageshwar (Amrish Puri) who doesn't want his father's shadow in his life, he is a very popular student in his college who falls in love with Madhoo and after their infant baby is kidnapped he is forced to take arm in his hands to save his son. \nI watched this movie in 1997 on VCR- a long time ago when I was only 10 years old and Ajay Devgan Sahab remains my one and only favourite actor from bollywood ever since then!\nHis introduction scenes are still my favourite and still I watch it once a day on YouTube.\nToday in 2019 after bagging two national awards and many popular award and accolades Devgan Sahab has millions of fans but no-one could match that ten year old kid who watched phool and Kaante with amazement and wonder!\nToday that kid is writting review for that film and it is privilege to write some thing about Ajay Devgan Sahab.\nHe is and always will be my favourite even he didn't know but I have learnt a lot from him only watching his movies and phool and Kaante was the beginning for him and for me also.\nI pursued my career in film making only because of Ajay Devgan Sahab!!!\nToday I am what I am only because of him and from this review I am only trying to show my gratitude!\nHail Devgan!!!!!!!!!!","label":0},{"review":"Hello, this movie was the debut film of Superstar Ajay Devgn and what a debut and movie. The bike stunt he did was just amazing. And his serious look was cool. The music by my favorites Nadeem Shravan were outstanding. Tumse milne ko, dheere dheere pyar, or maine pyar times. The actress madhoo also looked very beautiful. Thank you.","label":0},{"review":"Ajay devgan lucky enough to make a first film big hit and earning good career with this movie.Very good movie. Ajay Devgan is very good actor. All songs are evergreen . my college life's favorite movie. I am very big fan of Ajay Devgan.","label":0},{"review":"Very good movie. The action was nice. All the songs are super hit & evergreen. It was a debut of both Ajay Devgan & Madhu. Super hit movie.","label":0},{"review":"Very good movie. Ajay Devgan is very good actor. All songs are evergreen . my college life's favorite movie. I am very big fan of Ajay Devgan.","label":0},{"review":"First movie of Ajay Devgan Sir & Madhoo Mam. Songs are so romantic & I love the opening scene when Ajay Sir comes on two bikes with his legs spread apart on moving bikes.","label":0},{"review":"After watching this movie I became hardcore fan of Ajay devgn in my childhood. Even today Ajay sir is my full time favorite actor.","label":0},{"review":"Awesome movie... My life is block buster movie... I 'm very fan for Ajay Devgan...  His acting is genius... He is always bollywood superstar","label":0},{"review":"The songs and ajay devgan action is superb mindblowing superhit film why dont nowdays such type of beautiful films are made","label":0},{"review":"A very special movie for me.Even after 25 years the impact of the movie is great.Ajay become my favorite..","label":0},{"review":"Ajay devgan lucky enough to make a first film big hit and earning good career with this movie.","label":0},{"review":"Its a comic entertainer, the story keeps you enagaged till the end, priyadarshan jadhav has given a remarkable directorial debut.","label":0},{"review":"Amazing stunt in this movie. Ajay debuted to this movie that was very successful in that time . Superhit all songs ...","label":0},{"review":"vvvv beautiful movie this is the baby taken in the movie is so cute and sweet like kaju katli","label":0},{"review":"It's best action movie of all time of bollywood.\nAjay Devgans performance is best.","label":0},{"review":"Phool aur kaante is very good movie action   Bollywood is student is great life is starting of college so great for life","label":0},{"review":"Hello, this movie was the debut film of Superstar Ajay Devgn and what a debut and movie. The bike stunt he did was just ..","label":0},{"review":"Ajay Devgan best super hit move and song    \n1000 star move 1000 star. Move poster and Ajay best","label":0},{"review":"Very good. Ambrish and ajay are superb.its debut of ajay.","label":0},{"review":"Awesome movie, good action by Ajay Deccan, good direction.. Reminds me of my school days.","label":0},{"review":"One of my best Movie Suppereb songs\nAll songs are awesome suppereb","label":0},{"review":"When I saw this movie I was 11 year old boy 27 year back. Awesome movie","label":0},{"review":"Ajay Devgn's entry... The most versatile actor... Best one..","label":0},{"review":"Movie is good story is well definite actor and actress are good but first scene when entry of heroine and hero irritates her that's not good other wise everything is good","label":0},{"review":"Very beautiful movie and I am also very big fan","label":0}]