[{"review":"Awesome family movie about a Royal Family. Great dialogues and dramatic acting\n\nAll characters are shown with an equal opportunity. The story plot was great and a must watch for drama-lovers or families. \n\nHas some really enjoying songs, light comedy and a wide-ranging plot characters. The Royality is shown perfectly. And the real twist comes with the double role of Salman and the villain's conspiracy.\n\nBut finally, everything goes fine and a very Happy Ending.\n\nThanks","label":0},{"review":"This time Sooraj Barjatya disappointed us. Though it's a family type movie,but screenplay being slow and repetitive same BGM also killed the enjoyment of the movie. Songs were good and looked colourful. Salman Khan did his role perfectly and his dialogue delivery specially in emotional scenes were good. In every scene director tried to make us emotional but as an audience we fail to connect with the story. Armaan Kohli deserved more screen time. Ratings:5/10 stars.","label":0},{"review":"Best family movie I have ever seen. Too much emotional ,touchy and romantic movie. Along with it the actors also played a good job to make this movie look real. Best acting by Salman Khan, Sonam Kapoor and Anupam Kher. The background music throughout the movie is also very touchy which made me cry at many instants.","label":0},{"review":"A poorly adapted remake of Tapan Sinha's  1961 Bengali classic 'Jhinder Bandi' (The Prisoner of Jhind). The original cast had legendary actors like Uttam Kumar and Soumitra Chatterjee. If u are a bong and have not watched it, do it today. The screenplay is awesome and depiction of the character's contemplation is so well portrayed. 'PRDP' with its silliness and hideous acting just could not do justice to this classic.","label":0},{"review":"Best family movie i have ever watched. Too much romantic , emotional and comedies as well are equally served in this must watched movie.\n\nI don't think that there is anything good missing from this wonderful movie .\n\nI feel very lack for watched Prem Ratan Dhan Payo","label":0},{"review":"I like the movie. Best for watching with your family members. It has a meaningful story a mashup of everything romance, drama,action, emotion and comedy. I love salman Khan's most movies but it is awesome.","label":0},{"review":"A very good family movie with full of true emotions about family relationships, respect & love & attachment with our family members..... PRDP teach us to love, help & respect our family and relatives beyond our ego... Everyone need to learn from PRDP that what are our family priorities & how much  they matters to us....🙏🙏🙏👌👌👌💓💓💓💓","label":0},{"review":"Prem ratan dhan Payo is a interesting movie. The film is based on kings and queens and how they live their life. \n\nThe film makes me sad when Salman khan , the elder brother fight with the younger brother. \n\nIn the movie , Sonam kapoor acts wonderfully in the character . she has enjoyed , lived and portrayed the audience.","label":0},{"review":"I really luved it.I cried even my dad too at the scene wen her sis comes for the property papers n that scene is really touching the heart of mine .n the actors also did a gud job in that movie.","label":0},{"review":"PRDP is a perfect example of films which shouldn't be released on big festivals like Diwali. While watching it, you may feel okay, but later on, it'll remain nothing but a dud. Only for die-hard Bhai fans.","label":0},{"review":"Best family movie ever and great music which makes u feel it.Movie has emotions , romance ,comedy,action and most important salman khan & suraj barjatiya combo.Must see PRDP.","label":0},{"review":"I think that this movie was amazing. Good job director,producer,casting and singers. This family movie has amazed me","label":0},{"review":"I don't understand Tamil. But still watched these movie with my Grandfather who is Tamil. And I really enjoyed this movie. (English Subtitles was the reason how I understood the story 😂😂😂)","label":0},{"review":"One of the best movies ever made in Bollywood Salman prooved to heater that he is good actor also good family with the golden director sooraj barjatiya sir enjoy the movie","label":0},{"review":"Worst movie ... Worst Screenplay ...Isko Dekke Sardard Payo ... Characterization is worst in the movie ...Sothe sothe nikale hai kya movie bc ... Niel Nitin's character is a mere puppet .. Sonakshi as usual is overacting","label":0},{"review":"Super movie... Love it.....  Why this movie ratings is very low??? I thing  the movie should give 9  out of 10.. Salman Bhai Rock's... Sorry for late...  Watch","label":0},{"review":"One of the successful movie of Salman Khan. This film contains an interesting family storyline. Best movie I have ever seen.","label":0},{"review":"It's the best movie I have ever seen . Sonam Kapoor and Salman Khan both were looking very good , beautiful , handsome.","label":0},{"review":"I love prem songs. Watch it alot..,the coriography, tune,lyrics of each songs very interesting so I always enjoy all songs alot.","label":0},{"review":"Sanjay leela bhansali should make notes from this film for making big budget movies.This is an absolute masterpiece.","label":0},{"review":"Sooraj's legacy continues like his previous films, it might not be everybody's cup of tea but still it holds the moral values , bondage       in the family,the purity of love.but for those old fans of hahk it's quite disappointing for watching the onscreen chemistry of director and actor ,bcz something goes missing out of the shell..","label":0},{"review":"full on serial drama.... you can watch it with your family. IF you are fan of sonam kapoor's attire then you will love it.","label":0},{"review":"Prem Ratan Dhan Payo tittle song is the very nice song really I like this song and I like indian playback singer Palak Muchhal .","label":0},{"review":"It's beautiful..!!\nPeople who are rich in values are gonna love this movie for sure...!!\n+SALMAN KHAN ROXX","label":0},{"review":"Only suraj ji can break the milestone of this movie by making another one with salman....just fab mindblowing ....","label":0}]