[{"review":"Wow movie ! Love, a feeling that never leaves u till u die, sometimes it fades but yet it comes back. Everyone in love matters think that Love is like Yash Chopra's Movies, in which guys imagine they are like Shahrukh Khan, but it's not that simple boys, it can take any turn. Everything has its own pros and cons, hopefully Love also. This movie is all about some of pros and cons of being in a relationship with a girl.Gets little Boring in some parts but In all u will Definitely enjoy.\nPrequel of ...MORE","label":0},{"review":"Wow movie ! Love, a feeling that never leaves u till u die, sometimes it fades but yet it comes back. Everyone in love matters think that Love is like Yash Chopra's Movies, in which guys imagine they are like Shahrukh Khan, but it's not that simple boys, it can take any turn. Everything has its own pros and cons, hopefully Love also. This movie is all about some of pros and cons of being in a relationship with a girl.Gets little Boring in some parts but In all u will Definitely enjoy.\nPrequel of this movie is Hilarious but loose climax, In part 2 less Hilarious comedy but Climax is, a word above Hilarious.\nDo.watch","label":0},{"review":"The last scene sums up the movie- the three men..err sorry I meant boys calling their mothers to tell them how much they love them after they have been deceived by their girlfriends. The esteemed director, Luv Ranjan makes you think about the gender dynamics in Indian society. Ofcourse, men are naive and gullible creatures easily duped by scheming women. You truly feel for these men if they will ever become smart enough to ward off these \"gold diggers\" in future. Maybe part 3 would be about them ...MORE","label":0},{"review":"The last scene sums up the movie- the three men..err sorry I meant boys calling their mothers to tell them how much they love them after they have been deceived by their girlfriends. The esteemed director, Luv Ranjan makes you think about the gender dynamics in Indian society. Ofcourse, men are naive and gullible creatures easily duped by scheming women. You truly feel for these men if they will ever become smart enough to ward off these \"gold diggers\" in future. Maybe part 3 would be about them buying blow-up sex dolls and calling it a day.","label":0},{"review":"Worst movie.. What are they trying show? What about guys?? They also always want a beautiful and hot girl for them that time love doesnt matter.. When they can be so selfish and self centered.. Girls are exaggeratedly showed wrong way.. If he really wants to show truth then even guys do many things they also ditch, break promises. He should have made movie showing both sides.. Anyways as usual male dominated Society.. Whatever males do that's right and if a girls do is to be blamed..","label":0},{"review":"Warning: This movie will actually make you hate girls. This director has the power to do that. Anyways, a great watch. Good performances by male actors, women are doing too much over-acting, specially Nushrat. I cant understand, why she is overacting in every single scene.","label":0},{"review":"Assoum movie. It's a part of real life. in my opinion it's a mind-blowing movie. And character of choka is very much sensetive. And one of the dialogue is my best is \"chal jhuthi\".I appreciate the writer thought. And I have a doubt that also girls watching this movie and they are agree with the story and situation. Very good movie. 👍👌","label":0},{"review":"A must watch for all the singles who are desperate finding gf or bf. Also after a long time bollywood's obsessions with pyaar has brought some light into the reality of pyaar and relationships, which seems very good when you imagine it but it fails in reality and only comes out to be a fake, manipulative and non-working relationship from females.","label":0},{"review":"Well the movie was really awesome treat to watch.. girls do feel about the concept however its the truth most of the girls does the same.. there are good girls an bad girls.. watch it as movie of entertainment not to take personally... Happy entertainment guys","label":0},{"review":"Girls or Feminists will say this as biased towards male. But this is the reality. There's a saying, \"Woman can get laid anyone they want, Man will get laid whom they want.\" That's how our society is. All are thinking that this is a male dominant but the reality is women are dominating not openly though but with mental and emotional. If this movie is creating awareness about how to stay and live with girls, then nothing wrong in this.","label":0},{"review":"Great Movie... Some people said, it's a male dominanated society but it's true that some girls ready to go with another option if they found nothing new in boys in most of the cases... Sometimes boys too... But more chances with girls... 😂😂😂","label":0},{"review":"No doubt the movie was awesome!! Acting, music, leads and the location everything was superb.!!! \nAlso I love myself more. Thank god I ain't pretty and not like girls shown in the movie😂😂😂","label":0},{"review":"It's a great movie specially for youths.\nIt has fun masala and romance. In a simple word we can say that it's a paisawasool 🎥 😉","label":0},{"review":"I recently see it on jio cinema and movie is \nvery good and tell me a lesson that never be trapped in any relationship be free with your frends and chills out that's it thanks","label":0},{"review":"Awesome, It's a fantastic movie.The movie express the real and dark side of love which happens in our society.Besides this this movie defines the modern and money oriented girls properly","label":0},{"review":"Awsm moive😍but we need 3rd part which will focuosed on the problems of gfs bcz of their bfs....n plz dnot cast nusrat bharuch,over acting ki dukaan n so much irritating😡😸","label":0},{"review":"one of the best movie i watched to date. special shout out to cast and the director and yeah i would love to dedicate this movie to all the gold diggers out there.","label":0},{"review":"Believe me guys... It's a treat to watch... Just forget the love word... It kills.. \n It's a perfect sequel to it's predecessor... So funny..","label":0},{"review":"Very good movie at least something to show in movie of some girls attitude Nd behv..like betray arrogance is that ok for them but not for true lovers.. after I show this both movie pkp 1 Nd 2  I never should fall in love Nd don't trust any girls","label":0},{"review":"Movie is so good I loved the story and of course the acting of the whole star caste lovely jodi of kartik and nushrat Always best 😘 \nWell ❤❤❤❤","label":0},{"review":"Movie was awesome it shows the about today's relationships. Just Waooo it is awesome like its first part","label":0},{"review":"Proud to see that movie ,womans country ,no one think for boys now days ,this cinema show that how womens are actually are","label":0},{"review":"Best actor Nusrat she is` what makes the flim so very much Lovable best acting ever...","label":0},{"review":"Best for the ones who are truly friends and trust each other.Made my day","label":0},{"review":"I just can't stop laughing, even at the emotional parts , this series is too good!!","label":0},{"review":"see guys it's a movie so dont show off ur self girls very nice movie and kartik is brilliant","label":0},{"review":"Best movie ever.\nThe satisfaction level will be high after you watch this.","label":0}]