[{"review":"Raanjhanaa is the movie for all ages! Marvellous writing! Script of highest class that looked simply unforgettable when portrayed by some of the unheard actors...Director Anand L Rai couldn't create such highest order of magic in any of his movies like what he did in this one! It was the movie perhaps made for Dhanush aka Kundan! Just magnificent acting...Class in the pace of the movie...I have watched more than 100 times, seriously...Still gives me enough goosebumps. I cry at the ending of the  ...MORE","label":0},{"review":"Raanjhanaa is the movie for all ages! Marvellous writing! Script of highest class that looked simply unforgettable when portrayed by some of the unheard actors...Director Anand L Rai couldn't create such highest order of magic in any of his movies like what he did in this one! It was the movie perhaps made for Dhanush aka Kundan! Just magnificent acting...Class in the pace of the movie...I have watched more than 100 times, seriously...Still gives me enough goosebumps. I cry at the ending of the movie...I fail to hate Dhanush's pathetic looks because he deserves every round of applauds for his performance in this movie...His best one! My most favorite movie in last 10yrs...","label":0},{"review":"Such a nice movie. People in love can really go into depth to do anything. I cried. It hurts. Love is love whatever age it is. It shows the real thing that girls do. She said that she was only in 9th. It was not love. When she said that, i think i was more hurt than the character of kundan (dhanush). Some people don't understand true love. However, all the actors like Dhanush, Sonam, Swara and Mohammed Zeeshan were really great in their role, specially swara and dhanush. And the between these th ...MORE","label":0},{"review":"Such a nice movie. People in love can really go into depth to do anything. I cried. It hurts. Love is love whatever age it is. It shows the real thing that girls do. She said that she was only in 9th. It was not love. When she said that, i think i was more hurt than the character of kundan (dhanush). Some people don't understand true love. However, all the actors like Dhanush, Sonam, Swara and Mohammed Zeeshan were really great in their role, specially swara and dhanush. And the between these three friends was awesome. I don't if i have seen dhanush's any movie but this one must be the best. \nSpolier\nI am confused did he really died in the end or lived.","label":0},{"review":"Hats off To three people\n1.Himanshu sharma for writing such a fantastic story, except some parts of 2nd half he is absolutely on top of his game\n2.Aanand L rai One of the better director who makes desi stories, he is an honest man which reflects in his direction\n3.Dhaush the National award winner actor, his hindi is little weak but he makes up with his extraordinary acting, No one could have done the role better","label":0},{"review":"Very Fresh and Brilliant Movie. Nice story line and incredible performances by Dhanush, Sonam, Swara, Zeeshan Ayub, Abhay deol or I should say by all the actors. Nice direction by Anand L Rai. I should definitely give a special mention to Dhanush for his iconic role. Not a typical love story.","label":0},{"review":"Amazing movie...very emotional and especially the acting of Dhanush and Sonam kapoor.....They just nailed it with their promising class act through out the film...For me 1st half is more beautiful and heart breaking.Shortly this movie just blew me away.After watching it I has such an emotional feeling.The highlight of this wonderful play is Dhanush's acting..This was one of the best love story I had ever seen in my life....","label":0},{"review":"To be true this movie is real new face of bollywood cause in this movie there is much more than gaana bajaana. You should watch this beautiful piece that will amaze you how a smiple love story turns into a political jaal and how a person's complexity changes with time. truly worth watching movie 👍","label":0},{"review":"One of the best movies you'll ever watch . Movies like this are the heart of our bollywood . The movie captured the landscapes of Banaras so beautifully . And acting by Dhanush is superb . Kudos to the team .","label":0},{"review":"A great concept with a beautiful plot. Thoroughly enjoyed the movie. When such a story is mixed with superb acting by all the artists we get to see such heart touching movies like this one.","label":0},{"review":"And this listed in the top of my fav movies list. I am totally drifted by this movie, there is so much reality in this movie. This is what I call real acting. Thank you Dhanush and Sonam for playing such a beautiful and inspiring movie.","label":0},{"review":"After seeing this movie I think my heart is even beating more fastly.. because it's such a wonderful love story.....                      \n          I don't know what my feelings now it just like I don't know,, I want to cry or... I think it's very painful...\n          But I know that it's awesome film....","label":0},{"review":"Raanjhna is one of the best movie I have ever seen in my life..I have watched this movie many times but still can't get over it...it still gives me goosebumps as if I m watching this for the first time...... awesome acting,story,music...👌👌 amazing movie....I hope that more such types of movies to come... ❤️❤️🙂","label":0},{"review":"Perfect acting by dhanush and sonam kapoor...nice screenplay..fantastic direction...fabulous story..worth watching movie!! Specially the climax scene dialogues are outstanding!! Must watch for every true movie fan..","label":0},{"review":"This is the best Indian love story movie I have ever seen. Dialogues are just fabulous. I have watched it more than 10 times but never got bored.","label":0},{"review":"This is best movie. This won my heart. The acting of dhanush and sonam kapoon is at best, Believe me or not. \nBut this is best best and best. The screenplay , direction , songs all are very good.","label":0},{"review":"Heart touching love story......\nWonderful Movie but very painful.....\nI hope at least in the next life Zoya will correct all her mistakes.....and Kundan will get his love.......and Akram will unite them....\nLove U Dhanush and Sonam","label":0},{"review":"This movie is underrated masterpiece. Excellent in every department, acting by Dhanush and all co-actors are at the top. Music by A. R. Rahman is breathtaking, story is excellent. This is movie is must watch.","label":0},{"review":"I found this movie almost relevant to real life and I would strongly recommend you all beautiful people to watch it at least for once and you will go to appreciate the time you put to watch the whole movie.\nwell plotted <3","label":0},{"review":"This the best romantic sad Story which I ever seen yet , it touch ur heart and at last I'm sure you will cry by seeing this movie, it's really really a fantastic movie guys and I'm waiting the next part of this movie","label":0},{"review":"Must watch this Raanjhanaa movie It's ok Heart touching Movie & so emotional movie but yes something new Love Story shown I like it I will 98% outoff 100% percent👌👍♥️","label":0},{"review":"Raanjhanaa is the one of best movie, I have ever seen. This movie will be always in hard drive so that when ever I like to watch, I just go for it without hesitation.","label":0},{"review":"Raanjhanaa is my favourite movie,dhanush at his best and one of the best script in bollywood till yet by himanshu sharma.Anand L Rai makes banaras a dream place to live.","label":0},{"review":"One of the best love story i have never seen this type of story. I like to watch this movie again and again. Zero some dialogue is same ie kute, tum kya kahana chah rahi ho last seen...","label":0},{"review":"One of the best movies that bollywood has made. Everybody is exceptionally brilliant. There are no loose ends at any point and climax scene is epic.","label":0},{"review":"One of best movie of Bollywood.  Hats off to each  and  every  one person connected to it. All characters are like real , kundan, zoya, murari bindiya, and of course  character of abhay deol\n.","label":0},{"review":"In simple word it is awesome and the best one from all those movies that I have ever been watched...Just perfect no movie or story can beat it's intellectual story and the dialogues.","label":0}]