[{"review":"A romance by Aamir khan karisma kapur -It proved that Love doesn't obey any limitation. It goes beyond imagine. Love doesn't see status. When why who which How where are impossible to determine. Very smooth quite normal instinctive. \n           Dr Dharmesh Darshan did well.Aamir khan is gorgeous handsome around the world,n't probably but must count as best goodlooking man in the earth.In Raja Hindustani he acted smartly, touched perfectly to the character of a taxi driver,  straight forward, sen ...MORE","label":0},{"review":"A romance by Aamir khan karisma kapur -It proved that Love doesn't obey any limitation. It goes beyond imagine. Love doesn't see status. When why who which How where are impossible to determine. Very smooth quite normal instinctive. \n           Dr Dharmesh Darshan did well.Aamir khan is gorgeous handsome around the world,n't probably but must count as best goodlooking man in the earth.In Raja Hindustani he acted smartly, touched perfectly to the character of a taxi driver,  straight forward, sensitive lovely appeared. Both fell in love each other and discovered or found  love between self and opposite partner Inspite of being parental opposition she got married and barriers came in their way. Misunderstanding led them to be detached each other.In party Raja got offenses due to intensely created confusion arranged by relatives Arti behaved badly with Raja in the party inspite of knowing Raja's honesty she couldn't manage Raja well and shorttempered on Raja.Raja hurted by her deeply and stepped away. \nUltimately Arti repented and Raja forgave, his mind set turned towards wife for his kind hearted nature. Indian woman culture strictly showed in this movie that a woman never wants to break up the relation with her mind-God by any means of.By hook or by crook  she wants to protect  and develop the  life of her closest partner.In this circumstances how she can demand divorce separation ; out of imagine.Marries happens  once in life fixedly .THE FIRM RELATION.   But in our country, real fact is well-known. Mutually understandings is very essential now a days in married life atleast. It was all time block buster.I think Aamir khan acting in this film is fabulous powerful full of passion oriented minute touch  well done. \n   A coincidental happened once without any plan during watching in 2018  on small screen. A scene Arti begging her  husband's long life before lucky mirror on karwachowth.Just at same time my mom suddenly came and looked her face before mirror on karwachowth;   Cleary we (me and daad) could observe having sat at a side to the mirror. We delighted.  Exactly \"mirror watching\" from two sided at just same moment and on obviously on same auspicious day karwachowth. My mom also was celebrated karwachowth on that day interestingly.  Unexpected gift presented to us .All God's wish.\n   Watched it 17 times till the date. All songs are superb,sweet Especially  as a bathroom singer I've been singing kitna pyara. Pucho zara  .Aaye ho .\n\nMeanwhile connecting with this romantic picture is mandatory for all film lovers.watch and enjoy Life is Love,enjoy it with peace in a short term human life span.\nNamaste to all readers heartly .Good luck. 🖒","label":0},{"review":"This is a my fav. romantic movie.\nThis movie to connect my childhood drama i m sharing now\nWhen i was saw this movie with my parent in the theater so i did't understand what was happend surround to me  bcoz i was only 2 year old.\nBut now i was know through my parents u sung a song pardesi pardesi movie of raja hindustani 2 to 5 year.\nBut i don't remember bcoz i was childhood when i was 9 year old in 2002 i was saw the movie 4 to 5 time regularly. Then i was big fan of amir khan & \nkarishma kapoo ...MORE","label":0},{"review":"This is a my fav. romantic movie.\nThis movie to connect my childhood drama i m sharing now\nWhen i was saw this movie with my parent in the theater so i did't understand what was happend surround to me  bcoz i was only 2 year old.\nBut now i was know through my parents u sung a song pardesi pardesi movie of raja hindustani 2 to 5 year.\nBut i don't remember bcoz i was childhood when i was 9 year old in 2002 i was saw the movie 4 to 5 time regularly. Then i was big fan of amir khan & \nkarishma kapoor.\nWhy amir khan call him Mr. Perfection? I was know after saw  the raja hindustani\nI like Acting , Dram, dialouge, Direction , Songs etc.in this movie.","label":0},{"review":"Hello, this is one of my most favorite movies of the 90s. Very good performance by everyone that includes Aamir Khan, Karishma Kapoor, Jonny Lever, Monish Behl, and Suresh Oberoi. The songs were a rage back in the day whether it was Pardesi Pardesi, kinta pyara, pucho zaara, ayeho meri zindagi. This movie had it all drama, romance, emotions, action and my favorite Aamir Khan who won his first best actor award for this film. Thank you.","label":0},{"review":"I think Raja Hindustani is a romantic movie . All the songs are very beautiful.  Nadeem Shravan music in this film are very good & melodious. Nadeem Shravan are the best musicians in the Bollywood.Love story of true love. Amir Khan is loved by Karishma Kapoor. She leaves all her riches for love. A good film with very good songs.","label":0},{"review":"I was in my first year of college and was totally mesmerized by it songs,  karisma Kapoors beauty and Aamir khan s  performance. I remember running to the theater every Thursday to watch it as every Friday there was a fear that the flim might be removed. With this being my worry I saw the film nearly 12times. Those were the days!!","label":0},{"review":"This move very liked by my father \nThey see this move allows and I think that this move very nice very most and  I like this move after my father .. I had been looked when this move come no the t.v. thay  Wher very happy that time. Thankyou..","label":0},{"review":"I think Raja Hindustani is a romantic movie . All the songs are very beautiful.  Nadeem Shravan music in this film are very good & melodious. Nadeem Shravan are the best musicians in the Bollywood","label":0},{"review":"It is a very emotional & entering moment of this movie. That's like Thousand per only one movie. Love is Joy everyone. Everything is possible by love so I am very interesting on this movie.","label":0},{"review":"Love story of true love. Amir Khan is loved by Karishma Kapoor. She leaves all her riches for love. A good film with very good songs.","label":0},{"review":"I love dz movie, \nSpecialy pardesi song. \nY song dil ko choo Leta hai, \nJb maine first time y song dekha to mai ro padi thi. \nSuch a very very touching song.","label":0},{"review":"It is  a blockbuster  flim  and  one of  the most popular  flim of Karishma Kapoor and Amir  Khan .First  time  best actress  Flimfare award win Karishma  Kapoor. All the  characters very  well  performance  in this  flim.My best movie  it forever .","label":0},{"review":"Never seen a movie like this  \nI am a school student but after seeing this movie i dont want to watch any other bollywood movie \nGreat job \nAamir sir \nAnd\nKarishma mam \nThankyou for realeasing a movie like this","label":0},{"review":"Udit jee song is just like hari bhajan. Every song is evergreen. Legend nd veteran udit jee is d best singer in india after kishore nd rafi.","label":0},{"review":"I like this movie very much. because of this is like my own love story as well as acting which was acted by both amir and karishma was really admirable.","label":0},{"review":"I remember long time ago i had watched film Raja Hindustani in theatre when i was 6 years old.The most interesting and exciting was comedy.","label":0},{"review":"Lovely Love story and Music is Superb fantastic i am Speech less about the Music. Great Absolutely","label":0},{"review":"I was a classe nine boy,when the movie  was released.the unit acting is fantastic. Every song of that film is memorise till now.","label":0},{"review":"This movie is one of the best film i have been see all time i am not getting boared.karishma kapoor is my best film actress.and amir khans acting is very good....","label":0},{"review":"was in college first year. was very giid movie. love the location and beauty of Karishma","label":0},{"review":"With romance it also show how for being hot temper you may fall in evil  trap of some one . It  tells  us  we  must  be  careful","label":0},{"review":"This movise is like my friend so after anything this movie is very interesting .I am a student , this movise like my class teacher","label":0},{"review":"One of the 90's Block buster.\nOne of my Favourite movie.\n\nKarishma never ever seen beautiful like before that.","label":0},{"review":"This is our time movie. I didn't have the chance to see at that time. But now enjoyed.","label":0},{"review":"This has the legendary song pardesi pardesi jaana nahi ... which almost everyone knows how to play ... don't know what else is called popularity 😂","label":0},{"review":"I noticed one music which was keep running in background of this film which later used in movie Dhadkan with track TUM DIL KI DHADKAN ME.","label":0}]