[{"review":"Although I am writing this review in 2019, an era when many young audience like to watch hi-fi films like that of Marvel's, this simple yet fun movie is sure a nice thing to watch. Built on cross border terrorism, it educates audience about its mechanism while showing a brave police officer's desparate attempts to stop it with many humourous scenes in between. Overall the story is simple and nice not to mention great acting and direction. Recommended watch for people looking for some serious iss ...MORE","label":0},{"review":"Although I am writing this review in 2019, an era when many young audience like to watch hi-fi films like that of Marvel's, this simple yet fun movie is sure a nice thing to watch. Built on cross border terrorism, it educates audience about its mechanism while showing a brave police officer's desparate attempts to stop it with many humourous scenes in between. Overall the story is simple and nice not to mention great acting and direction. Recommended watch for people looking for some serious issue based non animated film.","label":0},{"review":"Well, Hello to all.\nDon't coming a Single reason to reject the most of the today's CINEMAS which indirectly teaching  our kids to grow adult more before time, and they Definitely lack of a super strong story, unless they copy something. \nFilm makers are focusing on money not on content and quality of the cinema, which they are going to Present in a Society, what makes me angry is, They don't feel SHAMEFUL while saying We the Audience are demanding semiporn Cinema!! Shame on them.\nThey must learn ...MORE","label":0},{"review":"Well, Hello to all.\nDon't coming a Single reason to reject the most of the today's CINEMAS which indirectly teaching  our kids to grow adult more before time, and they Definitely lack of a super strong story, unless they copy something. \nFilm makers are focusing on money not on content and quality of the cinema, which they are going to Present in a Society, what makes me angry is, They don't feel SHAMEFUL while saying We the Audience are demanding semiporn Cinema!! Shame on them.\nThey must learn from the movies like SARFAROSH and they know much much and much better than me. Because the are Filmakers.\nToday's songs are even not worth of Selling a condom, people are using GOLDEN COLLECTION SONGS FOR SELLING A condom? this shows most of the today's cinemas are just to make money and sell Product. \nSeriously yaar I'm sad ...","label":0},{"review":"I don't know but this film has some magical staying that make me to watch the film till end. It is aVery high standard film. Mr. Perfectionist just nailed the role of Ajay Rathod. The other actor and actress also gave high level acting performance. and the main fact is ,it has Very standable Story and most finest Driection. Nearly 20 year has been passed but it still remain imcompareble.","label":0},{"review":"I guess that I've watched this one for at least 10-12 times and each time I started watching this movie on television I watched it till the end ! That was d magic of this film, absolutely class performance by our beloved Mr. Perfectionist ! Ane Nasheruddin sahab  to ! Mashallah <3","label":0},{"review":"Great acting by the Indian cast as soldiers etc.\nActors playing the part of English officer's,wives and nanny's,very amusing,\nGood battle scenes and good camera work.\nWe English just love the Punjabi people and soldiers,fierce fighters and very good people to this day.","label":0},{"review":"Most underrated amir Khan's movie. Amir was outstanding and so were other actors.\nGreat direction and even songs were good.\nMust watch for amir's fans. One of the best movie of Amir Khan. 4 out if 5","label":0},{"review":"Film's visual are magical, never seen before. The film is fresh and energetic. But must say script is compromised but visual neglects that part. So must watch SHANKAR'S spectacle.","label":0},{"review":"Even after 20 years of this movie, even today the story is so much relevant. Excellent direction & research by John Matthew Mathan. Hats off to him!!! ðŸ‘ðŸ‘","label":0},{"review":"Good action movie I liked it Salim character as officer played the very dynamic role with Aamir Khan, Nasiruddin shah as it well n Song zindagi maut na ban yaaro all character played good work with direction as well","label":0},{"review":"Love story is on one hand and drama/action on another. They didn't mix it making it one of the best movie..  Amir sir at the best.","label":0},{"review":"It really has some magic which will compel you to watch this movie all over again no matter how many time you have watched this before. Awesome movie!","label":0},{"review":"A movie about an honest, positive & courageous National Police Services Officer. Good motivation for me.","label":0},{"review":"AWESOME movie yaar, I saw already 10-15 times\nVery good direction, pictorisiation\nSuperb casting too....all characters are too good","label":0},{"review":"I don't know how many times I have watched this movie ....with same interest that I  m seeing  first time ... great work","label":0},{"review":"I have watched this movie like 25-30 times. One of the best performances by Amir Sir and Nasir Sir.","label":0},{"review":"Great movie. Skilfully directed. Need to see some more great work from the director.","label":0},{"review":"Sukun mil gya..... Achha  laga and I understood..... What is the love...... And also I love my wife","label":0},{"review":"Sarfarosh is supposed to be the one of the best Movie of Bollywood and the best of Aamir Khan work even far better then Lagaan and Rang de basanti....","label":0},{"review":"Magnificent movie....\nUnparalleled..\nUnforgettable..\nIncomparable..\nRemarkable..\nBrilliant..\nIncredible..","label":0},{"review":"Superb movie with useful social message included excellent album hit musically generated songs.","label":0},{"review":"Loved it. Still think best movie of perfectionist Khan","label":0},{"review":"It was a very serious moive ..and Jo hal dilka  one of my fvrt song ......supb ðŸ‘","label":0},{"review":"I saw the film 4 times in 1999. Excellent screenplay and good music.","label":0},{"review":"You watch the movie a dozen times but you don't get bored.","label":0},{"review":"Great movie like to watch every time it's on channel","label":0}]