[{"review":"My View My Review :-\n\n\nAjay Devgan is back as Bajirao Singham, an upright officer who is now promoted as DCP of the Mumbai \npolice. Unlike it is shown in the prequel, this time he doesn’t have to waste time dealing with \ncorruption that is prevelent within the system, on the contrary the Mumbai police is shown as a \ndisciplined force and united like one family, Rohit Shetty’s efforts to build a positive image of the \nMumbai police is evident in Singham Returns, but the filmmaker has unknowingly  ...MORE","label":0},{"review":"My View My Review :-\n\n\nAjay Devgan is back as Bajirao Singham, an upright officer who is now promoted as DCP of the Mumbai \npolice. Unlike it is shown in the prequel, this time he doesn’t have to waste time dealing with \ncorruption that is prevelent within the system, on the contrary the Mumbai police is shown as a \ndisciplined force and united like one family, Rohit Shetty’s efforts to build a positive image of the \nMumbai police is evident in Singham Returns, but the filmmaker has unknowingly shown that even the \npolice force is a victim of blind belief, I hope in reality the Mumbai police does not sit idle \nthinking that the blessings of a Sufi phir will take care of all the incidents of robbery taking place \nin the city. Bajirao Singham has a tougher task this time as he has to locks horns with a fake godman \nessayed by Amol Gupte who along with a corrupt politcian( Zakir Hussain) is involved in hoarding black \nmoney and their men are armed with some of the most deadly wepons. Amol Gupte’s getup remindes me of \nthe contoversial god man Chandraswami, who made headlines throughout the 90s and was accused of \nrepeated financial irregularities. The budget of the film must surely have gone up as the number of \ncars reduced to pieces are far more in numbers in comparison to the prequel. Kareena Kapoor’s role \nis quite opposite to her figure conscious, low appetite image, she eats everything that her hands can \nlay on, it seems Kareena was roped in to add some comedy flavor which unfortunately failed miserably, \nit would have hardly made any difference even if the film didn’t had a female lead. Ajay Devgan is at his best \n,certain things that I found common in the prequel and sequel is Singham’s style of walking directly \ninto the villain’s den, striking fear in the hearts of all those who are on the wrong side of law. \nAction sequence is too good and exchange of fire between the police force and badmen is lively,actor \nDayanand Shetty who is seen in Television series CID and is considred a specialist in breaking doors \ndoes the same act with ease, very true! Practice makes a man perfect. I wont say that Singham Returns \nis better than Singham but the sequel deserves an audience, a lot is already spoken about the Song Ata \nMajhi Satakli sung by Yo Yo Honey Singh so I wont comment on that, but I liked the new title song sung \nby Mika, it is not part of the film but is played during the interval, the lyrics describes and \nglorifies Singham’s style, quality and nature, I would call it a Singham Chalisa.","label":0},{"review":"Movie was good but not best.\nPositives:Acting By Ajay And other actors,good songs,good actions,good cinematography,gripping emotional scenes and dialogues.\nNegatives:Worst villains ever casted, Bad editing, satisfactory screenplay,lack of perfection in gun fight scene,flat jokes.\nRohit Shetty is a very capable director but this time he missed his mark.\nRatings:6/10","label":0},{"review":"i may have enjoyed some previous movies but this one is one of the best movies i have watched. i love it and i watch it mutiple times. I may be South African but i love INDIA AND ALL THE BOLLYWOOD  IN IT","label":0},{"review":"Must watch movie ajay all movies are always best this best movie of ajay after singham and kareena was nice and I want that they will make 3 rd part","label":0},{"review":"In India we have lots of corrupted politicians who with the help of money win seats. Officers like Singham are needed to really make India developed and to stop rubbish political games going on in India. This is a tale of such a brave officer Singham.","label":0},{"review":"This was the best movie of both Ajay Devgn and Kareena Kapoor. Both acted superb. The theme of the film was very good .","label":0},{"review":"Story was fine, but action is worst. All the fight scenes seems to be quite pointless specially gun fights.\n\nI don't understand why the would keep these unrealistic scenes in movies.","label":0},{"review":"NON SCENCE MOVIE INDIAN ARE NONSENCE THATS WHY THEY LIKE THIS FILM I AM NOT INDIAN MY FRIEND IS INDIAN HE TOLD ME TO WATCH THIS FILM I WASTED MY TIME MY MONEY EVERYTHING ONLY MINDLESS AND HOPLESS PEOPLE LIKE THIS FILM THANK U VERY MUCH","label":0},{"review":"This is my favourite movie ever I watched.\nAnd the act is awesome by cast and song is also awesome.","label":0},{"review":"I loved it.Kareena is fabulous and of course,I don't have to mention how good Ajay Devgan is😍🤩😎","label":0},{"review":"Not like the first part but yaa........nice movie....Daya sir .....we luv uh......darwaza tor .....that famous quote used....sooooooooon niceeeeeeeeee. Ajay sir uh'r great....","label":0},{"review":"Top class movie of all time. Awesome Ajay sir. Please release next part soon.","label":0},{"review":"Kareena as always over acted and spoilt the other wise average movie. They could have excluded Kareena saved cost. Otherwise its an average typical Bollywood movie.","label":0},{"review":"This is my favourite movie. Agar meri bas chale toh mei toh har roz dekhu!","label":0},{"review":"Best film I just loved it and I saw this movie 13 times in a week","label":0},{"review":"Best of Rohit Shetty's Unusual Action Defining Physics. Loved It.","label":0},{"review":"Superb movies series of Singham series both Singham  1 & 2 movies are superb both Ajay Devgan's Singham movies are blockbuster movies love this movies","label":0},{"review":"Ajay Devgan best acting in bajirao singham in singham and singham returns. Best movies of Ajay Devgan","label":0},{"review":"No one can compare with Singham Ajay he proved that he is the best best movies by him","label":0},{"review":"Title song Encourage me every time.Thanks to Rohit sir with all members","label":0},{"review":"I like the hindi film named Singham Returns (2014) because Ajay Devgan is the best film actor","label":0},{"review":"I like very much this movie because bajirao singham is the honest police officer","label":0},{"review":"Movie is fantastic I love Ajay . He is very good actor .","label":0},{"review":"Ultimate action of finest actor of indian cinema , Ajay devgn awesome movie...","label":0},{"review":"Love to c it again and again..... Creativity","label":0}]