[{"review":"Taal is the musical drama .And an milestone in indian cinema.I love all the songs and musical instrumental songs used in this movie.You can easily go out of stress when you simply listen it's songs with headfon.This movie is a complete package of entertainment and music.A.R.Rehman the music composer of this movie have done a fabulous work which will be remembered all the time in future also. Classical as well as western music all the forms includes in this movie. An awesome fabulous and extraord ...MORE","label":0},{"review":"Taal is the musical drama .And an milestone in indian cinema.I love all the songs and musical instrumental songs used in this movie.You can easily go out of stress when you simply listen it's songs with headfon.This movie is a complete package of entertainment and music.A.R.Rehman the music composer of this movie have done a fabulous work which will be remembered all the time in future also. Classical as well as western music all the forms includes in this movie. An awesome fabulous and extraordinary all time favorite movie that must watched by everyone.👌👌👍👍","label":0},{"review":"Taal is my one of the favorite movie.  I love this movie a lot.  I watch this movie more than 10 times. Every time when I see this movie seen on t.v I again watch it. After this movie I am a great fan of Aksay. And sometimes I think such a good actor like Hollywood actor why  so neglected in Indian film industry?  I love Anil and  Aishwarya   also.  This is my all time  favorite  movie. Beautiful story line   what a  romantic  movie .","label":0},{"review":"I loved taal as a child because of my favourite superhero Akshay Khanna. Love his vibes. Specially when the songs with the musical instruments came on. The atmosphere in the movie really kept me so excited and I love to taal se taal mila every morning with a cup of coffee.","label":0},{"review":"One nice movie to watch.. a great piece of Indian movie industry. Good package of direction, scripts, actings, music, songs, dance and yes locations. Overall a movie you must watch. And on completing 20 years, this 2019. Still I can say if this movie would have released today. It will way more better than today's movies in any category.","label":0},{"review":"the pillar of this film is music . what a brilliant beautiful composition by the legendary music composer ar rahman . seriously aaj k date mai bhi aisa instruments aur itna beautifully koi bhi music ko decorate na kar saka aur na suna saka.( seiously till todays date no any other music arranger composer than ar rahman has used this type of instruments and made us hear music so beautiful ) .","label":0},{"review":"I was born in 1995 ,I had watched this movie in 2005-2006 .This movie taught & inspired me to Love someone Wholeheartedly.\nI was able to feel true love after watching this movie.splly the songs which touch my soul.\nThank u Rahman sir","label":0},{"review":"This musical drama has more of music than drama! Every song will touch your soul! Beautiful compositions by AR and beautifully portrayed by the Artists. One of the last magical movies by Subhash Ghai!","label":0},{"review":"It's almost 20 years now that film has released..I watched this movie 2 times on the same day of release.. matinee n first show.. thanks for great compilation of Indian music","label":0},{"review":"Known for its music. No movie before Taal or after Taal had such beautiful mesmerizing music. And no one can replace this piece of AR Rahman or ever reach this level.","label":0},{"review":"What a romantic love story.. It's a milestone in Indian Cinema. Fantastic acting from Aishwarya, Akshay and Anil Kapoor.. What a nostalgic acting from Akshay. His acting and attitude touch my heart. Wow amazing. Must watch.","label":0},{"review":"music of this movie is superb mr a.r .rahman and mr.shubhash ghai both are very good in their own field.nahi saamne tu alg baat hai wht a song written by anand bakshi and wht a composition great mr.rahman","label":0},{"review":"I have watched this movie 75 times since from its release, and all the times, i watch it feels fresh as it release today\n\nI simply love the music\n\nFinest production from Subash ghai","label":0},{"review":"It's going to be 20 years...still it's fresh and completely bliss to listen to the music.... the videos are definitely a visual treat  and a complete musical album so far.....It's connect to us so emotionally even after 20+","label":0},{"review":"Loving the song and still have a hope that we will keep getting music like this and just  praying that Reheman sir must bring the magic and create something like this for the younger fans","label":0},{"review":"Still a fresh musical and love story after 20 years .. Really look like a fresh love story and big hit earn near 52 crore box-office collection","label":0},{"review":"Superb songs...still fresh to hear even after it is gonna be two decade....love it...and a good film that makes an audience not to fall but rise in love...","label":0},{"review":"The songs of this movie is treat to ears. So even if you can not understand the lyrics still you should listen to the songs and find yourself in heavenly feeling.","label":0},{"review":"A musical romantic drama. It s just not a movie, its a musical saga, I love this movie so much. outstanding songs.","label":0},{"review":"'Taal',its very  beautiful @ sweet romantic movie .Akashy @ Aishwarya's jodi looks sooooooooooo beautiful , lovely .Movie is all about music , very nice music ,loved it","label":0},{"review":"this is one of the best movies i've ever seen.this film has inspired us to love and caring towards others.","label":0},{"review":"THE movie ..superb .. never seen this kind of album which have all the beautiful song.. no words to say for whole movie. !!","label":0},{"review":"One of my best movie in my life... By seeing this movie I fall in love and got my first love....","label":0},{"review":"its a wonderful movie  i use to watch till now in both language.\nto relax my mind.","label":0},{"review":"This film and same song are my old memories I will never forget...luv this movies.","label":0},{"review":"Superb love to watch it again and again. Love it's music also.","label":0}]