[{"review":"Either you too much like this or find this very poor , i belong to first category !. I was expecting some investigation based melodrama but complelty awestuck when it got onto a different plane with rational justification of paranormal . This kind of movies make paranormal concepts serious rather than mocked by rationalists .  Way this niche supernatural phenomena mixed with rational hero plus intelligent screen play and edition is breathtaking , exponentially the film gives goosebumps as it pro ...MORE","label":0},{"review":"Either you too much like this or find this very poor , i belong to first category !. I was expecting some investigation based melodrama but complelty awestuck when it got onto a different plane with rational justification of paranormal . This kind of movies make paranormal concepts serious rather than mocked by rationalists .  Way this niche supernatural phenomena mixed with rational hero plus intelligent screen play and edition is breathtaking , exponentially the film gives goosebumps as it progresses with utter shocks in the end . \n\n\nAll actors  were amazing did justice to it ,  and this kind of movies make  movie watching so serious and entertaining at the same time  , i bet they out lots of hard work into this .  Kareenas  justification for killing spree is bit warranted , you cant keep of killing just because they left you die on road , this looks irrelevant and illogical , plus women centric concept that she is been murdered  brutally , so just because she is woman revenge is going to be big . Other than this its a perfect movie to spend to these 2 plus hours and will keep on a edge","label":0},{"review":"One of the Best movie\nWatch out for the story,twists and the man who's diehard fan i am AAMIR KHAN with kareena kapoor whose most successful acting after jab we met and rajkumar raj,Nawazuddin and Rani Mukherjee.\nFinest story by zoya akhtar and reena kagti\nNo overacting\nEverything was realistic\nGood music that matches with the plot\nAnd good dialogues by Farhan Akhtar. \nIf u do not watch this semi-hit movie(as stated by box office)\nU will miss something to experience to your life.","label":0},{"review":"Talaash is one of the finest movie and absolute gem to watch. Actors in this film have given beyond their best. Amir would take you to his intense , dark and sad world. kareena would take you to her mysterious yet flawless world with her still acting. Rani portrayal as a helpless wife controlling her emotions is amazing. I would like to definitely mention Nawazuddin here for his so bloody real acting in the movie. This movie is not at all boring for suspense lovers. I was mesmerized watching thi ...MORE","label":0},{"review":"Talaash is one of the finest movie and absolute gem to watch. Actors in this film have given beyond their best. Amir would take you to his intense , dark and sad world. kareena would take you to her mysterious yet flawless world with her still acting. Rani portrayal as a helpless wife controlling her emotions is amazing. I would like to definitely mention Nawazuddin here for his so bloody real acting in the movie. This movie is not at all boring for suspense lovers. I was mesmerized watching this movie. One of my all time favorite. We need movies like this to show the real world we are living into......Kudos to the team of Talaash.","label":0},{"review":"So this is a spooky film but was not marketed like that. So if you like spooks you will be amused, if not you would be confused. However the direction and cinematography is flawless and either way you will be in awe of the work put into this. Amir, Rani and kareena have done some horrible movies in the past and this is certainly an atonement for all of them. Each one including nawazuddin and Rajkumar Rao have played their parts so convincingly. Kareena looks ethereal and is all about body langua ...MORE","label":0},{"review":"So this is a spooky film but was not marketed like that. So if you like spooks you will be amused, if not you would be confused. However the direction and cinematography is flawless and either way you will be in awe of the work put into this. Amir, Rani and kareena have done some horrible movies in the past and this is certainly an atonement for all of them. Each one including nawazuddin and Rajkumar Rao have played their parts so convincingly. Kareena looks ethereal and is all about body language and expressions- which was a pleasant surprise!\nThe story itself has some questionable content. The mystique is subtle till the end when it becomes more fantasy than anything- which partly spoils the tone of the movie. Some unnecessary angles like the last scene will make your eyes roll. \nAll in all it is a good work of cinema and it is enjoyable if not relatable.","label":0},{"review":"Taalash is a cinematic masterpiece. The story chauffeurs you through a wide array of emotions which the cast aptly portray. The turbulence of sentiments amidst a dark and sinister backdrop, keeps you excited and intrigued. Kareena stuns in a glamorous yet spookily shady avatar. She is silently scintillating and mesmerises with her hypnotic charm. Rani nails the role of a  helpless housewife who has to endure the agony of her crumbling world. Aamir and Nawaz excel in their respective roles.","label":0},{"review":"A gripping psychological thriller supported by its stellar cast. I watched this movie long back on its release and it just stayed in my mind. I watched it again today and was amazed. Except for one note which is unconvincing, the entire movie is a treat for cine lover. More than mystery, it is about guilt, grief and pain. Why Suri (Aamir) was driven to Rosie (Kareena) is what strikes me most in the movie which is depicted beautifully.","label":0},{"review":"Best cinematic experience. This movie demonstrates the art of movie making. Intelligent screenplay, extraordinary acting and mysterious background score makes this a perfect movie to watch in this genre. I am highly impressed by the screenplay, the way they have hidden everything when it was right there in front of you.","label":0},{"review":"I'm in the middle of the mid night...3:00am precise and i thought giving a review is more important than sleeping right now ...like this movies gives me goosebumps, chill in my spine, tears and what not !!!!!\nI just love this movie . Its a pure psychological thrill. I hope everyone watch it if u ...r intending to watch a real movie .","label":0},{"review":"Excellent movie. Great performances. Brilliant direction. Beautiful songs. I was absolutely riveted in every moment.  Kudos Reema Kagti.  Loved every performance.  Aamir Nawaz. Rani Kareena.  Delighted to see Rajkumar.  Loved the movie. Lakh duniya kahe is a beautiful song. I cannot tell enough how touching that song is.","label":0},{"review":"Its Pure Gem. Its bliss for real cinema lovers. If you haven't seen this movie, you missed one of the few good movies made in Bollywood.\nSurely, it deserves 5/5. These kind of movies in Hollywood win Oscar. But lot of Indians indeed have a bad taste towards actual cinema. I hope these kind of movies continue to be produced.","label":0},{"review":"Couldn't resist to write a review for this movie. It's got one of the best climax scenes in Bollywood. The background score gives goosebumps and a sense of something mysterious thing happening in the movie. Awesome movie. Everyone played their part so well. A must watch Aamir movie. \\m/","label":0},{"review":"I thoroughly enjoyed this movie.  The actors were superb.  I didn't move from my spot on the couch for the full duration of the movie.  I somehow can relate to this movie with regards to getting messages from the spirit world.  It's not everyone's cup of tea but I certainly enjoyed it.","label":0},{"review":"The paranormal activity done by Kareena kapoor khan makes the audience stunned... how  a  thing so beautiful which can only seen by Aamir or Aamir is alive or not or horrific things seen by him only or not by his team. I think Aamir got so suffocated from his life.  As a result Aamir got so attached with  Kareena in the movie. All in all watching d movie and understanding it's plot makes for the audiences a roller coaster ride  in itself.","label":0},{"review":"Best indian thriller you can watch in indian movie industry..the hero of the film is not story not actors not music but direction and film making..just loved the product when u have absolute finest artists and artistry together amalgamating..if you are a film buff..you can't get better than this to savour..","label":0},{"review":"Well the time right now is 2:11 post midnight and trust me I watched the movie Talaash just now on Sony . I was about to sleep at 12 but this movie kept me awake. Brilliant is just an underrated word for this movie. Watch it once, you will realise what I just spoke of this movie","label":0},{"review":"its a pleasure to watch this movie .. It surround with the mysterious murder case and when I say mysterious I really mean it.This movie also gives us a different perspective to see supernatural  things \n4 star","label":0},{"review":"Movie is tooo good till interval.....but story is totally changed....as movie goes on.I don't know but i do not believe in all that sexy...hot...beautiful ghost.Amir has done very well as he do in every movie. Movie is full of surprises and suspense till end. Altogether 6/10.","label":0},{"review":"The movie is really good... A must watch for an Aamir and a Kareena fan .. But all the three leading cast acted really well and special mention for Nawazuddin.. so a must watch basically..\nLove Kareena","label":0},{"review":"Talaash, aa Mir acting .storytelling.topclass..\nOutstanding movie I watched 5 times..if u 've enthusiasm in soul plz watch it quick 4 knowing real soul theme..soul never dies..good movie I felt eternal peace mindblowing exp on witching it..aamir as suri played perfectly..","label":0},{"review":"Wow just great i am watching this movie in 2018, it was fabulous, great acting by kareena, rani and amir. Loved this movie, i really dont know how to express my love for it.","label":0},{"review":"Excellent Movie. Everybody acted very well in the movie. The movie was so interesting and thrilling. The movie had no unwanted scenes. The movie was so interesting but the movie somewhat lagged. This movie is one of the best movie of Aamir Khan. The movie was not at all boring. Songs in the movie were not needed in the movie but the BGM in the movie were good in the movie. Excellent Movie.","label":0},{"review":"What an amazing movie...loved everyone's work.Fullon tense throughout the movie..love d twist in the end. One of the finest job by Reema Kagti.","label":0},{"review":"Worth watching. Actors have done fantastic role. Best for suspense lovers. We need more movies like these. Well done team talaash.","label":0},{"review":"the one aspect of it is like #13 reason why\nOverall it is very good movie \nthe Mystery is Amzing\nand the concept is new\nmust watch at lest once","label":0},{"review":"A gripping plot,fantastic acting and a marvelous message....\nA movie that has it all.... One of the movies that should be watched before you die.","label":0}]