[{"review":"Many atimes we appreciate our jawans  by naming them army personnel. But bsf or crpf they fight for us every where all over india in very different situation from controlling riots , fighting naxals to securing international borders. This movie depicts that same life in a real way and honouring these paramilitary jawans. But it is also true that paramilitary forces lacks infra and fighting equipments. Just check pulwama attack, jawans were not sitting the bulletproof buses cause so many casualit ...MORE","label":0},{"review":"Many atimes we appreciate our jawans  by naming them army personnel. But bsf or crpf they fight for us every where all over india in very different situation from controlling riots , fighting naxals to securing international borders. This movie depicts that same life in a real way and honouring these paramilitary jawans. But it is also true that paramilitary forces lacks infra and fighting equipments. Just check pulwama attack, jawans were not sitting the bulletproof buses cause so many casualities, and definitly there were other reasons also but a big salute to all these bravr soldiers.","label":0},{"review":"I watched this movie many times. it is a great depiction of life of BSF soldier. since my father too was a Head Constable and he was engaged in kargil, gujaratriots and north east conflicts this seems truely real for me. proud of my father and all soldier who serve for motherland.","label":0},{"review":"TANGO CHARLIE is among the movies that audience wants to see;Wonderful acting by our legends,and bobby deol should come forward to perform in such type of films where he is adept at. JAI HIND-INDIAN ARMY","label":0},{"review":"Mike Alpha to Tango Charlie, come in. That's a great movie. Thanks to show us such a great patriotic and action movie, over.\nTC to Mike Alpha, thanks. Move in to your bunkers. Mission Accomplished, over and out.","label":0},{"review":"It is one of the movies that brilliantly depicts the bravery as well as the difficulties of soldiers.. salute to all those bravehearts safeguarding us and the nation","label":0},{"review":"This  is a inspirational  movie for us who what  to join  indianarmy🙏... Watching many times to motivate myself... Jay jawan Jay kisan","label":0},{"review":"Nice and lovely war drama film. Bobby Doel and Ajay Devgan gave their best in army uniforms.","label":0},{"review":"The real heros of our  country is\nSoldiers jai hind\nI love this movie\nWhen it is come on The T. V I always watched it","label":0},{"review":"Nice film i m shocked to see some scenes of this film if the terrorist want to fight, war should break out face to face","label":0},{"review":"I recently saw this film.I salute to the Indian army for their bravery 👍👍 👍Ajay devgns acting is outstanding","label":0},{"review":"The film express army feelings and the rule regulations. \nI juss enjoyed this film, I love it","label":0},{"review":"Omg...  What a movie it was!! \nSuch a great movie on our brave BSF. \nSalute... More than salute to our Indian Army.","label":0},{"review":"Its movies per seqnce is tuch in our hearts..\n Because a army smyle death in our country ..\nN a terrst every dY destroy in our equilty ,peace ,","label":0},{"review":"Wonderful acting by our legends,\nbobby deol and ajay Devgon acting. .     Awesome","label":0},{"review":"Its really a nice movie. Hats off you Ajay devgan, Bobby deol & all others","label":0},{"review":"Great movie on the unrevealed Role of our glorious paramilitary Forces esp BSF..","label":0},{"review":"It’s one of the best movie with superb acting from all.","label":0},{"review":"Now saw this Tango Charlie. I grand salute for our Indian Army  beautiful movie","label":0},{"review":"Nice movie.  I love this movie.","label":0},{"review":"A very good movie based on patronism of our nation","label":0},{"review":"It is the best best that I ever seen .it is dedicated to the Indian solider ......Jay Hindi,..............","label":0},{"review":"Epic Movie 👌 Great Acting Authentic Direction 👍","label":0},{"review":"Wonderful full movie I like it movie","label":0},{"review":"very niece movie on\n our great soldiers","label":0},{"review":"This is bobby deol's first and last only beat movie ever","label":0}]