[{"review":"What a awesome movie ! Can't describe it only in few words. This type of movies deserves billions @ box office. If Arrange Marriage like this possible in real life is far better than love marriage (babu sona etc). Heart touching songs. Every time you watch it ..never get bored...it seems like watching it for first time. Awesome story ..Director showed it perfectly. Shahid and Amrita rao acting is awesome.","label":0},{"review":"What a awesome movie ! Can't describe it only in few words. This type of movies deserves billions @ box office. If Arrange Marriage like this possible in real life is far better than love marriage (babu sona etc). Heart touching songs. Every time you watch it ..never get bored...it seems like watching it for first time. Awesome story ..Director showed it perfectly. Shahid and Amrita rao acting is awesome.","label":0},{"review":"This movie is great movie in my whole life.....I have made after watching this movie ......I can't explain condition my heart after watching this movie...... I am speechless about this movie because when I am watching then I can't control my emotions ....this movie hardly touching my heart and deeply touching my soul ... I just love prem and poonam .... I love character of poonam I love u very very very very much I love u both prem and poonam and also chutki....At the end I want my engagement be ...MORE","label":0},{"review":"This movie is great movie in my whole life.....I have made after watching this movie ......I can't explain condition my heart after watching this movie...... I am speechless about this movie because when I am watching then I can't control my emotions ....this movie hardly touching my heart and deeply touching my soul ... I just love prem and poonam .... I love character of poonam I love u very very very very much I love u both prem and poonam and also chutki....At the end I want my engagement between marriage time is same this movie.               I am watching this movie 100 time more.        क्यों कि यार पेट ही नही भरता बस ऐसा लगता है बस इसी फिल्म को देखता रहूं और देखता रहूं    again i love u amrita mam ....i am watching always your movie i love u so much","label":0},{"review":"Our culture is so delightful ,so pure and full of essence of love and affection.\nLove and it's purity is so soothing that becomes your strength and wisdom,ultimately this movie set another a little modern yet rooted and impartial example of lovely efforts of girl and boy who were brought together by the destiny but gradually started loving and respecting each other.\nI wish such emence love should happen to everyone.","label":0},{"review":"Really awesome movie.When this movie was released Iam only 5 years old,i didn't watched at that time.Now Iam 17 years old watched this movie .\nIt's an amazing movie which touched my ♥ heart ♥ and soul. My mother tongue Is Telugu but liked this movie.\nLove you Bollywood.Shahid Kapoor and Amrita rao look very cute together.😍","label":0},{"review":"The VIVAH movie is so good. It is familiar also and we can able to watch it with our family Nd frnds ... And the characters of this movie is so smart..... I like this movie's song specially 2nd last(hamari shadi me abhi baaki hai hafte 4).........I'm watching it every Sunday.... Really I like this VIVAH Movie😍😍","label":0},{"review":"One of the nicest movie of Indian Cinema.. Salute to Sooraj Barjataya sir for making this incredible movie..Each & every character are just incredible..I watch it every time whenever it comes on television...My all time favorite movie...I just love all rajshri production movies.. because it teaches lot of things to us.. Thank you sir","label":0},{"review":"The movie is like a desirable sweet dish/dessert, while consuming slowly gives you pleasure and still wanting for more, neither arrange or love marriage, only love and trust matters! Great work by all the actors in the movie, Shahid and amrita are so cute and lovable together.","label":0},{"review":"I in love with this movie it gives us the message that not only the love marriage are successful but arrange marriage are more better than love if it is properly maintained with care,Love,respect,trust.The cute moments between the lovers are awesome and shahid's cuteness was overloaded ....if u love family movies of olden days than it is a must watch movie","label":0},{"review":"My favourite movie of all time. Zindagi se pyaar ho jayega kisiko bhi ye movie dekhne ke baad. I get positive vibes Everytime I watch this movie. So peaceful. The songs are so heartouching. Chemistry of Amrita-Shaheed is amazing.","label":0},{"review":"I COULD WATCH THIS MOVIE OVER AND OVER AND OVER AGAIN I THINK I MIGHT HAVE SEEN IT OVER 25 TIMES …..I LOVE SHAHID KAPOOR AS AN AMAZIONG ACTOR AND I AM SURE A WONDERFUL HUMAN BEING.\n\nHE IS THE WHOLE PACKAGE.  GOD BLESS HIM AND HIS FAMILY.\n\nNO ACTOR COULD DO THE ROLE LIKE SHAHID DID IN THIS MOVIE.","label":0},{"review":"I think sooraj barajatya is one of the most best film director and producer. He makes film which can be enjoyed with family. He always gives his best and I love his all films including prem Ratan Dhan Payo.","label":0},{"review":"Owesome movie .... That's a great one of the indian cinema in bollywood . I can't control the emotions. And ending is very very good . And all character are its very perfect. Lead character is one of the most important and they do it.","label":0},{"review":"This movie is super heart touching movie.  This is all about of love. Jo arange marriage ke baad ek jode ko hota hai.  I love this super movie.  Great job suraj sir.  Aap hamesha hume aise hearttouching movie dete rahiye.","label":0},{"review":"This movie is  really beautifully presented especially for new upcoming generation.\nArrange  marriage can also be  successful if the trust, love , caring nature is there in both the sides. Thank you all the casting team  for given us this movie","label":0},{"review":"Excellent film\nThe marvelous dil jeet lenewala acting by shahid kapoor as always.\nThe pretty cute Amrita Rap looked so nice as a romantic wife opposite to shahid kapoor.\nA simple engaging story you will surely enjoy.","label":0},{"review":"I like this movie  very much this movie actor have love each other very much and they  gives the massages that the story the love marrige  are successful but of amrita roa is story of arrange marrige very  lovely and better than love and properly car with her husband burning of his body  maintained care love trust respect and love but her husband help to him every stage .","label":0},{"review":"Vivah is the best movie\nI like  it very much. This movie had been seen many times by me.   Thank you\nSongs are very sweet of this movie. These songs touch my heart.","label":0},{"review":"Really.... Movie worth it... Anytym i watch this movie... It literally makes me cry... Its one f my fav movie..  I lyk both the actors & the way they protrayed their respective roles... The songs have their beauty & the touch given to each lyrics is fabulous....","label":0},{"review":"What a beautiful movie....Each characters were perfect. One can never get bored of this movie. Shahid Amrita acting was of top class. Wish our society take some lessons from the movie...","label":0},{"review":"I have watched this movie 100 times.  I loved it. The way it has been executed and a lovely message given by it is awesome. The romantic moments are just very nice. I cannot forget this movie, as it always strikes in my head everytime. 💖💖💖💖💖💖💖💖💖💖💖😘😘😘","label":0},{"review":"I think it's one of bollywood's finest films n best wedding family film whole cast and specially shahid n amrita are amazing n hats off to suraj barjatia for presenting real indian drama films this film is one of his best movies","label":0},{"review":"what a move!  A wonderful description of 'The journey from engagement to marriage'. beautiful songs and great actors make the movie a box office hit. A must  watch movie! My favourite movie.","label":0},{"review":"Most dramatic movie i have ever seen,\nI'm watched it multiple time, even now a days with most amazing vfx movies on market but this two movies(vivah, DDLJ) \nCreate unforgettable place in my heart.","label":0},{"review":"I watched this movie recently and loved it so much. It potrays family, love and the understanding between people so beautifully. Watching Vivah is pure bliss","label":0}]