[{"review":"I love John Abraham and his badass character In all of his movies.. BUT still that's not a reason to give him a role where he can talk to Uday and Majnu like this.. I mean they were the boss and suddenly someone came out of nowhere and gets vulgar and threatened them.. it was too unrealistic.\nThey were the Mafia man!\nOtherwise it was a good movie, one time watch at least.","label":0},{"review":"Good movie and handsome some action really appreciate you getting on with your movie nice directions from industry capacity and very happy and healthy business relation \nDifferent types from industry capacity of the best film nice colourful background happy romance cool movie and very John Abraham\nPerfect role action really good facility national movie part so kindly send me your movie nice work intelligence Rockies game theory for your movie and very happy with the best film and television and  ...MORE","label":0},{"review":"Good movie and handsome some action really appreciate you getting on with your movie nice directions from industry capacity and very happy and healthy business relation \nDifferent types from industry capacity of the best film nice colourful background happy romance cool movie and very John Abraham\nPerfect role action really good facility national movie part so kindly send me your movie nice work intelligence Rockies game theory for your movie and very happy with the best film and television and film good movie and handsome and very busy and I am a good movie and handsome businessman and handsome man strong man who can make it to good use of the best UB city of the best","label":0},{"review":"I liked the movie till the john abraham came, his entry was good but after that he acted too bossy and there were some unrealistic scenes. And the graphics of the movie was a disgrace...The movies plot at most of the points matched the plot of the prequel except the fact that the prequel was much better...So I personally wouldn't want to go for this movie if I have to go along with my frnds and watch but if u r planning to go with ur family then maybe u should as some people might find it funny.","label":0},{"review":"Seriously I can't believe that how can they replace akshay and katrina they took john abram the movie was epic flop time waste boring story over acting. Only nana patekar anil kapoor paresh rawal supriya were nice everyone else were over acting and we're not looking nice at all welcome 1 was best","label":0},{"review":"Fantastic film what a role shruti hasan has done. Have a look once again in next upcoming film. brilliant gorgeous","label":0},{"review":"Welcome one was awesome but two is not at all. There is no story line in this film. Everything is too much. One was awesome two is a disaster. Not at all nice.","label":0},{"review":"A superb and fantastic film with lots of action and comedy enjoyed love you anees bazmee for this great film","label":0},{"review":"This movie is complete bakwas... Rather back wash of the title welcome... Trust me.. the more relax u get after watching welcome one, even more headache u get after watching welcome back...","label":0},{"review":"Super good movie... Movies like this are missing now a days.... Its a great movie.","label":0},{"review":"Well this movie is nothing in comparison of welcome but not bad, atleast one time watch, some scenes are really comedy.","label":0},{"review":"Befor long time all bollywood movie fan wiatinng for par of movie welcome but this movie is third class and and thirld class story and cast also","label":0},{"review":"Very entertaining. I love this movie","label":0},{"review":"these movie is bad and boring because akshay kumar is not in welcome back bad idea to take john abraham in welcome back and john abraham is don't no comedy in welcome movie was akshay kumar and akshay kumar was so amazing and comedian","label":0},{"review":"It so funny but for my son he Love's this movie","label":0},{"review":"One of worst story, no real comedy other then acting of nana and anil everything rates 0","label":0},{"review":"Good movie my mind was very fresh","label":0},{"review":"Really a big disappointment &  a disaster by a anees bazmee not less than that","label":0},{"review":"Very good & comedy movie","label":0},{"review":"I didn't like it too was just a waste","label":0},{"review":"Fantastic movie","label":0},{"review":"Nana is the and anil kapoor is best","label":0},{"review":"Best movie","label":0},{"review":"I love this movie","label":0},{"review":"Supper comedy movie","label":0},{"review":"Boring movie the first welcome is best but the welcome back is badtest","label":0}]