[{"review":"One of the best comedy movie . Everybody's acting was really good. Dialogues were too funny. homour factor was  actually there.\nAll the cast has done a very good job.\nIt's a pure comedy and noting to be taken seriously.\nAkshay sir you are best . \nNice work by Katrina Kaif. This movie always makes me stress free n makes me laugh too hard..must watch movie..one can not miss it..","label":0},{"review":"I love this film so, so frigging much! Hands on the best comedy film you'll ever watch. I cannot get tired of watching this movie, I really don't understand why this was given a 6 star rating by Imdb, it deserves more! Amazing direction, acting and dialogues. You can watch it with your family and your friends!","label":0},{"review":"One of the best comedies ever made in India.\nAll of the cast has done a very good job.\nIt's a pure comedy and noting to be taken seriously.\nThe 2 brothers, Majnu and Uday will always be remembered. \nStill after 11 years, this movie is fresh and one of my most favourite comedy movies.\nRating: 9/10","label":0},{"review":"One of the best comedy movies produced by Bollywood. Movie gets never tiring. Can watch the movie several times without it getting bored.\nStrong acting by every character especially Akshay, Nana Patekar and Anil Kapoor are praise worthy.","label":0},{"review":"Excellent performance by all the characters in welcome. Songs are too good. Paresh rawal  nana patekar anil kapoor akshay kumar feroz khan katrina kaif all have put their efforts to entertain the audience.","label":0},{"review":"Just awesome movie\nEvery character in this movie put their all effort to entertained the viewers.... Having good mixture of comedy, suspense, and romance \n\nAnd the last great story by the writer really one of the good comedy movie..👍","label":0},{"review":"It was good family comedy overall but I have been a long time admirer of Vijay raaz's be it kya delli kya lahore ,Prarambh,Raghu romeo & Mumbai express  everything about that guy is mind impressive.","label":0},{"review":"Amazing movie watched this movie 100 times right now also I am watching the absolutely stunning picture all the actors were acting fabulously all were sparkling katrina was glittery the story was awesome love the movie beautiful story marvellous acting superb movie","label":0},{"review":"Full on dhamaal in this movie. All characters have played their roles awesome.. 🙏🙏🤘 This is Family film & evergreen comedy + drama added movie...","label":0},{"review":"This film is extremely  funny with lots of humor and fun. I really like this film it is one of my favorite films.","label":0},{"review":"Love the Jodi. Best comedian movie. This is one of my favorite movie of Katrina Kaif and Akshay together ever.","label":0},{"review":"Akshay sir you are best in your life \nNice work romance Katrina Kaif do you\nUnderstand number one film   nice colourful\nBrightness and  happy nice work intelligence rocking film stars","label":0},{"review":"The roll Axaykumar Nana patekar Anil kapoor Paresh Raval and so beautiful actress Katrina kaif superb I enjoy  this picture","label":0},{"review":"What a movie...I just love this movie so much whenever it's on TV I watched it with same excitement as I seen this first time...","label":0},{"review":"Watched it 30 to 40 times.. Every time it's like new. One of the most loved comedy movie ever made in India.","label":0},{"review":"This movie is my one of the best childhood memories...that's was the best time for us..no movie can match the humour of welcome","label":0},{"review":"Hello my dear sir urgent movies is very good songs and videos have nice looking for etc all'","label":0},{"review":"I love this movie and i remember that i was child that time this movie was so precious and so special for me in 2008","label":0},{"review":"i always see this movie, i don't know how many times I seen this movie, really pure comedy. all characters , story,  background music all is well","label":0},{"review":"My most Favourite Movie In my life..1 st Ranked in my favourite list...watched it Many times..","label":0},{"review":"Best comedy movie  of all time.watched it more even  than 20 times.its a must watch movie!!!","label":0},{"review":"I do not even pay any price for the movie and I am not going to give any mistake because I am not going to give you a chance to watch the movie as soon as you can not see the movie 9/10.","label":0},{"review":"Epic comedy movie. Once again duo of akshay kumar and paresh rawal deliver blockbuster","label":0},{"review":"Some films are watched by people again and again.\nWelcome,is one of them.The entire cast was superb.","label":0},{"review":"Superb and excellent comedy it's really very difficult to do and hat's off to the direction","label":0}]