{"name":"Daman: A Victim of Marital Violence ","release_year":2001,"release_date":"2001-05-03T18:30:00.000Z","release_info":{"date":"4","month":"May","year":"2001","zone":"India","datestring":"4 May 2001 (India)"},"description":"The Saikias are a wealthy family, consisting of father, mother, and two unmarried sons, Sanjoy and Sunil. Sanjoy is the elder of the two, who refuses to marry, and the rest of the family ...\n                    See full summary »","genre":["Drama"],"poster":"https://m.media-amazon.com/images/M/MV5BOWE1M2JkZmEtZGY0NS00NzMzLTkwM2YtODIzMjFkOWM2Zjk2XkEyXkFqcGdeQXVyODQ0MzQ3Nzg@._V1_QL50_.jpg","posterimageid":"rm4018099712","stars":5.7,"rated":"A","running_time":{"hour":0,"minute":0},"trailer_link":"https://www.youtube.com/embed/_dLe2mgt9DM","images":[{"id":"rm4018099712","h":400,"w":290,"msrc":"https://m.media-amazon.com/images/M/MV5BOWE1M2JkZmEtZGY0NS00NzMzLTkwM2YtODIzMjFkOWM2Zjk2XkEyXkFqcGdeQXVyODQ0MzQ3Nzg@._V1_QL50_SY200_SX145_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BOWE1M2JkZmEtZGY0NS00NzMzLTkwM2YtODIzMjFkOWM2Zjk2XkEyXkFqcGdeQXVyODQ0MzQ3Nzg@._V1_QL50_.jpg","altText":"Raveena Tandon in Daman: A Victim of Marital Violence (2001)"}],"cast":[{"title":"Directed","persons":[{"name":"Kalpana Lajmi","role":"(as Kalpana Lazmi)","link":null,"image":null}]},{"title":"Writing Credits","persons":[{"name":"Kalpana Lajmi","role":"(as Kalpana Lazmi)","link":null,"image":null}]},{"title":"Music","persons":[{"name":"Bhupen Hazarika","role":"Music","link":null,"image":null}]},{"title":"Cinematography","persons":[{"name":"Jatinder Sharma","role":"Cinematography","link":null,"image":null},{"name":"Bijoice Verghese","role":"Cinematography","link":null,"image":null}]},{"title":"Film Editing","persons":[{"name":"Onir","role":"(as Anirban)","link":null,"image":null}]},{"title":"Art Direction","persons":[{"name":"Muneesh Sappel","role":"Art Direction","link":null,"image":null}]},{"title":"Costume Design","persons":[{"name":"Muneesh Sappel","role":"Costume Design","link":null,"image":null}]},{"title":"Second Unit Director or Assistant Director","persons":[{"name":"Ayussh Joshii","role":"second assistant director (as Lina Joshi)","link":null,"image":null},{"name":"Sunanda Mitra","role":"associate director","link":null,"image":null},{"name":"Jaswant Dev Shrestha","role":"assistant director","link":null,"image":null}]},{"title":"Art Department","persons":[{"name":"Jagadish Kumar","role":"assistant art director","link":null,"image":null}]},{"title":"Costume and Wardrobe Department","persons":[{"name":"Smita Kamble","role":"assistant costume designer","link":null,"image":null}]},{"title":"Music Department","persons":[{"name":"Dominique Cerejo","role":"playback singer (as Dominique)","link":null,"image":null},{"name":"Maya Govind","role":"lyricist","link":null,"image":null},{"name":"Bhupen Hazarika","role":"playback singer","link":null,"image":null},{"name":"Ishaan","role":"playback singer","link":null,"image":null},{"name":"Barnali Kalita","role":"playback singer","link":null,"image":null},{"name":"Kavita Krishnamurthy","role":"playback singer","link":null,"image":null},{"name":"Jaspinder Narula","role":"playback singer","link":null,"image":null},{"name":"Kalpana Patowary","role":"playback singer (as Kalpana)","link":null,"image":null},{"name":"Hema Sardesai","role":"playback singer","link":null,"image":null},{"name":"Shaan","role":"playback singer","link":null,"image":null},{"name":"Alka Yagnik","role":"playback singer","link":null,"image":null}]},{"title":"Cast","persons":[{"name":"Raveena Tandon","role":"Durga Saikia ","link":"/name/nm0849199/?ref_=ttfc_fc_cl_i1","image":"https://m.media-amazon.com/images/M/MV5BNzk5MDExNDI4N15BMl5BanBnXkFtZTgwNTAxMTIzOTE@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Sayaji Shinde","role":"Sanjay Saikia ","link":"/name/nm0793851/?ref_=ttfc_fc_cl_i2","image":"https://m.media-amazon.com/images/M/MV5BNzU0OWNlNzAtODE0YS00NDVlLWEzYTMtN2JhN2Y1MjM1OWVhXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR7,0,214,317_AL__QL50.jpg"},{"name":"Sanjay Suri","role":"Sunil Saikia ","link":"/name/nm0839634/?ref_=ttfc_fc_cl_i3","image":"https://m.media-amazon.com/images/M/MV5BYjJkMWM4OGQtODdhNC00ODcyLTgwM2MtN2E1NzRjZDBjMWVjXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_UY317_CR130,0,214,317_AL__QL50.jpg"},{"name":"Raima Sen","role":"Deepa Saikia ","link":"/name/nm0784025/?ref_=ttfc_fc_cl_i4","image":"https://m.media-amazon.com/images/M/MV5BMDU0ZmZiYjgtODEwNS00MmFjLTg5OTQtZWE0NjhiZGFjNTc1XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Ranjan Koshal","role":"Sailen Mahanta ","link":"/name/nm1030621/?ref_=ttfc_fc_cl_i5","image":null},{"name":"Bharati Jaffrey","role":"Laxmi Goswami (\n \n (as Bharti Jaffrey))","link":"/name/nm0415526/?ref_=ttfc_fc_cl_i6","image":null},{"name":"Shaan","role":"Kaushik Nath (\n \n (as Shaan (II))","link":"/name/nm1034805/?ref_=ttfc_fc_cl_i7","image":"https://m.media-amazon.com/images/M/MV5BMjM3NzUwNjQtNTA1Ny00NzEwLWEwZDUtNTJmNjI4MzE0NWE5XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR21,0,214,317_AL__QL50.jpg"},{"name":"Nippon Goswami","role":"Surya Narayan Goswami ","link":"/name/nm1029756/?ref_=ttfc_fc_cl_i8","image":null},{"name":"Kalpana Barua","role":"Chameli ","link":"/name/nm1028003/?ref_=ttfc_fc_cl_i9","image":null},{"name":"Ishaan Barua","role":"Bisnu Prasad Saikia ","link":"/name/nm1028002/?ref_=ttfc_fc_cl_i10","image":null},{"name":"Girija Das","role":"Mukut Saikia ","link":"/name/nm1028881/?ref_=ttfc_fc_cl_i11","image":null},{"name":"Indra Bania","role":"Sardar ","link":"/name/nm0052005/?ref_=ttfc_fc_cl_i12","image":null},{"name":"Jharna Bishaya","role":"Putoli ","link":"/name/nm1028177/?ref_=ttfc_fc_cl_i13","image":null},{"name":"Dinesh Bishaya","role":"Naren ","link":"/name/nm1028176/?ref_=ttfc_fc_cl_i14","image":null},{"name":"Chetana Das","role":"House Servant (\n \n (as Chetona))","link":"/name/nm2762787/?ref_=ttfc_fc_cl_i15","image":"https://m.media-amazon.com/images/M/MV5BMWVjNmMwZjMtMjI0ZC00NGJiLWJlNmUtNDBmMDMyOGQwYmZjXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY317_CR5,0,214,317_AL__QL50.jpg"},{"name":"Moloya Goswami","role":"(as Malaya Goswami) ","link":"/name/nm1122408/?ref_=ttfc_fc_cl_i16","image":null},{"name":"Bishnu Kharghoria","role":"()","link":"/name/nm0451440/?ref_=ttfc_fc_cl_i17","image":null},{"name":"Monalisa","role":"Dancer (song \"Bhagwati\") ","link":"/name/nm1853497/?ref_=ttfc_fc_cl_i18","image":"https://m.media-amazon.com/images/M/MV5BMDkxNGM2NDYtZDU4Yi00ZGYzLWE3OTktZjE5ZjM2NDZlNDQ0XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY317_CR15,0,214,317_AL__QL50.jpg"}]}],"reviews":[{"heading":" A horrible movie with a horrible direction","review":"'Daman' directed by feminist director Kalpana G. Lajmi is one of the most horrible movies I have seen in my life. Honestly, I expected a better movie from Lajmi who had previously given us critically acclaimed movies like Rudaali and Darmiyaan. But sadly, I was letdown.'Daman' is the story of a meek woman named Durga played by Raveena Tandon who suffers endless domestic violence from her psychotic husband, Sanjay Saikia played by Sayaji Shinde. Still, Durga carries on with her life with the only crutch in the family, her brother-in-law Sunil played by Sanjay Suri. But unfortunately in a state of rage, Sanjay kills Sunil and Durga is left alone to survive with her only daughter. But her evil husband plans to marry his daughter (who is only 12) to a much older man. Eventually, Durga runs away with her daughter only to be found again by her sadistic husband. What will happen to Durga and her daughter? The movie has many flaws. The script is badly handled. If Lajmi was to show the theme of marital rape (which the poster of 'Daman' shouts out loud), then she should've handled the theme with extreme care. But sadly, she doesn't even provide any explanation for the rape. The rape scene was ostensibly shot leaving the audience to guess what's happening. Furthermore, Sunil acts beastly with almost every member in the family. So it's more than spousal abuse.Raveena Tandon could've shined in the movie and she can emote well. But the script couldn't do justice to her role. Sayaji Shinde is the worst piece of casting in the movie. Sanjay Suri had nothing to do. Singer-turned-actor Shaan should consider going back to acting school or to leave acting forever. Because he doesn't even know the definition of acting. Same can be said for Raima Sen who plays Raveena's daughter in the movie.Cinematography is mundane and the beautiful locales of Assam haven't been captured to the fullest. Editing is horrible.A complete no-no for any movie-goers.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" GREAT, though could have been better.","review":"If you read the tagline alone, you'll think this story revolves around the subject of marital rape, which would have made for an interesting plot. But Daman is more about Durga's (Raveena) life after marriage. Her husband, Sanjay (Sayaji Shinde) is unfortunately a psycho type who abuses her. She seeks solace in her brother-in-law, Sunil (Sanjay Suri). It's implied that they secretly love each other. Nothing develops, but it does help to provide the necessary tension. Some people I know think they should have made the two express their love for each other so Durga will have someone to walk into the sunset with at the end. But that's one of the reasons why Daman shines. It doesn't cater to the norm. Kalpana Lajmi has made this film by her own  standards and that's to be applauded. However, Shaan's presence was unnecessary. It's pretty obvious that he's in the film only to give a breather of sorts. The film could have done without the little love story between Shaan and Reema Sen.The film is told in flashback sequences and that's also beautifully done. But I still feel that the marital rape topic should have been the dominant issue, especially since the tagline mentions it. Daman, however, focuses only on Durga's trials and tribulations as a married Indian woman who has to listen to her husband. It talks of how the Indian society still gives second billings to women and how Durga tries her best to live with that.Raveena's performance should be mentioned. Anyone who's not convinced of her acting prowess should watch Daman. Sayaji Shinde is like a clown. He's not as scary as say, Ashutosh Rana in Dushman or Shah Rukh Khan in Darr. Shinde makes me laugh instead. Sanjay Suri is also worth watching. He's a natural. Other characters in the film come and go. None are developed enough. You're left wondering why some characters do the things they do, where they come from, etc.The songs aren't as hummable as the usual Bollywood numbers, but they're easy on the ears and will grow on you.On the whole, Daman is unique and worth a watch if you're tired of the usual masala movies you've been subjected to. It's also worth watching if you want to see Raveena at her very best. But there are the few loopholes which you wish had been fixed.","imdb_rating":4,"our_rating":0,"algo_label":0},{"heading":" For Raveena Tandon, the enslaved queen","review":"Daman is a movie dealing with domestic violence. Kalpana Lajmi, who previously directed strong women-centred movies such as Ek Pal, Rudaali and Darmiyaan, directs this feature. The movie follows the story of a poor lower-caste woman named Durga, from the first days of her marriage to her struggle to find peace for her and her grown daughter many years later. Durga was married into a wealthy family in the rural state of Assam. Her husband, a much older, cruel and merciless man, sees her as a burden, and during all the years of their marriage, he viciously abuses her, both physically and morally, intimidating her into total submission. It is after years of hell that Durga summons up the courage and runs away in order to save her daughter from her husband's decision to get her married to one of his friends. Durga sets on a new life, hoping to build a future for her daughter, but she herself knows that it's not long before her husband comes back to make her life miserable.Daman is gritty, raw and very disturbing in its depiction of domestic abuse. The scenes showing the husband beating and torturing his wife are very painful to watch. Sadly enough, except for the character of Durga and her struggle to put an end to her long suffering, everything else in the film, including the portrayal of her daughter's romance and every other of its minor sub-plots, is poorly handled. Now let's put it straight, if Daman ever manages to work, it is for Raveena Tandon's superb acting. I was blown away by her powerful portrayal, which is replete with so much authenticity, intensity and terror. Just see the fear in her eyes, her nervous body language, and the astonishing depth with which she performs the most difficult of scenes; you will see a true bravura performance. It is almost impossible to believe she is the same actress who played so many useless roles in countless comedies and action films, showing that given the right role and director she can make wonders.Except for Raveena Tandon, no one else exists in the movie, and sadly so. Raima Sen, playing her daughter, is not convincing enough and at some scenes she looks very unnatural. Shaan, one of the greatest singers in India today, is awful as her daughter's boyfriend. The only one who does a decent job where acting goes is Sayaji Shinde, who manages to be really hateful and scary as Durga's inhuman husband. Daman is not a great film, it has little entertainment and is for the most part too cruel and unsettling to be enjoyable. Yet, it is effectively made and it has a great performance from its leading lady, which makes it totally worthy and appreciable.","imdb_rating":6,"our_rating":0,"algo_label":0}],"imdbId":"tt0273164"}