{"name":"Rehnaa Hai Terre Dil Mein ","release_year":2001,"release_date":"2001-10-18T18:30:00.000Z","release_info":{"date":"19","month":"October","year":"2001","zone":"India","datestring":"19 October 2001 (India)"},"description":"A young girl is torn between an obsessive lover and a mild-mannered suitor.","genre":["Musical","Romance"],"poster":"https://m.media-amazon.com/images/M/MV5BZmVjOTY1NjUtMjVkYS00YjE4LTk5N2YtMWU2MTA4NmJjM2I1XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_QL50_.jpg","posterimageid":"rm4146949120","stars":7.5,"rated":"U","running_time":{"hour":2,"minute":40},"trailer_link":"https://www.youtube.com/embed/ribCqsU-yCs","images":[{"id":"rm21132544","h":422,"w":759,"msrc":"https://m.media-amazon.com/images/M/MV5BNzA0MjgyY2EtOWM5OS00NGQ3LWJiZWUtZjA4NzM1NDA2ZmRjXkEyXkFqcGdeQXVyMjUxMTY3ODM@._V1_QL50_SY211_CR0,0,379,211_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BNzA0MjgyY2EtOWM5OS00NGQ3LWJiZWUtZjA4NzM1NDA2ZmRjXkEyXkFqcGdeQXVyMjUxMTY3ODM@._V1_QL50_.jpg","altText":"Madhavan and Dia Mirza in Rehnaa Hai Terre Dil Mein (2001)"},{"id":"rm2462022912","h":522,"w":700,"msrc":"https://m.media-amazon.com/images/M/MV5BMjAzOWJmMWMtOTcxZC00YzZhLWI0ODktMDZlYjRlY2E2ODczXkEyXkFqcGdeQXVyMzEzNzk1NDk@._V1_QL50_SY261_SX350_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BMjAzOWJmMWMtOTcxZC00YzZhLWI0ODktMDZlYjRlY2E2ODczXkEyXkFqcGdeQXVyMzEzNzk1NDk@._V1_QL50_.jpg","altText":"Rehnaa Hai Terre Dil Mein (2001)"},{"id":"rm2294250752","h":420,"w":800,"msrc":"https://m.media-amazon.com/images/M/MV5BZGRjMjRjZGQtNTM2ZC00NGY1LWFjZmUtZTQyMTVlYWQ4YmMxXkEyXkFqcGdeQXVyMzEzNzk1NDk@._V1_QL50_SY210_SX400_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BZGRjMjRjZGQtNTM2ZC00NGY1LWFjZmUtZTQyMTVlYWQ4YmMxXkEyXkFqcGdeQXVyMzEzNzk1NDk@._V1_QL50_.jpg","altText":"Rehnaa Hai Terre Dil Mein (2001)"},{"id":"rm1056861440","h":600,"w":446,"msrc":"https://m.media-amazon.com/images/M/MV5BMzg5YjM0N2UtZjI0Yy00MGE1LWIyOTItMDIzMzAzZjlmMjAxXkEyXkFqcGdeQXVyOTIzODUxMjk@._V1_QL50_SY300_SX223_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BMzg5YjM0N2UtZjI0Yy00MGE1LWIyOTItMDIzMzAzZjlmMjAxXkEyXkFqcGdeQXVyOTIzODUxMjk@._V1_QL50_.jpg","altText":"Rehnaa Hai Terre Dil Mein (2001)"},{"id":"rm905866496","h":600,"w":443,"msrc":"https://m.media-amazon.com/images/M/MV5BNGI3ODkyN2YtMzAwMS00ZTdkLWJhYTItZDVlNDA2NmVkZTg0XkEyXkFqcGdeQXVyOTIzODUxMjk@._V1_QL50_SY300_CR0,0,221,300_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BNGI3ODkyN2YtMzAwMS00ZTdkLWJhYTItZDVlNDA2NmVkZTg0XkEyXkFqcGdeQXVyOTIzODUxMjk@._V1_QL50_.jpg","altText":"Rehnaa Hai Terre Dil Mein (2001)"},{"id":"rm4146949120","h":600,"w":446,"msrc":"https://m.media-amazon.com/images/M/MV5BZmVjOTY1NjUtMjVkYS00YjE4LTk5N2YtMWU2MTA4NmJjM2I1XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_QL50_SY300_SX223_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BZmVjOTY1NjUtMjVkYS00YjE4LTk5N2YtMWU2MTA4NmJjM2I1XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_QL50_.jpg","altText":"Saif Ali Khan, Anupam Kher, Madhavan, and Dia Mirza in Rehnaa Hai Terre Dil Mein (2001)"}],"cast":[{"title":"Directed","persons":[{"name":"Gautham Vasudev Menon","role":"(as Gautham Menon)","link":null,"image":null}]},{"title":"Writing Credits","persons":[{"name":"Gautham Vasudev Menon","role":"(story and screenplay) (as Gautham Menon)","link":null,"image":null},{"name":"Vipul D. Shah","role":"(dialogue)","link":null,"image":null},{"name":"Vipul D. Shah","role":"(story and screenplay)","link":null,"image":null}]},{"title":"Produced","persons":[{"name":"Vashu Bhagnani","role":"producer","link":null,"image":null}]},{"title":"Music","persons":[{"name":"Harris Jayaraj","role":"Music","link":null,"image":null}]},{"title":"Cinematography","persons":[{"name":"Johny Lal","role":"Cinematography","link":null,"image":null}]},{"title":"Film Editing","persons":[{"name":"Sanjay Verma","role":"Film Editing","link":null,"image":null}]},{"title":"Costume Design","persons":[{"name":"Shaahid Amir","role":"(Shaahid Amir)","link":null,"image":null},{"name":"Reza Shariffi","role":"Costume Design","link":null,"image":null}]},{"title":"Makeup Department","persons":[{"name":"Luize Joyce Margaret","role":"personal hairstylist: maya alagh","link":null,"image":null}]},{"title":"Production Management","persons":[{"name":"Mukti K. Mohanty","role":"production manager","link":null,"image":null},{"name":"Roshan Singh","role":"production manager","link":null,"image":null}]},{"title":"Second Unit Director or Assistant Director","persons":[{"name":"Mukesh Bansal","role":"associate director","link":null,"image":null}]},{"title":"Sound Department","persons":[{"name":"Irfan Mohammad Khan","role":"boom operator","link":null,"image":null},{"name":"Parikshit Lalwani","role":"sound effects editor","link":null,"image":null},{"name":"Umesh Patel","role":"dialogue editor","link":null,"image":null}]},{"title":"Special Effects","persons":[{"name":"Sanjay Naik","role":"special effects","link":null,"image":null}]},{"title":"Stunts","persons":[{"name":"Kishore Verma","role":"assistant action director","link":null,"image":null}]},{"title":"Editorial Department","persons":[{"name":"Dilip Deo","role":"assistant editor","link":null,"image":null}]},{"title":"Music Department","persons":[{"name":"Sunidhi Chauhan","role":"playback singer","link":null,"image":null},{"name":"Vasundhara Das","role":"playback singer","link":null,"image":null},{"name":"Bombay Jayashri","role":"playback singer","link":null,"image":null},{"name":"Kavita Krishnamurthy","role":"playback singer","link":null,"image":null},{"name":"Krishnakumar Kunnath","role":"playback singer (as Kay Kay)","link":null,"image":null},{"name":"Sonu Nigam","role":"playback singer","link":null,"image":null},{"name":"Preeti Pinky","role":"playback singer","link":null,"image":null},{"name":"Roop Kumar Rathod","role":"playback singer","link":null,"image":null},{"name":"Sameer","role":"lyricist","link":null,"image":null},{"name":"Shaan","role":"playback singer","link":null,"image":null},{"name":"Vipul D. Shah","role":"lyricist","link":null,"image":null},{"name":"Shekhar","role":"playback singer","link":null,"image":null},{"name":"Sukhwinder Singh","role":"playback singer","link":null,"image":null},{"name":"Anuradha Sriram","role":"playback singer","link":null,"image":null}]},{"title":"Other crew","persons":[{"name":"Zia Khan","role":"production controller","link":null,"image":null}]},{"title":"Cast","persons":[{"name":"Madhavan","role":"Maddy (\n \n (as R. Madhavan))","link":"/name/nm0534856/?ref_=ttfc_fc_cl_i1","image":"https://m.media-amazon.com/images/M/MV5BZjQ4NWIwYzYtOTYwZC00ZDI4LWFmYWEtZjhmNTE3ODVhYzJkXkEyXkFqcGdeQXVyOTc1MzM5MA@@._V1_UY317_CR12,0,214,317_AL__QL50.jpg"},{"name":"Saif Ali Khan","role":"Rajiv Shyamrao (\"Sam\") ","link":"/name/nm0451307/?ref_=ttfc_fc_cl_i2","image":"https://m.media-amazon.com/images/M/MV5BMTUyNjI2NTg3M15BMl5BanBnXkFtZTcwNDEzNDg3OA@@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Dia Mirza","role":"Reena Malhotra (\n \n (as Diya Mirza))","link":"/name/nm1069850/?ref_=ttfc_fc_cl_i3","image":"https://m.media-amazon.com/images/M/MV5BMTU3Mjc1NDUzNl5BMl5BanBnXkFtZTcwMjkxMzgzMQ@@._V1_UY317_CR10,0,214,317_AL__QL50.jpg"},{"name":"Vrajesh Hirjee","role":"Vicky ","link":"/name/nm0386358/?ref_=ttfc_fc_cl_i4","image":"https://m.media-amazon.com/images/M/MV5BMTI4OWU4ZDktOGNlNC00NTBlLWJjNTctM2JmYzBhOGFhNWE4XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR8,0,214,317_AL__QL50.jpg"},{"name":"Tanaaz Currim Irani","role":"Shruti (\n \n (as Tanaaz Currim))","link":"/name/nm0193022/?ref_=ttfc_fc_cl_i5","image":"https://m.media-amazon.com/images/M/MV5BZWU0N2M3NGUtZDdmYS00YTdmLThjMzUtMDRiZjgwMjlhNmVmXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Anupam Kher","role":"Deen Dayal ","link":"/name/nm0451600/?ref_=ttfc_fc_cl_i6","image":"https://m.media-amazon.com/images/M/MV5BMjMyMjc1OTgzNF5BMl5BanBnXkFtZTgwMDY1NDMzOTE@._V1_UY317_CR4,0,214,317_AL__QL50.jpg"},{"name":"Navin Nischol","role":"Mr. Malhotra (Reena's dad) ","link":"/name/nm0632615/?ref_=ttfc_fc_cl_i7","image":"https://m.media-amazon.com/images/M/MV5BNzY5NWIxMDItMzZkNi00YzNiLTkyMWQtZDJlNzEwODA2MDNkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR7,0,214,317_AL__QL50.jpg"},{"name":"Smita Jaykar","role":"()","link":"/name/nm0419741/?ref_=ttfc_fc_cl_i8","image":"https://m.media-amazon.com/images/M/MV5BODE4ZjI3MzctZGE4Yy00NzRmLWI5ZWItNTljNDM4MWRjMmYyXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR14,0,214,317_AL__QL50.jpg"},{"name":"Hemant Pandey","role":"()","link":"/name/nm0659235/?ref_=ttfc_fc_cl_i9","image":"https://m.media-amazon.com/images/M/MV5BOGFiNTBlNDQtMjM0Ni00Njc3LTg4NGQtYmExMWY3ZWJjMTg2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR11,0,214,317_AL__QL50.jpg"},{"name":"Kabir Sadana","role":"Maddy's Friend 2 ","link":"/name/nm1294647/?ref_=ttfc_fc_cl_i10","image":null},{"name":"Reshma Modi","role":"()","link":"/name/nm1293815/?ref_=ttfc_fc_cl_i11","image":null},{"name":"Maya Alagh","role":"Mrs. Malhotra (Reena's mom) ","link":"/name/nm0015808/?ref_=ttfc_fc_cl_i12","image":null},{"name":"Kabir Sadanand","role":"Maddy's Friend ","link":"/name/nm1328817/?ref_=ttfc_fc_cl_i13","image":null}]}],"reviews":[{"heading":" Great movie","review":"Well what I can say..I remember, I took this DVD with much disdain as I don't usually go along with romantic movies..and voilà!! i was more than surprised as how much I liked the movie..it was a novel concept ,Maddy was great so his gang of friends, I think I have saw this movie at least 6 times, planning to buy a DVD. The movie start with the monologue by none other than Maddy..describing his love n Hate relationship with Rajiv Samra(Saif Ali Khan).the first half is great , its all fun, all jokes especially Maddy's gang.They are great especially the specko guy..his timing of delivering jokes and one liners are simply kewl.I think it would be great if you guys see the movie..am sure you wont regret..Folks..don't wait just go and grab the DVD and fall in love with the movie.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Hmm...I love this movie","review":"Although it wasn't a big movie when it came out and wasn't a successful one either. But, I got to see this movie in theater and I loved it throughout. It has emotional/comic romantic story and movie starts from college campus when our hero is about graduate and most of the story takes place after he passes out of college.I was amazed by madhavan's acting skills (and comic timing too) and diya's beauty. Perfect chemistry between the two and comic moments here and there in the movie keeps you engrossed throughout. Music and all the songs are superb and A-classAnother great revelation was Saif's character. He was in new avatar (as he was written off by then) and could easily be said to be his one of the finest comeback movie (though there is dil chahta hai) and now he is one of the biggest star in bollywood, he should be thankful to this role.I must have seen this move 100s time by now, it is so refreshing. When this movie came out, I was 18 then and was totally smitten by it.I love it. :)","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A Story with a twist","review":"This movie was rather different in style and approach. The story was simple, thus adding to the charm of the movie. There where no \"goodies\" or \"baddies\", and the characters show some depth time and again. The rivalry between Sam and Maddy being the premise of the movie, made it a lot more interesting than your regular love drama. I initially took this movie out as I'm a Saif Ali-Khan fan, but at the end of the movie I was a Mahdhavn fan. He is a good actor, and the character \"Maddy\" was so colorful that you can't help but fall for him. This movie had the best acting Diya Mirza has done to date, bar her performance in Tehzeeb. Unfortunately an actor of Saif's caliber was under-used, but Saif still manages to inject some life to the character Sam which is rather flat in comparison to the character Maddy. The surprising sensitivity that Sam shows at the end of the film was well written. The only criticism I would have is that the character Rina seemed unable to make up her mind at the end and needs Sam to intervene, but this may be something to be expected as her family's expectations are huge weight on her shoulders. This ad's to the realism of the film. Another reason I like this film is that it was shot on location in New Zealand, and at one point I see Diya Mirza running down a street I used to live on! They also dance in the Octogen in Duedin which is where I lived during Univesity. So to me this movie holds a special place because of the locations it was shot in, as well as being a thorough entertainer!","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" An excellent movie with a questionable moral basis","review":"I remember watching this movie with my parents ages back, in fact a year after it was released. While it never became a box office hit, it certainly ascended to cult status and i can probably understand why. I've only recently gone back to watching these movies now, as a form of exam procrastination (an art which I am readily perfecting).Before I get into the positives of this movie however, id like to elucidate upon what i thought was a very alarming moral issue within. The movie in a nutshell basically condones stalking and general thuggery to 'get women'. In fact, that is basically what Maddy, the movie's protagonist character, does in order to woo the girl he falls in love with after seeing her dance in the rain from a call booth (an aside - i always find it interesting to watch movies pre-smart-phone and pre mobile accessible technology because it harks back to a time where society was not poisoned with the ills and obsessions that have been created by social media - but i digress).Maddy spends at least twenty minutes of the film engaging in what would otherwise be known as unlawful stalking behaviour in most common law countries. He takes pictures of the love interest of the movie, Reena (played ably by dia mirza), somehow solicits her number from an otherwise dumb and slightly ridiculous friend, goes to such lengths that he enlists his buddies to cut the telephone line at Reena's own home; and to top it all off, impersonates the man that is supposed to marry his love interest for 'five days' in order to 'have her.' He even hints that he might have 'raped' her if wanted in the closing stages of the film. It is highly unlikely that anyone would NOT consider all or even some of this kind of behaviour morally questionable and stalkerish, and it represents a moral undertone which i frankly dislike. Considering India's much publicised problems with rape, sexual harassment and treatment of women, such a moral undertone condones such behaviour more than anything else (granted, the film was released much before such events in India have entered a global limelight, but this does not mean those problems were not present back then either). Maddy's 'win' at the end of the movie only emphasises that problem.Nonetheless, despite this questionable undercurrent, the movie in itself is excellent, and it is why it has bought me back to watch it and created a cult following along with it. What strikes me from the movie is the manner in which Menon, the director, treats the screenplay, which is in my opinion flawless. The movies lengthy time is barely noticeable because menon is able to intelligently weave together the initial Maddy- sam conflict throughout the film, ensuring that their conflict is always in the background but not taking up more than required screen time to effectively convey it. Further, the comedic scenes are excellent; R.Madhavan possesses a distinct comedic touch and is ably supported by another outstanding character in the film, Vicky, who's one liners had me sniggering and guffawing quite often. Menon is able to frame each comedic scene and tie to those human, good qualities that Maddy does possess - his unrelenting will, his care for his friends and family and a boyish inflection in his personality. Despite the fact that he stalks Reena, Menon's direction enables the audience to ignore the ridiculousness and instead almost root for Maddy as he, his friends and dad cook up various plans in order to woo the lady. For the most part, the scenes in which Maddy is trying to get to know Reena or is devising plans to have 'the perfect night out' are the best, because Menon paces them well, edits the scenes to elicit the humor (one particular scene, as Maddy is driving a 1970's fiat, he proclaims that 'everything is planned out and nothing can go wrong when I have planned something'; which immediately cuts to Maddy coughing and cursing an overheated car as he unsuccessfully tries to fix the radiator in the bonnet, drew several laughs). Further, Menon conveys Maddy's inner conflict of keeping his facade as 'rajiv from America' and telling Reena the truth in effective ways; he often juxtaposes Maddy's conflict in scenes where he is expressing his feelings to Reena, keeping the audience interested but also worried for the eventuality that will happen if Maddy does not tell the truth. But the greatest success for Menon is how he is able to connect Mumbai to the character of Maddy; mumbai's grime and problems is reflected by Maddy's irresponsible, immature, vulgar, alcoholic side; but on the other hand, mumbai's humor, its points of beauty and its charm is also reflected by Maddy. It is interesting when Reena admonishes Maddy on their first day together, stating that 'im a simple woman, an Indian woman...leave your American-ness alone', effectively implying to Maddy that it is his inner mumbaiwalla charm which she wants, and which she eventually falls in love with. It is this which makes the film such a cult classic because it speaks to the inner Indian in the moviegoer heart, the charm and visceral beauty within each and the will to achieve their ends.The songs in the movie are also great and are a treat to listen to, meaning that the segues which can often be jarring are not so bad.In all, this movie is great. It has excellent re-watch value. However, one must ignore not only the ridiculousness of the plot but also the questionable morals which plague the movie to fully appreciate its quality, and for that reason it deserves a 7/10.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Excellent Combination Of Love And Music","review":"RHTDM is indeed one of my favourite movie, i watched it more than 100 times or may be much much more.Movie got a touching songs and background score(RHTDM THEME) every time a emotional love scene comes which always melt my heart much faster than anything.Although the movie is quite expected but the acting of all the characters in the movie is above par, specially Madhav Shastri aka Maddy(Madhavan).Reena Malhotra(Diya Mirza) looks awesome in this movie and the prettiest ever in her bollywood carrier.Rajiv Samra(Saif Ali Khan) adding twist to the movie also played a studious dude role in the movie.Although the movie was not much successful at the time of its release, but as far as i concerned all the youngsters at the time when this movie was released, loved it so much and can watch this movie uncountable time.Enjoy this movie with some of the unforgettable, evergreen, touching, heart breaking, romantic, funny, etc songs and scenes.Atlast want to say than RHTDM Always....","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Best Movie","review":"RHTDM was best movie according to me. But i didn't know how it became flop. It was awesome movie with nice story line. Role of diya mirza and madhvan was extra ordinary. I had watched this movie approx 50-60times. One of the best movie of madhvan. And the song was great. There was mixture of all type of song. \"Sach keh raha hai deewana\" and \"Dilko tmse pyar hua\" was awesome. The movie was slightly slow or boring in first part. But after that the movie was great. When first time i watched the movie. I was very sad because i didn't watched the movie in theater. By the way all movie of madhvan are good. Tanu weds Manu was also a great movie, with great story line, and awesome songs.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Its all about being Maddi","review":"Not all movies with low box office earnings are duds.. This cute flick proves just that. And another point to ponder is how can guys deciding the various awards recipients' could not recognize the valiant effort of a man, an amchi Mumbai guy, popularly known thereafter as simply Maddi!!! How many a times one can recollect an actor by his screen name n not his actual one, that too from a movie that could not ring the box office bells??? To be true, if such a thing happens then that only in a way can depict the heavy role played by that character in the picture... Meet Maddi, the local amchi Mumbai man who is an Indian at heart n gets bowled over by a truly magnificent looking girl at first sight... He breathes life into his role & puts in such a performance to have shamed many an established stars., He brings in his own style n one is gonna love him for that.. Be it his rowdy look, his mischievous nature, his ascent or his anger, its simply a style that is inimitable.. N in fact the best parts of the movie are when he is with his love interest, doing what he does best, romance.. Its a sheer pleasure seeing him emote, confessing his love, getting excited on hearing the partner's approval of him or gifting a memento to his friend , i mean he does it with a class n energy n uniqueness unheard of before.. Towards the end one can be seen equally moved n dejected on the guy being rejected!!! Not for something he ruled the charts down south n was sought by directors like Mani Ratnam sir for varied roles.. He may not have made it big in bollywood but i guess his time will come... Ably given company by the eye catching miss diya who gives a decent performance n paves way for some great on screen chemistry with Maddy.. A simple, no-nonsense girl character has been given some new dimensions by her., she will leave u spellbound by her beauty, freshness, charm n simplicity... The other co stars too act good.. Saif too pitches in with a satisfactory show. My review would be incomplete without talking about the music.. The music director from south has given some compositions dat can still be heard after more than 10years!!. Be it the beautifully sung melodious tunes in *Zara Zara*& * Dill KO tumse* & my favorite from the versatile singer KK* sach keh raha hai deewana*, a song that Will make you cry, literally n very meaningfully penned.. Another noteworthy point that may have gone against the movie is shoddy dresses given to Maddi, that simply looked old fashioned n southern in character unlike the ones adored by the lead actress. Guys, its a movie that one movie buff must have in his/her collection.. Maddy u are a diamond that needs a director to give it the sheen it truly deserves......... U not only rock but dazzle too..","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" A well Acted Movie","review":"A well acted movie. the story is simple, but the actors have done a very good job. most of the scenes are nicely done. Madhavan and Diya does a good job as newcomers to Bollywood.The songs were really good too. All of the songs were equally good in tunes and lyrics. My favorite was \"Dil Ko\" by Roopkumar Rathod.Madahavan looked comfortable and natural in front of the camera, maybe because this was not his first movie. though, this was his first Hindi movie.Diya makes a good job out of her character.Saif Ali Khan was the weakest of the trio, but his performance was also considerably good.The supporting actors didn't spoil the movie.The beginning scenes doesn't look out of place, as they describe Madhavan's character. it also serves a purpose to the plot.overall, nice movie.","imdb_rating":9,"our_rating":0,"algo_label":0},{"heading":" The villain gets the girl . A romance for psychopaths ..","review":"A deeply disturbing movie portraying a villain , a liar , a violent guy , a cheapster , a thug , a stalker & a loser without a career , as the ' romantic Indian hero ' .Maddy Dayal is a deceptive , lying conman who is impersonating Rajeev Samra & fooling Rajeev's bride-to-be , Reena Malhotra ( who romances him mistakenly believing him , to be her future husband , Rajeev )Reena drops him like a hot potato when she learns of the fraud & Maddy can't take the 'rejection' . He shows absolutely no contrition for his Big-Fat-Lies & his shameless impersonation of Rajeev .Instead he's selfishly obsessed with possessing her , even against her will & begins to beg , plead & finally Stalk & Harass Reena , making her life a misery . At this point , his loathsome ass should've been sent to prison .The icing on the cake was when Madhavan's despicable character Maddy , comically threatens to get violent with the real groom , Saif Ali Khan / Rajeev ( as if Rajeev was the person who was harassing Reena & forcing his unwelcome attentions on her ) when he finally arrives from the States for his wedding .It was absolutely illogical - You need to take LSD or be stoned to be okay with Maddy's ' logic' , before this Oscar - worthy scene . Very high IQ stuff here ..Maddy was ridiculous , when he was trying to channel the Terminator in his pseudo-menacing speech to Rajeev . Even his costume change to look 'tough' was comically contrived , artificial & very , very embarrassing .Cringe-worthy & childish .While he idiotically posed like Khal Drogo ( in his head .. ) - he seemed to have Zero perspective about how ridiculous , insincere & stupid he looked ( esp. since he was the real villain )He probably felt like Leonidas ( again , in his head ! ) with his flaring nostrils , his cigarette , his constipated expression & his forced trembling rage .What was the point in Maddy threatening ANY guy in the world when the girl had already rejected him ? ( The revolting creature wasn't even a valid suitor to be rejected in the first place . Just a cheap conman stealing a Better man's identity for 5 days to get close to a girl , who wouldn't have let him come within 100 feet of her otherwise .. )The creepy-deepy had no understanding of the concept of consent , the bride' s free will or the grace to accept rejection like a gentleman & move on.See Patrick Dempsey getting dumped at the altar in ' Sweet Home Alabama ' or Kevin McKidd in ' Made of Honor ' - these authentic grooms took it solidly on the chin ( without even deceiving the brides in the first place ) & exited as bonafide gentlemen with their honours intact .Not that fake-groom-Maddy was a gentleman by any stretch of imagination .. or even a man ... he was a cartoon thug .Despicable swine .The other astounding thing in the film , apart from Maddy's deranged , selfish , whiny pursuit of Reena was that , none of his odious simian friends corrected him ( or pointed out how villainous & demonic he was being ) & neither did his contemptible father / Anupam Kher .If Maddy deserved some thrashing ( for his fraudulent identity theft , his illicit romancing , his unhinged stalking , his deranged harassing of Reena & threatening violence to Rajeev ) - his imbecile ape of a father also richly deserved double that thrashing , for grooming a stalker .\nIf this kind of stalking & harassment passes off as ' Indian romance ' , maybe it's understandable why there are so many violent crimes in India against women by psycho-romeos who can't take ' no ' for an answer or whose egos get bruised like peaches , when they get dumped .As another reviewer accurately pointed out - \" Maddy's 'win' at the end of the film only emphasises that problem . \"A truly disturbing ending - where the heroine is so weak & confused that the deranged villain gets her & she leaves a good , sensitive , suitable groom for the dangerous stalker who fooled & threatened her .She would've have made a better decision about her future if she'd taken a break from both guys & the whole wedding scene for a few months .( Time & distance would've restored her balance & she could've seen Maddy for the garbage he really was & Rajeev as a worthy man to marry )But sadly , she didn't give herself that chance & threw away her life to become Mrs. Garbage ...","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" 90s kid raise your hands 🤘","review":"This movie is just wow. Goals for all 90s kid. From music, acting everything simply beautiful.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Love this romantic Bollywood love story","review":"I love this Bollywood movie. This is when I was traveling through India my one of my Indian friend suggested me to watch this awesome movie. This is funny, romantic, sweet, light hearted and well acted movie. I have watched many Bollywood films but this one was I fell in love with. I've seen this more than ten times. The lead R. Madhavan and beautiful lady Dia Mirza I love this couple. very good actors. They could work well in Hollywood though. and about music. who the hell had composed the music in this film. I don't know the name of music director. but I love all songs from this film. I still listen to them sometime. I would rate it four and half out of five. :)","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Not very good, not bad either.","review":"Firstly I'd like to say that people wanting to see this film should not read the synopsis, as it gives away to much and takes the \"shock\" or surprise factor from the films pacing.It is good and simple love story of a spoilt guy who falls in love at first sight, then he tries to get her by any means and re discovers his sense of righteousness.The story is very simple and just similar to any other film of its genre. It's nothing one hasn't seen in Bollywood. The second half fairs a little better than the first as it has a minute novelty factor. The film manages to keep you engaged but at the same time feels a bit \"lengthy\". It could have been cut short a bit by either removing a few unnecessary scenes or songs. As, it just has only a couple of good songs, one of them is the legendary and timeless \"Zara Zara\" by Oscar winner A.R. Rehman and Oscar nominee Bombay Jayshree. This is the song which brought the movie in limelight upon its release. A great song indeed.Another commendable part of the film is the performance of R. Madhavan. He solely bears the film on his shoulders and sees it to the end. He depicts wide range of expressions along with a striking charm.Direction: Good.Script: Strong.Acting: R Madhavan all the way. Dia is average and one fails to feel the love towards her character. Saif is Average. Anupam Ji is good. Side actors like Madhavan's friend Vrajesh has done a good job.Music: Zara Zara is outstanding. Songs are good but are in excess.An enjoyable film, a bit lengthy but a good watch.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" What message does that send to young Indian men?","review":"I watched that movie with a lot of hope after seeing its mark. I have been hugely disappointed. India is a country where girls are subject to an increasing level of sexual harassment. It is also a country where their honour is highly valued, and where a bad marriage often means a life of misery. This film portrays Reena as a nice girl, but a girl whose choice is never taken into account. I thought that the film would end by her choosing neither after she says she doesn't want to decide her future by closing her eyes. It would have been an excellent, and genuinely original ending. Sadly, she goes with her harasser (which is what Madhav is). This basically say you can lie to a girl, and you'll get her. It doesn't matter what she thinks, she'll fall for you. As in ALL Bollywood movies, the first half hour is about the guy creepily staring at her all the time. It doesn't take into account the fact that, yes we do realise that as girls. And we don't like it. No wonder guys in India think it's OK to stare at a girl and harass her. It's because of films like that such behaviour is tolerated. Then what happens? Oh yes, Madhav pursue her, threatens her, threaten to hit her friends, beat up a few guys, and tell her that he could have raped her. She cries, but so what? It works. The film ends when Rajiv 'gives her' (she doesn't even come on her own) to Madhav. I know the story between the guys was in the background, but come on. What does that say, really? Such a film deserves only blame. It normalises attitudes which are deeply disturbing in Indian society. Get a grip, and produce films that have the balls to actually portray women other than passive victims, and men as weirdos who stare, harass, and get what they want.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" A movie with flawed concept.","review":"I don't review movies but seeing so high ratings for this movie made me to review it. I can't understand why this movie is rated so high on IMDB. The basic concept of this movie is flawed.\nMaddy sees Reena and falls in love with her. Reena is going to be married to Rajiv, who lives in USA and is about to come to India in 5 days. Maddy impersonates as Rajiv and makes Reena fall in love with her. When Rajiv comes to India they get to know the truth. Also Rajiv and Maddy happen to be college time enemies. Maddy starts to harrass both Rajiv and Reena and their families as well and he is fully supported be his father and his goon friends. On the day of their marriage Reena realises that she really loves Maddy and tells Rajiv. Rajiv then patches up Reena with Maddy.\nI mean what was it. Is the director trying to promote harrassment in the name of love? What effect will this movie have on youth? Certainly this flick should be avoided. The only saving grace is its music which consists of some melodious songs.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Stalking is Crime","review":"Main thing .. ,, world is changed with mobiles n internet and with tht,,, storyline is totally base-less.3 stars for false attitude🙄. music is good.'Dude' word ..,,i got tht 1st time to my knowledge by this movie 😎😁","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Stalking in the name of love","review":"When did love become stalking ? Or vice versa?! There are quite a few elements that aren't acceptable today . Great songs and visuals","imdb_rating":5,"our_rating":0,"algo_label":0},{"heading":" Boys Will Be Boys","review":"First of all, I'm not sure how this movie has a 7.5 IMDb rating. But, anyway. So the movie revolves around a strange love triangle between Madhavan (Maddy) , Saif Ali Khan, (Rajiv) and Dia Mirza (Reena). This movie is a good example of how the audience's logic is sometimes taken for granted.The Good: 1. The music. If the music wasn't good, the movie would have been a total letdown. Zara Zara and Dil Ko are the best songs in my opinion, and the background music is pleasant too. 2. The first half of the movie is still somewhat entertaining, especially the sequences between Maddy and his friends trying to track down Reena, and the scene in the grocery store was quite funny too.The Bad: 1. Saif Ali Khan - probably his most annoying performance. He looks like a wimp and overacts his way through the whole film and what the hell are his outfits? Oh, and in one of the songs he decides to roam the streets shirtless. Charming, isn't it? 2. Dia Mirza's character is presented as too innocent and rather dim-witted. Why didn't she get her phone re-connected? And why does she get so angry at Maddy when she was in love with him too? 3. Everyone overacted in the second half, and Maddy's violence seems over the top. The last 30 minutes of the movie were a drag.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" Cult Classic Romantic Movie","review":"This movie is love, it depicts modern love story in early 2000's, Best Bollywood Romantic Movie Made Ever.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" A review on the Review we don't need A movie to be a message .","review":"The Movie is pretty Good their are flaws around in the movie but music is too good even the story is good... People who are giving bad reviews don't have any idea what 2001 was it's far better than the DDLJ shit where the guy was a college drop out at least the guy here is an engineer had a Job . People should accept a Character as a character Yes Maddy isn't perfect but no one is He made mistakes but he didn't hurt anyone and der is nothing wrong with the Girl she is independent and yet could accept a arranged marriage which is perfectly Fine..","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Best romantic -drama film of bollywood ever","review":"I HAVE WATCHED THIS MOVIE MORE THAN 100 TIMES. \nThis is my most favourite romantic movie ever.\nIt is a very beautiful movie, with solid acting shown by madhvan (maddy) , dia mirza and saif ali khan. The dialogue are so well written. the best thing of movie is it's songs, they are really heart touching, and it's background music also. and the rivalry of saif ad maddy is damn amazing.\nsome pure comedy scenes are also included in the movies ,which are really funny (by maddy's friends). great supporting acting is there by anupam kher also.overall it is a must watch movie for bollywood movie lovers.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Best love story","review":"Friends this this one of the best love story that have ever made,i watched this movie for more than 50 times and still want to watch it.Madhvan did great acting as well as Diya is looking so cute.Songs are still heart touching.This is the movie which i first saw when i was in class 7th my love story too started at this very age and i was madly in love with that girl.This story have song's which will touch your heart if you are in love.This movie also has record for the most movie title songs. This movie is made in so many languages and all over South India it was super hit and i felt so disappointed to know it was flop in north India people in north still want masala movie but this is full package.","imdb_rating":8,"our_rating":0,"algo_label":0},{"heading":" Review from an Indian woman !","review":"This is a typical example of Indian cinema glorifying the harassment in the name of romance. \nMaddy - Does not respect women during college, acts like a goon etc etc. Falls in love instantly with Dia and decides that she is the one. He sets out to get her by hook or crook. \nDia - Shown as independent working woman. But , I don't understand how did she even fall for this guy in 5 days and decide to marry him. Stereotyped to be an Adarsh Indian Bahu.\nRajiv - Sensitive enough to respect women ; to even notice that Dia was not happy during the wedding ceremony. (Most Indian guys cannot even figure out why a woman is mad at him even when it's super obvious). But, Dia is shown to fall for Maddy who shouts and threatens her when things aren't going his way. Even after he says that he could have sexually violated her in disguise as Rajiv. \nNo self respecting woman in the real world would actually choose someone like Maddy. Atleast I would not. Such a sad thing to see that this is such a celebrated movie among Indian youth. Influences the people to think it's \"OKAY\" to lie, stalk , threaten, harrass, emotionally blackmail, beat up people etc. :'(","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" A terrible story line and a very average narration.","review":"Projects the emotional immaturity of Indian youth. Especially through the comments and high rating for such a retarded story. Surprising that the script-writer could not be gutsy. Gutsy enough to write a more apt ending. By showing the complete rejection of a mentally disturbed and personally flawed character. for a well-educated, decent human being. My heart goes out to Indian women. if this is the choice the Indian society portrays as ideal for them. I am an Asian from neighboring country with conservative values. But I still can not relate to this. Please watch it as an insight into what is wrong with the Indian Society and Youth. Why India is lagging behind in every other field in the world. Because the time and priorities of people are so misplaced and skewed.","imdb_rating":1,"our_rating":0,"algo_label":0},{"heading":" Watchable remake Of Minnale but with a few flaws","review":"A remake of the same movie in Tamil titled \"Minnale\".The film was not so successful during the time of its release in the year 2001, but has since developed a cult following on the internet. Most of the film contains the same exact scenes as its Tamil counterpart. However the hindi audiences were not ready for a different style of movie that itself was new in the original Tamil movie. Minnale was well received in the south because it appealed to Tamil sensibilities and tastes of that timeAs compared to the original movie Minnale. the acting seems to be better especially the female lead role played by Diya Mirza compared to the Reema Sen in the original. Diya seems to be a more competent performer than Reema Sen and carries the film throughout with her excellent mannerisms and performance.However in this hindi remake, Madhavan seems to have faltered in his acting compared to the original Tamil version His performance at times comes off as over exaggerated or subpar. At times the screenplay and production seems to be rushed and greater care could have been taken in editing and production values. The film seems to have an early 90s style cinematography and production values which seems out of place. Nevertheless, the on screen presence of Diya Mirza and her performance still is one of the best in Indian cinema.The film itself contains a few unnecessary elements which are draggy and irrelevant to the central story.The soundtrack by Harris Jayaraj while being brilliant as it was int he original , it had been successfully and nicely dubbed from the original version without coming off as too much tamil s and avoided the problems which plague dubbed soundtracks of this sort from the South to North. Overall the soundtrack is the biggest winner in this film as it had the same impact on Hindi audiences as the Tamil version.Overall a watcher for its presentation of couples in love.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Minnale Copy Paste but quite watchable","review":"RHTDM as it's affectionately called was a remake of Tamil film Minnale(2001) which also starred Madhavan alongwith Reema Sen Govind Menon remakes the same film with a few changes. The film starts off well, with Maddy and Saif fight and then Maddy falling for Dia, though the south style may not work for all at times Yet the scenes between Dia and Maddy are superbly handled The twist in the tale is well handled too with Saif making a comeback The going ons do get predictable in second half but the climax is well handledDirection is good Music is mostly recreated yet Zara Zara became a rageMadhavan tends to overdo a bit and reminds u of Shahrukh Khan but yet he plays Maddy superbly of course he has played it before in Minnale but he lends freshness to the role though he was overweight Dia is also cute in her role though weak in her emotional scenes and dialogue delivery Their chemistry is amazing Saif Ali Khan is superb in his role, this was his first role after Dil Chahta Hai and he is good Vrajesh Hirjee is funny as Maddy's friend, Anupam Kher is lovable though typecast rest are okay","imdb_rating":6,"our_rating":0,"algo_label":0}],"imdbId":"tt0299108"}