{"name":"Yeh Kaisi Mohabbat ","release_year":2002,"release_date":"2002-05-30T18:30:00.000Z","release_info":{"date":"31","month":"May","year":"2002","zone":"India","datestring":"31 May 2002 (India)"},"description":"Yeh Kaisi Mohabbat (YKM) is a romantic thriller. It deals with a whole lot of fun, romance and suspense. It is story of an innocent boy Vicky. The plot involves an innocent poor boy, who is...\n                    See full summary »","genre":["Musical","Drama","Romance"],"poster":"https://m.media-amazon.com/images/M/MV5BYTllNzJjMGItY2ZmYy00YzUxLThhZDktZjIyZmU3YTUzY2JlL2ltYWdlXkEyXkFqcGdeQXVyMjQ2MjgyNjY@._V1_QL50_.jpg","posterimageid":"rm1358839552","stars":4,"rated":"unrated","running_time":{"hour":2,"minute":40},"trailer_link":"https://www.youtube.com/embed/xE74x9l-Xcc","images":[{"id":"rm1358839552","h":580,"w":400,"msrc":"https://m.media-amazon.com/images/M/MV5BYTllNzJjMGItY2ZmYy00YzUxLThhZDktZjIyZmU3YTUzY2JlL2ltYWdlXkEyXkFqcGdeQXVyMjQ2MjgyNjY@._V1_QL50_SY290_SX200_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BYTllNzJjMGItY2ZmYy00YzUxLThhZDktZjIyZmU3YTUzY2JlL2ltYWdlXkEyXkFqcGdeQXVyMjQ2MjgyNjY@._V1_QL50_.jpg","altText":"Yeh Kaisi Mohabbat (2002)"}],"cast":[{"title":"Directed","persons":[{"name":"Dinkar Kapur","role":"Directed","link":null,"image":null}]},{"title":"Writing Credits","persons":[{"name":"Aadesh K. Arjun","role":"(dialogue)","link":null,"image":null},{"name":"Y.N. Kapoor","role":"Writing Credits","link":null,"image":null}]},{"title":"Produced","persons":[{"name":"Vinit Handa","role":"executive producer","link":null,"image":null},{"name":"Ashok Kotwani","role":"producer","link":null,"image":null},{"name":"Sanjeev Kumar Sharma","role":"production head","link":null,"image":null}]},{"title":"Music","persons":[{"name":"Sandeep Chowta","role":"Music","link":null,"image":null}]},{"title":"Cinematography","persons":[{"name":"S. Pappu","role":"Cinematography","link":null,"image":null}]},{"title":"Makeup Department","persons":[{"name":"Shrikant P. Desai","role":"personal makeup artist (as Srikant Desai)","link":null,"image":null}]},{"title":"Sound Department","persons":[{"name":"Vikram Biswas","role":"foley editor","link":null,"image":null},{"name":"Ajith Abraham George","role":"sound mixer","link":null,"image":null}]},{"title":"Camera and Electrical Department","persons":[{"name":"Junaid Shaikh","role":"first assistant camera","link":null,"image":null}]},{"title":"Music Department","persons":[{"name":"Paul Praveen Kumar","role":"musician","link":null,"image":null},{"name":"Kumar Sanu","role":"playback singer","link":null,"image":null},{"name":"Alka Yagnik","role":"playback singer","link":null,"image":null}]},{"title":"Other crew","persons":[{"name":"Himanshu Jhunjhunwala","role":"p. r. o.","link":null,"image":null}]},{"title":"Cast","persons":[{"name":"Krishna Abhishek","role":"()","link":"/name/nm2243737/?ref_=ttfc_fc_cl_i1","image":"https://m.media-amazon.com/images/M/MV5BOWJmNDJkYjEtYmY5ZC00NmY5LTgyNTUtN2FjODQyZGZhNmIzL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR15,0,214,317_AL__QL50.jpg"},{"name":"Viveka Babajee","role":"Priya Thakral ","link":"/name/nm1163179/?ref_=ttfc_fc_cl_i2","image":null},{"name":"Sheeba Bhakri","role":"()","link":"/name/nm3078611/?ref_=ttfc_fc_cl_i3","image":null},{"name":"Deeksha","role":"Tina ","link":"/name/nm1164141/?ref_=ttfc_fc_cl_i4","image":null},{"name":"Dinesh Hingoo","role":"Gurkha Bahadur ","link":"/name/nm0455454/?ref_=ttfc_fc_cl_i5","image":"https://m.media-amazon.com/images/M/MV5BMjQ4N2IxYmMtYTc3NC00YThhLTkzNGQtYzk4MjM5ZGFiMGU3XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR8,0,214,317_AL__QL50.jpg"},{"name":"Javed Rizvi Jarehavi","role":"()","link":"/name/nm1835719/?ref_=ttfc_fc_cl_i6","image":null},{"name":"Sharad S. Kapoor","role":"Rahul Thakral ","link":"/name/nm2528716/?ref_=ttfc_fc_cl_i7","image":"https://m.media-amazon.com/images/M/MV5BYzQ5MzkyNDMtYjFjNC00NGE1LTk4MjItZDVkYjY4MzEwNzcwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR16,0,214,317_AL__QL50.jpg"},{"name":"Krishna","role":"Vicky ","link":"/name/nm1094279/?ref_=ttfc_fc_cl_i8","image":null},{"name":"Johnny Lever","role":"Paaji ","link":"/name/nm0505323/?ref_=ttfc_fc_cl_i9","image":"https://m.media-amazon.com/images/M/MV5BMjMyMTQzMjk1MV5BMl5BanBnXkFtZTgwMDg5MTMzOTE@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Mehmood Jr.","role":"Bhaaji ","link":"/name/nm0576455/?ref_=ttfc_fc_cl_i10","image":"https://m.media-amazon.com/images/M/MV5BNDI3MDRjYmMtMGI2NS00NzUxLWI3Y2ItYjM2ODJlM2U3ODYxXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR5,0,214,317_AL__QL50.jpg"},{"name":"Mukesh Rishi","role":"Asst. Comm. of Police ","link":"/name/nm0728262/?ref_=ttfc_fc_cl_i11","image":"https://m.media-amazon.com/images/M/MV5BZjVjZjdhYzEtYTUxZi00OTBjLWI4OGYtNGE5ZmQzMTFkYWEwXkEyXkFqcGdeQXVyMjYwMDk5NjE@._V1_UY317_CR3,0,214,317_AL__QL50.jpg"},{"name":"Anjan Srivastav","role":"Ratanlal (Tina's dad) ","link":"/name/nm0820283/?ref_=ttfc_fc_cl_i12","image":"https://m.media-amazon.com/images/M/MV5BYmQ4Nzg3NGYtZjU0YS00ZGRmLThhOTUtNGFhMTJiNjJjZWUzXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR8,0,214,317_AL__QL50.jpg"},{"name":"Deepak Tijori","role":"Vijay Pal ","link":"/name/nm0863120/?ref_=ttfc_fc_cl_i13","image":"https://m.media-amazon.com/images/M/MV5BNmIwYzhiNjUtYmY3NS00YjdhLTlkM2UtZDJhZDJiNDkzNDI5XkEyXkFqcGdeQXVyNDY2Nzg2NQ@@._V1_UY317_CR51,0,214,317_AL__QL50.jpg"}]}],"reviews":[{"heading":" Unfunny and unsuspensful mix of comedy and thriller","review":"This is one of the minor examples of Bollywood's ability to cross genres. For better ones, turn to \"Humraaz\" or, well, probably anything you can find on the market. Why is \"Yeh Kaisi Mohabbat\" this bad? It starts and ends with Johnny Lever. I cannot stand this guy. Period. I don't know if there's some special humor in his jokes that you only get if you're Indian, but I don't think so. It's not only his jokes, it's his whole appearance. This terrible eye-rolling, his constant shouting - I've seen about 20 films with him in it and I got annoyed by him in every single one of them. And here, his role is rather big. Go figure.To be fair, it's not just him. I had a problem with the plot and the three newcomers as well. First the actors: Krishna, Deeksha and Viveka were all rather bland. Viveka is at least a stunning beauty but her role was small. Deeksha has an amazing body but I got distracted by her face. It looks elegant, but her eyes are so far away from each other, it just doesn't look, well, real. But who am I to judge an actor by the looks, so I continue elsewhere ... the plot.The comedy start has some nice gags, but overall, it's boring. The thriller part, which kicks in about half way through, is predictable and unsuspensful. There are one or two good scenes, the rest is a waste of time. I guess the producers smelled these weaknesses and tried to up the ante with some special effects. The major ones were the wire fighting. You know, when the actor hangs on wires and seems to fly while fighting - à la \"Matrix\", \"Crouching Tiger\" etc. You also remember the wires in \"Scary Movie\" or \"Austin Powers 3\"? This is how it looks here. It really looks like a parody of wire fighting.At the end, we even have the \"Matrix\"-bullet-effect. Yes, they were that desperate. Overall, I'd say you can invest 162 minutes way better than in this. Not even the music is particularly good. I'd rate it2/10","imdb_rating":3,"our_rating":0,"algo_label":0},{"heading":" Expensive B Grade Masaala","review":"Abbaas-Mustaan are considered as the Alfred Hitchcock of Indian cinema. Their disciple Dinkar Kapur decided to direct a movie independently and he made the script from the leftovers of the movies of his gurus for that purpose. The suspense-thriller thus coming into existence is Yeh Kaisi Mohabbat (2002) which stars Govinda's nephew (sister's son) - Krishna (now he is known as Krishna Abhishek) in lead role.Yeh Kaisi Mohabbat (what kind of a love is it ?) is the story of Vicky who wants to lead an affluent life by trapping some rich girl in his love and thereby marrying her. Soon he is able to do so with Tina (Deeksha). However when he comes into contact with a wealthy person Rahul Thakraal (Sharad Kapoor) and gets the assignment of spying his wife, he's shocked to find that Rahul's wife is Tina only. But the truth is something else. Rahul's wife is actually Priya (Viveka Babaji) who gets murdered and the police goes after Vicky considering him only the murderer. The real murderer is unmasked in the end.Dinkar Kapur and the screenplay writer Y.N. Kapoor succeeded in preparing the script of this murder mystery by assembling various scenes like the pieces of a jigsaw puzzle and generously used the finances of the producer Ashok Kotwaani by shooting on foreign locations. However this and exposing the physic of the heroine is not sufficient to make a quality suspense-thriller. Dinkar Kapur has made an expensive movie which, due to his poor sense of filmmaking, could not rise above a B grade masaala flick.The suspense is intriguing no doubt which keeps the viewer guessing about the real murderer till the climax and that's the first and the foremost ingredient of a good mystery. However the casting and the treatment of the plot is certainly B grade and does not render an air of an excellent suspense-thriller. Frankly, I don't think that there should be any gradation of movies because a movie is either good or bad but the public responds to the movies by perceiving them as such only. And that's the tragedy of this movie.The movie is an entertaining mystery nonetheless which contains a good dose of romance also. Good performance by Krishna in the lead role has helped the script and the direction. Among the other cast members - Mukesh Rishi has done admiringly as the investigating police officer whereas Sharad Kapoor, Deepak Tijori etc. are also well in place. Johny Lever has left no stone unturned in boring the audience by his stale comedy. Heroine Deeksha has exposed more, acted less (perhaps that's what the director wanted her to do). Late Viveka Babaji who was a well known model, could not do much in this the only acting job done in her life.Technically and production value wise, the movie is up to the mark. Sandeep Chowta has composed music quite reasonably in at least two songs - Akeli Hai Raat and Lafda Hai.All in all, I can say that Dinkar Kapur has been only partially successful in imitating his gurus, i.e., Abaas-Mustaan. However this so-called B grade movie is an interesting murder mystery which can be recommended as a one time watch to at least those who are fond of the movies of this genre.","imdb_rating":6,"our_rating":0,"algo_label":0},{"heading":" the musical numbers are the best parts","review":"For me, (this is typical) most of the fun, energy and sex appeal of the film are in the musical numbers. The fight scenes are comical, almost every hit forcing the characters to dive in some direction. I was also amused by the the running gag of the inspector cracking his neck, but I didn't find the comic relief to be very funny. The plot was over-complicated and improbable. Most of the characters were not (to me) very sympathetic. I did like the art direction, locations and choreography. The music itself didn't particularly appeal to me, but it had good energy and served the dancing. The female lead was suitably hot.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Interesting Bollywood rip-off","review":"Deeksha's red-hot dance to the song \"Akeli Hai Raat\" is the clear highlight of this overlong masala movie: unfortunately things go rapidly downhill thereafter.This film takes its plot from Hitchcock's \"Vertigo\" but adds Bollywood slapstick, Hong Kong-style action and a plethora of plot twists to create a fairly indigestible mixture. Kapur takes Hitchcock's already-complex plot and overcomplicates it to the point of parody. This reminds me somewhat of the way \"Gumnaam\" similarly over-elaborated when it ripped off \"And Then There Were None\". Somehow Bollywood always seems to miss the point when remaking Hollywood thrillers.","imdb_rating":5,"our_rating":0,"algo_label":0}],"imdbId":"tt0316911"}