{"name":"Ehsaas: The Feeling ","release_year":2001,"release_date":"2001-11-29T18:30:00.000Z","release_info":{"date":"30","month":"November","year":"2001","zone":"India","datestring":"30 November 2001 (India)"},"description":"Ravi Naik lives a middle class life with his son Rohan in the country of India. He brings up his son in a very strict, quiet and disciplined atmosphere, so much so that his son starts to ...\n                    See full summary »","genre":["Drama"],"poster":"https://m.media-amazon.com/images/M/MV5BMDFkYTI1ZDgtOGJhZS00MGFiLTkyNmEtMDc5NWNmNjQ4YTk3XkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_QL50_.jpg","posterimageid":"rm407902208","stars":5.6,"rated":"unrated","running_time":{"hour":1,"minute":56},"trailer_link":"https://www.youtube.com/embed/RIa5O83poJI","images":[{"id":"rm407902208","h":500,"w":500,"msrc":"https://m.media-amazon.com/images/M/MV5BMDFkYTI1ZDgtOGJhZS00MGFiLTkyNmEtMDc5NWNmNjQ4YTk3XkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_QL50_SY250_SX250_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BMDFkYTI1ZDgtOGJhZS00MGFiLTkyNmEtMDc5NWNmNjQ4YTk3XkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_QL50_.jpg","altText":"Sunil Shetty in Ehsaas: The Feeling (2001)"},{"id":"rm441456640","h":500,"w":500,"msrc":"https://m.media-amazon.com/images/M/MV5BYjAyOWE3N2MtNTRkMy00ZmM5LTg0NjUtNGQ3NWZiYmI5M2UwXkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_QL50_SY250_SX250_AL_.jpg","src":"https://m.media-amazon.com/images/M/MV5BYjAyOWE3N2MtNTRkMy00ZmM5LTg0NjUtNGQ3NWZiYmI5M2UwXkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_QL50_.jpg","altText":"Sunil Shetty in Ehsaas: The Feeling (2001)"}],"cast":[{"title":"Directed","persons":[{"name":"Mahesh Manjrekar","role":"Directed","link":null,"image":null}]},{"title":"Writing Credits","persons":[{"name":"Deepak Kulkarni","role":"Writing Credits","link":null,"image":null}]},{"title":"Produced","persons":[{"name":"Pravin Shah","role":"producer","link":null,"image":null},{"name":"Asif Shaikh","role":"executive producer","link":null,"image":null}]},{"title":"Music","persons":[{"name":"Anand Raj Anand","role":"Music","link":null,"image":null},{"name":"Prajwal Anand","role":"Music","link":null,"image":null},{"name":"Milind Sagar","role":"Music","link":null,"image":null}]},{"title":"Cinematography","persons":[{"name":"Vijay Kumar Arora","role":"(as Vijay Arora)","link":null,"image":null}]},{"title":"Production Design","persons":[{"name":"Nitin Chandrakant Desai","role":"Production Design","link":null,"image":null}]},{"title":"Second Unit Director or Assistant Director","persons":[{"name":"Raminder Singh Suri","role":"chief assistant director","link":null,"image":null}]},{"title":"Art Department","persons":[{"name":"Rajkishor Choudhary","role":"assistant art director (as Raj Kishor Choudhary)","link":null,"image":null}]},{"title":"Sound Department","persons":[{"name":"Rajendra Hegde","role":"sound mixer","link":null,"image":null},{"name":"Ajay Kumar P.B.","role":"sound pre-mix","link":null,"image":null}]},{"title":"Camera and Electrical Department","persons":[{"name":"Rajeev Shrivastava","role":"assistant camera (as Rajeev Shrivastav)","link":null,"image":null}]},{"title":"Music Department","persons":[{"name":"Sunidhi Chauhan","role":"playback singer","link":null,"image":null}]},{"title":"Other crew","persons":[{"name":"Remo D'Souza","role":"choreographer (as Remo)","link":null,"image":null}]},{"title":"Cast","persons":[{"name":"Anand Raj Anand","role":"Special appearance ","link":"/name/nm0025607/?ref_=ttfc_fc_cl_i1","image":null},{"name":"Sunidhi Chauhan","role":"Special appearance ","link":"/name/nm0154298/?ref_=ttfc_fc_cl_i2","image":"https://m.media-amazon.com/images/M/MV5BODE2NDJjNWQtMzkxYi00OTVjLTk2MTktMjk1NWVhN2VjNWE1XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR8,0,214,317_AL__QL50.jpg"},{"name":"Nagesh Haldankar","role":"()","link":"/name/nm1523390/?ref_=ttfc_fc_cl_i3","image":null},{"name":"Shakti Kapoor","role":"Principal ","link":"/name/nm0007106/?ref_=ttfc_fc_cl_i4","image":"https://m.media-amazon.com/images/M/MV5BMTY2MDE1MTQ2N15BMl5BanBnXkFtZTgwNTk2OTczOTE@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Kiron Kher","role":"Sunil shetty's mother ","link":"/name/nm0451601/?ref_=ttfc_fc_cl_i5","image":"https://m.media-amazon.com/images/M/MV5BMGQ1NTZkOWQtN2Y2Zi00NDEyLWFmZjktNjVmZTRlMGUyMjQzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY317_CR2,0,214,317_AL__QL50.jpg"},{"name":"Mahesh Manjrekar","role":"Michael ","link":"/name/nm0542498/?ref_=ttfc_fc_cl_i6","image":"https://m.media-amazon.com/images/M/MV5BMzY3NjAwOTAzN15BMl5BanBnXkFtZTgwNjUzMjgzOTE@._V1_UX214_CR0,0,214,317_AL__QL50.jpg"},{"name":"Kishore Nandlaskar","role":"()","link":"/name/nm0620816/?ref_=ttfc_fc_cl_i7","image":"https://m.media-amazon.com/images/M/MV5BODVkODQ2MGQtZjFmNS00ZDgxLWEwZjgtYzFiNWUxMmE5NzliXkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_UY317_CR20,0,214,317_AL__QL50.jpg"},{"name":"Sanjay Narvekar","role":"()","link":"/name/nm0621560/?ref_=ttfc_fc_cl_i8","image":"https://m.media-amazon.com/images/M/MV5BNzQ4NzRhMDAtOGRlOS00NTM0LTkyNDYtZWUzMjExNzA3ODMzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjgyOTU0ODU@._V1_UY317_CR131,0,214,317_AL__QL50.jpg"},{"name":"Neha","role":"Antra Pandit ","link":"/name/nm0624545/?ref_=ttfc_fc_cl_i9","image":null},{"name":"Shivaji Satam","role":"()","link":"/name/nm0766146/?ref_=ttfc_fc_cl_i10","image":"https://m.media-amazon.com/images/M/MV5BMTJjZTM4NDgtZDUwMC00MWE1LTg4ZDgtNWI2Y2QwOWYxY2QzXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY317_CR13,0,214,317_AL__QL50.jpg"},{"name":"Rakhi Sawant","role":"()","link":"/name/nm1179156/?ref_=ttfc_fc_cl_i11","image":"https://m.media-amazon.com/images/M/MV5BMTgwZDgwMzktYzFkOS00Y2ZjLTlhM2YtM2RiMmRhN2YzMmY4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY317_CR266,0,214,317_AL__QL50.jpg"},{"name":"Bhaskar Shetty","role":"()","link":"/name/nm0792899/?ref_=ttfc_fc_cl_i12","image":null},{"name":"Sunil Shetty","role":"Ravi Naik ","link":"/name/nm0792911/?ref_=ttfc_fc_cl_i13","image":"https://m.media-amazon.com/images/M/MV5BODUwMzUyNTUxMl5BMl5BanBnXkFtZTcwNDM2ODIyOA@@._V1_UY317_CR4,0,214,317_AL__QL50.jpg"},{"name":"Mayank Tandon","role":"Rohan Naik ","link":"/name/nm1091448/?ref_=ttfc_fc_cl_i14","image":null},{"name":"Neeta Thakkar","role":"()","link":"/name/nm1525268/?ref_=ttfc_fc_cl_i15","image":null}]}],"reviews":[{"heading":" A touching father-son saga","review":"Ehsaas (feeling) is the story of a widower - Ravi (Sunil Shetty) who could not fulfil his dream to become an ace athlete but now wants his son - Rohan (Master Mayank Tandon) to fulfil that and get everything in his life which he (the father) could not get. For this purpose, he behaves with him like a strict disciplinarian without caring for the fact that his harsh attitude is taking his little son mentally away from him. The child, Rohan has started disliking his father and a rift has propped between the father and the son which is not known to the loving father. A divorcée lady, Antara (Neha) lives in the neighbourhood of Ravi with her mother (Kiran Kher) and though she has a liking in her heart for Ravi (in addition to her affection for little Rohan), she does not approve of the highly strict approach of his towards Rohan. Ravi is training Rohan for a race and arranging all the requisite facilities and equipments for him despite his limited earnings and financial resources. Ravi's dream of seeing his son winning the race is shattered with an accident of Rohan. Firstly, Ravi is misunderstood by both his son as well as Antara. However Rohan realizes his father's love for him and he reciprocates it by participating in the race despite his injury. He is not able to win the race but the heart of his proud father. The ending scene unites Ravi and Antara also when both of them realize their love for each other and the pain they would feel if distanced from each other.Ehsaas is the movie of Mahesh Manjrekar whose maiden directorial venture - Vaastav (1999) was a box office hit and fetched best actor awards for Sanjay Dutt. After that formula-based movie, Mahesh Manjrekar directed some low budget but down-to-earth, realistic and touching movies. Ehsaas is one of them. It was not a box office grosser. However this simple movie is touching and lovable. The father-son relationship is the premise of the movie and the coconut like character of the father (hard when looked from outside but very soft inside) is heart-conquering. By my own experience, I know that a loser always wants his progeny to be a winner in his / her life and that's how I am able to relate to the character and the story. No loving father wants his son / daughter to come across the losses, deprivations and frustrations that he has undergone in his life.The movie emphatically underscores this fact that despite the love for the child and a desire for the betterment of his / her life, the parents have to understand child psychology and mould their own approach and behaviour according to the situation and try to avoid hurting the feelings of the little one. A child may not be mature enough to understand your intentions but you should be mature enough to understand his feelings. Military-like discipline is good for long run but demonstrating your love and affection for the child is equally important. Understand him / her, lest he / she should misunderstand you.Through the indirect and unspoken love of Ravi and Antara for each other, the director has demonstrates the human aspect of life with finesse. Saying 'I love you' is not required (it appears stupid also for mature people) but it's better if the sentiment is conveyed through gestures at least. Ravi feels his love for Antara when she is about to depart for US, thinking that Ravi will always remain ignorant of her feelings. The happy ending tells that small joys are always scattered around us which can be turned into big ones by ourselves.The climax in which Rohan participates in the race despite being physically unfit, is quite impressive and touching. The director has kept the movie realistic by showing that injured Rohan is not able to win or complete it though he could have gone for a filmy climax by showing him as winning it. I admire his better sense which has kept this movie down-to-earth and reliable.The production value of this low budget and simple movie is bound to be modest. However technically, the movie is good. The cinematographer has captured the real life of the countryside of Goa (where the story is set) and the natural beauty prevailing there fantastically. Editing is also good though the length of the ending scene could have been curtailed.Whatever may be people's opinion about Sunil Shetty, I have always been his admirer. He has delivered a very impressive performance in the role of the father who dreams big for his son but hides his true love from him and allows his strict and disciplinarian form only to appear before him. Master Mayank as the little son is equally impressive who finally comes to realize his father's love for him and then demonstrates to him that his love for the father is in no way any less. Neha, Kiran Kher, Shivaji Satam, Sanjay Narvekar, Rakhi Sawant etc. all have quite done admirably to support the father-son duo.Anand Raj Anand's music is good. In my opinion, Yeh Kaisa Ehsaah Hai sung by Sonu Nigam and Sunidhi Chauhan is the best from the album. However the other songs are also good to listen (and feel if you pay attention to the lyrics). The songs of this movie were not chartbusters but listening to them provides a soothing experience to the listener's heart.Ehsaas is an out and out simple movie sans all the formulae viz. romance, comedy, action etc. Hence this sentimental movie is not for those who like to see larger than life characters and situations on the screen.It's for sentimental people like me. I recommend this a decade old underrated movie to the viewers liking emotional family dramas and willing to learn something about fostering of the children.","imdb_rating":0,"our_rating":0,"algo_label":0},{"heading":" Ehsaas-Truly A Great Movie","review":"Suniel Shetty's Best Film Is Ehsaas(2001)The End 30 Minutes Are Truly Wonderful,A Brilliant Sports Movie Overall.I Wish Filmmakers In India Make More Movies Like This.Neha Looked Cute In This And Suniel Shetty And Mayank Tandon Acted Fine And Well,Locations Of Goa Are Cool.Story-Screenplay By Deepak Kulkarni Are Simply Superb,So Is The Direction.The Scene In The Climax When Suniel Shetty Tells His Story Is Very Emotional.Overall A Great Film In Every Sense- 10/10.","imdb_rating":10,"our_rating":0,"algo_label":0},{"heading":" Father and son story","review":"One nice thing about this movie is that it's set in Goa (Portuguese colony in India up to 1961), and much of the action takes places in two neighboring beach-side villas. So one side topic is Catholicism - the two servants, Joe and Maria, wear cross pendants around the neck, and talk about going to church (though we never see that); most of the schools at the local track & field contest are named after saints.But most of all, it's an interesting character study of a widowed father (Sunil Shetty) who projects his sportive ambitions into his 10 year old son to a degree that might be considered torture. A sports drama develops, plus the long lingering romance(s) finally find their expectable conclusion, of course...I've seen Bollies that gave me more enjoyment (for instance, no action scenes here, and not much comedy), but I think this one is a decent, somewhat realistic piece, with the father-son relationship, and their talks, giving me most food for thought. I'll watch it again.","imdb_rating":7,"our_rating":0,"algo_label":0},{"heading":" Quite good","review":"This movie is quite good, but not fantastic. Suniel Shetty plays a poor widower with a young son. He pushes the son to achieve at running, controlling his life and making him work so hard that the son thinks of him as 'Hitler'. A young widow (Neha) lives with her mother next door and takes an interest in them, eventually leading to a love story. Suniel's character isn't very likeable for the first part of the movie, although his motives are explained later. The movie is alright for passing the time.","imdb_rating":0,"our_rating":0,"algo_label":0}],"imdbId":"tt0302524"}