[{"review":"I saw this movie 14 years after it was made. I wish this movie could be re-released today, the time when article 370 has been revoked by the government of India in Kashmir. The movie depics how everyday life of ordinary kashmiris is fraught with uncertainty in a state torn between two factions - entities that spread terror and an army that's trying to keep peace but has not been able to win trust   of its citizens. The touching love story that's woven around the theme makes it hugely watchable.","label":0},{"review":"A very well thought and well executed movie...movie was made 10years back but is still so refreshing and contemporary. Shoojit Sircar at his best..one of the finest film maker. I fail to understand why it didn't connect with the population and didn't find a good market for the film.","label":0},{"review":"I loved this movie the moment I'd watched it. I didn't know it was Shoojit Sarcar's film and didn't know much about him until I watched Vicky's donor, Pink, Piku and now October. During October's interview I came to know that one of my all time favourite love stories was also made by the same guy. It's a beautiful film, subtely made and Kashmir adds too much beauty to it.","label":0},{"review":"This movie I saw in 2019 .\nI think I love this movie as much as Roja by Mani Ratnam sir. \nJimmy u rock great job \nMinissha lots of love for wonderful acting \nThe small kid shri good actor \nEvery scene is great \nMusic is the best \nLoved the movie \nSoojit please make one more movie now after article 370 is removed. \n\n\nPlease make it","label":0},{"review":"I loved this movie it is wonderful  message to all wars... It's Love. Love is the only solution. Superb acting by minissha and Jimmy..\nGr8 movie superb story... Congratulations to makers they have done good job.","label":0},{"review":"My fav movie of all time.. I don't know how many times i have seen it but always feel fresh.. Jimmy has done wonderful job.. Love this movie","label":0},{"review":"I have read somewhere that one should not miss this movie.So recently I saw this movie and.    What a movie.I have never seen such a beautiful movie.A fine combination of Love and patriotism.It is a pity that such a wonderful movie could not get the complete attention of many.Certainly I will see this movie again.","label":0},{"review":"Awesome complication and execution.. Watching in 2019 doesn't anywhere make it feel being shooted way back in 2005.. Huge accolades to the whole team..","label":0},{"review":"Very very good and loving movie because this movie shows  a Kashmiri girl fall in love with an Indian army captain aman.Jai Hind 🇮🇳","label":0},{"review":"A very special movie for me..Very well shown the situation where Kashmiris are stuck..youths are misleaded to get into terrorism. Indian Army at it's best.","label":0},{"review":"Awesome...really I don't know that the film was done by sujit sarkar...he is really awesome....he is very unpredictable..love u sujit da😚😚😚👌👌👍👍","label":0},{"review":"One of my all time favourite movies. Favourite word is underrated","label":0},{"review":"Nice movie. Jimmy Shergill work is very good. I like the story also.","label":0},{"review":"Another wonderful movie from Shoojit sircar. It is all time watchable.","label":0},{"review":"not Extraordinary I would say,its just ohk movie with happy ending inspite adding the twist of HiNdu Muslim relation........","label":0},{"review":"This film goes on to show clearly that God created men and women irrespective of cast, creed or religious beliefs to live in harmony.","label":0},{"review":"Really loved this movie.. Excellent","label":0},{"review":"I just saw this movie and it blew me .. not sure why I could not watch it in last 14 years .. it is such a gem of a cinema .. deserve national awards, not sure if it got any ..","label":0},{"review":"Yahan will go on refreshing and surprising you beyond the limits of time.","label":0},{"review":"A class movie.. shoojit sircar is the finest director of bollywood.","label":0},{"review":"Just Awesome.. great script. Must watch.","label":0},{"review":"Overall good romantic movie enjoyed it","label":0},{"review":"Excellent movie","label":0},{"review":"Awesome movie","label":0},{"review":"Unmatched , unparalleled!","label":0}]