[{"review":"I have never seen any movie with such concept. I am proud of the director and south film industry for thinking such creatively. This film wasn't much talked about but it deserves all the appreciation. The story and the execution both were next-level. To go with it was superb acting by Madhavan who has done a more than wonderful job. Music was not that good but who cares when you've all the other things just right. The intriguing and spellbinding quotient of the film is just Wow. Yeah yeah, myste ...MORE","label":0},{"review":"I have never seen any movie with such concept. I am proud of the director and south film industry for thinking such creatively. This film wasn't much talked about but it deserves all the appreciation. The story and the execution both were next-level. To go with it was superb acting by Madhavan who has done a more than wonderful job. Music was not that good but who cares when you've all the other things just right. The intriguing and spellbinding quotient of the film is just Wow. Yeah yeah, mystery-thrillers and horror-dramas do get their audience guessing but this was something else. Right from the first shot you'll stick to wherever you would be sitting and after the last shot you'll simply say, WHAT-A-MOVIE. RATING: 4.25/5 !!","label":0},{"review":"Such a fun movie it does start slow but then when it gets to the rising action, it literally keeps you on its toes... It's not traditional horror, it's slow creepy atmospheric horror which was my first exposure to it. It's great, must watch!","label":0},{"review":"Just finished watching this movie. What an amazing movie. The director has done a marvelous job. Right from the beginning, it gets you hooked. Madhavan's work in this movie is worth mentioning, great acting.","label":0},{"review":"13B. This movie should've been sort of a trend setter. But sadly that didn't happen. The best part of the movie was thriller mixed with horror though the ending felt a bit bland but it was suitable. At first I didn't really like the shaky cam but got used to it and it became an integral part of the movie.","label":0},{"review":"The movie was excellent. Madhavan and Everybody acted very well in the movie. Songs and BGM in the movie were also very good in the movie. One of the scariest movie I have ever seen. The movie is very thrilling and interesting.","label":0},{"review":"this horror suspense thriller is a must watch for everyone who loves this genre.. brilliant way to story telling without any over dramatic like typical horror movies of bollywood or South..... Unfortunately it didn't get the appreciation it deserved!!","label":0},{"review":"Unique experience \n\nYou’ll get glued, may scratch your head but the ending is worth the wait.\n\nWe need more movies like this !\n\nThis flick easily beats Hollywood Horror movies.","label":0},{"review":"It was the awesome movie. Horror movie. Very much thrilling and excited and Maddy acting is superb. Hats off to every one who acted in the movie and hats off to director too","label":0},{"review":"A fabulous thriller horror movie with a great direction. Suspense in the movie creates more excitement . R Madhavan is amazing.","label":0},{"review":"Brilliant Film One the best ghost films I had Watched  Awesome  acting from  Madhavan Sir  and Awesome Debut from  Vikram Kumar Sir.  Climax is Outstanding","label":0},{"review":"Its not like the stereotypical horror films usually made in Bollywood..Its very unique and really has an impressive story line..Will surely give u an edge-of-the-seat experience..\nNice one.. 😊","label":0},{"review":"I can't understand why this movie is soo underrated, It's is an awesome movie and it deserves 8.2 rating. Don't be fooled by it's rating otherwise you miss very unique experience.","label":0},{"review":"The Concept of the movie was very unique and not common it is very relatable with our daily life and i loved this movie........ \nEspecially connecting the movie with serial was awesome.....","label":0},{"review":"After each and every once in month most wanted type we as well our family member watch this one very calm quietly watchone.thanking you","label":0},{"review":"It,s horror and suspence movie. Nice acting. Story is interesting, if u like suspence ,u should watch it. I like this movie. :-)","label":0},{"review":"I have watch this movie just an minute ago \nI truly said that I was the greatest fully supencable movie .I really appreciated that man who have written this plot of the stoy .\n🔥","label":0},{"review":"I think that the movie was really fake and I thought before watching the video it was horror but I didn't find is so terrifying .SO IF YOU ARE THINKING TO WATCH THIS MOVIE ITS A COMPLETE NOOOOO.","label":0},{"review":"Great Movie. Madhvan acted so well. The Story Was Engaging The Plot Was Well Written. Enjoyed The Movie A Lot.","label":0},{"review":"One of the best horror thriller movie . It's very unique . One of the best movie of Maadhavan. I have amused.","label":0},{"review":"Nice movie, fresh concept and thriller. You will see the suspense. I love it, everyone should watch it.","label":0},{"review":"I just watched it! What an amazing movie. Really good direction and subject. I loved it!","label":0},{"review":"This is the best thriller movie i have seen ever . Such a mindblowing story.","label":0},{"review":"Amazing.. actually you'll not believe that 13B is the first horror movie I've ever seen in my life!!!","label":0},{"review":"This movie needs a sequel..one of the best indian thriller movie it is...Yes i repeat i still do watch it sometimes","label":0},{"review":"13B Fear has a new address I love this film because horror  thriller suspense movies I give like","label":0}]