[{"review":"Very nice film. The handling is superb. The technology touch given is very high class considering those times (2002). Great work by Manishankar and all team.\n\nDanny, Milind Soman, GG and all others have done their best.\n\nDil mera ek tara is a beautiful song.\n\nBackground score is up to the level of perfection.\n\nIn my view, this is really a master piece.","label":0},{"review":"It's quite good movie all time. All the characters played a vital role in their side. Whenever I watched the movie I never get bored, I am much impressed by the acting of Dost khan(Gulshan Grover) as well Victor.. That's all..","label":0},{"review":"On the 8th of December, the Bengali nation remembered with deep respect and love the great victory and honor of the children whose sacrifices were acquired in exchange for our dear independent Bangladesh ..... 🇧🇩🇧🇩 Humble respect for all the martyred freedom fighters ..... ♥️♥️","label":0},{"review":"there is some movie which is very good. but lake of Superstar the not too famous. one of these movie really awsome","label":0},{"review":"A good movie who loves spy or jasoosi movie, spy appliances,not very welknown stars but a bundle of very good actors acting r amazing...in one word...a mission movie.","label":0},{"review":"It is the good movie in the Indian history...for remembering our nation to know how to beat by terrorist..and save them...","label":0},{"review":"Fabulous, mindblowing movie!!!! Just saw it again and was glued till the end. Superb acting 👍👍👍","label":0},{"review":"It is really fantastic movie which got very low publicity.The movie shows real position of Indian politicians. Hats off.","label":0},{"review":"My Birthday Today 16-12-2018 Thanks For Perfect Date Doodle\n& This Movie is good Jay Hind","label":0},{"review":"Awesome movie. One of the finest bollywood movies","label":0},{"review":"16 th December,  a New Independent Nation was Born ably aided by my Motherlannd.","label":0},{"review":"A disaster movie.. They tried to do something and the movie is something else.. 16 /06 /19","label":0},{"review":"watching right now after a couple of years\nstill love it👍👍👍","label":0},{"review":"One of the finest action movie of Bollywood \nMust watch","label":0},{"review":"The movie was ahed of its time.. very well written and executed","label":0},{"review":"Excellent movie,I can see any time..","label":0},{"review":"Economics and terror mixture...Must watch... India's at her best... Thank you.","label":0},{"review":"I saw this movie 50 times i like it very much","label":0},{"review":"Very nice movie and inspiring","label":0},{"review":"Truly fantastic","label":0},{"review":"Awesome movie","label":0},{"review":"great work.. ahead of its time","label":0},{"review":"Fantastic one","label":0},{"review":"AWESOME MOVIE","label":0},{"review":"Good movie,must see","label":0}]