[{"review":"I like horror movie. 1920 is scary at some parts and funny at some. It's a thumps up to all horror movie lover. You will like it. But I warn you it's not sheer scary as I said some parts may look funny or boring. But still it's a good piece to watch. The acting is commendable especially Adah's.","label":0},{"review":"This movie is fantastic no other movie is look alike this movie I am 15 yrs old I saw 178 horror movies Hollywood and Bollywood but nothing Is like it best story line graphic designs. Are good fantastic work I appreciate your work","label":0},{"review":"Great movie, i dont think there is any other horror movie in bollywood which is equal to this, we know that there are only dull and boring horror movies in bollywood with waste storyline but this one is perfect.","label":0},{"review":"This is fantastic movie. Music ans starcast also verry nice. And rajneesh duggal is verry charming","label":0},{"review":"This is example of a best horror movie hats of vikram bhatt sir story is good and fresh acting is good script is strong and direction is nice.","label":0},{"review":"All time favourite movie of mine. Everything was perfect in this movie, star  cast also was perfect. In short.  .........incredible","label":0},{"review":"With a very good storyline it's the best horror movie in my opinion","label":0},{"review":"It's horror but nice. I loved it because i like horror movies.","label":0},{"review":"One of the best bollywood movies.. ada sharma does grt justice to her role...","label":0},{"review":"I was a little kid when i watched it first time  it was one of my favourite movie","label":0},{"review":"Bollywood most horor movie this movie has a great story don't dare to watch alone","label":0},{"review":"In one word , the movie is just fabulous...no other bollywood horror movie is better than this....","label":0},{"review":"Undoubtably Best horror movie till date in Bollywood....story is amazing","label":0},{"review":"It was a  an awesome movie in my life","label":0},{"review":"in the song vaada tumse hain vaada , the husband wife relationship was beautiful","label":0},{"review":"Abhishek I am watching it alone , \nlet's meet in next life","label":0},{"review":"All time favorite film\nA nice Horror movie","label":0},{"review":"one of d best horror movie in bollywood","label":0},{"review":"This movie is very nice and simple.","label":0},{"review":"Greatest horror movie in bollywood","label":0},{"review":"This is haunted movie I liked this film","label":0},{"review":"Why this movie name is 1920?? Why not other year?Is anything real story occurred in this year?","label":0},{"review":"Nice movie i love horror","label":0},{"review":"One of the best movie","label":0},{"review":"I like this movie I love her Lisa arjun","label":0}]