[{"review":"The most interesting part of this movie is Aftab Shivdani's acting surprisingly good.\nCast- Aftab, Tia bajpai, Sharad Kelkar, and others.\nReview- It comes under same genra possessing and love triangle. But Tia Bajpai's acting was really good. The first half is bit slow but second not bad. Some thrilling moments, some scary moments, good songs all are in second half.\nConclusion-1920 evil returns is not as bad. One time watch able only becoz the second half has some interesting moments..","label":0},{"review":"One of the best horror movie I have ever seen..... Tia bajpai is my favorite actress... In this movie I found real love.... It was horrible and beautiful.... The story of the film was outstanding.....","label":0},{"review":"Plot was extremely weak and cringe-worthy. It didn't feel original or scary at all. It seemed like a cheap rip off of the original 1920 movie, which it was. I had the feeling that this movie was written and directed by an immature 5th grader.","label":0},{"review":"Good story. I am regular coustomer horror movie i said you you must watch this movie if you lover of horror movie and song is so good\n\nAmazing story","label":0},{"review":"One word Awesome . Full package movie great stroy line and dialogues, Songs are just incredible.. loved it 🤘","label":0},{"review":"Plot is not very strong and full of loopholes & discrepancies. Not very scary either. Good for timepass, though.","label":0},{"review":"This is a great horror movie      Tai bajpai madam is looking awesome with her great acting All songs are beautiful","label":0},{"review":"I love this song because it's remember  my. Girlfriend with natural dream s","label":0},{"review":"Awesome movie are songs good & Tia bajpai ki acting aachi thi","label":0},{"review":"I hope it`d be pretty good, just gonna watch it in a bit","label":0},{"review":"I love this film .Specially the queen is so beautiful 😍😘🤗","label":0},{"review":"good plot with talented actors and actresses with lovely songs and good direction.","label":0},{"review":"Very romantic horror story. Too much passion.","label":0},{"review":"ONE OF THE BEST SO FAR IN BOLLWOOD","label":0},{"review":"Good very interested movie and I like horror movie 😍😍😍","label":0},{"review":"Good awesome just I liked it","label":0},{"review":"Very horror full but also enjoyable","label":0},{"review":"Awesome movie and awesome songs","label":0},{"review":"Nice story to rise a evil. And scary too","label":0},{"review":"Nice movi all songs very nice 👌👌👌","label":0},{"review":"Good story & music was awesome.","label":0},{"review":"Best part of the series 1920","label":0},{"review":"Very good and thriller film","label":0},{"review":"Movie is average. But all songs are awesome...","label":0},{"review":"I love movie very dangerous and horror hd","label":0}]