[{"review":"To summarise it in a single line, i would've rather spent 3 hours re-reading the book than watching the movie. The movie definitely follows the book , yet the direction of the movie is vague. some pivotal scenes have either been entirely deleted or their importance has been drastically diminished (like the scene where krish finally gets accepted by ananya's father and mother). I personally am not a fan of chetan bhagat's writing skills, however, i did fall in love with the story in the book. how ...MORE","label":0},{"review":"To summarise it in a single line, i would've rather spent 3 hours re-reading the book than watching the movie. The movie definitely follows the book , yet the direction of the movie is vague. some pivotal scenes have either been entirely deleted or their importance has been drastically diminished (like the scene where krish finally gets accepted by ananya's father and mother). I personally am not a fan of chetan bhagat's writing skills, however, i did fall in love with the story in the book. however, the movie disappointed. The direction is bad and very vague. apart from pivotal scenes being deleted, a lot of times the editing of the movie too disappoints. for example, the song chandaniya, which has a peppy beat, plays during the saddest scene in the movie when ananya breaks up with krish. A lot of scenes depicted in the trailers and songs release online are not there in the movie,To add to the misery, Arjun kapoor has pretty much the same expression throughout the film. he looks bored and constipated. His extremely muscular look is out of place for a studious IIT-IIm nerd.\nAlia bhatt however, has perfectly adapted into this role. She look a tad bit young to be an IIM graduated, but she does play the role of ananya swaminathan pretty well. Even though I may have criticised this movie a lot but it  is worth a single watch.The songs of the movie are really good though, peppy, upbeat and really catchy!Shankar-ehsaan-loy have really outdone themselves with the music this time.","label":0},{"review":"This movie is one of my favorite movie. \"Love does not trap in religion boundaries it is beyond all of this\"movie gives this message. Allia and Arjun both  acted well and do justice with his character. I like the temperament of Allia Bhatt in selection of movies. This movie is a mixture of Love, Attraction, Sentiments, Feelings, Emotions, Determination and Dedication towards himself and each other family. This movie shows religion , tradition and customs of two different religion. All the songs  ...MORE","label":0},{"review":"This movie is one of my favorite movie. \"Love does not trap in religion boundaries it is beyond all of this\"movie gives this message. Allia and Arjun both  acted well and do justice with his character. I like the temperament of Allia Bhatt in selection of movies. This movie is a mixture of Love, Attraction, Sentiments, Feelings, Emotions, Determination and Dedication towards himself and each other family. This movie shows religion , tradition and customs of two different religion. All the songs are melodious especially the song sung by Benny Dayal . Too good direction by Abhishek Verman and effective work by his entire team .","label":0},{"review":"I love this movie and its my favorite one . I like Arjun kapoor and Alia bhatt a lot because of their choice of roles and movies.I like the story line , arjun kapoor is a punjabi and alia is a tamilian. They study in same college and become friends and their friendship gets converted into love.They convince their parents and finally get married. Chetan Bhagat novel 2 states is a excellent book. I overall rate this as 4.5/5","label":0},{"review":"Amazing movie. Actors acting were too good . Specially Arjun Kapoors he is improving his acting a lot . I think Arjun Kapoor is selecting good movies now a days. They given good message to us that those both new couples belong from different states . South Indian familes lead simple lifestyle like Bengalis and Punjabis shows off a lot like marwaris. Nice movie. Storyline direction was nice. Songs were real good.","label":0},{"review":"This movie was a perfect Indian  love story .In India family and society is more important than the true love story.Most of the relationship are not successful just because of different culture,caste,etc. Acting by Alia Bhatt and Arjun  Kapoor are absolutely realistic.How can i miss the songs.Every situation has a perfect song ..amazing movie..one of my favourite movie .","label":0},{"review":"Actually i got to see this movie very late , i missed one of the wonderful movies , bollywood audience always criticise bollywood but i think there are many good stories and this one movie can show the potential of bollywood  , emotion between father and son is top notch and the best . alia bhatt rocked it what an actress she is , just hatsoff to entire movie cast and crew.","label":0},{"review":"Nice movie having story about two people from two different states who fall in love and how they convince their parents to accept their love finally... Movie is full of entertainment and makes us understand that love knows no boundary and can grow even against all odds.","label":0},{"review":"watched 22 times and still I want to watch again and again. I don't know why I like this film so much is this because of Alia Bhatt? or any reason behind it? still, am searching for it, let's see when I will find my answer. lots of love from SOUMYA to the gorgeous ALIA BHATT. my favourite.","label":0},{"review":"My God!!!! I hv watched this movie 50 times and still dont mind watching it again!!!! A veerryyy beautifully made movie.... all characters have been played soo nicely!!!!! Really an irresistible kind of a movie..actually this movie deserves a 5 starrer rating!!!!!! Too good!!!👍👍👍👍","label":0},{"review":"This movie was a perfect Indain love story.In India family and society is more important than the true love story.Most of the relationship are not a success just because of different culture,caste,etc.The dilogue dilevery and acting by Alia Bhatt and Arjun Kapoor are absolutely realistic.How can i miss the songs.Every situation has a perfect song which definitely  blows our mind.It is a must watch movie and even 1 of my favourite.❤","label":0},{"review":"It is an excellent movie.... Must watch movie who love, love stories... It is one of my favorite movies mainly because of 2 reasons:\nFirst, it is a Arjun Kapoor😍Movie\nSecondly, it was released on my birthday","label":0},{"review":"Arjun Kapoor and Alia Bhatt you are so many exciting things happening in industry association good facility national movie\nSome of the best film and handsome man strong enough to good use and very happy\nRomance Alia Bhatt very good movie and handsome young man strong enough and handsome\nGreat movie nice directions from industry capacity","label":0},{"review":"Good movie emphasises the cultural differences, and shows us the problems faced by youth by inter caste marriage. Very good acting, and memorable characters.[Must watch before loving someone gives good idea to convince parents.😋]","label":0},{"review":"I really love it!!! All main character had done a marvelous job! 2 thumbs up to the producer, director, script writer & all!!","label":0},{"review":"Over acting of Alia Bhatt is on display and apart from Amrita singh and Ronit Roy, all other actors acting including Arjun Kapoor is average. Better than the movie, which conceal important facts, one should read / re-read the book.","label":0},{"review":"Refreshing love story, great acting by Alia Bhat. Good theme depicting commonly occurring situations these days. Great music too!","label":0},{"review":"This movie was a perfect Indain love story.In India family and society is more important than the true love story.Most of the relationship are not a success just because of different culture,caste,etc.The dilogue dilevery and acting by Alia Bhatt and Arjun Kapoor are absolutely realistic.How can i miss the songs.Every situation has a perfect song which definitely  blows our mind.It is a must watch movie and even 1 of my favourite.","label":0},{"review":"Very nice movie . The storyline is something different than other movies those are releasing nowadays . Nice movie. Just enjoyed it.","label":0},{"review":"Storyline is good ! \nThe movie is watchable.  Alia Bhatt's costumes by Manish \nMalhotra are to drool over !","label":0},{"review":"I am from Tamilnadu,,,  watched the mve just now,,,  tears automatically came in the climax 😆,,, love thz mve,,,  Tamil Hindi is not a matter love is all❤","label":0},{"review":"They even cant define love or fomality for girl.\nI have seen hundereds of movie of bollywood and hollywood but in this i have seen only the star no story.","label":0},{"review":"Ending of this movie gave me goosebumps... One of my favorite movies that can keep watching without getting bored.","label":0},{"review":"An amazing movie with beatiful couple nice story line everyone acted beautifully and of cource alia bhatt the beauty....","label":0},{"review":"The whole movie in single sentence:-\n\"Agar sUDDENLY... Ek saath sab kuch theek ho jay, toh life bahot boring ho jaye\"\n\nTranslation:-\n\"If, all of a sudden, everything becomes alright then life will be very boring.\"","label":0},{"review":"I love this movie because of Roni Roy as vikram Malhotra. He just nailed the character","label":0}]