[{"review":"Good movie, but not great like the legend of Bhagat Singh. I would’ve gave this movie 3 stars if characters like Sukhdev and rajguru had more footage in the movie. Bhagat Singh’s struggle was incomplete without these two characters. This movie did not show how Bhagat Singh incarceration and his hunger strike influenced public. The biggest flaw in this movie was when Chandrashekar died. In the movie police officers shot Chandrashekhar, but in real he shot himself. Political rallies and politics l ...MORE","label":0},{"review":"Good movie, but not great like the legend of Bhagat Singh. I would’ve gave this movie 3 stars if characters like Sukhdev and rajguru had more footage in the movie. Bhagat Singh’s struggle was incomplete without these two characters. This movie did not show how Bhagat Singh incarceration and his hunger strike influenced public. The biggest flaw in this movie was when Chandrashekar died. In the movie police officers shot Chandrashekhar, but in real he shot himself. Political rallies and politics like Nehru and gandhi’s Stance on Bhagat singh’s Ideology was not shown like it was shown in the legend of Bhagat. Finally, the legend of Bhagat Singh was the winner all the way. As for shaheed, I would rate this movie 2.5/5.","label":0},{"review":"Everyone should watch this movie once Best independence based movie\nBeautiful songs full of energy\nAny one can get emotional by watching this movie\n Salute to our Real Heroes","label":0},{"review":"Best Bhagat Singh movie forever Bobby Deol play Bhagat Singh role and Sunny Deol play Chandrasekhar Azad what a movie ...Nice movie ..you see this movie you must remember on that's period of time Lahore in our India's situated  ....","label":0},{"review":"Great movie the role of each character was fabulous. I could not stop my tears at many moments in this movie. \nJai Hind \nJai Bharat","label":0},{"review":"Awesome movie! I came to know a lot about Bhagat Singh & his ideologies. Thank you for making this movie.","label":0},{"review":"What a role play by the actors... I feel that I was there and try to smth for our nation","label":0},{"review":"I like this movie more than any other movies based on bhagat singh.\nReason:Songs,location of shooting.","label":0},{"review":"The memories of our freedom fighters from this fight against the Britishers. Jay hind","label":0},{"review":"We never forget d memories of our freedom fighters Bhagatshigh sukhdev rajguru","label":0},{"review":"I love this and i proud of bhagat singh sukhdev and rajguru","label":0},{"review":"The memories of our freedom fighters from this fight against the Britishers.","label":0},{"review":"Awesome mind blowing song...when ever I listen this song...I got full energetic.....","label":0},{"review":"This is my favourite movie for the legend Bharat Singh ever","label":0},{"review":"This is a best movie in the Bollywood","label":0},{"review":"This is a awesome movie","label":0},{"review":"Awsm movie and very very interesting","label":0},{"review":"Jai hind\nAnd proud to be an indian citizen","label":0},{"review":"I am proud of all my indian⛿⛿","label":0},{"review":"This is very powerful movie.","label":0},{"review":"Great movie","label":0},{"review":"Jai hind\nMy best movie.","label":0},{"review":"Good movie","label":0},{"review":"I proud freedom fighters","label":0},{"review":"Its a Nice Movie.","label":0},{"review":"Songs is very nice","label":0}]