[{"review":"3idiots; coincidentally without planning I watched 3Idiots with 3 idiots (including me;met accidentally nearby theatre). Mazaa masti romance tragedy humour means wholesale masala by genius Aamir saab & wise Raju sir .Raju is a fantastic director, his expression method of a story telling with humour is really outstanding extraordinary  .The masterpiece. U can see observe clearly in pk as in same with favourable message.  Many msgs lies herein. It's based on our ednl system through well-known  nov ...MORE","label":0},{"review":"3idiots; coincidentally without planning I watched 3Idiots with 3 idiots (including me;met accidentally nearby theatre). Mazaa masti romance tragedy humour means wholesale masala by genius Aamir saab & wise Raju sir .Raju is a fantastic director, his expression method of a story telling with humour is really outstanding extraordinary  .The masterpiece. U can see observe clearly in pk as in same with favourable message.  Many msgs lies herein. It's based on our ednl system through well-known  novel of chetanjee Five point someone. Aamirkhan said only 5 p.c. similarities with this novel.\n\nNever pressurise students to opt out as ur choice  but should be given right to choose their own edn-career  destination. Attention parents and teachers!!! Wrong decision may lead harm both physically and mentally  2 ur child. It's very mandatory lesson  for all of us. 3 idiots taught us this impt msg.    In my life,  parents forced me to study in Arts (intermediation).Then Economics Hons  (graduation). I compromised with my dream edn for parental advice blindly. My wish was intermediation  in commerce , then Graduation in English Hons,  but foundation smashed out.  As a result,  although 62 p.c. in Arts  but collapsed  4 Eco Hons (disliking subject), aggregate  marks  just 41p.c.Hons just 31 p.c (without hons).my all efforts times  went on Eco , very less time  saved 4 my fvt language literature.  Then parents said 2 MBA. But I answered big no undoubtedly. First time I realised  never compromise with  own dream-edn. Today I've built up my career as per own will.Formal higher-edn ,certificate is valueless 4 me.I've been already a writer poet social activist Astrologist Palmist psychologist spiritualist and huge AAMIRIAN in  my own way.This is my own original track .I don't want atall to compromise anymore. Meanwhile now I've firmly mindset \n\nSimilarly parents punished me for not doing homework, study properly, criticized  me in childhood.couldn't arrange  well atmosphere  based school  for their outlookless though they were educated Doctor Economist respectively. It is not meant that I've no love to them .sometimes extra hope optimist nature  may spoil  career  and mental growth of ur child , I meaned that .my personal experience. \n\nLove ,smile, mix,realise student's wish of brain as a intimate friend lovely. It's most vast thing atleast now-a-days.\n\nZindagi jeene ka maxad mukamal ho gaya.My appeal every human should watch atleast once in life ( mr.passionate  aamirsir's wonderful gift  3idiots).l watched 21 times till date  All memorable dialogues've stored  in my brain forever. Cinematography, visual quality  is so nice  to watch on screen, eyethrilling.mindblowing   spot  like shimla Ladakh. Music is well touched  specially \"Aal izz well\". Personally  've  tryed so many times A I W like Rancho at my troubled circumstances;  it functioned so amazingly , believe me truly. Something courage  supplier to  fight out issues.\nRancho studied 4 pleasure satisfaction  knowledge, building machines rather than achieve degree certificate job money life style . \"Don't run after success,success 'll run automatically after  you \". This quote is appropriate  4 Rancho vs chatur .Rancho invented  a power inverter and utilised through car battery  during unfavourable condition like labour pain . Engineers delivered smartly .so, practical knowledge is greater than book knowledge  & appropriates  4  Rancho vs biru  \"why astronauts didn't use pencils in space ?\"  Ultimately prize pen of teacher went into Rancho's pocket .This picture reminds us pure friendships bond. My desire is have'nt any Rancho farhan raju in study days.Unfulfillment. \n\n\nRancho character is  well similarities  with Aamirsir in many ways in real .\n\nBy th by, AAMIRKHAN SIR TOUCHED LIVINGLY THE COLLEGE BOY ROLE AT 44  .ALL MY LOVE RESPECT  THANX TO \"AAMIRKHAN SIR\" LARGELY...LET'S ENJOY. BEST OF LUCK \nWITH.LOVE.💋🖎","label":0},{"review":"3 idiots is a good example for students who believe on ratta .\nThe film begins with entry of threesome idiots in the city's elite engineering college. It takes the first trust with the mandatory ragging session  which enunciate who the leader of the gang is going to be: new entrant Baba Rancchoddas, as his friends fondly call him. Rancho not only leads his friends through the maze of India's competitive, high-pressure, rote-heavy, illogical and almost cruel education system, he tutors them on se ...MORE","label":0},{"review":"3 idiots is a good example for students who believe on ratta .\nThe film begins with entry of threesome idiots in the city's elite engineering college. It takes the first trust with the mandatory ragging session  which enunciate who the leader of the gang is going to be: new entrant Baba Rancchoddas, as his friends fondly call him. Rancho not only leads his friends through the maze of India's competitive, high-pressure, rote-heavy, illogical and almost cruel education system, he tutors them on several life mantras too. Like, running after excellence, not success; questioning not blindly accepting givens; inventing and experimenting in lieu of copying and cramming; and essentially following your heart's calling if you truly want to make a difference.\n\nSo, you have the threesome embroiled, time and again, in a confrontation with authority, as represented through the domineering figure of Viru Sahastrabuddhe (Boman Irani), the unsmiling Principal who venerates the cuckoo because the bird's life begins with murder. Kill the competition, because there is only one place at the top, believes the Princi. Poor, mistaken Princi! Doesn't he know that competition is effete, model students like Chatur (Omi) end up as duhs in real life and non-conformists (Rancho and Rocket Singh Inc), who care tuppence about being on top, could end up as eventual winners. More importantly, they could be high not only in IQ (intelligence quotient) but in EQ (emotional quotient) too, never losing their humaneness and social networking skills.\n\nThe high point of the film is the fact that director Rajkumar Hirani says so much, and more, without losing his sense of humour and the sheer lightness of being. The film is a laugh riot, despite being high on fundas. Certain sequences almost have you rolling in the aisle, like the ragging sequence, Omi's chamatkar/balatkar speech, the threesome's wedding crasher sequence, their mournful meal with Raju's mournful mum and Rancho's sundry demos to prove how Kareena has chosen the wrong guy for herself. Add to this, the strong emotional core of the film that makes gentle tugs, now and then, at your guts, and you have an almost perfect score. Hirani carries forward his simplistic `humanism alone works' philosophy of the Lage Raho Munnabhai series in 3 Idiots too, making it a warm and vivacious signature tune to 2009. The second half of the film does falter in parts, specially the child birth sequence, but it doesn't take long for the film to jump back on track.\n\nAmongst the performances, Aamir Khan is stupendous as the rule-breaker Rancho. But the rest of the cast doesn't remain in the shadows. Both Sharman and Madhavan manage to carve their independent characters as lovable rebels too. Even Kareena shines out, despite the minuscule length of her role. A special mention for Boman Irani who is impeccable as `Virus', the vile Principal and newcomer Omi who perfectly slips into the stereotype of the best, albeit bakwas student. Shantanu Moitra's music score, which may have sounded pheeka in the audio version, comes alive on screen with lyricist Swanand Kirkire giving India its clarion call for 2010: Aal Izz Well. Rush for it","label":0},{"review":"3 Idiots looks at our educational system which pressurizes the students and does not allow to chose his destination by his own wish, in a satirical way and brings out some of the flaws in it... On parallel there is a love angle between Rancho and Pia (Kareena)... Many of the situations/characters have resemblance or inspiration to \"Five Point Someone\", blockbuster novel penned by Chetan Bhagat...\n\nBoth humour and emotional quotients are amalgamated in the right proportion, full credits to Raju f ...MORE","label":0},{"review":"3 Idiots looks at our educational system which pressurizes the students and does not allow to chose his destination by his own wish, in a satirical way and brings out some of the flaws in it... On parallel there is a love angle between Rancho and Pia (Kareena)... Many of the situations/characters have resemblance or inspiration to \"Five Point Someone\", blockbuster novel penned by Chetan Bhagat...\n\nBoth humour and emotional quotients are amalgamated in the right proportion, full credits to Raju for that... Film offers lots of quality rib-tickling moments throughout.. The intermission point offers a twist that is totally out of the blue and keeps you hooked to the movie ! Just when you think this feel-good comic caper is leading to its culmination, there is another surprising element at the climax which is brilliantly weaved out by Hirani...\n\nTechnically, it rocks with astounding and visually arresting cinematography, the aerial shots of Shimla and Ladakh are a pleasant treat for our eyes... Editing was good... Song visualizations were cool... Music was good and well placed with the flow of the narration...\n\nComing to performances, all of them comes out with convincing portrayals, but it is Aamir Khan, the real showman of Bollywood, steals the shows with yet another stellar portrayal and will go down as one of his best performances. His looks and mannerisms as a college student was genuine and consummate.. Madhavan and Sharman adds up with commendable performances... Kareena does her part well... Among the supporting, Boman Irani as the eccentric head of the institution was too good.","label":0},{"review":"How so sweet very fantastic movies\nEntertainment meng tip class, no doubt. \n\nFor young students who got inspired, impresses or carried away by \"Rancho\" character.....And Raju, Darshan.....Some missing links to remember. \n\n1. Book definitions - they didn't tell what kind of definitions were wrote in exam by Rancho, which got him 1st rank in varsity. Were they simple definitions like \"pant ki zip\" or book definitions? \n\n2. Wild life photography: they didn't tell whether there is any degree availab ...MORE","label":0},{"review":"How so sweet very fantastic movies\nEntertainment meng tip class, no doubt. \n\nFor young students who got inspired, impresses or carried away by \"Rancho\" character.....And Raju, Darshan.....Some missing links to remember. \n\n1. Book definitions - they didn't tell what kind of definitions were wrote in exam by Rancho, which got him 1st rank in varsity. Were they simple definitions like \"pant ki zip\" or book definitions? \n\n2. Wild life photography: they didn't tell whether there is any degree available in photography, at least a graduate or you need to live as a non-degree holder? \n\n3. They didn't tell which corporate recruits from campus a student w/o any first-class? Other than quotas? Not even having sports certificates!!\n\n4. They didn't tell the Road from a non-degree holder to a top class innovative research organization, who can place sign deals with Chatur's company worth millions of  dollars in 6 years span. What was the hardwork involved, what sacrifices made? This message is missing. End is hurried up as ALL IS WELL. \n\nIf kids learnt (and they do) from the movie, it's half baked truth....., rather misguiding too. \n\nHard work message is eliminated and replaced with entertainment!\nUnchecked boxHelpful? • 71 people found this helpful.","label":0},{"review":"Entertainment meng tip class, no doubt. \n\nFor young students who got inspired, impresses or carried away by \"Rancho\" character.....And Raju, Darshan.....Some missing links to remember. \n\n1. Book definitions - they didn't tell what kind of definitions were wrote in exam by Rancho, which got him 1st rank in varsity. Were they simple definitions like \"pant ki zip\" or book definitions? \n\n2. Wild life photography: they didn't tell whether there is any degree available in photography, at least a gradu ...MORE","label":0},{"review":"Entertainment meng tip class, no doubt. \n\nFor young students who got inspired, impresses or carried away by \"Rancho\" character.....And Raju, Darshan.....Some missing links to remember. \n\n1. Book definitions - they didn't tell what kind of definitions were wrote in exam by Rancho, which got him 1st rank in varsity. Were they simple definitions like \"pant ki zip\" or book definitions? \n\n2. Wild life photography: they didn't tell whether there is any degree available in photography, at least a graduate or you need to live as a non-degree holder? \n\n3. They didn't tell which corporate recruits from campus a student w/o any first-class? Other than quotas? Not even having sports certificates!!\n\n4. They didn't tell the Road from a non-degree holder to a top class innovative research organization, who can place sign deals with Chatur's company worth millions of  dollars in 6 years span. What was the hardwork involved, what sacrifices made? This message is missing. End is hurried up as ALL IS WELL. \n\nIf kids learnt (and they do) from the movie, it's half baked truth....., rather misguiding too. \n\nHard work message is eliminated and replaced with entertainment!","label":0},{"review":"This movie doesn't need a review, everyone has seen it and everyone knows how awesome, creative, mind boggling, thought provoking, funny, emotional movie this is! It has all the elements you would want in a movie you don't wanna forget for the rest of your life! An evergreen comedy movie with strong acting, memorable characters, some thought provoking scenes, a brilliant storyline and most importantly, highly motivational movie to choose the right path in your life. This movie is my personal fav ...MORE","label":0},{"review":"This movie doesn't need a review, everyone has seen it and everyone knows how awesome, creative, mind boggling, thought provoking, funny, emotional movie this is! It has all the elements you would want in a movie you don't wanna forget for the rest of your life! An evergreen comedy movie with strong acting, memorable characters, some thought provoking scenes, a brilliant storyline and most importantly, highly motivational movie to choose the right path in your life. This movie is my personal favourite. No movie ,even any Hollywood film doesn't come even close to the feel this movie generates, and how brilliantly this movie is blended with all awesome elements to create it a cinematic masterpiece!","label":0},{"review":"I love this movie a lot , all time favorite one and i have watched this movie more than ten times. I like the story line because its related to education and instead of mugging up things , we should understand the concepts and learn. I love the actors specially amir khan and kareena kapoor , I was lucky to see the first day show of 3 idiots in delhi. Well the title of this post says it all. I would rate it as among the best from amir khan (which obviously means among the very best from bollywood ...MORE","label":0},{"review":"I love this movie a lot , all time favorite one and i have watched this movie more than ten times. I like the story line because its related to education and instead of mugging up things , we should understand the concepts and learn. I love the actors specially amir khan and kareena kapoor , I was lucky to see the first day show of 3 idiots in delhi. Well the title of this post says it all. I would rate it as among the best from amir khan (which obviously means among the very best from bollywood. I would also give a lot of credit to the director rajkumar hirani,  should rank as among the top in bollywood too  9/10.The movie is an example of classic film making- brilliant and highly entertaining.","label":0},{"review":"I love this movie. This movie is inspirational. It tell us that  , studying for getting marks has no point. We have to gain that knowledge. You should chose a career in which you are most intrested.\n              I love the character rancho which is potrayed by Amir Khan. His character inspires us to be optimistic in tough times. His focus was good. He had helping nature as well as he always thought out of the box and was very inovative. He loved the path he chose and therefore was able to excel ...MORE","label":0},{"review":"I love this movie. This movie is inspirational. It tell us that  , studying for getting marks has no point. We have to gain that knowledge. You should chose a career in which you are most intrested.\n              I love the character rancho which is potrayed by Amir Khan. His character inspires us to be optimistic in tough times. His focus was good. He had helping nature as well as he always thought out of the box and was very inovative. He loved the path he chose and therefore was able to excel in his field. We should learn from him his qualities which will be help us in  becoming successful in a path we chose.","label":0},{"review":"THIS IS A WELL-CRAFTED FUN-FILLED MYSTERIOUS MANHUNT STORY BY VINOD CHOPRA!!I\n3 IDIOTS is about a VERY RICH and TALENTED KID RANCHOD DAS a.k.a RANCHO, who is fascinated by engineering and joins an ENGINEERING COLLEGE., Eventually he ends up as a ROOMMATE to two other STUDENTS who are from different contexts of life.,Three of them explore the life of engineering in a fun-filled way and FOLLOW  their PASSIONS with RANCHO'S HELP inspite of their complicated situations!They depart without bidding fa ...MORE","label":0},{"review":"THIS IS A WELL-CRAFTED FUN-FILLED MYSTERIOUS MANHUNT STORY BY VINOD CHOPRA!!I\n3 IDIOTS is about a VERY RICH and TALENTED KID RANCHOD DAS a.k.a RANCHO, who is fascinated by engineering and joins an ENGINEERING COLLEGE., Eventually he ends up as a ROOMMATE to two other STUDENTS who are from different contexts of life.,Three of them explore the life of engineering in a fun-filled way and FOLLOW  their PASSIONS with RANCHO'S HELP inspite of their complicated situations!They depart without bidding farewell to each other, untill after few years the TWO ROOMATES OF RANCHO SET TO FIND HIM AGAIN as he goes MISSING AFTER THE CONVOCATION DAY., END UP FINDING RANCHO AND AMUSED AS HELL!!\nNOTE:: IF YOU MISS IT YOU'RE GOING TO REGRET IT(when you find out how good movie this was!!)","label":0},{"review":"Amazing movie. Actors acting were real good specially boman Iranis virus role was superb he was playing that act in natural way too good. Dialogues were motivational and they have given us true message that we study only for getting marks otherwise we will not get  any job.  Our thinking quality is like that that's why our mentality is like that and we are illetaret . In real life also 90 percent students commenting sucide due to pressure of education. Our country education system is not develop ...MORE","label":0},{"review":"Amazing movie. Actors acting were real good specially boman Iranis virus role was superb he was playing that act in natural way too good. Dialogues were motivational and they have given us true message that we study only for getting marks otherwise we will not get  any job.  Our thinking quality is like that that's why our mentality is like that and we are illetaret . In real life also 90 percent students commenting sucide due to pressure of education. Our country education system is not developed at all. That's why everybody hates studies. Nice movie.","label":0},{"review":"I will never forget each nd every dialouge of this movie till my last breath.This film really justified the condition of students in India and after all a perfect combination of love ,friendship nd innovative thinking of student.very practical nd very very motivational movie i hv ever seen...\nA big salute to three genius of  our cinema Amir khan & Raju hirani &  vidhu vinod chopra..3 idiots us a Unforgettable cult movie...A milestone.. exposed education system ... Delivered a great message to so ...MORE","label":0},{"review":"I will never forget each nd every dialouge of this movie till my last breath.This film really justified the condition of students in India and after all a perfect combination of love ,friendship nd innovative thinking of student.very practical nd very very motivational movie i hv ever seen...\nA big salute to three genius of  our cinema Amir khan & Raju hirani &  vidhu vinod chopra..3 idiots us a Unforgettable cult movie...A milestone.. exposed education system ... Delivered a great message to society ...A masterpiece","label":0},{"review":"Still one of the best movies ever made in bollywood. Honest effort to show drawbacks and shortcomings of our so called education system. What a representation of friendship, superb song, story. No words literally no words for dis awsome movie. Must watch. Even after 10 yrs still i can choose it over any other movie.","label":0},{"review":"One of the best movie I have had ever seen... Totally based on real situation that a student can face every single step of his student life and it shows that how talent and intelegency can breaks the hard work...\nThere is not a single unreal scene here, and we learn that one man should choose that, which he likes from his own mentality not by pressure...\nSimply outstanding movie...","label":0},{"review":"One of my favourite movies of all time. Never gets old. I can keep watching this throughout my life. The comic timings of the characters, oh my god, still makes me laugh hysterically.\nThis film is a wild ride of emotions.You laugh, smile and cry with Rancho, Farhan and Raju. At the end, you want to be a part of their gang.. You wish to have a forever with friends like them!","label":0},{"review":"\" 3 idiots \" is a very motivational movie  . This movie reveals  the real  truth about students condition . This is a sad but real  truth  that in now a days students are studying for getting marks only . I just can't understand why study  for only getting marks ? Where is the  purpose of gaining knowledge ? \nWell actually it's  a very nice movie . Actors played their role very naturally . Every students and their parents must watch this movie to know that students should not be pressurize for t ...MORE","label":0},{"review":"\" 3 idiots \" is a very motivational movie  . This movie reveals  the real  truth about students condition . This is a sad but real  truth  that in now a days students are studying for getting marks only . I just can't understand why study  for only getting marks ? Where is the  purpose of gaining knowledge ? \nWell actually it's  a very nice movie . Actors played their role very naturally . Every students and their parents must watch this movie to know that students should not be pressurize for their studies and not for anything . \nConcept of movie is a very nice I praise the writer and director and everyone who had done their best for making this  film .","label":0},{"review":"One of the best movie ever watched. When this movie was released I was just 5 so I couldn't understand the movie but now I'm 15 and I realize that the movie was great. It teaches you the lesson that never mug up without understanding coz it will result to nothing in future. Best friendship movie n overall it's like a diamond to the Bollywood industry. I love to watch 3 idiots even to like every Sunday it give on TV n I make sure to watch it. I literally looveeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee ...MORE","label":0},{"review":"One of the best movie ever watched. When this movie was released I was just 5 so I couldn't understand the movie but now I'm 15 and I realize that the movie was great. It teaches you the lesson that never mug up without understanding coz it will result to nothing in future. Best friendship movie n overall it's like a diamond to the Bollywood industry. I love to watch 3 idiots even to like every Sunday it give on TV n I make sure to watch it. I literally looveeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee 3 idiots.💜💜💜💜💜💜💜💜","label":0},{"review":"This movie is best of bolywood got till now.. 10 on 10.. U can watch it 100 times.. Every moment of this movie is worth watching.. Movie is very motivational for youngster and a lesson for parents those who create pressure on their children regarding career decisions..\nI personally love this movie and suggest every person of any age to go and watch..","label":0},{"review":"An awesome, must watch movie for all students and parents. I loved it and it never stops to make me laugh each time I watch it. Good job team.\nJust a suggestion, can u please make a 2nd part of 3 idiots. Where rancho and pia will get married, the three friends stay in touch and the agreement of chatoor and rancho. Please consider this and waiting for the movie....","label":0},{"review":"Best movie engineering college training\nTo start this position you best in industry\nPractical knowledge  machine  different types of file attachments  goal  perfect role action. Your  greatest strengths health and handsome man who was the only thing that comes to the best film and handsome young man strong enough good things to do have some questions regarding the best  directions","label":0},{"review":"Hi, I am Bani Kaur. I study in class 7.\nIt is really very good as it gives us a moral and it was very attractive, good and funny movie. Children who are not good in studies learn how to improve themselves. In this movie Chatur he worked very hard to be the best. But no he could be that as he was not having enjoyment in his life. So dear children, always study and play.","label":0},{"review":"It's heartwarming full of quotes  that will guide you in your personal life.  It shows the strong bond of friendship, that true love never dies, love and respect for family and many more.  Aamir Khan is handsomely superb supported by a powerful cast and production team,.   The movie is timeless","label":0},{"review":"This movie is a very Inspirational for the students. Amir khan you and your team are great \nYou learn:-\nWhat to Study ?\nHow to Study ?\n When to Study?\n      And best opinion than choose  your Passion dear, Students. Really I like this movie I want to tell all of you as a free advice everybody must watched this movie.","label":0},{"review":"The friends between them... firstly I love it..and the thing that I learnt from the movie is make the best that I have. Learn the thing in which u are interested..when we do the thing in which we are excellent    \nMe get topmost success in that and if we cannot achieve any aspect. But there no regret in us that we didn't make it. Bcz it's our passion...and it's one off my lifetime favourite movie..","label":0},{"review":"The love angle between Rancho and Pia (Kareena) is osm... Many of the situations/characters have resemblance to \"Five Point Someone\", a novel by Chetan Bhagat.\n\nBoth humour and emotional quotients are amalgamated in the right proportion, full credits to Raju for that... Film offers lots of quality rib-tickling moments throughout.but overall it is a good movie.","label":0},{"review":"This is the best Indian movie on The education system of India. This movie is very Amazing. I think everyone should watch this movie. I love it. \nAamir Khan is awesome along with all the other cast members. Rajkumar Hirani has done a amazing work as a director. \nMy ratings : 9 out of 10.","label":0}]