[{"review":"01.55  am and I've just finished seeing the movie and it is really brilliant directing, story line and the screen play the quality was so realistically presented although predicting was only the help to get multiple factors relating to character only to understand the thrill and suspense climax was the part where I predicted that was correct about the professor and the student conversation and suddenly turns into the strangling sence to be coming on screen still high level of skilled and method  ...MORE","label":0},{"review":"01.55  am and I've just finished seeing the movie and it is really brilliant directing, story line and the screen play the quality was so realistically presented although predicting was only the help to get multiple factors relating to character only to understand the thrill and suspense climax was the part where I predicted that was correct about the professor and the student conversation and suddenly turns into the strangling sence to be coming on screen still high level of skilled and method acting by all the cast things were sometimes spooky sometimes weird anything to get from this movie is change and inspiration to create such storyline again the need is though important I. e new content and storyline\nExcellent work prawaal raman sir","label":0},{"review":"Watching it twice to keep the vibes on. A must watch for psychological thriller lovers. Very well balanced script with utmost good direction. The best catch was the light and shadow effects, with the best combination of background score. Last but not the least the best set of actors involved in the film. A complete masterpiece. It’s very unfortunate to have the film so very underrated.","label":0},{"review":"I actually watched this movie back in 2011 but that time my mind wasn't  mature enough to Understand this kind of movie and  what it  wants to convey .... It is a  perfect combination of horror and science and it turns out be  one of the best psychological thrillers of indian cinema ... performance  was good well directed and Ofcourse the ending will give you a shock ... \n\n as , i am from dehradun  this movie was filmed at FRI(Forest Research Org.) one the most visited place in dehradun. It is t ...MORE","label":0},{"review":"I actually watched this movie back in 2011 but that time my mind wasn't  mature enough to Understand this kind of movie and  what it  wants to convey .... It is a  perfect combination of horror and science and it turns out be  one of the best psychological thrillers of indian cinema ... performance  was good well directed and Ofcourse the ending will give you a shock ... \n\n as , i am from dehradun  this movie was filmed at FRI(Forest Research Org.) one the most visited place in dehradun. It is the most beautiful campus..","label":0},{"review":"I don't understand why such master piece has not been telecasted on small screen. Instead of showing those repeated movies of Superstars, pls telecast such wonderful movies.. the acting was truly natural.. loved it .. I got goosebumps in climax..","label":0},{"review":"I love open ended movies. This is one such movie. Great acting, story, and screenplay. Sad to know that this movie wasn't a box-office hit. Why don't such movies make money instead of sleazy sex comedies and sub-par romantic movies which have famous celebrities?","label":0},{"review":"My friends were recommending this movie for past 2 year..just watched it.. brilliant piece of work... amazing story, climax goosebumps guaranteed... amazing act by whole cast... specially krish and professor... everybody should watch this movie...","label":0},{"review":"👌👌👌 one of the best bollywood movie till now i watched.one of the best thriller,suspence,psychological movie.\nBut mind you,plz dont skip in the middle, to get the best experience.\n5/5 stars to this movie, and its a must watch movie.","label":0},{"review":"A brilliantly made film, intriguing plot and a fantastic climax, it’s sad that such movies doesn’t get the success they deserve. Imaad Shah and Nishikant Kamath doest justice with there roles. A must wantch horror movie.","label":0},{"review":"Everything is so good in this film apart from Nishikant Kamat (Professor). His eyes are like Irfan Khan, however, unable to understand his emotion in this film. Maybe his level of acting is not visible for a normal audience.","label":0},{"review":"Amazing movie. What a great Twist it has!  It's concept makes the movie interesting. Totally recommended to watch","label":0},{"review":"3:03 am... Just finished watching the movie... It is such an underrated film..all the actors were superb but direction definitely could have been better.. sad to see that such films doesn't get their due credit..","label":0},{"review":"True masterpiece of modern bollywood. Nishikant kamat acting was brilliant. 1st half was ok but 2nd was very good. 7.5 out of 10.","label":0},{"review":"Very entertaining movie with awesome climax..you can't miss any moment of the movie..I wonder why these awesome movies remain unknown..","label":0},{"review":"an awesome n yet a highly under rated movie...highly recommended if anyone loves suspense thrillers...intriguing plot that ll keep u in pace as the movie continues...sad to see these movies hardly get the appreciation and attention that they deserve....","label":0},{"review":"One of the most boring movie I've ever watched. The story is good enough to be made into a short film of 20 minutes, not a feature film.","label":0},{"review":"This is a masterpiece film...i can't understand why this type of movies not went 100 cr club","label":0},{"review":"Please do give its watch .. Being a self suspense lover .. I rarely have given reviews... But this movie deserves.","label":0},{"review":"A must watch movie. A true mind-blowing movie. One of the most Underrated movie.","label":0},{"review":"One of the Most Under-rated movie.\nBrilliant thriller!","label":0},{"review":"This movie is fully based on ragging in the universities also in this movie there is many suspense which you willing to know but you can't","label":0},{"review":"Brilliant ! The climax is really chilling and completely unexpected!","label":0},{"review":"This type of movies I like most ...really thrilling suspence at last ..odd movie...","label":0},{"review":"one of the best movies i came through loved ittttt","label":0},{"review":"Watched in 2011 awesome movie full of thriller and suspense..","label":0},{"review":"Brilliant concept... This movie should get some recognition...","label":0}]