[{"review":"Just finished watching the film on Prime Video and it was unlike anything else I had seen till date in a Bollywood film. \n\nNeedless to say, this film was way ahead of its time. No unnecessary love tracks, forced comedy or songs: just purely smart, impressive, intriguing storytelling. You can't afford to miss any detail in this high-concept action thriller that is complex and yet not complicated to understand.\n\nAkshay Kumar delivers an outstanding performance, and Javed Jaffrey also entertains wi ...MORE","label":0},{"review":"Just finished watching the film on Prime Video and it was unlike anything else I had seen till date in a Bollywood film. \n\nNeedless to say, this film was way ahead of its time. No unnecessary love tracks, forced comedy or songs: just purely smart, impressive, intriguing storytelling. You can't afford to miss any detail in this high-concept action thriller that is complex and yet not complicated to understand.\n\nAkshay Kumar delivers an outstanding performance, and Javed Jaffrey also entertains with his subtle comic timing. Ayesha Takia is impressive as well. The story revolves around a limited set of characters but that doesn't stop it from being captivating. It's packed with high-octane action sequences and edge-of-the-seat thrills. Visual effects are also quite top notch. \n\nThat being said, 8 X 10 Tasveer is not your typical Bollywood film. It's an out-and-out action thriller that feels like an international film as it entertains without compromising on quality. I'd love to collect it, as the stunts and twists have really left me impressed more than any Akshay Kumar film I have seen till date. Nagesh Kukunoor's first attempt at making an action thriller is so successful that I wish to see more of his works in this genre.\n\n10/10.","label":0},{"review":"Very well written, however poorly executed in terms of editing and directing. Even though we have never seen such an amazing movie in india.\nIf you love watching thriller and suspense this is one of the best given by bollywood to its audience.","label":0},{"review":"8×10 was way too ahead of its release time ... Had it been released today , it would have garnered both critic and multiplex acclaim. Watched it after 10years ... Damn good man 👍🙏","label":0},{"review":"Ok i watched it 10 years later from its release and feel that this is the best movie for suspense lover. Must watch movie and i don't know why it failed in cinemas. I think this movie should release again.","label":0},{"review":"Awesome and outstanding movie story line was amazing but happi shouldn't die at the end it would be better to see jai and happi together at end as best friends","label":0},{"review":"Tje movie has best ever plot and super murder mystery however the pace ruins everything. One of the best films of Akshay Kumar. I feel Akshay Kumar and Bobby Deol are made for thriller films.","label":0},{"review":"This is an excelent movie and acting of all actors are very natural particularly Akshaykumar and Ayesha Takia as they have matchless acting .Thanks Nageshji.","label":0},{"review":"This movie prooves that creative indian story writers are not dead yet.\nlove this movie cause pyaar vyaar jaisee ghisi piti movie to nhi hai kam se kam.","label":0},{"review":"Very good movie. Excellent script,  good screenplay. I don't know why  this movie flopped","label":0},{"review":"Nice storyline. Good cast. Beautiful locales. Suspense till end. No one can predict","label":0},{"review":"It is interesting to watch who is the murderer of Jai's father but there are certain things in the movie which disconnect the audience to watch this movie but overall an interesting movie.. I rate 2.5/5 stars.","label":0},{"review":"Real thriller... exciting t t end... Akshay suits t role  well..Sharmila... beautiful as ever","label":0},{"review":"Such a great movie i wonder how it was not able to cross the budget","label":0},{"review":"it is like movie butterfly effect with but without having butterfly effects in it he just look in past  cannot do anything ,well it is not copied may be inspired","label":0},{"review":"Such a good thrilling and suspense movie... \nI loved it.... ❤","label":0},{"review":"very good moviee. but happie shouldnt die in the ending otherwise the movie is very good","label":0},{"review":"Okay nice film but bores at starting and gets interesting. The film have weak soundtrack and good plot.","label":0},{"review":"It is best mistry film. I like it too","label":0},{"review":"awesome thriller film with super acting.i like thriller films","label":0},{"review":"Good this is very thriller movie I think this is very best","label":0},{"review":"Suspense movie\nMust watch it\nIt available on YouTube.","label":0},{"review":"One of the best thrillers","label":0},{"review":"Awesome movie exilent story","label":0},{"review":"Worst movie ever seen third class suspense editor is sleeping","label":0},{"review":"love love love","label":0}]