[{"review":"A very slow paced, agonizing love film\n\nThe movie is about a love story which is stretched over two and a half hours - An unmarried guy Ram (Golden Star Ganesh) meets his 1999 batch school love Janu (Bhavana) after 20 years at a school reunion and then he regrets on not expressing his love to her in the first place. The film revolves around a somewhat complicated love story where Ram hides his feelings within himself without unveiling it openly to Janu. The film also shows his state of mind as m ...MORE","label":0},{"review":"A very slow paced, agonizing love film\n\nThe movie is about a love story which is stretched over two and a half hours - An unmarried guy Ram (Golden Star Ganesh) meets his 1999 batch school love Janu (Bhavana) after 20 years at a school reunion and then he regrets on not expressing his love to her in the first place. The film revolves around a somewhat complicated love story where Ram hides his feelings within himself without unveiling it openly to Janu. The film also shows his state of mind as muddled and how he has lost his confidence to love someone else in his life as he's unable to forget her. The first half of the film is enchanting where their earlier school life in Theertahalli in Shivamogga is shown. The second half shows their present life and is quite a strain to watch. The actors Hemanth and Samikshaa who have played as younger Ram & Janu have performed brilliantly. Especially the cute and beautiful Samikshaa will steal your heart with her charming, sweet smile & acting. Ganesh & Bhavana have also delivered their performances very well. The cinematography by Santosh Rai is excellent and the music by Arjun Janya in this film which is his 100th one is quite good. Although there are some melodious tracks, they don't create much of an impact on the viewer. The film has a very slow pace and it drags at many places where silence & pauses are used with minimal dialogues. All in all you can watch this film if you have the patience to sit through a slow paced romantic film.\n\nThe Shy Guy's Rating: ⭐⭐⭐","label":0},{"review":"Emotional, heart touching tale narrated beautifully. Appears little slow in the beginning but then makes you feel it should not end. very much realistic and no much melodrama. Ganesh and Bhavana steals your heart. Bhavana is just superb. Soo very natural acting  and her eyes speaks everything. Ganesh has truly lived up the character. One of his best performance i feel. Music is apt, soothing and lifts the movie. Overall a great job by the captain of the ship, Preetam Gubbi.\n\nMost of the media re ...MORE","label":0},{"review":"Emotional, heart touching tale narrated beautifully. Appears little slow in the beginning but then makes you feel it should not end. very much realistic and no much melodrama. Ganesh and Bhavana steals your heart. Bhavana is just superb. Soo very natural acting  and her eyes speaks everything. Ganesh has truly lived up the character. One of his best performance i feel. Music is apt, soothing and lifts the movie. Overall a great job by the captain of the ship, Preetam Gubbi.\n\nMost of the media reviews have compared it with tamil version and given low ratings which had held me back from watching it till now. Watched as there were no other new movies and it made me feel should never look at newspaper reviews. We should learn to appreciate the good rather than pulling down our talents by comparing with others.\n\nA great watch.","label":0},{"review":"Great direction for a very good script.Hats of to director's thought.Need guts to execute such a movie. Very good performance by Ganesh and Bhavna.Justified the characters.Even Samiksha(as young Jaanu) done excellent acting.The beauty of the movie is music.Best in class music by Arjun. Heart of the movie is song sung by Shreya.And that's where this movie has an little upper hand compared to Tamil and Malayalam. What a voice and what a soul touch singing.Superb lyrics. Movie looks little bit slow ...MORE","label":0},{"review":"Great direction for a very good script.Hats of to director's thought.Need guts to execute such a movie. Very good performance by Ganesh and Bhavna.Justified the characters.Even Samiksha(as young Jaanu) done excellent acting.The beauty of the movie is music.Best in class music by Arjun. Heart of the movie is song sung by Shreya.And that's where this movie has an little upper hand compared to Tamil and Malayalam. What a voice and what a soul touch singing.Superb lyrics. Movie looks little bit slow.But touched all aspects.Expecting such different type of movies from the film fraternity. Audience encourage such movies...","label":0},{"review":"A heart touching movie though it's very slow your will never fell that it's gonna be dragged. \n\nIt's a story of a school boy who falls in love with a girl he likes her very much from the depth of the heart. He understands the girl very much he satisfies himself by from the happiness of the girl. I liked very much\n\nEven after 20 years they are at same stage where they left the boy rame lives his life with the memory of janu.\nIt's honest review from Ganesh fan I want a movies where it's full of em ...MORE","label":0},{"review":"A heart touching movie though it's very slow your will never fell that it's gonna be dragged. \n\nIt's a story of a school boy who falls in love with a girl he likes her very much from the depth of the heart. He understands the girl very much he satisfies himself by from the happiness of the girl. I liked very much\n\nEven after 20 years they are at same stage where they left the boy rame lives his life with the memory of janu.\nIt's honest review from Ganesh fan I want a movies where it's full of emotional but an unexpected happy ending as a girl meets his boyfriend.\nThey would have done in this movie it's self as bhavna would get never married. And both would have lived in Bangalore a happy life with happy ending.\n\nA honest review from Ganesh fan.","label":0},{"review":"This is one of the best movies of golden star GANESH. This is a movie filled with true emotions. For people who are materialistic this movie would be a boring. But for those people who have emotions and feelings this will be a treat to watch. Great performance by the actors. Great direction. I felt I could die a very peaceful death after watching the movie. I was full & satisfied. I didn't feel I wanted anything else in life. You will feel like this when you taste your favorite food made by your ...MORE","label":0},{"review":"This is one of the best movies of golden star GANESH. This is a movie filled with true emotions. For people who are materialistic this movie would be a boring. But for those people who have emotions and feelings this will be a treat to watch. Great performance by the actors. Great direction. I felt I could die a very peaceful death after watching the movie. I was full & satisfied. I didn't feel I wanted anything else in life. You will feel like this when you taste your favorite food made by your mom & when you watch these kind of movies. God bless 🙌.","label":0},{"review":"Sadly an outright rushed copy and paste of 96 which was truly a masterpiece. \n\nThe dialogues sound like they were directly translated from Tamil (96) to Kannada... To make things worse, what 99 doesn’t get is the silent score that drives such narratives. By score, I’m not pointing at the background score; it’s rather the mood that I’m underlining. The scenes where Ram jumps into panic mode the minute Janaki gets close don’t dance to the tunes of humor. They become a farce as if Mr. Bean (Rowan A ...MORE","label":0},{"review":"Sadly an outright rushed copy and paste of 96 which was truly a masterpiece. \n\nThe dialogues sound like they were directly translated from Tamil (96) to Kannada... To make things worse, what 99 doesn’t get is the silent score that drives such narratives. By score, I’m not pointing at the background score; it’s rather the mood that I’m underlining. The scenes where Ram jumps into panic mode the minute Janaki gets close don’t dance to the tunes of humor. They become a farce as if Mr. Bean (Rowan Atkinson) has possessed him.\n\nA lot more could have been done to make it stand apart (different) and yet similar. Sometimes making a remake too soon to a mega blockbuster like 96, can draw plenty of criticism.","label":0},{"review":"Watched today. No comment on Ganesh and Bhavana's acting. As usual they gave the life to their role. But the story was not that catchy and sometimes feels boring and literally I was checking still how much length left. Also at the end feels like could have given a happy ending. Because there was a chance for that. Only Ganesh fans can watch and that too one time. And most importantly there is not even a single fight and dance in the entire movie which doesn't suite for commercial audience. And t ...MORE","label":0},{"review":"Watched today. No comment on Ganesh and Bhavana's acting. As usual they gave the life to their role. But the story was not that catchy and sometimes feels boring and literally I was checking still how much length left. Also at the end feels like could have given a happy ending. Because there was a chance for that. Only Ganesh fans can watch and that too one time. And most importantly there is not even a single fight and dance in the entire movie which doesn't suite for commercial audience. And this review is completely based on my opinion.","label":0},{"review":"It is an extended version of \"My Autograph\" and \"Charminar\", but still it is an entertaining watch. I have not seen the Tamil cinema.\nGolden Star is the backbone of this film. No one would have done a better job than Ganesh. It is a usual Ganesh role like any other films. He has just lived his character. Never the less Bhavana Menon was also brilliant. But Junior Bhavana was more sensible and she might get good number of offers in the future. \nSupporting artists were fantastic. Music was decent. ...MORE","label":0},{"review":"It is an extended version of \"My Autograph\" and \"Charminar\", but still it is an entertaining watch. I have not seen the Tamil cinema.\nGolden Star is the backbone of this film. No one would have done a better job than Ganesh. It is a usual Ganesh role like any other films. He has just lived his character. Never the less Bhavana Menon was also brilliant. But Junior Bhavana was more sensible and she might get good number of offers in the future. \nSupporting artists were fantastic. Music was decent. \nOverall ratings was 3/5","label":0},{"review":"First to speak about the plot of the movie, it is a remake of 96 movie from tamil but is touching and connecting to most of the people who have gone through their high school, which means it is readily immersive to most of the people. Secondly the cast whom so ever it may be taking Mr.Hemanth, Miss Samiksha apoorva, Mrs Bhavana madam,   golden star Mr ganesh and all others are exactly well suited to their characters and they lived in their characters respectively I opine that they have not acted ...MORE","label":0},{"review":"First to speak about the plot of the movie, it is a remake of 96 movie from tamil but is touching and connecting to most of the people who have gone through their high school, which means it is readily immersive to most of the people. Secondly the cast whom so ever it may be taking Mr.Hemanth, Miss Samiksha apoorva, Mrs Bhavana madam,   golden star Mr ganesh and all others are exactly well suited to their characters and they lived in their characters respectively I opine that they have not acted but lived in their characters. And lastly but not the least if you compare the acting and total cinematography quality of both the movies 96 and 99 you will definetly appreciate that 96 is far behind and even not in close of 99 to be compared with. And as it is a review i must write that just watch the movie it will be a life time memory to all.","label":0},{"review":"I really respect Karnataka people and happy seeing 96 was remade in kannada. Such a wonderful movie and I would suggest to watch in Tamil rather than 99 in Kannada as always the original version would be good.\n\nI would prefer KGF Kannada version than other languages and mungaru male such a wonderful movie. Also have seen many movies in kannada for it's reality apart from the budget. Keep rocking..","label":0},{"review":"Nice Narration...Passes through past of everyone's School days.Really a cliffhanger can come up with an Sequel. A one  night story passes through 2.30hours narration. Kudos to Preetham Gubbi still holding that crave to encash the sequence of being young in every moment of Picturising. A warm Heartly thanks to Preetham Gubbi to making this movie a worth watching in everyone's lifetime. 💐","label":0},{"review":"A slow not much decorated simple story..which based on the a simple ,a kind of cute love story.once both ramu and janu had a love in their childhood. And there was not a good start for their love story ..after a long gap they are going to meet each other. surprisingly now also both have the same feelings for each other and they also accept it, but because of the some reason they can't continue with their love.so that is the end of the story.without any  accepted outcome the story Will end.. some ...MORE","label":0},{"review":"A slow not much decorated simple story..which based on the a simple ,a kind of cute love story.once both ramu and janu had a love in their childhood. And there was not a good start for their love story ..after a long gap they are going to meet each other. surprisingly now also both have the same feelings for each other and they also accept it, but because of the some reason they can't continue with their love.so that is the end of the story.without any  accepted outcome the story Will end.. some times it feels like this film should not end like this.because of a good narrative of the story and a good managing of the characters the story won't feels bore.some of the childhood scenes freshup the our childhood memories (if u feel it)... entirely it's just an example that how movie can be done with a simple story..and the main characters in this film is Ganesh and bhavana.both will  steel the heart of the audience.","label":0},{"review":"I am a Telugu person. I can understand little bit of Kannada language. Watched movie with English sub titles. It’s one of the best movies I saw in recent times.  Hats off to the director and to the screen play. \n\nThe body language of the character are too good. It’s not a regular movie. The manners between two relationships are very well portrayed. \n\nGreat movie over all. The sensitiveness of the relationship is great. The lover taking care of her. And blessing her to be happy. He is more happy  ...MORE","label":0},{"review":"I am a Telugu person. I can understand little bit of Kannada language. Watched movie with English sub titles. It’s one of the best movies I saw in recent times.  Hats off to the director and to the screen play. \n\nThe body language of the character are too good. It’s not a regular movie. The manners between two relationships are very well portrayed. \n\nGreat movie over all. The sensitiveness of the relationship is great. The lover taking care of her. And blessing her to be happy. He is more happy to see his lover to be happy. It’s not a sacrifice it’s own her with deep respect towards her.","label":0},{"review":"Good Movie True eternal love no plastic love. Both the junior artists have done justice to their role (younger part of Janaki and Ram) they have a great career ahead. Ganesh and Bhavana stalwarts of such emotional movies. Hats off to the Director and all those who were part of the film. Good location lush green beauty of the malnad region.","label":0},{"review":"Ganesh and Bhavana acting was amazing, both of them were gave best to their character. \nOnce again a good and silent music from magical composer Arjun sir..\nI was like ending will be happy to Ganesh. But once again sad ending to Ganesh.\nNo doubt and no one can replace Ganesh..\nQuality of entire film and music is good.\nI surely tell, it will touch your heart..","label":0},{"review":"Lovely movie...\nIt is seriously a heart touching story !!!! It has been very well crafted, acted and delivered to end audience. Every emotional scene advocates for itself and makes it a 'must watch'.\nOverall storyline is not as expected and surprising element is that viewers feel happy about it. It's a practical love story.","label":0},{"review":"99 is one of the best kannada movie.\nits so sensitive and smooth\nits just like what happens in most of our lives. \nIts not entirely realistic but the movie is not out of track anywhere.\nGanesh has done a remarkable job and bhavana looks as cute as she can ever be ❤️.","label":0},{"review":"Life and story of life is never as you want that to be. Very well written dialogues and melodious songs. Story that touched your heart and gives you a beautiful message to express your feeling to the person that too at right time. Living that moment is important. They lived and laughed that moment together.","label":0},{"review":"Outstanding film overall,, A Big Salute to The Director who tied the film with viewers so tightly,, Excellemt acting by Ganesh Sir and heroine.. Strong emotional BGM played a Major role.. Overall Its Very well made film with Dedication story oriented,, Not like a Normal Love Story..","label":0},{"review":"One of the best movies I've ever watched, this movie had me crying like a baby. I usually don't write reviews but i had to for this one such a strong and intense acting by ganesh and bhavana and even the actors who portrayed their childhood, overall i will give this movie a 5.","label":0},{"review":"Great story narration with a splendid acting performance by the lead actress. Preetum gubi proves again he is a talented and showing a romantic line in a native way. Watch when you are alone and if you wanna know the feelings of love.","label":0},{"review":"who knows our next day what will happen we just could be imagine and happened this movie story will showed some on person deserve to be happened in his whole life share his feelings with friends and life partner thank you sir GOLDEN STAR GANESH AND MADAM BAVANA YOU ROLLED BEAUTIFULLY IN THIS MOVIE","label":0},{"review":"Good movie..its well narrated commonly happening story..brought back all my school days while watching..this two ppl gave birth for the story from there asuall lovely acting..music and cinematography is well structured nd plays important role..please doo watch once..","label":0},{"review":"A warm Kannada Movie. Heart touching tender love, which was not expressed. Brilliant Acting, Direction, Cinematography, Music & Script. Film is little slow, but worth watching. 5/5 from my side.","label":0},{"review":"Heart touching movie , it remembers my high school lover... Respect married women even we loved in hour school days... \nSongs are OK... Still watchable every scenes super and enjoying..","label":0}]