[{"review":"Pandey's directorial debut is one of the very best crime drama films ever made in the history of film making. Propagating from the theme of terrorism and inefficient and insufficient action taken by the system and law and justice of the state, his idea of awakening the common man to revolt after he suffers  from a personal loss which is a part of a gigantic participation of antisocials in their never ending quest of killing innocents to bring what they call a 'revolution', was immaculately displ ...MORE","label":0},{"review":"Pandey's directorial debut is one of the very best crime drama films ever made in the history of film making. Propagating from the theme of terrorism and inefficient and insufficient action taken by the system and law and justice of the state, his idea of awakening the common man to revolt after he suffers  from a personal loss which is a part of a gigantic participation of antisocials in their never ending quest of killing innocents to bring what they call a 'revolution', was immaculately displayed to the audience. Veteran actor Shah as the fully charged common man motivated with vengeance, nails it fully with his years of acting experience and unparalleled skills. The supporting roles of Kher and Shergill have been more than satisfying, successfully keeping the pace and tension of the film intact. The absolutely gripping 9 minute monologue of Shah was perhaps one of the most jaw dropping scenes of any Hindi film ever made deserving an absolute 'cult' status. An excellently arranged plot with a really commendable screenplay succeeds in literally stalling the audience to even have a bite of nachos while watching it run on the screen. The movie also delves into the problems of police officers who face difficulties over balancing their family and professional lives as well as in facing the media which compels them to take certain actions which may result in short living but negative outcomes like the shooting of Shergill's 'Inspector Arif Khan' thereby injuring him, by Bashir's 'Inspector Jai Pratap Singh' to divert the attention of the media. Kher's 'Comissioner Prakash Rathod' is shown as a man of values who understands the 'Common Man's' psychology and respects his steps to mitigate a problem which everyone has just seemed to either accept or approach lackadaisically. This causes him to apparently probe further into the matter making him take a gun to arrest the seemingly anarchic 'Common Man' though finally deciding to let him go his way, returning to his wife with a bag of groceries (a remarkably appropriate portrayal of Indian husband) even after catching him red handed. A concoction of masterpieces, I give the film a bang on five on five.","label":0},{"review":"My notes on A Wednesday ~ movie\nRewatched it because of that one line at the end. Humans tend to search for the mazhab in the name. I wanted to see how they masked his religion plus I love the movie.\nThe J and K bag, the azaan type background score , the whole mystery of the man who is always lurking in the shadows of his men etc to give him that terrorist touch but when his wife called she did not have any Muslim twang to her language, she sounded Hindu. I thought it could also be that he had a ...MORE","label":0},{"review":"My notes on A Wednesday ~ movie\nRewatched it because of that one line at the end. Humans tend to search for the mazhab in the name. I wanted to see how they masked his religion plus I love the movie.\nThe J and K bag, the azaan type background score , the whole mystery of the man who is always lurking in the shadows of his men etc to give him that terrorist touch but when his wife called she did not have any Muslim twang to her language, she sounded Hindu. I thought it could also be that he had a love marriage and he is a Muslim. It mildly occurred to me that he could be of some other religion but I discarded that...too much passion and effort...did not seem Christian atleast. I now realize as I write my thoughts what I did not back then... religion is so deeply rooted in us that even a non religious person like me, is hoodwinked into this whole game sublimely.\nI love the nuances of the movie...it hits tg right spots and that also makes u realise when u have a great story , you need great actors not a star cast and the movie will work.","label":0},{"review":"Excellent screenplay and storyline by Neeraj Pandey! Undoubtedly, he's one of the best filmmakers in Hindi Cinema. He is a man of parts who knows how to make audience gripped to their seats for around 3 hours. And, this is his first movie. It doesn't matter how many times you've watched it, you will always be able to watch it again. The dialogues have such a magnificent impact that you'd be able to remember them throughout your life.","label":0},{"review":"Watched it today. I know I'm late. What a fantastic thriller this is! Really really engaging. Keeps you hooked. Story, screenplay, direction everything is just great. Neeraj Pandey is a Genius. And the casting! The two men. The legends. Anupam Kher and Naseeruddin Shah. These two guys, damn they're such a treat to watch in any kinda role. One of the best thrillers from Bollywood!\n5/5","label":0},{"review":"What a film.A well written simple thriller.A good acting by Naseruddin shah and Anupam kher.lts a short duration smart film.It gives bump to all other directors of bollywood for that when the are fond of engaging lusty songs huge item lassy girls rich and powerful gangster involved in their long duration movies with unnecessary actions.Congrats to Neeraj Pandey for gifting this film.","label":0},{"review":"What a movie....so gripping....when saw first, for months we discussing about it.\nGood performance by all....!\nThis is also a movie, one can watch from any part...!fantastic direction, gripping screenplay, realistic dialogues, good background music.\nA COllectors item.","label":0},{"review":"Short Review \n\nOne word. Cult. Mic Drop\n\nLonger Review\n\nExceptional casting, tight editing, wonderful direction and most of all a story which needed to be told done so well that it is practically flawless.\n\nFinal verdict \n\nMust watch","label":0},{"review":"He got to be a true Indian and had a muslim name.\nAlso he was 'not just good' but 'the best like you' who refuse to keep any police records of him.\nDo you agree with me Mr.Rathod?\n(Commissioner of Bombay Police)\nOne of very good movies","label":0},{"review":"Every common man will feel proud after watching this great movie. It shows us that we can do everything. If we made it than we can break it. Really loved this movie very Much.","label":0},{"review":"Awesome movie, evergreen, best of bests... Expect Bollywood to make more of this kind of films.\nVery inspiring, loved it, the best movie I have ever watched. Naseer's a natural actor...","label":0},{"review":"I would say this a must watch movie. Good screenplay, excellent acting by naseer uddin shah and anupam kher. I totally loved the concept of the movie.","label":0},{"review":"Just saw ot with my 10 yr old child wven he liked it very much\nAwesome movie, \n minus the usual bollywood masala of high flying action, songs, and half naked actresses","label":0},{"review":"Great movie. It is high time law enforcement agencies should realize that they should stop using common people. It is rightly said that , 'We are resilient by force not by choice. '","label":0},{"review":"This one of the best films on terrorism. Neeraj Pandey's concept  of filmmaking is brilliant. The ending is mindblowing.","label":0},{"review":"One of the best produced by Mumbai film industry... love to see others followed this film with multiple languages including Hollywood.. great directorship,best of luck.","label":0},{"review":"A must watch movie for every single person.\nAmazing in everything whether it's acting or suspense.","label":0},{"review":"Before watched this movie i think all the other Khan's and Kapoor's are one who are backbone of Bollywood..!! But they are nothing..!! Tremendous movie that is..!!","label":0},{"review":"It's 2019 and still 'A Wednesday' remains my favourite film of all time! Just brilliant!","label":0},{"review":"What a movie..., too good, This will not let you go anywhere without watching till end.\nIt gives a great msg too.","label":0},{"review":"Not even a single usless scene.... Every scene links to the story...That last pre climax call shows the true patriotism evry individual should have in them... 📞","label":0},{"review":"Story of a common man!Neeraj Pandey you have done excellent job here.Hat's off to you Sir...Just Hat's off","label":0},{"review":"IN TAMIL KAMAL HASSAN DONE ALSO GREAT............SUPERB DIRECTION,\" UNNAIPOL ORUVAN\" I LIKE IT MORE THAN HINDI.","label":0},{"review":"It's 2019 and I watched this movie more than 10 times and still in my all time favourite list.","label":0},{"review":"Excellent storyline, direction, acting. Perfect treatment to the terrorists.","label":0},{"review":"Too good.. Didn't expect the sudden twist in the story. It ws like 👍👏","label":0}]