[{"review":"It's a rather sloppy copy of Harry Potter.\nCharacters are largely borrowed: Shaanu (Harry); Pinky (Hermione); Limbu Chacha (Hagrid); Suzanne the flight teacher (Professor Hooch); Mind over matter teacher (Professor Flitwick); Bijli (Weird Voldemort-McGonagall combo); Changezi (Draco Malfoy).\nThere are scenes like the flying class where broomsticks are replaced with flying carpets, the great banquet hall with talking portraits, ghosts swooping around, and just the entire idea of a magic school so ...MORE","label":0},{"review":"It's a rather sloppy copy of Harry Potter.\nCharacters are largely borrowed: Shaanu (Harry); Pinky (Hermione); Limbu Chacha (Hagrid); Suzanne the flight teacher (Professor Hooch); Mind over matter teacher (Professor Flitwick); Bijli (Weird Voldemort-McGonagall combo); Changezi (Draco Malfoy).\nThere are scenes like the flying class where broomsticks are replaced with flying carpets, the great banquet hall with talking portraits, ghosts swooping around, and just the entire idea of a magic school so uncannily similar to Hogwarts, that I'm still wondering why Rowling hasn't noticed this yet. Also, it's full of silly songs and shabby graphics. Not the magical movie you'd want to watch unless you're silly enough to substitute pizza with subzee on a burnt paratha.","label":0},{"review":"This  movie  is very entertaning full of adventure, fantasy and mythology awesome movie for childrens and also for elders and who loves mythological movies.   \n\nEagerly waiting for part 2.","label":0},{"review":"It is a good film about magic. Best for children. Copied a little from Harry Potter","label":0},{"review":"Memory of childhood but still remember the story and suspens of part 2 use to see on Pogo","label":0},{"review":"My favorite movie I love this movie","label":0},{"review":"No one can copy harry potter films the mystery and suspense are all in harry potter films","label":0},{"review":"Bakwass movie a worst copy of harry potter","label":0},{"review":"Awesome movie","label":0},{"review":"Worst movie I have ever seen","label":0},{"review":"Worst movie where is part 2","label":0},{"review":"This flim is fantastic","label":0},{"review":"This movie is fentastic....amazing ....","label":0},{"review":"My childhood film","label":0},{"review":"It was Trash","label":0},{"review":"This movie is good but the copy of harry potter","label":0},{"review":"I like this movir","label":0},{"review":"Copy of Harry Potter","label":0},{"review":"We want part 2","label":0}]