[{"review":"One of the best movies produced in Bollywood based on realistic events. A must watch movie for those who like serious issues related to society and administration. Ajay and Akshaya performed excellent alongwith Paresh Rawal.\n\nIt's Priyadarshan's different type of movie than his usual comedies. Don't miss it 👌","label":0},{"review":"I am a big fan of Mr Priyadarshan's movies. His movies are way beyond imagination .. superb script. Must watch movie.\nevery actor gave their outstanding performances. ( Gems of Actors Ajay Devgan, Akshay khanna, Paresh rawal, Bipasha basu, Pankaj tripathi,Reema sen, Jaideep Ahlawat, Vineet sharma, paritosh sand etc..)","label":0},{"review":"Nice movie. Different from usual script and story. Good chemistry shown between Ajay devgan and Akshay Khanna. All actors including Pareshan Rawal acted well. Action scenes could have been a bit lesser in lengh","label":0},{"review":"Awesome movie..........after watching this movie you can easily imagine that what would have been the situation of jungal raaz in Bihar in 90's when A corrupt and casteist man was CM of Bihar.\nThis movie strongly shows the corrupt police system and untouchability still prevailing in our society.","label":0},{"review":"This movie proved a milestone in Indian cinema. Every positive mindset people must watch this movie. I salute to Nihaliniji for presenting such movie. I salute to Vijay Tendulkarji for his script.Overall I salute to every person  making it memorable.","label":0},{"review":"A Ditto copy of Mississippi Burning (1988). The only difference is that hollywood flick was made on depicting Ku Klux Klan and it’s related nuisance caused by anti-black mindset of 1960s America. And this movie depicts the dirty politics of Bihar state involving an honor killing case.","label":0},{"review":"What a great movie which is shows some real issues of society. \nAll are good but Ajay Devgan is just brilliant in his business. \n#TopClass","label":0},{"review":"A very realistic and action packed movie.Although I have watched this movie at the time of release I saw it again and enjoyed it thoroughly.Worth seeing for everybody.","label":0},{"review":"Very nice movie. Reflecting the caste system an endless stigma in Indian society..we are still not independent of such sameful discrimination in our rural localities ....mm","label":0},{"review":"This movie is excellent and wonderful, depending on crime and reality behin it, very interesting acting done by all the casts specially by ajay devgan and akshay khanna","label":0},{"review":"Poorly made movie, wasted talent. Had it been made by Prakash Jha or Anurag Kashyap with dame cast, story and budget, I reckon, would have been a master piece.","label":0},{"review":"Good film and Ajay and Akhshay has complemented each other very well.the main idea was from the film \"Mississippi Burning \"but remade into the Indian context very well.","label":0},{"review":"This movie is a good demonstration of corrupt system and ill mentality of the society. This movie shows how Indian society prevents people from taking their own decisions and forces them to follow what their ancestors did.","label":0},{"review":"A poor adaptation of \"Burning Mississippi\" 1988 hollywod movie. Scene to scene copy. Why can't we even copy properly.","label":0},{"review":"This is was a glamorous movie...Ajay Devgan as always was at his best...What an enthralling way to expose and explain the discrepancies in the caste violence and bias in Bihar...Think Politics...","label":0},{"review":"Most underrated Bollywood movie ever.\nBest movie.","label":0},{"review":"This movie is based on cast system.\nSo this movie flop,\nBad feeling for those indians who believe in cast system.","label":0},{"review":"Good movie with effective superb acting aspecially of Ajay Devgan & Akshay Khanna.","label":0},{"review":"Om puri, smeeta patil, & Nasser all carectors & their casting superb. Hats all team","label":0},{"review":"Ws wonderful....Ajay & Akshaye Combo was v nice... entertainer on all fronts.. action .. dialogue..","label":0},{"review":"Does anyone know this movie is copied from gene hackman and william dafoe starrer hollywood movie named Misssisipi Burning?","label":0},{"review":"One of best movies I have ever seen, Must watch.","label":0},{"review":"World class acting n direction. Great Movie","label":0},{"review":"One of my favourite movie. Priyadarshan always rocks.","label":0},{"review":"Such a powerful performances..Great movie ..A masterpiece","label":0}]