[{"review":"Very much impressed with the acting of the hero and the tempo is kept till last minute. \nAs there are many who are willing to do such dirty works,why he was chosen to do the work is not clear. \nDirection and technical sides are worth mentioning.\nA watchable movie. \nRated 8/10","label":0},{"review":"Yesterday i was searching for underrated Bollywood movies and i found this. 0% overacting Rajeev did a great job. best bollywood movie.\n\nBest Underrated Movies must watch \n\n1. Aamir 2008  - Rajeev Khandelwal\n2. Shahid 2012 -  Rajkummar Rao","label":0},{"review":"Aamir movie will shake you to the core . It is a movie that will tell what conscience is to a man . Beautifully written and executed well . Both protagonist and antagonist gave towering performance. Every thriller loving people should watch it . This is about what a citizen should do intuitively.","label":0},{"review":"Its movie is totally on Rajeev Khandelwal's shoulders and he has justified his role very decently and naturally.  Very good direction.  Hats off to Directors, Producers who made this.","label":0},{"review":"fabulous acting by Rajeev Khandelwal. This movie shows us the true face of islami mullas who use & mislead the innocent people for their own silly interests in the name of islam.","label":0},{"review":"Watched on 8th May, 2019. \nAamir is a well executed movie with very good acting by Rajiv Khandelwal. \nNice to watch.\n****","label":0},{"review":"It's worth watching movie .\nWhat a acting by Gajraj Rao , Rajeev Khandelwal loved it .\nSpecial that woman who helped Aamir Ali to find his suitcase .","label":0},{"review":"Good performance by Rajeev Khandelwal. Indian Viewer should encourage such movies and help film makers to do such great movies.","label":0},{"review":"One of the best Indian movies I think. Superb direction..full of suspense,fear. Great.","label":0},{"review":"Rajeev Khandelwal did rubbish with coat and tie, is he copying from Liam Neeson's The Commuter or Colin Farrell's In Bruges? That is very very rubbish film on world.","label":0},{"review":"Im huge fan of rajiv he never fail to make me surprised thruogh movie awesome very good","label":0},{"review":"A masterpiece that India should be proud of\nAlthough a remake but still much much better than others remakes","label":0},{"review":"Superb movie,Superb talent by Rajiv Khandelwal.... This movie tell us many things....which one can learn from this movie...","label":0},{"review":"Very good movie.....nice and natural@. Script and direction is awesome.","label":0},{"review":"A lot of things I have learned from this movie. Love this movie.","label":0},{"review":"Good job of Rajeev khandelwal. U r good actor","label":0},{"review":"master piece of bollywood totally mind blowing and thrilling","label":0},{"review":"Ending is mind-blowing very underrated diamond movie in Bollywood","label":0},{"review":"A great movie! shows patriotism for the nation.","label":0},{"review":"Great movie and great performers","label":0},{"review":"Terrific film with powerful message","label":0},{"review":"A cinematic masterpiece, a must watch","label":0},{"review":"Rajeev khandelwal is a charming and handsome boy","label":0},{"review":"A taut thriller.. Watched it for the third time","label":0},{"review":"This movie is a masterpiece","label":0}]