[{"review":"This is one of the best movie which can change the society but it is difficult as well impossible... arakshan supporter or virodhi should watch this wonderful movies. If you people want remove arakshan you must change the education system and should give equality in education to everyone. This movie gives good message  and show the real fact of society. \n\nAll the actors are very good in their role. I will give 4.5 out of 5.","label":0},{"review":"Amazing movie. Storyline direction  was good. They have given true message that education system in our country is very week we Indians think that if we don't become doctor or engineer nobody is going to give us respect but that is wrong mentality. Nice movie. Actors acting were too good.","label":0},{"review":"Every (Educated and General)citizens should watch this movie. It defines the poor   education system and Reservation  policies as well as the dirty sides in our Education Department. One of the Best movie about Education like 3idiots and tare zameen par. Best performance by Amitabh in this decade and his entire career. I will give it 4stars","label":0},{"review":"this is very heart touching movie\nthis movie is great and everyone should be watch this movie this is the best inspirational movie for students to be courageous in fighting for their brighter future..amazing movie i have ever seen so emotional and motivational. \nbut the story will never be true in real life.. this is the good way to inspire peoples \nthankyou sir for making such thoughtful movie..","label":0},{"review":"Movie's name only aarakshan' but in the true sense this movie was based on  deny the personal coaching center to get huge amount of money from the students named at the class fee and gave tham a fake fear of study. Thus the students join these types of coaching centers. That's why today's students not focusing in there colleges or schools because they have coaching centers.","label":0},{"review":"Excellent movie\nThanks Prakash Jha to raise this issue boldly,the only way to eradicate reservation is to provide equal education to all rich and poor to compete examination , equal opportunity provided to all without any discrimination of cast and creed.\nThanks for making a thought provoking movie Prakash Jha sir\n...","label":0},{"review":"Very very good film. I heartily thank u prakash jha sir 4 making this movie. I respect teacher and I suggest to all u also respect our guruji.","label":0},{"review":"Well about reservation , no one is sure what would be the step that give 100% justice to all Indian citizen.Although my opinion doesn't matter but can this reservation policy be applied to financially backward people and not on the basis of just caste??And If I comment on the film it tried to give us message to provide equal education to all.When education will be for all then reservation should be removed.","label":0},{"review":"In the movie Aarakhshan, more emphasis is given to education system and commercial coaching institutes rather than reservation system in India. Otherwise, the message given by the movie is remarkable and noteworthy. Superb acting by Amitabh sir, Manoj sir, Saif Ali Khan and Deepika Padukone.","label":0},{"review":"This is the best ever movie for me, this has changed my view ND gives me potential to do hardwork like amitabh g, Saif g, deepika g ND parteik babar g, nd I m feeling bad y I didn't watch this movie earlier","label":0},{"review":"Movie name focussed on reservations and then diverted the audience to education system? Because they scared of the debate on the reservation.\nWell, the name of the movie could be what? India's education system?\n\nAs a movie I can give it 4 stars","label":0},{"review":"Reservation is brought into Constitution to broke the superior mindset  of BRAMNICAL dominance.  It's not partiality, is just a hand given to the hindu lower class peoples by Dr ambedkar to came into the competition. Salute to such actors and filmmakers for making an film like this 🙏","label":0},{"review":"If you are contents lover, you will probably be disappointed after watching entire movie. In fact it's a classical Hindi drama.\nIt's not like Irfan khan's movie. Good thing is director didn't try to make scene realistic.\nFor me it's.  5.5/10","label":0},{"review":"If you are thinking that something about reservation has been shown in this movie,I may tell you that nothing is shown about it.\nMovie just shows that how true teaching wins over commercial coaching institutes and nothing about reservation.Movie has been named \"Aarakshan\" just to fool the audience.","label":0},{"review":"This is best movie made by Prakash Jha on social issue but I still think that merits should be given on the basis of their knowledge not on the basis of caste or religion.","label":0},{"review":"The thing about this movie is that it shows only one side of a coin. Creating huge bias between folks. No doubt Bollywood is known for that, still I won't give this 5 out of 10.","label":0},{"review":"Good movie.. It tells importance of reservations in India...Jai BC SC ST.....\nReservations are very important and compulsory....","label":0},{"review":"Sahi cheez h ...maja aa gaya WO scene dekh k interview wala and WO arguing wala...when at last amit ji comes and both of them become quiet.","label":0},{"review":"Beautifully directed movie on education.At that time education become bussiness and this movie is good example.","label":0},{"review":"This is a society movie.  Who increase every men a revolution  in his heart. And this movie give all men his right.","label":0},{"review":"This movie is fabulous and i like saif ali khan interview 😝","label":0},{"review":"It's a great movie. Everyone must watch","label":0},{"review":"Good movie but ending of the movie is not giving you a satisfaction.","label":0},{"review":"Amazing movie..... advice n story line direction good.","label":0},{"review":"This is best movie of 2011","label":0}]