[{"review":"My Review (11th Movies Review):\n\nVerdict - Blockbuster\nStoryline - This movie is adaption of an English movies which is star is born, however this movie is better from Bollywood version, but I have only seen this Bollywood version, however this movie is about an person who sings at an small concert who is played by the character from Aditya, however no one appreciate him anymore and he does end up with an fight with does appeared at the television because nowadays people hate time, also as you w ...MORE","label":0},{"review":"My Review (11th Movies Review):\n\nVerdict - Blockbuster\nStoryline - This movie is adaption of an English movies which is star is born, however this movie is better from Bollywood version, but I have only seen this Bollywood version, however this movie is about an person who sings at an small concert who is played by the character from Aditya, however no one appreciate him anymore and he does end up with an fight with does appeared at the television because nowadays people hate time, also as you watch whole of this movie, he is addicted to alcohol, however he leaves this concert straightaway and his car crashed into an tree because there was someone instantly walking across the road, this was shraddhar Kapoor, however she dislikes of what he had done to her because she dropped all of her items of which he helped her, soon he was looking for an shop which sells alcohol at that night which was at the bar of where shraddhar Kapoor sings, he appreciated her for the singing, but she did not know that this guy was actually the famous singer from the past whereas from the past, he win lots of award and become the best singer in the world, however soon, he came near her house and called her up, he told her that he can make her the best singer, this could be the turning career for her, however she did agreed for this, but his best friend did not like of what he is doing because his career is going downwards and now he is not even doing an small concert music and want to help her to make her best singer, then she left the job and moved to another town whereas her parent live who was poor, however she waited till it is time for her to start her career, but soon Aditya got injured because he was Beaton by gangster group because they did not like him anymore, but before this happen, Aditya asked his team to give her chance to do this job and if she is good singer, then she will be in this job and sing various of song from either movies or short videos, however Aditya is now in hospital and the phone is picked by his best friend of which he says to shraddar Kapoor of lies, because there was no phone call and she did not have job for 2 months of which you need to see for this movie, she then ask her best friend to get her the job, but as you watch, Aditya managed to get her back and soon she started to the job from training and actually did various of singing in the concert and studio as well, but she did became famous, but also both of them did became love for each other which is Adtiya and shraddar Kapoor, however Aditya career is turning down and he is not with best friend anymore due to lies incident, but his friend did came back soon, to get his career back, but his good voice is gone and his money is finishing, however people still saying bad about Aditya and shraddar Kapoor is just an star of which he used to be from the past, but soon shraddar Kapoor left the job to look after him because he is out of control, he is drinking an lot, having an fight and they moved to another town, but Aditya did not want her career to go down because this is his desire that she is just like he was from the past, but as you watch, at the end he suicide himself by falling into big ocean and Shraddar Kapoor did her job at the end from her past lover desire that she continues.\nSongs - All songs were beautiful to listen, but one of the songs which is ''Tum hi ho'' is famous and is good to watch lots of time.\nPerformance - The three characters stand out for this movie which is Aditya, Shraddar Kapoor and Aditya best friend.\nType of Movie - Great romantic movie with drama alongside, also the emotional of this movie starts to build up and yoh do started to feel crying as the movie is closer to the end.","label":0},{"review":"It is by far one of the only films that has had such an emotional impact on me. Aditya Roy Kapur is absolutely stunning through his performance. Every fight sequence, every alcoholic sequence looks so real and natural. Shraddha Kapoor is equally brilliant in the film and their chemistry is better than any recent movies we've seen in the past. You see the innocence on her face, wanting to help him and you see his face full of guilt and anger and insecurity. There's this scene where he's frantical ...MORE","label":0},{"review":"It is by far one of the only films that has had such an emotional impact on me. Aditya Roy Kapur is absolutely stunning through his performance. Every fight sequence, every alcoholic sequence looks so real and natural. Shraddha Kapoor is equally brilliant in the film and their chemistry is better than any recent movies we've seen in the past. You see the innocence on her face, wanting to help him and you see his face full of guilt and anger and insecurity. There's this scene where he's frantically searching around his house for alcohol and he can't find any, looks at Aarohi's wallet longingly, when she watches him holding her wallet. She watches him taking her purse which has all of her hard- earned money but doesn't even try to stop him. It's so heartbreaking to watch but also absolutely amazing acting. \nPS-  I haven't had sleep since I've watched the film last night, so there's a possibility that it may happen to you too😂","label":0},{"review":"It is one of the most magical movie as there are presence of love and ruined career as star Rj lost his fans due to alcoholism but he made a promise to help a small girl Aarohi Keshav who wanted to become a star. As from that place the love journey begin of two love bird. However the movie is one time watch as it also has certain scene which makes it more emotional and mad when RJ lose his temper after his career is completely ruined. But still it was surprise to see Aarohi who actually never le ...MORE","label":0},{"review":"It is one of the most magical movie as there are presence of love and ruined career as star Rj lost his fans due to alcoholism but he made a promise to help a small girl Aarohi Keshav who wanted to become a star. As from that place the love journey begin of two love bird. However the movie is one time watch as it also has certain scene which makes it more emotional and mad when RJ lose his temper after his career is completely ruined. But still it was surprise to see Aarohi who actually never left Rahul Jacked due to his bad habits. But it was going great until Rahul actually commit suicide in the end while he realized that he was becoming a burden on her. Sad to see Aarohi left in broken heart. Overall the partner of Aditya Roy Kapoor and Shraddha Kapoor has done the fantastic job in this film as per their characters.","label":0},{"review":"This my fav flim whenever I saw this movie (even though i don't know the language) just I'm getting emotional and what is love? The full answer of aashuqui2... The couples acting it's really outstanding especially Aditya he live on the character and music OMG speechless ✌️✌️ love makes life live 💟 just I'm addicted this movie and love is sweetest pain in the world.The last one aashuqui 2 beauty is the three magic word of Tum hi ho...\n2013 to 2019 days was passed but still aashuqui 2 feel like f ...MORE","label":0},{"review":"This my fav flim whenever I saw this movie (even though i don't know the language) just I'm getting emotional and what is love? The full answer of aashuqui2... The couples acting it's really outstanding especially Aditya he live on the character and music OMG speechless ✌️✌️ love makes life live 💟 just I'm addicted this movie and love is sweetest pain in the world.The last one aashuqui 2 beauty is the three magic word of Tum hi ho...\n2013 to 2019 days was passed but still aashuqui 2 feel like fresh, many of the real Aarohi Rahul characters live on the world love is more powerful weapon like  it's will make a beautiful life r destroying our world.","label":0},{"review":"This movie Aashiqui two is not only the intense love story between Rahul and Arohi but also the real friendship for lovers.. Which realizes us how love and beloved one is important and very important than our life. How Rahul made a girl as a singer from a bar to The film industry..!! Really amazing. \nBut really the death of Rahul hurts Arohi A lot.\nI am sure their is no one who has ever seen this movie without falling off a drop of tears...  \nI never see movie but it the third movie of My life w ...MORE","label":0},{"review":"This movie Aashiqui two is not only the intense love story between Rahul and Arohi but also the real friendship for lovers.. Which realizes us how love and beloved one is important and very important than our life. How Rahul made a girl as a singer from a bar to The film industry..!! Really amazing. \nBut really the death of Rahul hurts Arohi A lot.\nI am sure their is no one who has ever seen this movie without falling off a drop of tears...  \nI never see movie but it the third movie of My life which i have seen after bahubali one and two and from The day of seeing this movie I Am A great fan of the actors and singers... Mainly of Arjit singh","label":0},{"review":"Aashiqui 2 is the best Intense love story in the history of Bollywood.  Such a great story and no movie can have such a fabulous collection of songs as Aashiqui 2 have.\nMohit Suri is one of the Most talented Directors of Bollywood and he proved it with Aashiqui 2.\nBeautifully executed plots. Aditya and Shraddha Kapoor' s chemistry is mind blowing.\nA must watch for everyone and I promise you can't rest without watching it again and again.","label":0},{"review":"This Movie 's power is Its Music and background score...\nThis Movie changed my life...\nMy Musical journey started from the song Tum hi ho\nI learnt Piano and Guitar both by first playing This movie song...\nBut The Acting and Tragic ending also play an important role in making this epic\nSpecially both Aditya roy kapoor and shradhha Lived thier Roles like real....\nThe last scene will make anyone cry...\nHatsoff Mohit suri","label":0},{"review":"This is not the first Bollywood movie I have seen, but this is the first movie I am reviewing. Really this movie is Emotional and unpredictable.... I wasn't expecting Rahul to give up on everything he had put together, although he tried, of course It wasn't just enough, I pray may Almighty God continues to direct our paths and help us to overcome the habits we can not control. Meanwhile I am not really familiar with the actors in the movie... But you guys did a great job, it looked so real. I al ...MORE","label":0},{"review":"This is not the first Bollywood movie I have seen, but this is the first movie I am reviewing. Really this movie is Emotional and unpredictable.... I wasn't expecting Rahul to give up on everything he had put together, although he tried, of course It wasn't just enough, I pray may Almighty God continues to direct our paths and help us to overcome the habits we can not control. Meanwhile I am not really familiar with the actors in the movie... But you guys did a great job, it looked so real. I almost forgot it was a movie. All the best","label":0},{"review":"This movie's storyline has been woven very loosely and the execution/performance is all the more disappointing. Also, it's not even an original script... I'd suggest anyone not to waste their time on this and rather watch 'A Star is Born (1976)' which has almost the exact same storyline(If you're so fascinated by the story, then 'A Star is Born' would preferably be the choice)\n\n *Ahem, SPOILER ALERT* \n\nexcept for the part as to how the protagonist dies. The 1976 version is the 3rd remake of the  ...MORE","label":0},{"review":"This movie's storyline has been woven very loosely and the execution/performance is all the more disappointing. Also, it's not even an original script... I'd suggest anyone not to waste their time on this and rather watch 'A Star is Born (1976)' which has almost the exact same storyline(If you're so fascinated by the story, then 'A Star is Born' would preferably be the choice)\n\n *Ahem, SPOILER ALERT* \n\nexcept for the part as to how the protagonist dies. The 1976 version is the 3rd remake of the actual original film of the same name 'A Star is Born (1937)' followed by 'A Star is Born (1954)' but with slightly(just a smidge, maybe, even) different stories regarding the stardom involved and their rise to fame. In all, I don't think I'll ever watch this movie again and I'd advise you not to either. All in all, it's a 3/10 so a complete NO GO!","label":0},{"review":"I really like this movie. I can't  accept the end scene Rahul jaykar death. But , the director view is perfect. If anyone person really love his beloved, he will never  see control her  of suffer. That's way  Rahul select this kind of destined. But,  aarohi  character suffering is  touch by everyone's  heart.    Rahul jaykar dead  only happened. But his every moment of  action will around her ever.....","label":0},{"review":"really like this movie. I can't  accept the end scene Rahul jaykar death. But , the director view is perfect. If anyone person really love his beloved, he will never  see control her  of suffer. That's way  Rahul select this kind of destined. But,  aarohi  character suffering is  touch by everyone's  heart.    Rahul jaykar dead  only happened. But his every moment of  action will around her ever.....","label":0},{"review":"Sensation of love and music were so impactful that reflects.... Thankyou Mohit Sir and Bhatt camp for this rhythm to work.. In our life.....  must watch film if you are in love because it defines what we have never expected... Its a lot more!!!!!","label":0},{"review":"What an amazing, mind-blowing, fantastic, incredible love story...this movie is, I luv it and I can't just remember what to express words on this movie, I have seen ashiqui 2 long back at the time of its release, and giving review now, till now 40 or 50 times I have seen this movie, and I became die heart fan of Shraddha Kapoor mam since 2013, I don't like any one in this world, but only Shraddha Kapoor, I love her alot❤️❤️❤️❤️💓💓💓💓💕💕.","label":0},{"review":"It is the best movie ever made. Aditya and Shraddha played their part so well almost unbelievable. Only both of them deserve to be cast in aashiqui 3. And once again an unmatched movie. Love to shraddha .","label":0},{"review":"Best movie ever!! This movie has really left its trace in the hearts of people forever...It depicts true love and is very heart touching... best love story I've ever seen!! Must give it a rating of 10/10","label":0},{"review":"It was the best movie of that year. Shraddha kapoor is still known with the name of aashiqui 2 actress.\n   The songs of these movie is still as popular as at that time. These is one of the best movie.\nIn this movie shraddha kapoor is playing the role of poor and small singer named as arohi. And in opposite to her aditya roy kapoor is playing the role of popular and rich singer named as rahul.","label":0},{"review":"This is an amazing movie I never watched dis type of amazing movie.. Dis iz dat type of movie wic includes strong acting, melodrama ,heart breaking secenes ,amazing music ,evrytng.. The innocensy on shraddha face n d alcholic,stardious face with some insecurity, guilt n much lv.. Aditya...  I appreciate hum as an amazing actor n also my fav... Lv uu Aditya...","label":0},{"review":"This movie is sensational for love-story lovers. It is just mesmerising. The acting is so pure from both of them. Lots of emotional scenes that could make u cry. It is must watch. It has great songs too.4/5 .Go watch it.","label":0},{"review":"I think todays adults learn from movies and follow the celebrities so what i think for this movie it os good as well as bad.....it  is good becoz its acting expressions and it is feeling full movie . But i learnt something bad things from this movie i have learnt taking alcohol from this movie. Amd mow i'm wine addict so it is difficult to give any expression to this movie.","label":0},{"review":"The more i like is the songs of this movie.The basic concept of the film is also the music. Superb movie. Shradha kapoor and adithya roy kapoor done their best.\nReally amazing movie and also beautiful songs😍😍","label":0},{"review":"This movie never gets old.. Watched it again today.. Still felt as if watching for the first time.. Music, performances, dialogues, story everything  about this film touched my heart once again.. This movie is phenomenal from every angle..","label":0},{"review":"The concept is not new so I would give it 6.5 out of 10 but music is superb.Shradha and Aditya had a great chemistry and both performed very good..\nOverall recommended for those who lije","label":0},{"review":"The best movie i have ever seen .This movie is my favourite movie of all... Shraddha kapoor nailed it through her marvellous acting...And the songs are just mind blowing...No words to express","label":0},{"review":"I love your this film all songs.\nI love you so much shraddha kapoor \nyou are so sweet actress in \n the bollywood.\nand I love your this movie so sad movie .\nGod bless you Shraddha mam.\ni am Afghani girl \nLive in Australia","label":0},{"review":"It is a wonderful love story. But the end is very bad. True love will not die. So hero will be in heroine's heart .great film , perfect songs, natural acting.","label":0}]