[{"review":"There are enormous great masterpieces in B'wood in which Aashayein holds a position among the TOP 10 list according to me.\n\nThe emotions were too strong that made me pause and even think for a moment to stop watching. Usually, I'm a strong-hearted person but, ...  Just watch the movie, no matter who you are.\n\nYOU WILL LLOOVVEE IT!!!","label":0},{"review":"I was afraid to watch this movie.  Didn't think I could watch a movie where one of my favorite Indian actors played a role where he died.  But I'm glad I did.  It was wonderful.  John Abraham was amazing, as was the actor who played Padma.  Gave me a few tears, but turned out to be a real joy.","label":0},{"review":"Only one person has the guts to do such a film. One and only JOHN. Awesome movie.","label":0},{"review":"The only man in Bollywood industry who has guts to do such a wonderful masterpiece one & only my inspiration John Abraham","label":0},{"review":"nice to see my hero john abraham in such a great & heart melting movie love u john...","label":0},{"review":"Best movie ever.\nOne word it will give you hope to live. 😊","label":0},{"review":"I love this movie, when i feel demotivate then i watch this movie or listen song of it","label":0},{"review":"Simple and lively movie.hope john does these kind of movies again","label":0},{"review":"This is very good  song and this song is put in our school","label":0},{"review":"superb movie.. Feelings awesome","label":0},{"review":"one of the best movie i've ever seen","label":0},{"review":"Live in harmony and the universe conspires to let you live.","label":0},{"review":"One of the most beautiful movie of John Abraham..Love You John..","label":0},{"review":"one of the best performances of John!\nHats off!","label":0},{"review":"Best movie  ever watched...Very good theme....","label":0},{"review":"one of the best movies of John out there!","label":0},{"review":"Outstanding movie!!!","label":0},{"review":"It's a movie about life.","label":0},{"review":"loved the movie!!","label":0},{"review":"Just believe in your self and God... 😊","label":0},{"review":"Hey,wht the hell are you doing","label":0}]