[{"review":"My mind simply can't stop comparing it with the milestone movie SATYA.\n\nExcellent camera work.\nReal in Reel.\nVery Realistic yet fascinating.\nSuperb superb background score\nDetailed work on filming special force of police.\nExact and very on point casting.\nGreat direction\nAnd above all mind flattering acting by legendary actor Nana patekar.\n\nLike satya no catchy numbers.\nAfraid only that thing might have triggered negative for publicity.\n\nOverall a Master piece.","label":0},{"review":"Respect. Amazing performance and real fact. I salute Mr. Patekar for his natural acting.. He is rare kind of actor are who just behave like normal citizen he dosnt act no matter if his films are not 300 crore films like some bad actors like Bhaijaan or King khan...people know who is Nana Patekar.","label":0},{"review":"Nanaji is an icon. He is so realistic. I would love to meet him and give him a hug in my life time. Hope so God gives me an opportunity to meet him.","label":0},{"review":"Doesn't looks like a movie because of its originality. Best gangster movie all time. 5 star rating.","label":0},{"review":"Best crime thriller ever produced in Indian Cinema.You can watch it over and over and over still u will be thrilled every time.","label":0},{"review":"What a great movie... \nExcellent acting by our. Beloved nana patekar sir. .","label":0},{"review":"What an amazing movie. Nana leads the stellar cast with complete machismo","label":0},{"review":"What an grt movie... Nana patekar sirs acting * dialog delivery superb","label":0},{"review":"One of the best Movies. No one can Act like  Nanaji...","label":0},{"review":"At first the title kills the interest.secondly loosely based plot kills the rest.this movie can be watched to witness Nana s flawless acting.","label":0},{"review":"Excellent movie\nSuperb acting by Nana Patekar\nExcellent direction by Shimit Amin","label":0},{"review":"In the movie Department internal issues show how they create situations in public servent life and spoil that","label":0},{"review":"Nana patekar sir is versatile actor....I am a big fan .....","label":0},{"review":"One of the best from Nana Patekar","label":0},{"review":"A true masterpiece, Great movie.","label":0},{"review":"Inspiring movie","label":0},{"review":"amazing daylong & Nanas expression","label":0},{"review":"This film is very best film","label":0},{"review":"Nice movie bt 2nd part is umm... Ok ok","label":0},{"review":"Awesome movie","label":0},{"review":"Amazing film","label":0},{"review":"AWESOME MOVIE","label":0},{"review":"Fantastic movie...super suspense","label":0},{"review":"Just speechless","label":0},{"review":"Nice to watch.","label":0}]