[{"review":"A total Paisa vasool Movie... Really don't know why the hell the audience reject it... It's a superb combination of Action, Drama, Comedy and good music as well. The only reason for which I think the audience rejected it is due to bad dance moves of AD in AJ... But, that was shown as comedy scenes in the movie... If the audience can accept Ajay in his Golmaal series, than this movie should also be worth accepting... Bad Luck for both Ajay and Prabhudeva... But, in my view, it's a must watch movi ...MORE","label":0},{"review":"A total Paisa vasool Movie... Really don't know why the hell the audience reject it... It's a superb combination of Action, Drama, Comedy and good music as well. The only reason for which I think the audience rejected it is due to bad dance moves of AD in AJ... But, that was shown as comedy scenes in the movie... If the audience can accept Ajay in his Golmaal series, than this movie should also be worth accepting... Bad Luck for both Ajay and Prabhudeva... But, in my view, it's a must watch movie for them who want their full ticket money back in 3 hours...","label":0},{"review":"Kitaab Lekar dance yaad kraya Taa Syd Ajay devgan ko.. \nWo nhi kraya jo aata Hai.. \n\n\nA milestone actor With new director who was doing experiments with Ajay Ji.. \nNot use any single capacity of this mature and National award winner actor..\n\nAjay devgan should avoid this type of senseless project.. \nWe expect better from you..","label":0},{"review":"Thise film is very nice \n Thise film complited romance and comedian ajay and sonakshi theimprative love\n  Love is not hard of life ' but is part of life\n                  By. yogesh kumar","label":0},{"review":"Totally a masala movie for die hard ajay devagn's fans. Ajay did his best. Sonakshi and yami were just ok.","label":0},{"review":"This is not a Ajay Devgan's movie. Too much of commercial type movie. The story is same as Rowdy Rathore and Gabber is Back. Ajay sir's bad attempt!!!","label":0},{"review":"Hii May Best Aetress Bollywood Action Jackson (2014) Movies Is Great Full time Happy I Like This","label":0},{"review":"I like the full Hindi movie of Action Jackson because Ajay Devgan is the best Hindi Actor in the world","label":0},{"review":"It's action and stunts are best and comedy very much good I love this movie","label":0},{"review":"Wow very nice film drama and action one do action and the other do Jackson it,s Review totally full 10.10","label":0},{"review":"I wanted to see this movie but I m not getting it...  Can u help me to download","label":0},{"review":"Superb movies.       My favorite hero.    Aj","label":0},{"review":"My favourite movie Ajay devgan action , comedy maja aa gaya","label":0},{"review":"the best of all movies i ever watched . Ajey actor of all time","label":0},{"review":"This is very very good and nice action comedy film","label":0},{"review":"The movie was awesome  especially Anandraj acting was super","label":0},{"review":"Good and can be watch when you are free..","label":0},{"review":"The best movie i have ever seen","label":0},{"review":"You will like it only if you are Ajay s big fan.","label":0},{"review":"One time watch\nSome scenes are pretty good","label":0},{"review":"Prabhas special appearance in the song \"Punjabi Mast\" ⭐❤👌","label":0},{"review":"my favourite movie ever and my favourite actor Ajay Devgan","label":0},{"review":"Super  Super  Super","label":0},{"review":"Its really a good movie. Should watch once.","label":0},{"review":"Very good acter ajay devgan","label":0},{"review":"Excellent movie","label":0}]