[{"review":"One of the best bollywood movies I have ever watched .. It shook me both physically and mentally... It is such a tear jerking and heart rending story that it almost makes me cry for it !!\nOn one side the love between the son and the father and on the other side the love between a brother and his sister . The movie left me spellbound !🤐\nHats off to all the actors who were involved in the film ...","label":0},{"review":"Hats off Hrithik Roshan! Every scene is amazing. Acting , emotions, stunts  and more. What a story ! Thank you to all actors , everybody who worked for this film. So impressed by this film, thanks again.","label":0},{"review":"Excellent performence of hrithik roshan sir,best direction of mr. karan malhotra  ji,best performence  of  ms.priyanka chopra ji  and ms. katrina kaif ji,best music of mr.ajwy atul ji,action packed emotional  and touching filim.","label":0},{"review":"Each and every carecter in this film from lead to villan roles are designed for artwelming kind\nCredit goes to director. Goosebumps in many scenes has taken to the different world for 2 hrs. Art lovers will enjoy this movie irrespective of each carecter good move.","label":0},{"review":"The most wonderful remake I have ever seen in  any language. ...One of the best performance in hrithiks career. ...no words. ....simply outstanding. ...","label":0},{"review":"Better performance appeared of my hero AMITABH BACHCHAN in this movie.then only they got national award for their leading role!  Agneepath 1990 is evermore hit and no body can have ability to break this record nevermore...!","label":0},{"review":"One of the bollywood movies with which the audience gets emotionally connected..I literally had gone through no. of experiences -anger, tear, goosebumps and a lot more ..IMDb has given just 6.9 bcoz they didn't give weightage to emotional connection that this movie establishes with d audience ...because if they had , rating would be over 8.5.","label":0},{"review":"Superb movie every scene got goosebumps.. action scenes are highlight..villian is too good by Sanjay Dutt..I loved this film ...","label":0},{"review":"one of the best in Bollywood. not recommended for people who doesn't know the taste of good movie and there are many of them in India.","label":0},{"review":"Nice. Movie, sanju baba is great performance in this movie, must watch guys, once again, thank q","label":0},{"review":"Awsome movie in that the hrithik and sanjay duty fine combination really action movie I liked it and watched the movie 7 times fine","label":0},{"review":"Best ever acting by Sunjay Dutt.... Must watch movie... Hats off to the DIRECTOR...Loved it","label":0},{"review":"Amitabh Bachchan's dialogues were good Also Mithun Chakraborty had a great role. Overall excellent.","label":0},{"review":"At the climax, despite being stabbed hero's abs are neat and clean. Such a great movie.","label":0},{"review":"Awesome, Hrithik and Sanjay dutt is better act than 1990. Superb my hero Hrithik.","label":0},{"review":"Sanjay dutt best villan best actor best.& Best comedian I love baba💕💖💘🏨❣️","label":0},{"review":"In my opinion both Hrithik Roshan & Sanjay  dutt deserves national awards for best actor and villan respectively.","label":0},{"review":"Awesome movie!\nAll the main characters acted excellently.","label":0},{"review":"This is the Best Movie I have been ever seen \nIta my favourite","label":0},{"review":"Super songs superior acting touch my soul I love dis movie soooooooo much","label":0},{"review":"Best Movie Ever Seen In My Life I Watched this Movie For 378 Times","label":0},{"review":"Amazing movie, both the versions, but the older version has an edge but mind you, a slight edge only  !!!!!","label":0},{"review":"One of the best movie of Hrithik Roshan. I liked it.","label":0},{"review":"This movie is fantastic and very graceful all the characters.","label":0},{"review":"Very good movie with a nice story and cosept","label":0}]