[{"review":"I went into the movie blind, not knowing what to expect, except for the brief description of the movie on Netflix. In summary, people in jungle, something kills them 1 by 1. Got it. I was interested to see if this was a human killer or something supernatural.\n\nThe usual tropes are present. The only plane to the site only comes as and when, their phones has no network and the victims roster has the usual variety of characters such as the annoying one whom we will all hate, the meek one, the prett ...MORE","label":0},{"review":"I went into the movie blind, not knowing what to expect, except for the brief description of the movie on Netflix. In summary, people in jungle, something kills them 1 by 1. Got it. I was interested to see if this was a human killer or something supernatural.\n\nThe usual tropes are present. The only plane to the site only comes as and when, their phones has no network and the victims roster has the usual variety of characters such as the annoying one whom we will all hate, the meek one, the pretty one,  the angry one, etc. Ok, so far so good. \n\nHowever, even without touching on the weak storyline or the poor pacing, one major issue I have with the movie is the camerawork. The repeated pan-and-zoom from a distance from the sky, tree, bush, ground seems to serve no real purpose. Usually it ends up panning or zooming behind an object which blocks the characters from view. It felt that they just bought a camera that that this feature so they do it over and over and over again. If it is supposed to be an artistic camera shot as it comes from a weird angle, they got carried away with it. That kinda ruined the experience for me.\n\nAnd the ending was at best anti-climatic or simply lazy.\n\n3/10","label":0},{"review":"I want to watch  second part of Agyaat\nThe actor Nithin  performed nicely l would like to see Mr. NITHIN  in bollywood film also\nBest Regards","label":0},{"review":"There is my favourite actor Nithiin Kumar reddy.  So the movie will be good for me . I love him very much .","label":0},{"review":"This  is thriller, full of horror and mysterious movie .I am waiting since 2009 in the hope of watching the second part.I want to see NITHIN and NISHA KOTHARI.","label":0},{"review":"I want to wach second part of this movie because its so horer and best story of unknown mistry in the earth","label":0},{"review":"Sir Its a humble request please make part 2 of this movie we are eagerly waiting Sir Ram Gopal Verma is a great Director and producer","label":0},{"review":"I saw today early morning this movie I love that good job done waiting for next part","label":0},{"review":"I also want to watch 2ndpart of this movie and I want to know which things or animal ,whatever it is!Who killed person one by one.so I m so excited","label":0},{"review":"I want to see next part of this movie this is a unique horror movie.","label":0},{"review":"I watched Movie many times... really waiting for Part 2....all actors perform really good","label":0},{"review":"Best movie ever made. 11/10 would recommend.","label":0},{"review":"faltu acting,story aur directing.ALSO ITS COPIED FROM VARIOUS ENG MOVIES LIKE  PREDATOR , TREMORS","label":0},{"review":"I want to second part  and I love this move","label":0},{"review":"ram gopal varma sir please make this movie 2nd part so excited","label":0},{"review":"I love this movie. I want to watch second part of this movie.","label":0},{"review":"I want to watch its second part great movie.","label":0},{"review":"We're is this movie part 2 how many years I'm waiting for  part 2","label":0},{"review":"Waiting for the next part of the film and want to know the truth","label":0},{"review":"Want to see agyat second part any body can tell when it will be come","label":0},{"review":"Awosam movie","label":0},{"review":"It deserves best climax","label":0},{"review":"ramgopal ji please make part 2 of agyta movie we are waiting for movie since 2009","label":0},{"review":"It jst  freaking awsome","label":0},{"review":"I am wating for second part just to know what was that unknown creature","label":0},{"review":"I am wating for second part just to know what was that unknown creature???","label":0}]