[{"review":"The movie truly intricates the confusion all the twenties young brats go through. You know what you want but you want better, you know what you have but you want better. And just like that, love happens, we loose, we learn and we reconcile. Aisha is a simple girl (only in thoughts) and goes through a series of reconciliations and love-makings and in the end find love in what she had in the first place. A cute and honest lovestory.","label":0},{"review":"Amazing movie! being a Delhiite I can associate myself with it. The most amazing thing is that it is an adaptation of a novel Emma by one of my favourite writers Jane Austen. Reading her novels and discussing with my mates during my preparations for NET in Sahitya Classes by Vineet Sir was just amazing.","label":0},{"review":"Wow! what a movie. Just loved it. I am in Delhi for the last five years and literally, I can relate myself to the characters. The movie is an adaptation of a novel \"Emma\" by Jane Austen. I got to know about it during my NET preparations in Delhi Sahitya Classes by Vineet Pandey Sir. Those days were just amazing.","label":0},{"review":"I really love this movie. Aisha wants to make perfect everything by matchmaking but she herself jeopardizes her own life and others too. And this is one of the phases of the Indian cinema where the content is clean, innocent and cute. And thus, the brownie points for this movie. :)","label":0},{"review":"One of my favorites❤ This movie delicately covered Delhi young brats & their lifestyle. From the rich lanes of Delhi & glamorous lifestyle to silly yet cute problems of youngsters,  the movie showcases everything in style. On top, it has lovely background & original soundtrack music.","label":0},{"review":"Very nice movie.. Brilliant direction . Abhay deol is talented actor as he proved it again.. Sonam is beautiful but lacks acting skills ..She need focus on it ..Good movie ..","label":0},{"review":"Jane Austen's novel \"Emma, \" Where the character Aisha is Miss Woodhouse in the novel. The novel is based on a 19th century England. This novel delicately covered delhi's life and I also experienced when I went for my UGC NET JRF preparation in Sahitya classes by VINEET PANDEY.","label":0},{"review":"Great chemistry between Sonam & Abhay.. Carefree youthful days, good cloths, flings, parties, holidays etc. Enjoyed this chick flick !!","label":0},{"review":"I love this movie⏭️⏸️⏮️ one of my fav❤️❤️❤️the music, vibe, everyone was hilarious. Its entertaining #chickflick#adorable#SonamAbeyD❤️🌈","label":0},{"review":"Not a good movie. Failed to maintain one constant character of aisha. Aisha is full of over action. Somewhere, they have tried to put emotions but audience can't feel them.","label":0},{"review":"This type of movie tells love naturally. Portraying high society lifestyle.  flow in storytelling. Abhay is Rocking again.","label":0},{"review":"This is a poor rip off of the Hollywood movie 'Clueless'. The characters here are older though and there are a few changes from the original. Sad!!!","label":0},{"review":"Sonam kapoor is superb. Nice n simply cute. I loved it","label":0},{"review":"Very very nice ........the story of the movie is nice .....all the actors have done their characters in very well and effective .The songs of movie r very nice","label":0},{"review":"This movie is a clear cut adaptation of Jane Austen's novel \"Emma, \" Where the character aisha is Miss Woodhouse in the novel.  Only the bachkdrop settimg is different.  The novel is based on a 19th century England whereas the movie is of modern Mumbai(India)","label":0},{"review":"I LOVE THIS FILM..!!!\n\nFilm AISHA is an awesome film ❤️","label":0},{"review":"It's a nice and beautiful description of the novel Emma by Jane Austen.......I mean ...I personally loved it......","label":0},{"review":"Brilliant script. Pure class of presentation. Loved it.","label":0},{"review":"Based on the iconic movie Clueless. This one just has an Indian touch to it","label":0},{"review":"vry nice movie.. I love it","label":0},{"review":"Watch for Abhay Deol's role as a sensible man and a sweet lover.","label":0},{"review":"Very nicely directed and an Amzing combination","label":0},{"review":"the best work done by sonam kapoor","label":0},{"review":"Very nice  movie i like it","label":0},{"review":"Abhay is a suprb actor  n sonam is cute","label":0}]