[{"review":"First of all I love this movie because hameshe ladka galad nehi hota. Sometimes girls also do such bad thing. Priyanka runs for money and leave akshay by choose her profession and afterwards she married a old rich man. But later on she met akshay where she is come as a pisition on chairman. Priyanka can't resist her feeling and seduced akshay but akshay didn't agree as a result Priyanka sued a case against him. And after that kareena played the lawyer role and also the wife of akshay. Akshay, Pr ...MORE","label":0},{"review":"First of all I love this movie because hameshe ladka galad nehi hota. Sometimes girls also do such bad thing. Priyanka runs for money and leave akshay by choose her profession and afterwards she married a old rich man. But later on she met akshay where she is come as a pisition on chairman. Priyanka can't resist her feeling and seduced akshay but akshay didn't agree as a result Priyanka sued a case against him. And after that kareena played the lawyer role and also the wife of akshay. Akshay, Priyanka and kareena each all plays a good role. Story was good. Each song was feel good in ear till niw of this movie.","label":0},{"review":"A movie ahead of its time even though it took inspiration from the Hollywood. One of the finest work of Abbas Mastan duo.  Still Bollywood is not making such kind of movies. Watch it if you like to see different kind of stories. A well packaged movie. Don’t think well packaged means Taran Adarsh review","label":0},{"review":"The movie is very good. All Artists have done great job. But I liked Kareena Kapoor's performance most. The way she delivers dialogues in the court room is excellent. Completely immersed in the character. Very furious over inappropriate things. Does not accept wrong perspectives.","label":0},{"review":"I like this movie because it has some different aspect, not boys are always wrong. When i first saw it i didnt knew that its a remake of a hollywood movie and i didnt even realise because all actors, directors and team did a great job. Specially priyanka was superb in this role.","label":0},{"review":"Love this movie as it had every essence that portrays true love and trust a wife has on her husband. Awesome this one!!","label":0},{"review":"Inspired from the Hollywood flick Disclosure and adapted to suit the Indian masses. The movie does keep you engrossed and is a good thriller.","label":0},{"review":"Good film.Paresh Rawal is superb. Matured acting by Annu Kapoor and all the artists. Shooting has been done in beautiful locations.","label":0},{"review":"Remake of the Demi Moore movie \"Disclosure\", but overall I think Aitraaz is way better than the Hollywood counterpart! Highly recommended.","label":0},{"review":"True love between husband wife of this stature is rare now a days!  I wish this to happens in all marriages!","label":0},{"review":"Just watched on Netflix today , Great performance by every actor , specially Priyanka Chopra , Kareena Kapoor and Paresh Rawal too 👍","label":0},{"review":"Priyanka chopra  your charcter was great akki sir u are the best this film is great 100 out of 100 👌👌👌👌","label":0},{"review":"It was a blend of grey shades with villainous shades from Priyanka and doting wife played by Kareena Even Akshay did a great job......","label":0},{"review":"Movie is fantastic and i love perfomance of priyanka chopra ,although my favourite kareena kapoor is also!!!","label":0},{"review":"Well I think it's some of a bit taken from Hollywood movie Disclosure 1994. But well it's  nice movie.","label":0},{"review":"Himesh reshamiya ji is great music for this movie .and standing new level of this movie","label":0},{"review":"100/100 amazing movie.nice chemistry between Akshay Kumar and Kareena Kapoor","label":0},{"review":"It is basically the copycat of hollywood flick, Disclosure 1994. Yet both are hit.","label":0},{"review":"I love this move because this song is defrinte \nI like this move","label":0},{"review":"Love The film loved the songs","label":0},{"review":"I just search this movie for know what is actually happens there....and for what reason \"cat fight\" starts between priyanka and Kareena","label":0},{"review":"I Liked movies and loved songs","label":0},{"review":"One of Best Romantic Thriller","label":0},{"review":"I like this picture also like work of kareena","label":0},{"review":"Best movie I like this movie","label":0},{"review":"Fantastic movie of akki","label":0}]