[{"review":"An expected delight. This movie is so near to my heart. No matter many people do not  know about it or like it but for me this is an  ultimate stress burster. It renewed respect and love for Rani. Each aspect of the film demands praise separately. Love this movie. Thanks to the people behind making it.","label":0},{"review":"I would say this is the best movie ever...this made me laugh soo hard...everything about this movie was amazing...even my situation is also just like meenakshi...in the end I cried a lot seeing, Surya proposing Meenakshi....I just couldn’t control my tears..tears of happiness....this movie is a complete package I would say..every sad person should watch this movie...Rani Mukherjee did\n  a wondeeful job. Her acting was fabulous .. Hats off to the entire team..  \nI just fell in love with this film ...MORE","label":0},{"review":"I would say this is the best movie ever...this made me laugh soo hard...everything about this movie was amazing...even my situation is also just like meenakshi...in the end I cried a lot seeing, Surya proposing Meenakshi....I just couldn’t control my tears..tears of happiness....this movie is a complete package I would say..every sad person should watch this movie...Rani Mukherjee did\n  a wondeeful job. Her acting was fabulous .. Hats off to the entire team..  \nI just fell in love with this film❤❤","label":0},{"review":"Pure delight! There was a mention of Alice in wonderland in the movie. This movie has the same zany touch. Sachin Kundalkar, the director, is an eccentric genius :). I'll bet he was inspired by Alice. I'd like to watch the rest of his movies now. I hope they are this carefully made. He's mostly made Marathi movies, I hear.","label":0},{"review":"This movie sucks big time! The script is weaker than the male ego. Even deodorant ads will be facepalming after watching this movie. Rani's character is no less than a lost sniffer puppy. I mean getting attracted to someone because of their body smell is fine, but falling in love because of the same reason is so lame. Please do not waste your valuable time watching this.","label":0},{"review":"Wats fun without some craziness .. the entire cast has got their freak on .. also the movie has got some art to it amidst all the madness which gets gets u thinking .. and Rani is such a delight .. I suggest you to definitely watch the movie as it is not a typical Bollywood Romcom movie","label":0},{"review":"The movie is awesome. I loved it. Many people must hve not liked it, but Its great movie with awesome performances by all,specially Anita date. Pls show movie on TV.","label":0},{"review":"I like the movie too much.... I can relate with Rani's situation... Her expressive eyes told the full story...  And aiyyaaaa prthviraj was tremendous hot and irresistible... Loved the chemistry too much","label":0},{"review":"This is absolutely a feel good movie. Based on the reviews, I think one set of people would like this movie. In order to judge a movie unbiased, you need to discard the reviews and watch it without any expectations.","label":0},{"review":"It reveals characters efforts to look effortless.Nice movie. Rani's acting is outstanding. Every character played their role nicely.","label":0},{"review":"Was casually watching this movie on tv and I couldn’t stop from watching the entire film. The acting of the entire cast was really good - a different story which was a mood changer. Also extremely funny!!","label":0},{"review":"Very few movie has a feel to it ...This is one of it .Fabulous direction ..I think the name of the movie is not right ..It should have been more meaningful ..Aiyaa does sound that nice","label":0},{"review":"I don't know if everyone below the comment are joking but this movie is the the literally worst film I have ever watched all the story building in the movie ends in only  just one night and everything becomes normal like in every Bollywood movie I give this movie 1/5 stars.","label":0},{"review":"This is one of my favorite... And people who don't like this movie are surely depressed or don't know how to enjoy a delightful movie like this one!!!","label":0},{"review":"Both r my favourite Prithviraj n Rani Mukherjee the flim was very dramatic n romantic also songs r very good they both r done great job.","label":0},{"review":"Outstanding movie!! Unfortunately under rated. Too good casting and character. And no words for the humor and punches. Rani just rocked it.","label":0},{"review":"A sweet movie with so much fun elements and amazing charm of Rani. Loved it","label":0},{"review":"Amazing script and the characters have done a good job. Overall entertaining.","label":0},{"review":"This movie deserves better ratings, it a good movie. Decent comedy and good entertainment.","label":0},{"review":"I never get bored while watching this movie. Crazy n funny. I like it.","label":0},{"review":"This is the worst movie produced by YRF.Rani Mukharjee could have been declared as the worst actress.Thankfully she came back with Hichki.","label":0},{"review":"It's a nice Comedy movie. If you're rani mukharji's Fan then movie is for you.","label":0},{"review":"I love watching this movie. Such a delight.","label":0},{"review":"very nice comedy movie.all characters r very good.Rani is too good.must watch","label":0},{"review":"Outstanding....I saw the picture after seeing  the video of dreammum song ...good one..","label":0},{"review":"Superb movie...Rani is too good ...all the marathi actors hv rocked","label":0}]