[{"review":"(What can I say. When you hear that one of your favourite Disney classics is going to be recreated for live action, you also hear that tiny voice of trepidation in your head saying \"please don't mess this up\". Well I'm pleased to say that was not the case here. Aladdin is a complete triumph.\nLet's  break this down.\n\nWill Smith as the Genie was always going to be a huge talking point. He had some very large Robin Williams style shoes to fill. Smith admittedly did not want to recreate perfection b ...MORE","label":0},{"review":"(What can I say. When you hear that one of your favourite Disney classics is going to be recreated for live action, you also hear that tiny voice of trepidation in your head saying \"please don't mess this up\". Well I'm pleased to say that was not the case here. Aladdin is a complete triumph.\nLet's  break this down.\n\nWill Smith as the Genie was always going to be a huge talking point. He had some very large Robin Williams style shoes to fill. Smith admittedly did not want to recreate perfection but instead put his own spin on the character whilst still maintaining the nostalgia of the role. It's fair to say it was a success. There were some classic Smith comedy moments throughout as well as his own original musical flare in some of the films most famous numbers. A great job for the Hollywood legend.\n\nAs for Mena Massoud (a fairly unknown actor) who played the title character, he was simply perfect for the role. He looked the part, had an excellent singing voice and managed to capture the cheeky charisma of the character brilliantly well. With some excellent dance scenes and some hilarious comedy timing with co star Smith, Massoud was a truly wonderful casting choice for the film. He really is the real life Aladdin. \n\nIt wasn't just Massoud and Smith who stood out either. Naomi Scott (Princess Jasmine) and Marwan Kenzari (Jafar) gave an equally believable performance in recreating these characters. Naomi's out of this world singing voice was enough to send shivers down your spine whilst the villainous stare and evil tongue of Kenzari did not disappoint. A film is only as strong as its actors and everyone in Aladdin did a phenomenal job. \n\nThe film itself was very well directed. Props to Guy Ritchie for putting his own personal film style on this without diviating from the well known story line and maintaining the magic of the classic 1992 original.\nVisually spectacular scenes including the memorable flying carpet scene and the cave of wonders greatly exceeded my expectations. This CGI magic mixed with some excellent musical production scenes made this film one I would watch again and again. A classic story exquisitely made with an immensely talented cast. What more could you want from Disney. For me, watching this was like watching one of my favourite childhood films come to life.\n5 stars all day long!","label":0},{"review":"Directed by Guy Richie, the same Guy who gave us \"Snatch\" and \"Sherlock Holmes \" is here with an Arabian fairytale...\"Aladdin\" is nothing but a nostalgic dream came true for those who had seen it on TV years ago. We need , perhaps, more movies like this, celebrating love , hope, freedom and the pleasure of being together, victory of truth and the destruction of evil...Yeah ! in nutshell, a very happy ending movie. It's the most colourful movie I have seen this year...\nMena Massoud, who plays Ala ...MORE","label":0},{"review":"Directed by Guy Richie, the same Guy who gave us \"Snatch\" and \"Sherlock Holmes \" is here with an Arabian fairytale...\"Aladdin\" is nothing but a nostalgic dream came true for those who had seen it on TV years ago. We need , perhaps, more movies like this, celebrating love , hope, freedom and the pleasure of being together, victory of truth and the destruction of evil...Yeah ! in nutshell, a very happy ending movie. It's the most colourful movie I have seen this year...\nMena Massoud, who plays Aladdin may not be a guy that you will fall in love at the very first sight, but let me tell you, eventually you start to feel for him, root for the street rat. Naomi Scott is Princess Jasmine with all the glory to that name, she plays it convincingly innocent and royally elegant and super stubborn as she sings \"speechless \".\nBut who steals the show here ? None other than The Genie, Will Smith has transformed himself not just in to blue but also as an incredibly funny Genie who gets most of the best dialogues of the movie and he simply remains the sole reason why you leave the cinema with a big smile. He sings , dances and cracks jokes ... and you just can't help laughing out loud.\nGuy Richie extraordinarily recreates the Arabian magic on screen... Let it be Abu, Rajah or Iago, all of them are carefully crafted, magnificently maintained and brilliantly brought onto the screen. The songs, the set, the colours, clothes, the dance and I may not be able to finish without mentioning Jafar played by the very talented Marwan Kenzari, as an evil touch to the fairytale, is commendable. Guy Richie has been a brilliant director and he proves it yet again. \nI personally feel we need more movies like this... where goodness is rewarded, evil is expelled and togetherness is worshipped, Love is triumphed... With every rub on the Lamp, a genie is set out.... with a tale of love ,trust, hope and togetherness. \nI'm going with 4 stars for recreating the magic , for Guy Richie and Will Smith.\n⭐⭐⭐⭐","label":0},{"review":"Within a duration of about 2 hours, I was able to journey through my childhood days, and enjoy each and every bit of the ''Whole new world'' as well. Almost three decades have passed in between the old and new film, yet not a single emotion is absent in the new movie. It is as fresh and soothing as the old one. Hats off to @guyritchie, the director of the movie, for recreating most of my favourite scenes.\n Although a debate about @willsmith as the #genie is on air, Smith is too awesome for this  ...MORE","label":0},{"review":"Within a duration of about 2 hours, I was able to journey through my childhood days, and enjoy each and every bit of the ''Whole new world'' as well. Almost three decades have passed in between the old and new film, yet not a single emotion is absent in the new movie. It is as fresh and soothing as the old one. Hats off to @guyritchie, the director of the movie, for recreating most of my favourite scenes.\n Although a debate about @willsmith as the #genie is on air, Smith is too awesome for this role. He has done great justification for the role as well as for the movie. Once again, he proved that he can portray any role in any movie as efficiently as one can think of. @menamassoud as Aladdin is too adorable. He justified the multifaceted character of #Aladdin - a street rat who is forced to earn his living by thieving, a selfless vulnerable guy, a trustworthy friend and a true lover. But what I like mostly about Disney is the paradigm shift of its recent movies; a shift in the trend of female characters from dwelling on a bubble of romanticism to strong women who can earn their own positions in the society by themselves and not by the mercy of the patriarchal society. #Jasmine of this decade can speak about their own demands. They need no help of any man. They know what they want, and how to get them. Jasmine (played by @naomiscott) is perhaps the best role in the movie, and will be remembered by the audience for a long time.\nThe most powerful tool of this movie is its songs. Old songs are recreated in a wonderful way, especially ''Whole new world''. The new song #Speechless is also too good and powerful (I've already listened to all the songs almost a thousand times in a loop since release) \nThe VFX and other technical tidbits are indeed praiseworthy and mind-blowing. \nAlmost all scenes are breathtakingly awesome. Was there a genie in reality, I would have wished for such wonderful movies from the house of Disney in future... \nThanks again to @disney for refreshing our (me and all 90s kids)  childhood memories and gifting us a magic carpet ride, far away from lustreless reality, for full two hours. It's a must watch movie for all 90's kids.","label":0},{"review":"I will attempt to do this without too much bias from my 5-year-old self who fell in love with the 1992 Disney classic, \"Aladdin.\" I took my girls to see the live-action version today and it did not fail to deliver. Without any spoilers, here is what had me leaving the theater feeling like a kid with a dumb smile on my face. Jasmine was physically gorgeous and vocally spectacular. I did not know who Naomi Scott was going into this, but she certainly has my vote for future films. The way she belte ...MORE","label":0},{"review":"I will attempt to do this without too much bias from my 5-year-old self who fell in love with the 1992 Disney classic, \"Aladdin.\" I took my girls to see the live-action version today and it did not fail to deliver. Without any spoilers, here is what had me leaving the theater feeling like a kid with a dumb smile on my face. Jasmine was physically gorgeous and vocally spectacular. I did not know who Naomi Scott was going into this, but she certainly has my vote for future films. The way she belted \"A Whole New World\" and crushed her two new solos restored my faith in modern vocalization. She didn't necessarily sound like every pop-star born out of whatever reality t.v contest happened to be poisoning the nation at the time. Her voice seemed more pure, unique, and fresh. And whether or not you're into \"extreme feminism\" or \"women empowerment\" I would say, as a father of two women-in-training, most can agree that she was a breath of fresh air from your typical Disney princess without being over the top or anti-man. \nWhile Jafar's mannerisms were certainly maniacal and it was clear that he was obsessed with taking the throne, I had a difficult time with his voice. Jonathan Freeman (1992 Jafar) sounded like and delivered his lines in a way you would expect a classic villain. In my opinion, the new voice of Jafar left something to be desired. That said, the character overall was decently played and got the job done. \nOur main protagonist had the look and moves, but again, it was a voice thing for me. Perhaps this is in part to the fact that I had Steve from \"Full House\" and the singing talents of Brad Kane stuck in my mind. I understand you are trying to be different than your predecessor, but there were some sung lines that seemed short and cut-off; possibly even hesitant. Like Jafar, Aladdin was mostly positives and certainly held my attention. \nOn to sets, scenery, and costumes. What can I say? They were absolutely visually stunning! The colors were crisp and vibrant and the set designs gorgeous. The way everything flowed together with such ease made you feel as though you were in Agrabah. I imagine the 3-D would have been incredible, as you can clearly see how certain scenes were made specifically for it. \nWell, I suppose that's it. I don't believe I am missing anyone important... JUST KIDDING! I had to save the best for last. Let's just agree right now that the late, beloved Robin Williams certainly MADE the Genie, and increased the overall quality of the original classic by about 200%. Nobody could ever reprise his role and do it justice. Anyone taking on this blue powerhouse would absolutely have to do their own thing, and Will Smith did NOT disappoint. With great respect for Mr. Williams, Mr. Smith originally declined the role, but I could not be happier that he reconsidered. Everyone knows \"Big Willie\" can drop a beat but the way he rocks the vocals in all of his singing numbers is enough to make the part his. Add that to his personal twist on the humor and he IS the complete Genie package. \nAll in all, I would give \"Aladdin\" an 8/10. It is a great watch for the whole family as children and adults alike will laugh, dance, and sing along to this modern Disney masterpiece.","label":0},{"review":"3.5***  ALLADIN MOVIE REVIEW (NON-SPOILER)\n\nThe same wine in the new bottle with an appealing aroma will be the one-liner. Breaking down to the bright side, the 130 minutes of fun and drama is quite engrossing. Disney never disappoints and this time, Alladin has done decent enough.\n               Mena Massoud (Alladin) the wild card, was the perfect fit and a charming/jolly chap to count upon so as Naomi Scott (Princess Jasmine) who was lively and giving to the entire cinema. Both of them took u ...MORE","label":0},{"review":"3.5***  ALLADIN MOVIE REVIEW (NON-SPOILER)\n\nThe same wine in the new bottle with an appealing aroma will be the one-liner. Breaking down to the bright side, the 130 minutes of fun and drama is quite engrossing. Disney never disappoints and this time, Alladin has done decent enough.\n               Mena Massoud (Alladin) the wild card, was the perfect fit and a charming/jolly chap to count upon so as Naomi Scott (Princess Jasmine) who was lively and giving to the entire cinema. Both of them took us to the typical Arabian Era and revisiting the sweet teens' love story was a pure fantasizing affair. \n                                                                       Will Smith's effortless actions were invigorating to the genie character being the big boon and the fluent comic timings are equally perfect as well.\n                            The victory of good over evil, teenage love, dilemmas, exquisite cinematography, revisiting the ancient Arabian era and culture are the highlights. Much to my surprise like in Indian movies, songs pertaining to the plot and situations have been added like decorative icing on a celebration cake. The soundtracks, scores are amazing and have the biggest impact.\n\n                                                  Summing up for this Arabian knight story is a beautiful presentation with best castings and good music. Refreshing movie but little editing could have weeded out the flaws. Going out with your girl or family is a good idea. Also, watch out for the animals playing some crucial roles much to the credit of the movie.","label":0},{"review":"Aladdin was AWESOME!! 🧞‍♂️ \n(No Spoilers Review) - Listen, I am one of the many who are extremely loyal to the Disney Renaissance Era (89-99) If you were a kid, or had a kid during that time, then you completely understand 😉 Having watched those films and sang those songs HUNDREDS of times, and attaching those moments to life's most precious memories, they become a part of you... \nThe Verdict: THIS👏FILM👏WAS👏BEAUTIFUL 👏 One of the most incredibly gorgeous interpretations to the culture, cos ...MORE","label":0},{"review":"Aladdin was AWESOME!! 🧞‍♂️ \n(No Spoilers Review) - Listen, I am one of the many who are extremely loyal to the Disney Renaissance Era (89-99) If you were a kid, or had a kid during that time, then you completely understand 😉 Having watched those films and sang those songs HUNDREDS of times, and attaching those moments to life's most precious memories, they become a part of you... \nThe Verdict: THIS👏FILM👏WAS👏BEAUTIFUL 👏 One of the most incredibly gorgeous interpretations to the culture, costumes, and story you could ever hope for. The powerful Alan Menkin musical numbers were each a home run, they will have you tearing up from the opening \"Arabian Nights\" through Jasmine's new solo song \"Speechless\" 💜 The films music stayed true to the format of the originals, but added tasteful elements of new fun in small areas.\nWill Smith DELIVERS - he is famous for a specific reason, hes ridiculously talented as a musical artist, and comedic actor.. this should not surprise you honestly. This character is magical... when you stop focusing on how important Robin Williams was to the genie, you begin to remember how important the entire cast is in the tale of the story you're experiencing. If you really love the original, then you must go see this movie I challenge you not to cry, it's impossible 😊","label":0},{"review":"Absolutely stunning cinematography, amazing musical numbers, beautiful vocals and show stopping choreography . I was truly transported to a whole new world and all my childhood wishes were fulfilled. Simply put, it made me feel like a child again, it was enchanting and the amount of chills and goosebumps I received cannot be counted. Listen to no critic who cannot find joy because they simply do not want to, and go watch this stunning retelling of a story we all know and love. The cast did the o ...MORE","label":0},{"review":"Absolutely stunning cinematography, amazing musical numbers, beautiful vocals and show stopping choreography . I was truly transported to a whole new world and all my childhood wishes were fulfilled. Simply put, it made me feel like a child again, it was enchanting and the amount of chills and goosebumps I received cannot be counted. Listen to no critic who cannot find joy because they simply do not want to, and go watch this stunning retelling of a story we all know and love. The cast did the original justice and I left the cinema feeling magical. (Also ignore those who say Will Smith was a bad choice, because he was brilliant and no other actor could have done such a good job. The whole cast was amazing, when I saw the trailer I wasn't sold on Naomi and Mena but they WON ME OVER and now I've found I firmly believe they were born to play Jasmine and Aladdin.)\n\nDon't get me started on Naomi's beautiful voice, rendered me speechless.\n\nOverall it was perfect and Will Smith truly put his own spin onto the genie while still making us remember and love Robin Williams. They were both the perfect genie, just different types. The musical scores were amazing and I do not think it could have been remade any better. 5/5 as there was no room for improvement. \n\n(Also it's hilarious so if you want a good laugh, go and watch it. )","label":0},{"review":"I enjoyed every single second of the movie. The graphics, the dresses, the colors, the music, the strong nostalgia, the new feminist twist! Gosh! What a movie!\nJasmine was by far the most amazing disney princesses in live action and even animation. She is elegant, beautiful, royal, kind but stubborn, ambitious and yes, she won't be silenced. That song \"speechless\" the way she delivered it gave me goosebumps. Her character was complete within herself. Aladdin didn't need to rescue her. They were  ...MORE","label":0},{"review":"I enjoyed every single second of the movie. The graphics, the dresses, the colors, the music, the strong nostalgia, the new feminist twist! Gosh! What a movie!\nJasmine was by far the most amazing disney princesses in live action and even animation. She is elegant, beautiful, royal, kind but stubborn, ambitious and yes, she won't be silenced. That song \"speechless\" the way she delivered it gave me goosebumps. Her character was complete within herself. Aladdin didn't need to rescue her. They were a perfect duo. Needless to say, Aladdin was done to a perfection as well. The charm, the dance moves, the singing, the emotions.. all were spot on! Just made me feel all kinds of feelings. I was so sad when the movie ended. We need more movies like this. That remind us of beautiful love, friendship, sacrifice, honor, strength and that women desever their own voice.\nGenie was hilarious. To be honest, I missed the original Genie a little. But will smith did it his way. And in itself it was amazing. The humour, the facial expressions, the depth of character.\nI am in love with this amazing adaptation of a timeless classic in need of modern flavour! The changes were seemlessly interwoven into the original movie. It was perfect. Anyone who tells you otherwise just doesn't have any sense of wonder and nostalgia.","label":0},{"review":"As a huge fan of the origional Aladdin I decided to approach this film with an open mind and think of it as a stand alone.\nIt felt like it had the structure of the original but bits were taken out improved and put back in again.\nI see this as a good thing and everything a remake should be.\nThe casting choices for Genie, Aladdin and jasmine were perfect.\nWill Smith was perfect as genie and did not feel the need to match Robin William's Genie as it felt like his own take and I praise his Acting.\nA ...MORE","label":0},{"review":"As a huge fan of the origional Aladdin I decided to approach this film with an open mind and think of it as a stand alone.\nIt felt like it had the structure of the original but bits were taken out improved and put back in again.\nI see this as a good thing and everything a remake should be.\nThe casting choices for Genie, Aladdin and jasmine were perfect.\nWill Smith was perfect as genie and did not feel the need to match Robin William's Genie as it felt like his own take and I praise his Acting.\nAlladin showed real fun and you believed every line, he also had an excellent voice and had grat chemistry with Neomi and Will.\nNeomi was a fantastic Jasmine and has a beautifull voice, and showed us a Jasmine we never got to see before.\nWhen I first saw Jafar I had my doubts one included was he oldenough, evil enough however, his performance was sinister and sickening as it should be and he did a great job.\nA problem I had was that the film contained a lot of CGI now some CGI can be harmless if used right, I was impressed by the practical effects used for Alladin's stunts however I could tell when CGI had been used and it pulled me out of the movie.\nMore songs were added to the film and they made it all the more better, the new songs were taken worked on and made even better than before, a whole new world nearly brought me to tears and I loved it all.","label":0},{"review":"Wonderful uplifting movie 🎵🎶  \n\nWill Smith is so much fun,  he is a complete JOY to watch as Genie.\n\nHe brings out his super adorable hip-hop FRESH PRINCE persona and melds it with a dash of maturity\n\n . . . honestly you AIN'T NEVER SEEN A FRIEND LIKE HIM !!!\n\nMena Massoud and Naomi Scott are PERFECT as Aladdin and Jasmine,  they're a very talented duo.\n\nAll the BEST bits of the animated original are faithfully there . . but they're all ENHANCED\n\nAspects we were not comfortable with are all re ...MORE","label":0},{"review":"Wonderful uplifting movie 🎵🎶  \n\nWill Smith is so much fun,  he is a complete JOY to watch as Genie.\n\nHe brings out his super adorable hip-hop FRESH PRINCE persona and melds it with a dash of maturity\n\n . . . honestly you AIN'T NEVER SEEN A FRIEND LIKE HIM !!!\n\nMena Massoud and Naomi Scott are PERFECT as Aladdin and Jasmine,  they're a very talented duo.\n\nAll the BEST bits of the animated original are faithfully there . . but they're all ENHANCED\n\nAspects we were not comfortable with are all removed and-or improved.\n\nBetter than the original ?!    YES YES\n\nAnd I went to see this film unwillingly & fully expecting to be disappointed  (after having seen the original a hundred times or more when my children were little & growing up)\n\nReally this new Aladdin is such a fun joyful movie\n\n. . . I can't wait to see it again and again\n\n👑🎵💕","label":0},{"review":"Well, I think the movie is just awesome, a treat to visuals and imagination, the characters are so well developed- with aladdin’s character theres so much shown about being down to earth, then lovequest, then a little greedy, then learning about greed later giving it up and lastly coming back to and exploring and evolving true self. Further the way Mena handled the character was just so flawless, its hard not to fall in love with the way he portrays simplicity yet attitude. With genie, So much h ...MORE","label":0},{"review":"Well, I think the movie is just awesome, a treat to visuals and imagination, the characters are so well developed- with aladdin’s character theres so much shown about being down to earth, then lovequest, then a little greedy, then learning about greed later giving it up and lastly coming back to and exploring and evolving true self. Further the way Mena handled the character was just so flawless, its hard not to fall in love with the way he portrays simplicity yet attitude. With genie, So much humour and so many witty dialogues, his entertaining job never fails to make you smile or even laugh. To top it all, Will smith playing the Genie, is like cherry on top. And lastly Jasmine, strong yet soft, thats how a women should be, the way Naomi carried herself is fabulous, especially her expressions are so par with the scenes. In all, its a beautiful movie, I would go on to say, this movie is like an art, and with a beautiful message.","label":0},{"review":"I recently just watched this movie, Will Smith did a wonderful job. I loved the cartoon Aladdin and seeing the live action just made me love Aladdin even more, I love how the cartoons of your favourite disney classics get made into beloved live actions like Beauty and the beast and now this. \n\nI loved it so much, the music roles are so amazing. Aladdin, Jasmine and Genie all have such amazing singing roles. I loved Jasmine's singing solo, I've always loved Jasmine and Genie in Aladdin. It is sti ...MORE","label":0},{"review":"I recently just watched this movie, Will Smith did a wonderful job. I loved the cartoon Aladdin and seeing the live action just made me love Aladdin even more, I love how the cartoons of your favourite disney classics get made into beloved live actions like Beauty and the beast and now this. \n\nI loved it so much, the music roles are so amazing. Aladdin, Jasmine and Genie all have such amazing singing roles. I loved Jasmine's singing solo, I've always loved Jasmine and Genie in Aladdin. It is still that way plus Aladdin because I'm secretly crushing on him. WHAT??? He has a great voice and he's pretty hot.\n\nA teenager watching the live action and a little kid watching the cartoon. What's the difference? Well you see the cartoons are always amazing when you see them but when you see the live action version of them they are even better. The live actions are always more intenser more interesting and more enjoyable. It had such good songs, and effects. \n\nNaomi Scott  was so gorgeous and she had such an incredible voice, her song was just amazing. My first favourite song in the movie, she just has a wonderful voice. \n\nI totally recommend watching this movie if you haven't already, the effects and the camera angles are magnificent. The dancing and singing is spectacular.\n\nJasmine is beautiful, Aladdin is hot, Abu is adorable, Genie is fun, Jafar is scary, Iago is a spying parrot, Sultan is cool, Dalia is pretty too and Rajah is a tiger that doesn't even look real. \n\nThe actors are amazing\n\nWATCH THIS MOVE IF YOU HAVEN'T ALREADY!!!!!!!!!!!!!!!!!!!!!!","label":0},{"review":"I went to see this movie a few weeks back, after seeing the Google reviews on here. I hoped I wouldn't be disappointed and thankfully, I wasn't. \n\nAladdin is an exceptionally good film - Mena Massoud and Naomi Scott were perfect as Aladdin and Jasmine, and Will Smith pulls out a fantastic performance as the genie, making the role his own without imitating Robin Williams. Controversial opinion here, but I also liked Marwan Kenzri's performance as Jafar. I'm aware many wanted a more creepy version ...MORE","label":0},{"review":"I went to see this movie a few weeks back, after seeing the Google reviews on here. I hoped I wouldn't be disappointed and thankfully, I wasn't. \n\nAladdin is an exceptionally good film - Mena Massoud and Naomi Scott were perfect as Aladdin and Jasmine, and Will Smith pulls out a fantastic performance as the genie, making the role his own without imitating Robin Williams. Controversial opinion here, but I also liked Marwan Kenzri's performance as Jafar. I'm aware many wanted a more creepy version that is akin to the cartoon, but I felt Kenzari did a fantastic job in portraying a more realistic villain who is unhinged, insecure and power hungry, \n\nThe whole film looked exquisite, from the costume design to the set pieces, and the songs were brilliantly performed without mimicking the original. There was also some great comic timing from the actors and some scene left feel feeling enthralled. \n\nOverall, I felt like this movie paid homage to the original whilst taking some creative licence so it looks and feels fresh. I also loved how they have enhanced the themes of the story, particularly in being truthful and what true friendship and sacrifice is. 5/5","label":0},{"review":"Ok so i saw the live action version of the classic 1990's animated movie where a young, dirt poor arabian kid finds a magical genie in a lamp who grants him three wishes as he tries to gain the affection of the cities (called Agraba) princess. As she can only marry a prince. All while trying to deal with the evil jafar (one of the Sultans aids) who btw does not look like how i expected Jafar to look. I was defintely dissapointed. He looked like the average arabaian (or wherever he was from) pers ...MORE","label":0},{"review":"Ok so i saw the live action version of the classic 1990's animated movie where a young, dirt poor arabian kid finds a magical genie in a lamp who grants him three wishes as he tries to gain the affection of the cities (called Agraba) princess. As she can only marry a prince. All while trying to deal with the evil jafar (one of the Sultans aids) who btw does not look like how i expected Jafar to look. I was defintely dissapointed. He looked like the average arabaian (or wherever he was from) person you would see in the street where as the Jafar in the animated movie had heavy lidded eyes and that ugly long narrow face which made him so special was lost! Atleast make Jafar look sinister and or give him some character other than his clothing! This is meant to be a big production and a greatly anticipated one at that! \n\nFirst off i generally NEVER judge a movie on the first watch. Why? Well becuase i need to watch it several times over a period of time to fully let eveyrhting sink in and so to appreciate the film. I'm sorry, but that's just me. \n\nHowever, i will say a few things based on my first watching of the film.\n\nOverall it's a good film. The musical parts in particular are probably the best parts of the film. There's also a song called speechless which is surpisingly good and modern based on the films time period and setting. I kind of guess it might become a hit? You heard it here first if it does!\n\nI still think Will Smith was wrong to be casted as the Genie. Don't get me wrong. I think he did a great job if not better than all the other actors but he still wasn't the right actor for the role bo matter how talaned he may be as an actor. His 'Fresh prince' 'hip hop' spin on the genie kind of worked but overall Robin Williams blew the character out of the park with his performance but we all knew this was always going to be one best Genie. \n\nNo Disney live remake has been better than the animated (original) version and this movie is no exception. \n\nI'm still not sure whether it is the best rendition of a live action movie to date but i'm inclined to say yes becuase the story of Aladin in my opinion is one of the best and most popluar in the Disney catalogue of films. So that's why i think it is probably the best live aciton disney movie to date. (Although i reckon The Lion King will be considered the best once it is released for the very same reason). You can't beat the circle of life story. It's the best!\n\nI could literally write an essay on this movie however i will keep it breif as this is a google review and i understand people may not have the time and just want a general, condensed idea of the movie. \n\nI also thought Guy Ritchie was an odd choice to direct this genre of film. The Mummy yes, Aladin, no! And unfortunately despite it being a good movie i kind of think, imagine what it could have been like if they got a more appropriate director to shoot it!\n\nThe performances weren't the best imo. Apart from Will Smith who if i'm honest isn't in the top echelon of actors (he hasn't even won an oscar) And depsite how funny and entertianing he is he just isn't up there with the industries top teir actors no matter what you may think. Princess Jasmine acting is probably the worst imo. Her expressions were flat but her singing was good (if that was her natural voice which i HIGHLY doubt it was. I'm thinking autotune and all sorts of other electronic wizardry) was likely used to improve her voice which actually if your being paid such a large amoutn of money you should be able to sing. I think the actor who played Aladin actually did a really good job considering. \n\nOverall i would reccomend watching at the cinema (plus the fact i hardly paid anything to go see it) and becuase well, it's aladin!","label":0},{"review":"Alright, I was 11 when Aladdin came out in '92 and I instantly fell in love with the film and soundtrack 😍👏\n\nNow fast forward to tonight and I've now seen the live adaptation at 38 🤯 I won't lie, I was super skeptical about the film for so many reasons but the main reason was that Robin Williams could never be replaced as the Genie.\n\nI was ready to leave the theater within the first 20 minutes due to the pacing of the film but I knew I couldn't do that without seeing what the always charismat ...MORE","label":0},{"review":"Alright, I was 11 when Aladdin came out in '92 and I instantly fell in love with the film and soundtrack 😍👏\n\nNow fast forward to tonight and I've now seen the live adaptation at 38 🤯 I won't lie, I was super skeptical about the film for so many reasons but the main reason was that Robin Williams could never be replaced as the Genie.\n\nI was ready to leave the theater within the first 20 minutes due to the pacing of the film but I knew I couldn't do that without seeing what the always charismatic Will Smith could possibly do to fill these impossible blue shoes.  \n\nI am SO glad that I stayed because as soon as the Friend Like Me song started the movie flipped the nostalgic kid switch in me 😃 It was such an amazing sequence and I knew instantly that Will Smith was the perfect casting for this role. I'm certain that Robin Williams would approve of his respectful take 💙\n\nIf you have reservations about this film, let them go. I think you'll be pleasantly surprised with what entire cast and crew were able to create. It may not be a whole new world but it's pretty close 😉👍","label":0},{"review":"I can't believe....\n\nIT WAS AWESOOOOOMMMMMEEEEEE\n\nOk. Don't you dare compare to the original because the story got changed in many many ways and you will see as soon as the movie starts. They didn't change the very core of the story or the lesson that it teaches us by storytelling rather than added more flavor to it. If you're like me and has all the lines memorized ( in English and in your native tongue) you will see the differences, if it has been a while since you watched the Oscar winning mo ...MORE","label":0},{"review":"I can't believe....\n\nIT WAS AWESOOOOOMMMMMEEEEEE\n\nOk. Don't you dare compare to the original because the story got changed in many many ways and you will see as soon as the movie starts. They didn't change the very core of the story or the lesson that it teaches us by storytelling rather than added more flavor to it. If you're like me and has all the lines memorized ( in English and in your native tongue) you will see the differences, if it has been a while since you watched the Oscar winning movie of 1992 you won't notice rather you will enjoy every minute of it.\n\nWill Smith made me laugh for some good minutes in there and I don't usually laugh that much that easy in a movie. He kept the funny part of the Genie and added a human part of it . Literally and you will understand it as you watch the movie.\n\nMena Massoud is the PERFECT Aladdin. So charismatic! He is literally the cartoon brought to life. At first I didn't like him but when you hear him singing and going all over Agrabah with his street rat jumps, you will fall in love with the character of Aladdin more than ever. ( Even though the amazing dances and jumps are not his rather they are of Nicky Andersen who is his dance stunt double and Hashani who is his stunt double). When a Whole New World comes along you will feel like a child again.\n\nNaomi Scott was born to play Jasmine. Seriously and What a voice! She brought a new side of Jasmine to life and made her more independent than ever. Her relationship with Aladdin is certainly different from the cartoon. But it will charm you in every possible way. And when she dances it just looks so stunning.\n\nDalia adds so much more fun to the story. She is the handmaiden to the princess and every time she showed up I knew it would be entertaining.\n\nJafar... Gosh I literally felt bad for him when I learned more about his backstory. You can learn so much about Jafar if you actually pay attention. He is not just a villain that is hunger for power for literally no reason. He has his reasons .\n\nGosh they even teach you more about Jasmine's mother!\n\nAbu is still cute and funny. Carpet is the same great one that we love. And the Sultan is the most different of them all. He is no longer acting like a child rather he is a righteous leader.\n\nIt was more than 2 hours but it felt like 30 minutes. It is fast in my opinion. Such a diverse cast wow!!!!\n\nAnd of course Alan Menken, the best composer of all time!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nDespite being a musical in a way, Guy Richie made into a n action movie and you will feel it. It was better than a musical and than an action movie. It's literally the best of both worlds.\n\nI wish they had post end scenes\n\nWell don't just believe my words. Go see it for yourself.","label":0},{"review":"🌟😍WOW!!!! 😍🌟Ok...We just finished watching the new Aladdin live action film, we saw it in 4DX, that included movement, wind and scent. I have to say it’s now in my top 3 Live Action Disney Remake next to Maleficent and Cinderella. The story combines both the original Aladdin plus elements from Return of Jaffar. \n\nThe visuals are totally breathtakingly beautiful. The story is perfectly re-created with fantastic acting from the entire cast. Will Smith as Genie was just brilliant. I absolutely  ...MORE","label":0},{"review":"🌟😍WOW!!!! 😍🌟Ok...We just finished watching the new Aladdin live action film, we saw it in 4DX, that included movement, wind and scent. I have to say it’s now in my top 3 Live Action Disney Remake next to Maleficent and Cinderella. The story combines both the original Aladdin plus elements from Return of Jaffar. \n\nThe visuals are totally breathtakingly beautiful. The story is perfectly re-created with fantastic acting from the entire cast. Will Smith as Genie was just brilliant. I absolutely loved the arc of female empowerment given to Jasmines Character. Which I wont spoil for those that hasn’t seen it yet. \n\nThe music was so good! The songs including the classic “Whole New World” was perfectly re-created down to the “Do you trust me?” which just gave me goosebumps in the best way. The inclusion of new songs which I found to be really good. Especially Jasmine’s solo song “Speechless” was absolutely breathtaking and what a fantastic singer and actress Naomi Scott (Jasmine) is. \n\nSeeing the Movie in 4D was such a good idea!! The magic carpet ride scene you felt like you were flying with them through the night sky with the wind and the smell of Jasmine flowing through the cinema. this Cinema experience will certainly stay with me. When the film ended lots of the audience were clapping which I’ve personally never seen often. \nI went out to buy the CD soundtrack as soon as the movie finished.","label":0},{"review":"****THERE ARE SPOILERS I COULDNT HOLD BACK*****I went to watch this movie with high expectations as the original Aladdin is one of my favorite Disney movies though, the acting felt so forced except for will smith. If will smith wasn’t there with his acting kills, I probably would’ve walked out. There were scenes that were such a waste of time s/a the guitar picking jasmine does when she goes to Aladdin’s “home”. They added a song for jasmine, an already admirable female character. It feels as if ...MORE","label":0},{"review":"****THERE ARE SPOILERS I COULDNT HOLD BACK*****I went to watch this movie with high expectations as the original Aladdin is one of my favorite Disney movies though, the acting felt so forced except for will smith. If will smith wasn’t there with his acting kills, I probably would’ve walked out. There were scenes that were such a waste of time s/a the guitar picking jasmine does when she goes to Aladdin’s “home”. They added a song for jasmine, an already admirable female character. It feels as if every movie needs to emphasize that woman are allowed to really do whatever they want. Yes, I’m a woman and I can gladly say whatever comes to mind. Thanks Disney. That scene itself was questioning. Oh the parade, could Disney not afford a better set? The parade was sooooooooo lame. The parades in their amusement parks are more exciting than what Ababwa pulled off here. The acting was really, play acting it felt like.... a play. Thanks for being someone from SNL ya know. Sketch comedy but she had some ironic background so why not right? Also, there’s the scene where Aladdin wasn’t sure genie planned out “gifts” for the sultan to receive but then Aladdin knows all of a sudden what all the gifts are?? What? Oh and abu as an elephant...... oh my goodness. That looked awful. Remeber when Aladdin is in the lion cave? Yeah, how they’re not suppose to take anything? Well, they’re walking on gold... touching it. Right? But abu loooks at the red gem and takes it from that monkey statue so that’s what triggers the place to erupt. Well in this case, they were touching gold, walking on it. I mean the carpet thouched them too. Aladdin STEPED on a gem and dropped it, causing abu to become intrigued by how pretty it is, picks it up and just stares at it in his hands. Sooooo here the cave gets triggered if you stare at something for too long?????? I mean they touched things prior to the red gem? I’m really just listing my criticism now but the actor who played Jafar.... I couldn’t believe that was jafar. I wanted a more intimidating jafar. One to make me go “ahhh noooo” but this guy. I really couldn’t take seriously. The line in you’ve never had a friend like me... “our cells need service” I wanted to SCREAM. While watching the movie. I slapped my face many times. Honestly when it’s listed as a comedy I’d completely agree. It was a great movie to poke fun of. Would watch again.","label":0},{"review":"I grew up with the original animated movie, so I came in with pretty high standards, and came out very impressed. The two leads are solid and the comedic moments were A+. Although I will always be most attached to Robin Williams' genie, Will Smith does a really great job and makes his own version of the character while paying tribute to the original in a way that is very entertaining. \"Friend Like Me\" and \"Prince Ali\" were a lot better than any of the trailers/sneak-peaks made them look.\n\nThat b ...MORE","label":0},{"review":"I grew up with the original animated movie, so I came in with pretty high standards, and came out very impressed. The two leads are solid and the comedic moments were A+. Although I will always be most attached to Robin Williams' genie, Will Smith does a really great job and makes his own version of the character while paying tribute to the original in a way that is very entertaining. \"Friend Like Me\" and \"Prince Ali\" were a lot better than any of the trailers/sneak-peaks made them look.\n\nThat being said, I wasn't incredibly fond of the one new song addition, to be honest, and there were definitely a few changes from the animated film that I wasn't totally sold on. But there were also a number of new moments and changes (the jam/gift scene had me cracking up) that I really enjoyed. No movie is perfect, but this one was definitely one of the good ones and I would recommend that anyone who loved the animated one go and see it!","label":0},{"review":"My husband and I which are Will Smith’s age liked it . When I saw Will Smith in posters “blue”, and the silly uproar early on from fan of the animated feature negative comments about him possibly not being blue in the movie, I thought the movie would be (corney) a professional mis-step for Mr.Smith. I know that many have mentioned that Will Smith is no Robbin Williams , and to that I say, Robbin Williams as an animated voice was brilliant and as spastic as ever. However , anyone old enough to re ...MORE","label":0},{"review":"My husband and I which are Will Smith’s age liked it . When I saw Will Smith in posters “blue”, and the silly uproar early on from fan of the animated feature negative comments about him possibly not being blue in the movie, I thought the movie would be (corney) a professional mis-step for Mr.Smith. I know that many have mentioned that Will Smith is no Robbin Williams , and to that I say, Robbin Williams as an animated voice was brilliant and as spastic as ever. However , anyone old enough to remember watching Robin Williams in the Tonight Show with Johnny Carson and Jay Leno  interviews or other talk shows knows that a little of his brand of “spastic “, comedy goes a long way with many. I don’t think even if alive , would a live -action Robin Williams’ version would  work well. Even the absence of Gilbert Gottfried as “Lago”, the parrot may have been missed by some ( me included, although again too much for the live action version)  , but this gave other characters a chance to be fully developed , especially the main characters . Will Smith gave us a glimpse of his Fresh Prince days \n( albeit a bit older /mature version) in his comedy delivery and mannerisms , while not overshadowing the plot . I was dancing out of the theater ( with memories of gettin Jiggy wit it on my mind) ... All I needed to hear was Will Smith and DJ Khaled and my 14-year daughter was mortified and my husband surprised and pleased by my long forgotten dance moves to hip-hop that made you want to move dance too! Will Smith had a bit of trouble transitioning to the “normal” acting segments with Nasim Pedrad (Dalia character)   in the film , but it didn’t take away from his performance.  I’m sure this was due in part to all the energetic, emphasis  and focus going to the over the top “genie” character moments , which I feel he nailed. I also thought here we go again with young no-credential actors that will act as forgettable sidekicks to Will Smith’s Character. However, the break out star was Mena Massoud (Aladdin), I want to see more of his acting, when he smiled by 20-year old inner self swooned ( yes I used the word “swooned” first time for everything) I think that everyone played their roles well and not so over the top that you felt like you were watching a stage play.  \n\nWill Smith grounded the movie and brought the modern edge /swag to the movie.  Oddly enough, I had hoped for more from the character of Jafar, played by Marwan Kenzari. I thought he would be the villain with the dark comedy (forgettable ), I wished the performance was more like Jermey Irons as Scar from The Lion King or Alan Rickman performance as the Sheriff from the 1991 movie Robinhood:Prince of Theives. I think perhaps in addition to a possible a mis-cast, he maybe too young too play the part and bring the complexity that was needed to make him stand out. He may have just misunderstood that playing the villain didn’t have to be delivered as deranged -petulant child. However, it was Nasim Pedrad (Dalia/handmaiden), who I kept watching ,her comedy was a great bridge between the characters. Naomi Scott (Princess Jasmine) was engaging when playing off of or performing with Mena Massoud. Navid Negahban (the sultan) performance brought the levity to the film that helped make it more cinematic and less children night -time story. Overall good performance by all.","label":0},{"review":"When going into this movie don't think of it as the animated classic or the Broadway musical version in a separate way. Think of it as a merge of the two with a modern splash to top it off. \n\nI found the music to be a wonderful blend of classic Broadway hit and Modern beat. Smith's rendition of Genie is a wonderful mix of his own personality and the character as well as giving a honorable bow to William's classic character. \n\nThe new small twists they have regarding characters ambitions, & past  ...MORE","label":0},{"review":"When going into this movie don't think of it as the animated classic or the Broadway musical version in a separate way. Think of it as a merge of the two with a modern splash to top it off. \n\nI found the music to be a wonderful blend of classic Broadway hit and Modern beat. Smith's rendition of Genie is a wonderful mix of his own personality and the character as well as giving a honorable bow to William's classic character. \n\nThe new small twists they have regarding characters ambitions, & past bring out a more well rounded idea of the characters and how/ they act the way they do. Jasmine isn't just looking for a husband to become Sultan, SHE wants to be sultan. Jafar isn't just the Royal adviser, He was once a thief that climbed the social ladder. and Genie, has dreams of not only being just free, but human. Seeing these key things help you see the world from their eyes, why they do certain things and their process.\n\nI felt this was a good start to what the live-action movies should be. Beauty and beast was one of my favorites when it came out as i felt it blew the prior Jungle Book and Cinderella out of the park.However Aladdin has shown me what these movies are actually doing to the franchises, which is opening the animations and musicals to more details about the world that was already set. They are expanding our childhood movies in a way that we now can relate on am ore deeper level.\n\nIt's not that Cinderella just lost her father, they SHOW us  how she lost her father and the impact it had on her and WHY Cinderella was so kind.\n\nWe understand WHY Belle's father kept her in that small town that called her foolish and odd. We truly saw how horrible the prince was before the spell was cast.\n\nWe now know why Jafar was how he was, we see that jasmine had a big impact on her people and show the ambition.\n\nOur small golden paged books are being expanded into a large novel now, just like all our lives have since the first time we saw the flms.","label":0},{"review":"Rating : ⭐⭐⭐⭐⭐ /5.\n\nWhere to begin really? If you have not liked the animated version and that's why you're planning not to go to watch it, you're making a big mistake buddy!! I never quite liked the animated version in comparison to the other animated movies but I decided to give the major motion pictures version, a go. (With Guy Ritchie as the director) And now here I am getting all babblesome about how wonderful the movie was. I had watched the major motion pictures of 'Cinderella' and 'Beaut ...MORE","label":0},{"review":"Rating : ⭐⭐⭐⭐⭐ /5.\n\nWhere to begin really? If you have not liked the animated version and that's why you're planning not to go to watch it, you're making a big mistake buddy!! I never quite liked the animated version in comparison to the other animated movies but I decided to give the major motion pictures version, a go. (With Guy Ritchie as the director) And now here I am getting all babblesome about how wonderful the movie was. I had watched the major motion pictures of 'Cinderella' and 'Beauty and The Beast' before this one. And my personal favourite is Beauty and the Beast. But I'll have to tell you, now that I have watched this movie, I can bet the dislikers would too go crazy over the brilliant visual effects. According to me, this is the best Disney has created so far.\n\nSo now the performances are as follows. Will Smith was in his element. With all the swag of the cool genie and the heart of a compassionate friend, he was the best actor ever chosen to have played such a diverse role. He proved Aladdin could never have a friend like him. Mind you this man is extra talented with his raps and songs. ;)\n\nMena was the chocolate-boy-happened-to-be-a-thief but he played Aladdin as the boy with a golden heart. The audience would not be able to resist his dimpled smile and raw wit. And would awe at his velvet smooth working of hands on stealing anything swiftly.\n\nNaomi was all gracious and lovely. Her acting was fantastic. But I would have chosen a lady with a better Arabian English accent in this context. Her voice in her songs would give you goosebumps. And this movie showed a side of how women should be educated and well taught to be independent and voice their opinions. A freshly feminist one at that. \n\nMarwan was really the best who could ever play Jafar. Evil and hauntingly alluring at the same time. \n\nYou would love the great songs, although majority would go to see the song 'A Whole New World', which was as dreamy as dreams could get. I was literally bursting my lungs in the halls, belting it out, when it played. You would not hate this one I'm sure. Go for it :).","label":0},{"review":"Considering the badly edited trailer, movie was a pleasant surprise... can't say it was extraordinary but it was able to bring back those sweet childhood memories of watching the cartoon... Naomi was tailor made for Jashmine's  role & with her awesome singing & dancing skills she had done justice to the role with all the grace of a princess...a special mention to song speechless that left me with goosebumps.. As for Aladdin, Mena had his hits & misses, there were sm really good moments & in some ...MORE","label":0},{"review":"Considering the badly edited trailer, movie was a pleasant surprise... can't say it was extraordinary but it was able to bring back those sweet childhood memories of watching the cartoon... Naomi was tailor made for Jashmine's  role & with her awesome singing & dancing skills she had done justice to the role with all the grace of a princess...a special mention to song speechless that left me with goosebumps.. As for Aladdin, Mena had his hits & misses, there were sm really good moments & in some cases we involuntarily compare him to the animated character & feel his energy is not up to the mark & same goes with his singing prowess...Now coming to the places were there is huge gap between the animated characters & the real ones.. for starters Genie Maybe they could've chosen an alternate Genie with better comic timing & singing skills than Smith...Jim Carrey or Hugh Jackman for instance....Lago the talking parrot- voice over was nothing worth comparing to the original..Jafar was less of a villain & more of a comedian trying to pull some tricks... Even the ultan's character lacked that orginal silliness & joyful laugh... Anyway it was worth watching...","label":0},{"review":"Magical, entertaining and fun! Mena Massoud who played Aladdin and Will Smith who acted as Genie were the character themselves coming alive. Knowing that Abu is not real, Mena created a very believable interaction and made Abu come alive as its own character. This is no easy acting feat and I appreciate Mena for bringing his own Aladdin as a selfless, kind, determined and positive person with good intention. At the end of the movie, you really root for Aladdin. At the same time, Will Smith would ...MORE","label":0},{"review":"Magical, entertaining and fun! Mena Massoud who played Aladdin and Will Smith who acted as Genie were the character themselves coming alive. Knowing that Abu is not real, Mena created a very believable interaction and made Abu come alive as its own character. This is no easy acting feat and I appreciate Mena for bringing his own Aladdin as a selfless, kind, determined and positive person with good intention. At the end of the movie, you really root for Aladdin. At the same time, Will Smith would have made Robin William proud with his musical rendition and great acting as Genie. He bring a lot of soul to the movie too and he is a scene stealer in the scene of welcoming Prince Ali into the Agrabah. \n\nIn regards to the singing, Mena, Naomi and Will Smith can sing so well that I enjoyed the film all the more. Some of the audiences were really humming to the song \"Whole New World\" scene and the magic carpet scene is really wonderful. \n\n*I was so relieved that it was not a boring repeat of Emma Watson and Dan Stevens (zero chemistry) performance & the horrible \"out of tune\" singing from Beauty and the Beast. Aladdin was 10 times better.\n\nI applaud Guy Ritchie attempt to inject some dance scenes with Bollywood meet hip hop fusion. It was very entertaining. I felt transported to the world of Aladdin with all the beautiful choreography and it is so timely. The graphic effect of magic carpet deserve an Oscar nomination too!\n\nThe only letdown is Jaafar and Iago. Jaafar is very iconic as he has a comedic villain quality that endear many fans and Iago is our beloved \"over the top\" and easily irritable parrot. I am not sure why the director and film editor downplay the actor and voice character  in the films. I was so looking forward to the villains but the villains is so tame that I think Hamid (head general) would have been better off as the aggressive villain. \n\nAll in all, it was a great film to be enjoyed with family and friends on the weekend. I give this film a 4 stars out of 5 stars.","label":0},{"review":"The story of Alladin, the street urchin is one of the most fascinating story from Arabian Nights. This is also the most liked by the children and elders the world over and filmed in almost all the languages of the world. There is no surprise when Disney preferred to remake it to the modern times and taste.\nAnd how and what Disney has done is the beauty. The fantasy has been shot as a musical by Guy Ritchie, the director in a more enjoyable way. The presence of Will Smith as Genie enhances the ex ...MORE","label":0},{"review":"The story of Alladin, the street urchin is one of the most fascinating story from Arabian Nights. This is also the most liked by the children and elders the world over and filmed in almost all the languages of the world. There is no surprise when Disney preferred to remake it to the modern times and taste.\nAnd how and what Disney has done is the beauty. The fantasy has been shot as a musical by Guy Ritchie, the director in a more enjoyable way. The presence of Will Smith as Genie enhances the expectations and a guarantee for a lively movie. Our expectations are not shattered and what you see is a wonderful, fantastic, fabulous journey into the world of magic, graphics, fun and fascination.Children and adults are seen glued to the magic adventure of Alladin (Mena Massoud), Princess Jasmine (Naomi Scott) and their escapades from evil minded Jafar(Marwan Kenzari) with the help of Genie (Will Smith, beautiful portrayal) and assisted by princess' maid Dalia (Nasim Pedrad).\nTechnically too the film is excellent.\nA must film to enjoy with family. Take them on 3-D adventure,  it will be more fun!","label":0}]