[{"review":"Two fresh and most beatifull girl in the planet was in the moovie\nRealistic song \"kisi se tum pyar karo to phir ijhar karo\" aaj kahna jaroori hai\nwhen i seen first time this moovie that was jun 2003 first barsat ke din so aayega mazaa ab barsat ka was like a heaven\nAnd rabba ishq na hoye was in new heights of moovie all song is lovely\nBest Romantic love story. heart touching emotional story\niseee  nahi dekha to kya dekha","label":0},{"review":"Two fresh and most beatifull girl in the planet was in the moovie\nRealistic song \"kisi se tum pyar karo to phir ijhar karo\" aaj kahna jaroori hai\nwhen i seen first time this moovie that was jun 2003 first barsat ke din so aayega mazaa ab barsat ka was like a heaven\nAnd rabba ishq na hoye was in new heights of moovie all song is lovely\nBest Romantic love story. heart touching emotional story\niseee  nahi dekha to kya dekha","label":0},{"review":"This is the first movie of priyanka chopra. Iss film ka sab se badi baad hai uska gaana. Each and every song of this movie is really good. Akshay justice his role as well as lara. Priyanka first movie but nobody understood after seeing her acting in this movie that this was her first time movie. I love this movie.","label":0},{"review":"Very nice  film and jis  ladki  se  pyaar  karate  ho vha miljhe  yhe   kamnakarta hu   all the best  all  friends  thank you  God bless you","label":0},{"review":"I was 15 or 16 then, it was a comeback film of Akki ji.. I didn't watch this movie due to my Secondary Exam of Board.But Lara Dutta & Priyanka Chopra were the newcomers in the film and both were very attractive .","label":0},{"review":"Very very heart touch movie life ke sach sikhati hai.salute Lara dutta Mam acting.priyanka chopra's climax part sooo touching.","label":0},{"review":"My favourite movie...\nLara dutta has excellent acting...\nNice couple Akshay & lara dutta🤗\nI love Lara dutta😘","label":0},{"review":"Very very good film. Lara dutt is finest acting akshay aswell.  Priyanka is just adoll but fits in her roll","label":0},{"review":"I watched this movie today11 may in 2019 ...after 2003...but when i watch this hurt touching story i got cried...really hurt touching...akshay's every movies are awesome","label":0},{"review":"Nice movie!\nFull of romance, love& sacrifice!\nActing of Akshay Kumar, Lara Dutta & Priyanka Chopra is good!","label":0},{"review":"My hobbies are reading Om my dear Rose is red Sky is blue And happy holi","label":0},{"review":"My hobbies are reading\n Om my dear \n         Rose is red\n                 Sky is blue \n                         And happy holi","label":0},{"review":"This was the best movie and value get from this movie is the one you lose something the ones you get","label":0},{"review":"Movie is osm ,fantastic,.... Etc...\nLara has excellent acting.....\n#mindblowing","label":0},{"review":"Happy New Year!\n😄😃☺😉😁😌\nGood Luck To U 🎄","label":0},{"review":"Loved it. Heart touching songs .","label":0},{"review":"Amazing true love which never express it but it's important to express..","label":0},{"review":"Heart touching movie I have seen it a lot of time","label":0},{"review":"It's wonderful movie as well as Akshay Kumar's role is very good","label":0},{"review":"Brilliant movie this is my favourite movie of Akshay Kumar","label":0},{"review":"Awesome movie i was 12 year old very emotional movie","label":0},{"review":"Ya its very good movie and song also too good.","label":0},{"review":"I think about this movie that I remember my past positive feelings. \nThanks.","label":0},{"review":"i like this film akashy kumar the best hero","label":0},{"review":"Very good movies but very heart touching story","label":0}]