[{"review":"Ran into this gem accidentally. It is a shame that Indian audiences fail to recognize truly good story-lines, artists and movies. Had it been Hollywood or any international film industry, a movie like this would have been a massive success. All we look is for a rom-com story-line, item numbers and their even moronic sequels. It is high time we appreciate true talent. Hats off to all the artists and the crew behind this gem! You guys deserve so much more. 10/10.","label":0},{"review":"Good to see that such realistic movie is also being produced by Bollywood. It's totally the watchers fault who doesn't seem interested towards these kind of stories and like only to watch stories full of fantasy and over exposed romance scene. It feels so bad when I see these types of movie fighting to cross 1 crore where other movies of top actors without any stories are crossing over 100 crore.","label":0},{"review":"An amazing movie which I happened to watch while having lunch. Turns out to be thousand times better then those money wasting giants these days. India needs these kind of story telling more often. Also the story brings out the harsh reality of our society where life has no value, the only thing for those big hospitals is their image.","label":0},{"review":"Awesome movie. Lot of things to contemplate on what is happening in our society. We all are responsible for our actions.All actors have played their role perfectly and lovely music. Enjoyed Completely. Must watch.","label":0},{"review":"Nice story and it shows that now doctor has become businessman and hospitals are the good source of earning money. They do their job just to earn money and they lack service attitude. All hospitals be it in Metro or non metros work like this only.","label":0},{"review":"This is the awesome movie I have ever watched.....feeling sad for  real Ankur Arora and for his family.... Everyone must watch it... This movie brings the truth of casual attitude of hospitals.... I can watch this movie  any time... Just a fantastic movie","label":0},{"review":"Good movie for social awareness and spreading the truth around the society we live.\n\nBe responsible for your act. Because, this is you who lived in society and make the difference.This is you who demands justice and not standing for justice.Your present act is going to make your future(your future#Your children future# and yourSociety future as well )  \n\n#Act#Awareness#Precautions#Proactive#attentiveness#NeverBeCareless#BeResponsibleForAct","label":0},{"review":"A good movie on social awareness. Good work by all star cast. I am not a movie buff, but i was glued to the tv when this was on & Pictures.","label":0},{"review":"It's a very interesting and serious movie. Actors performed their part well. Story and message of movie are also very nice. It will not bore you for sure.","label":0},{"review":"Good Movie. Everybody acted very well in the movie. Songs were not needed in the movie. BGM in the movie was good. The movie was so interesting at 1st half. The movie lagged and bored a lot at 2nd half. Good Movie.","label":0},{"review":"Excellent Movie , this movie based on pakistan and indian dirty health care system. appricated Hindi cinema for this kind of movies . Jolly LLb is also based on pakistan and indian Dirty Judicial system.","label":0},{"review":"The way all the characters acted is awesome.\nScene of Nandita carrying Ankur's body is epic.\nNice to see such realistic movies.","label":0},{"review":"People are addicted to be in reel life in an imaginary world coz of this they didn't accept the reality they really don't like reality..must say this movie is awesome liked it 👌","label":0},{"review":"Seriously an eye opener movie....better to be beware of hospitals even. As nowadays they are moreover like hotel. Nice act nice movie.","label":0},{"review":"Bestest movie. The way everything is portrayed is fabulous. I would recommend to watch this movie to everyone out there. Family movie.","label":0},{"review":"Film: good\nMain character of surgeon: believable\nThe protagonist Romesh: wishy-washy. (Revenge would be better motive than conscience.)\nConscience prompts one to either move away from situation or complain to higher authorities. It doesn't take you to court !!","label":0},{"review":"An eye opener , revealed hard reality of negligence in medical field . Superb movie . A must watch.","label":0},{"review":"I love this movie...its awesome and its ZINADGI song is superb....i have downloaded this offline movie on you tube and watch any time if possible✔❤✔❤","label":0},{"review":"This movie opened up our mind about to do blind faith on reputation hospital and doctor and good for to be conscious about treatment","label":0},{"review":"Outstanding film. Kay Kay Menon was superlative... Tisca Chopra and Paoli Dam were very impressive too...","label":0},{"review":"Awsm movie...\nThe importance of money & reputation come, everyone is affected whether to save the life or not but they want to run their business.","label":0},{"review":"Love this movie.. Kay kay menon is far better than thinking.. Love u sir","label":0},{"review":"This movie symbolise the truth and honesty of human nature which has been gifted by supreme power god,and unfaithful doctors character.","label":0},{"review":"Very nice msg to public on medical field private hospital. Very pathitic movie. Be careful on your kids during hospitality.","label":0},{"review":"Heart bleeds ..such incidents still happening.moreover in many cases victims family never came to know the real cause of death, that is often a medical negligence.","label":0}]