[{"review":"Masterclass \nFabulous\nPrakash jha dared to show the reality of the society and has successfully done it.\nThe movie really depicts the life of a comman man hit hard by the corrupt system who then decides to change his fate \nThe movie is perfect blend of reality,revenge and truth.\nThe script and the direction has truly nurtured the acting of every single character in this movie \nHats off to acting skills of nana sir and ajay sir\nNo doubt its one of their best movies .","label":0},{"review":"It shows reality in real life through reel life . Ajay's & Nana's performance was amazing.Very nice movie .Special thanks to Prakash Jha sir","label":0},{"review":"Unbelievable corruption. Well worth a watch! Intense movie beautifully depicting human nature. Great end! Nana and Ajay Devgn!","label":0},{"review":"Superb movie ...Hats off to prakash jha  ..A perfect portrayel of  today's bloody stinking corrupt  politics ..Ajay devgan again delivered a top Notch performance..His eyes says everything ...","label":0},{"review":"This is actually a reality of an honest aspiring youth who is let down by the corrupt system resulting him to choose a wrong path. It's a big lesson for today's youth to have a right choice in whatever they choose.","label":0},{"review":"Have not seen ever a serial or movie like this.... Not only good, its excellent in all things.... Just say..... \nMust watch","label":0},{"review":"Great performances by Ajay devgn and Nana Patekar and a very nice movie depicting the real scenario","label":0},{"review":"Realistic performance by devgn sir..... \nGreat screenplay by prakash jha and team...","label":0},{"review":"Zabardast movie.it shows how down are our politician and burocrats.1%are sincere.","label":0},{"review":"An awesome movie which portrays the reality of politics and crime","label":0},{"review":"Oh man what a movie,best movie ever by prakash jha..❤","label":0},{"review":"Class movie super acting by each and every artists","label":0},{"review":"Great movie....Shows how corruption and nepotism makes a meritorious young guy a  criminal","label":0},{"review":"It is a classic Masterpiece memorable characters","label":0},{"review":"Best movie with best performances","label":0},{"review":"awesome movie i have ever watched","label":0},{"review":"Fantastic acting  performance by Ajay Devgan","label":0},{"review":"Wonderful movie","label":0},{"review":"great movie..........acting by nana is mind-blowing.","label":0},{"review":"Super movie","label":0},{"review":"I confirm  this  movie  but  how story","label":0},{"review":"Saharan.hindi\nMovies","label":0}]