[{"review":"The storyline and direction is very modern, especially the dialogues and situations created seemed natural to me. Gracy Singh is the poorest performer in this movie, I guess. Both Amitabh Bachchan and Anil Kapoor excelled in their roles. Anil Kapoor at times a little bit exaggerated in the romantic scenes, but he is very good at serious moments. Preity Zinta got her most challenging role in this movie and she fully justified it. \n\nLastly I can say that this movie fully entertained me. Music dese ...MORE","label":0},{"review":"The storyline and direction is very modern, especially the dialogues and situations created seemed natural to me. Gracy Singh is the poorest performer in this movie, I guess. Both Amitabh Bachchan and Anil Kapoor excelled in their roles. Anil Kapoor at times a little bit exaggerated in the romantic scenes, but he is very good at serious moments. Preity Zinta got her most challenging role in this movie and she fully justified it. \n\nLastly I can say that this movie fully entertained me. Music deserves a special mention, and my favorite song from this movie is \"mere dilka tumse hai kehna\"!","label":0},{"review":"This movie is a masterpiece I could not stop crying, It was the saddest when the main character Armaan died in a hole. My children, who are dying of starvation also enjoyed this movie i spent our grocery money on this film, We don't have food for the week.","label":0},{"review":"The script,  the direction and character placement is so bad. The movie is just so confused and every thing out of sorts. The only saving grace is Preity zinta. Rest assured that you are gonna get bored to death","label":0},{"review":"Its one of the best films from bollywood and most underrated too.","label":0},{"review":"Soo wonderful.  ....mast.. Heart touching moving.....  Awesome.... Meaningfully created....","label":0},{"review":"Just 1 of the best movies I have seen","label":0},{"review":"My name is Armaan i havent watched the movie but i read the description","label":0},{"review":"Rating - 2.5/5","label":0}]