[{"review":"Its a really good movie. This movie stands strong and powerful in its content, straight and solid dialogues and classy and apt performances. The story, is very beautifuly woven with superbly scripted pages giving importance to each star in the cast, who with extraordinary ease have brought the characters to life. As the narrative moves, the movie takes the viewer through the perspectives of the characters, and naturaly convinces to the choices between power, money, rishtey, righteousness, and br ...MORE","label":0},{"review":"Its a really good movie. This movie stands strong and powerful in its content, straight and solid dialogues and classy and apt performances. The story, is very beautifuly woven with superbly scripted pages giving importance to each star in the cast, who with extraordinary ease have brought the characters to life. As the narrative moves, the movie takes the viewer through the perspectives of the characters, and naturaly convinces to the choices between power, money, rishtey, righteousness, and brings to the viewer a classy climax. The feel of the movie is a mashup of Zanjeer-Trishul-Don, era, but nowhere a copy of them, and a total modern and realistic space. This movie deserved very high appreciation both financially and critically but could find just  some average collection(as per Wikipedia data). Its actually a rightfully worthy multistarer with genuine performances.","label":0},{"review":"One of the best movies of 2013. It was a movie which gave importance to every characters. Dont know why it didn't do well in box office. I would give a rate of 8 out of 10.","label":0},{"review":"Good movie...Keeps you guessing what comes next until the very end..Ofcourse it has its plot holes but still a good watch..i don't understand why the hate for this nice movie though.","label":0},{"review":"Wonderful film it is ... I just saw it sometimes ago nd I wanna see this film again... nd Rishi Kapoor's acting was too good 👍🏻👍🏻👍🏻","label":0},{"review":"Its a Fantastic Cast off on What the Actualities are Happening Around The Country & It has Depicted The Real World Which We Do Visualize Every Second but hardly Think of the same and Emphatize That its going too Wrong.","label":0},{"review":"First even seen movie of Arjun Kapoor wherein he acted damm well. Nice thriller content with drama and action and amZing content.","label":0},{"review":"one of the Best movie of 2013... movie is very dark and..a bit slow but awesome direction ...Must watch","label":0},{"review":"One of the best movie I've seen ever.... Arjun Kapoor was rocking","label":0},{"review":"This movie watch today during journey in bus after releasing first time....superb....👌👌","label":0},{"review":"Underrated movie enriched by excellent performances of Arjun Kapoor, Rishi Kapoor and Prithviraj","label":0},{"review":"Nice one. worth watching. Rare good hindi thriller. Directors effort.","label":0},{"review":"Very good movie.characters are written perfectly","label":0},{"review":"One of my favourite movie","label":0},{"review":"Awesome. Truly","label":0},{"review":"Story line was good.It was nicely directed👍","label":0},{"review":"Nice watch","label":0},{"review":"Rishi Kapoor role play excellent.","label":0},{"review":"nice movie","label":0},{"review":"Fantastic film....","label":0},{"review":"good movie","label":0},{"review":"Boreing movie","label":0},{"review":"like the police","label":0},{"review":"Arungzevv hindi full movie","label":0}]