[{"review":"This movie is best movie ever made in Bollywood and indeed best movie of Emraan, what an actor he is. This movie was made way ahead of its time.\noutstanding story, outstanding direction and outstanding acting by everyone and not to forget the music and background score.\nEach and every scene of the movie is a class, every scene has story  telling in itself.\nEmran did a great job, not much words spoken but all he showcased his pain his sorrow his loneliness all by his eyes. The actresses and Ashut ...MORE","label":0},{"review":"This movie is best movie ever made in Bollywood and indeed best movie of Emraan, what an actor he is. This movie was made way ahead of its time.\noutstanding story, outstanding direction and outstanding acting by everyone and not to forget the music and background score.\nEach and every scene of the movie is a class, every scene has story  telling in itself.\nEmran did a great job, not much words spoken but all he showcased his pain his sorrow his loneliness all by his eyes. The actresses and Ashutosh Rana also did fab job.\nHow  this movie knitted sprtiuality and humanity  is just awesome. This movie will make you believe in god even if you are an atheist.\nI must say I have watched this so many times but every time this movie amazes me, such heart touching movie which will touch your soul.\nEverything is perfect , this movie is a class. Masterpiece indeed. Emraan you are my favourite.","label":0},{"review":"This movie is a masterpiece. The comments you are reading are the words straight from the heart.\nI would state this movie as 'The most beautiful bollywood movie ever'. Every character has justified their role. Songs are marvellous, I still love (rather say 'feel') these songs after 11 years. Script and plot are amazing. No one could have done the roles better than Emraan Hashmi, Shad Randhawa, Shriya Saran and Ashutosh Rana (actually every actor of the movie).\nThis is the movie which will remain ...MORE","label":0},{"review":"This movie is a masterpiece. The comments you are reading are the words straight from the heart.\nI would state this movie as 'The most beautiful bollywood movie ever'. Every character has justified their role. Songs are marvellous, I still love (rather say 'feel') these songs after 11 years. Script and plot are amazing. No one could have done the roles better than Emraan Hashmi, Shad Randhawa, Shriya Saran and Ashutosh Rana (actually every actor of the movie).\nThis is the movie which will remain in my heart till the last breath. If there comes a sequel of this movie, I would book 1st day-1st show in advance instantly whatever the price is.\nLast but not the least, if I can define the beauty and sensation of this movie through my words then I'm actually lacking in it ❤️","label":0},{"review":"One of my all time favorites and the best movie of Emraan Hashmi. Deeply emotional and spiritual at the same time. Beautiful songs that will stand the test of time, especially Tera Mera Rishta Purana. \nThis movie is unlike any other love story. It could have been just that but it's not. It's deeply spiritual. Mere words cannot describe this film. You have to watch it and feel it for yourself. \nAlmost 12 years later, Awarapan remains a blessed movie. 💟🙏","label":0},{"review":"This is the best bollywood action/romantic movie. Even after 12 years, i will still say , the best ever made. It was way ahead of its time. The songs, story, acting of each and every character is the best and just cant expect more when it was filmed. Still touches each corner of your heart, doesnt count you are emotional or not, it will get you. Words will get short, just watch it guys who havent yet. And Im really in shock why imran hasmi is not acting these days with these sort of movies. Miss ...MORE","label":0},{"review":"This is the best bollywood action/romantic movie. Even after 12 years, i will still say , the best ever made. It was way ahead of its time. The songs, story, acting of each and every character is the best and just cant expect more when it was filmed. Still touches each corner of your heart, doesnt count you are emotional or not, it will get you. Words will get short, just watch it guys who havent yet. And Im really in shock why imran hasmi is not acting these days with these sort of movies. Missing Him greatly.","label":0},{"review":"One of the most intense and deep films , ever . It shows the horrors of human trafficking , communal differences and the lives that are destroyed due to these issues. The music is out of the world and reflects each mood. Emraan's acting was so real and touching . Ashutosh, Shriya and the others were brilliant as well. That film can be watched everyday and it still shakes  something inside you.","label":0},{"review":"First time I watched this in year 2009.Believe me I have watched this movie 100 times since then. Emraan Hashmi's acting in this movie,  is best till the date. A sad movie which gathered loneliness around. It's songs are still far better than modern songs. A hitman gave his life to protect love birds.Thanks 🙏🙇 bhatt Camp for making this marvelous movie","label":0},{"review":"This movie❤\nThere can be no review to express this movies greatness..love you emraan and please we are waiting for the sequel..the only movie which possesses the power to make me emotional!❤ And the songs damn! It's been like 11 years now since this movie came but still it's the best bollywood movie ever made!💓  I have no more words left! Best movie ever❤❤❤❤","label":0},{"review":"Dont watch the Movie...if you don't wanna  get addicted to it.....Because Movie is a Masterpiece..... Believe Me.... After watching the movie..... I no more trust on the  Movies collection on Box Office ...... Although the movie's collection was above Average but the movie is outstanding.... Specially for the Wonderful acting of Emraan Hashmi....... There are thousands of people waiting for the movie's sequel. Emraan Hashmi's Fan Cannot skip this movie..... \nAll over.... Everything in the movie  ...MORE","label":0},{"review":"Dont watch the Movie...if you don't wanna  get addicted to it.....Because Movie is a Masterpiece..... Believe Me.... After watching the movie..... I no more trust on the  Movies collection on Box Office ...... Although the movie's collection was above Average but the movie is outstanding.... Specially for the Wonderful acting of Emraan Hashmi....... There are thousands of people waiting for the movie's sequel. Emraan Hashmi's Fan Cannot skip this movie..... \nAll over.... Everything in the movie is Amazing\nEmraan's Acting\nHairstyle\nMovie's Ending\nStory\nSongs\n\n\n..... And Yeah Specially... The Song Tera Mera Rishta  which makes you a strong believer of \nGOD","label":0},{"review":"11 years have passed since the release of this timeless masterpiece. No one could have done it better than Emraan Hashmi. Love, pain, sorrow & above all freedom, this is the message of this wonderful film. Not to forget Mustafa Zahid is troop for some classy music.","label":0},{"review":"Have watched this movie hundreds of times and i fell in love with this everytime.... music,background score,direction everything is just out of the world... u will become fan of emraan hashmi after this movie if u r not.... love love and love to this movie... maula maula song picturised in mehrangarh fort jodhpur its music its picturisation take this movie to another level.. its always a memorable experience watching this movie","label":0},{"review":"This movie is masterpiece in every sense, one of the best movie of Bollywood and like many other things we realised this late! It is visible that it is made and performed with heart, every single character did his job with all finesse of this world.\nMust watch 👌","label":0},{"review":"Best movie of emraan hashmi and one of the best of Bollywood.... Can't describe the feeling... Whenever I see this... Might be today more than 100 times... But the feeling remains same... The theme and background during dialogue are truly master piece... Can't describe about the movie in just few words... Just a shame it lost track because of movie like aap ka suroor...","label":0},{"review":"I think it is the best Ever movie in Emraan,s Career till Now Every songs of this movie is Truly great and take nothing away from Emraan he has done a great work in this movie Hat,s off to his Acting In my opinion he Deserved the Award for the best Actor while Ashutosh Rana Deserves best Actor in a negative role","label":0},{"review":"One of my all time favorites and the best movie of Emraan Hashmi. Deeply emotional and spiritual at the same time. Beautiful songs that will stand the test of time, I'm waiting for Awarapan 2 I'm big of Emran hashmi","label":0},{"review":"Emi's work has to be above the mark..n it a masterpiece 😊 with topmost acting n class direction by Mohit Suri...al my favs came together with such a work ..fall in love with you every time I watch it 😊 thnx for being so graceful","label":0},{"review":"It's not just a movie but more then a movie. amazing work done by the director and artist especially Emran Hashmi. As a human Some things can feel in this movie which are very unique. Superbbb","label":0},{"review":"This is one of the best bollywood movies ever made . Best combination of spirituality and humanity shown through an effective and well made story. Best acting from Emraan Hashmi.","label":0},{"review":"Aawarapan  is best movie emraan hashmi emran hashmi is a hitman of mr malik and keeps work to eye on his boss's mistress and soon he realizes  she is victim of human sex trafficking  and then he vows to unite her by free to malik's caught because shivam(emran) loves to aaliyah (shriya saran) a muslim girl but she dies because of shot of gun by her father as she loves to shiv then he begin fight with against to free her boss mistress","label":0},{"review":"Mohit Suri's best.\nSongs make me nostalgic always. My childhood memories are relived whenever I watch this film or listen to the songs.","label":0},{"review":"very good emotional movie by great actor Emraan Hashmi \npeople calls him serial kisser but why don't they know he's a good actor and he have very good music taste!!!  Love Emraan Hashmi","label":0},{"review":"No matter how many times you watch it, it always seems the first time. A masterpiece from Emraan Hashmi. One of the best movies ever made in Bollywood.","label":0},{"review":"The best film of Emraan Hashmi. The expressions and mood of the actors looks parallel with the story. Songs are ultimate touching your heart.","label":0},{"review":"Speechless movie ..... Just doesn't matter how much u say good about this movie it's just incomplete to express a full review .... Awesome movie 💗","label":0},{"review":"This is best ever movie made in Bollywood One of the best and my fav movies of all times... Emmy bhai you are superb","label":0},{"review":"One of the best movie of my fav. actor Emraan Hashmi.\nI have no words to describe.\ni wanna give 5 out of 5 star of this movie.","label":0}]