[{"review":"A film that asks the question \"If a man helps you to walk your first steps in life, why can't you help him walk his last steps,\" director Ravi Chopra's family drama finds a father reaching out to his children with unexpected results. Throughout the years Raj Malhotra has provided his wife Pooja and their four sons with all the love and comforts that he could offer. Their well being a direct result of his lifelong dedication to his family, his entire world is turned upside down when, following hi ...MORE","label":0},{"review":"A film that asks the question \"If a man helps you to walk your first steps in life, why can't you help him walk his last steps,\" director Ravi Chopra's family drama finds a father reaching out to his children with unexpected results. Throughout the years Raj Malhotra has provided his wife Pooja and their four sons with all the love and comforts that he could offer. Their well being a direct result of his lifelong dedication to his family, his entire world is turned upside down when, following his retirement, none of his children are willing to repay him for his generosity. As Raj and Pooja begin to rely on the kindness of strangers of sustenance, the couple is faced with the unexpected challenge of overcoming their hardships and forging a loving future and other.","label":0},{"review":"The most heart touching movie of bollywood. One can feel this movie if he has a heart. As always I have been crying when I have seen this movie. Iss movie ko dekhne ke baad agar akhon mein ashu na aaye to aap insaan nehi hey ya fir apke paas dil nehi hey. The movie will always remain in my heart ♥. Honestly I love movie. A must watch movie for all the people of our society. This movie is not only meant for enjoyment but also it is itself a great heart warming message for our youth generation. An ...MORE","label":0},{"review":"The most heart touching movie of bollywood. One can feel this movie if he has a heart. As always I have been crying when I have seen this movie. Iss movie ko dekhne ke baad agar akhon mein ashu na aaye to aap insaan nehi hey ya fir apke paas dil nehi hey. The movie will always remain in my heart ♥. Honestly I love movie. A must watch movie for all the people of our society. This movie is not only meant for enjoyment but also it is itself a great heart warming message for our youth generation. Any combination of  26 letters can not explain the greatness of the movie. A hearty solute to the makers of this movie. 👍 👍 👍 🙏 🙏 🙏","label":0},{"review":"I personally hate this film bcoz my dad correlates this movie with our homes pseudo condition. He always picturizes  or sees his image in Amitabh's role. And this really creates a disgusting situations for all of us. (Our family). I hate its ending scene. The ending should have been the other way out. Its very adventurous to watch the movie sitting on the couch, sofa or bed. It seems so interesting and true when we connect this movie with the social world. Ppl call me Queen and keeping it's resp ...MORE","label":0},{"review":"I personally hate this film bcoz my dad correlates this movie with our homes pseudo condition. He always picturizes  or sees his image in Amitabh's role. And this really creates a disgusting situations for all of us. (Our family). I hate its ending scene. The ending should have been the other way out. Its very adventurous to watch the movie sitting on the couch, sofa or bed. It seems so interesting and true when we connect this movie with the social world. Ppl call me Queen and keeping it's respect I am rating this movie as 5/10.Bcoz always the children are not wrong.We need to understand our children with the growth of age","label":0},{"review":"Actors acting were too good and very realistic . Social message is there in this movie . That now a days most of children's don't respect their parents . And when they get married when their daughter in law's enter in her new house they don't respect and don't have emotion for them .  Only they can utilise them like pupets and latter they humiliate them as well . In climax scene Shri amibtah Bachchan sir break relationship with their childrens and he was staying with their adopted son Salman Kha ...MORE","label":0},{"review":"Actors acting were too good and very realistic . Social message is there in this movie . That now a days most of children's don't respect their parents . And when they get married when their daughter in law's enter in her new house they don't respect and don't have emotion for them .  Only they can utilise them like pupets and latter they humiliate them as well . In climax scene Shri amibtah Bachchan sir break relationship with their childrens and he was staying with their adopted son Salman Khan . That is perfect decision . In India 90 percent cases is there . In India most of parents spend money in their childrens education and for other Spense .","label":0},{"review":"I truly appreciate every single person to watch this movie specially  all the children so that we can understand the importance of having our partners around us. And being a very big fan of Mr. Bachchan and Hema Malini as well I just love the movie. Thanks for giving such a masterpiece. You made me cry.....","label":0},{"review":"Have been watching this film 2 or 3 times since last two days.It tells us how parents are neglected in their old age after retirement..Parents are not expecting anything from children expect love and affection.Parents are not asking money or any property.\nIn this movie amithab ji and hema ji get deeply pained by the kind of words used by their children they often cry and get deeply hurt..\nI request each and every children of this era watch this movie without fail..Even if u don’t understand Hind ...MORE","label":0},{"review":"Have been watching this film 2 or 3 times since last two days.It tells us how parents are neglected in their old age after retirement..Parents are not expecting anything from children expect love and affection.Parents are not asking money or any property.\nIn this movie amithab ji and hema ji get deeply pained by the kind of words used by their children they often cry and get deeply hurt..\nI request each and every children of this era watch this movie without fail..Even if u don’t understand Hindi please please do watch it with subtitles..Such a masterpiece from director sir","label":0},{"review":"I always want to support, love & be there for my parents I love you mom & dad . Every time my tears has been  fallen from my eyes when I watch this movie . Superb Ravi Chopra br Chopra production love this movie mainly the song main yahan tu wahan composer Uttam Singh by AB .","label":0},{"review":"One of the emotional film i have watched. This film really tells us what is love and how much we care about our beloved partner. Also shows that what children do to their parents by separating them just to save money.. Its tells us today's children story what they do to their parents. I love this movie.","label":0},{"review":"It is fantastic subject. Movie is marbles. Ravi Chopra direction is superb. I love this subject because of  everything  is there. Bagban inspire of the film telugu movie badi panthulu directed by legendary director PC Reddy garu. I'm  super proud of my guru PC Reddy garu.","label":0},{"review":"Really projected from the reality of life. The movie shows the fact that youth don't know that they must pass away through old age. Moreover, youths must know that they get what they give. Anyway, the heart touching movie on real story among human communities.","label":0},{"review":"Fabulous movie..Topic is superb..Very true subject..Parents sacrifice their whole life for their children but when it's comes to children,they took their parents as burden..Love your Parents..No Love in this world compares the true and selfless Love of our parents\nValue them as they are Priceless..Love you Maa and Papa","label":0},{"review":"It's very fantastic out standing movie I don't have words to say for that movie I like that movie a lot. Ya kids also should watch this movie it's really fantastic movie. My favorite movie it is","label":0},{"review":"Fantasic movie. There are so many things you get to learn from this movie. I have watched it a zillion times but never got bored. I recommend everybody to watch it.","label":0},{"review":"This fílm is one of the family wonderfull  drama ever in bolliwood. I thanks a load to this team. I spesially love the last part of this film and make me heart touching and quite moment ever.","label":0},{"review":"I am a non hindi person, who only understand little bit of hindi. I get a chance to watch this movie. Yes the message to take care of parents with respect is flimed very well. More than that the love and understanding between the couple is excellent. Everybody has a message.","label":0},{"review":"I like this movie. This movie made a real life story. Whenever keep father & mother in age of last position. Then that situation face a moment like that old Animal where do not work.","label":0},{"review":"Lovely flim.\nmust watch it\nIf you can't be a support of your parents at their old age so don't be a son or daughter of them because u don't have any right to make them sad or cry...","label":0},{"review":"I still find the movie's content so fresh and alive.Everyone lifetime must watch the movie. Those who think career is more important than their family , they must watch it once.","label":0},{"review":"Very emotional movie. Amitabh and hema malini have done it to tell people that parents give all the happiness to their children but children don't give back the happiness. An everlasting sequence of events. Good luck.","label":0},{"review":"A must watch movie , I think one of the best movie I have in my life in Hindi cinema. Great movie , and amazing work by amitabh bachhan and hemamalini ji","label":0},{"review":"Very good movie 🎥 it tell about that parents do everything for your aim but if you're serve them not well  when they are old that means you  are selfish so I thing does not do because they are God \nThank you","label":0},{"review":"I love my parents too much....\nThis movie make me cry... \nPlzzz guys never hurt your parents.... Bczzz they sacrifice everything for theirs children......\nLove you forever my dear parents 💕","label":0},{"review":"Even after 16 years, this movie makes me cry every time i watch. It connects with our family values, ethics, cultures to the core and inspires us to realize our parents love, affection and dedications for us...","label":0},{"review":"Beautiful movie.\nIt's both educating and hilarious at the same time.\nI recommend everyone to see this movie at least once.","label":0},{"review":"Moral Of The Story-India Has A Gr8 Culture.So Parents R Always God & So R Nevr At Fault.Bt Kids Being Devils R Always The Villains.One Can Easily Get The Deeper Meaning Of My Review😉","label":0}]