[{"review":"Uh, everyone's a critique these days. If I would've been creator of this movie just because some 'times of india' put critique into a perspective and disliked stuff really believe me anyone will be annoyed. To be honest this rating site's and their followers I find them as trolls. I know some movies are bad but just because some human criticized it, that doesn't make this movie bad. Tomorrow I will critique something negative I wonder how much it will affect the publicity of the product. I watch ...MORE","label":0},{"review":"Uh, everyone's a critique these days. If I would've been creator of this movie just because some 'times of india' put critique into a perspective and disliked stuff really believe me anyone will be annoyed. To be honest this rating site's and their followers I find them as trolls. I know some movies are bad but just because some human criticized it, that doesn't make this movie bad. Tomorrow I will critique something negative I wonder how much it will affect the publicity of the product. I watched this movie with my friends after we were done watching it no one said ti was bad or anything but they liked it and we talked about it for hours. But one of them saw this rating's. and then changed his mind lol just because he saw rating he reflected upon them, people can be manipulated by such so easily he was the one who liked the movie most it's rather ironic. I hope I don't have to make my point clear any more than this.","label":0},{"review":"Again! I mean Hrithik Roshan has all my top three favourite movies in the list after Zindagi Na Milegie Doobara and Dhoom 2. Bang Bang is one of the greatest action movie ever produced in Bollywood. This movie is full of action and drama. Only Hrithik can fit in the movie. The story was good. But the most wow factor about the movie was it's action scenes and the exotic locations that can be seen in the movie. This movie also has a bit of romance in between. The songs are awesome and the dance mo ...MORE","label":0},{"review":"Again! I mean Hrithik Roshan has all my top three favourite movies in the list after Zindagi Na Milegie Doobara and Dhoom 2. Bang Bang is one of the greatest action movie ever produced in Bollywood. This movie is full of action and drama. Only Hrithik can fit in the movie. The story was good. But the most wow factor about the movie was it's action scenes and the exotic locations that can be seen in the movie. This movie also has a bit of romance in between. The songs are awesome and the dance moves were just breath taking. I mean Hrithik Roshan has danced the best in this movie compared to other movies. This movie also gives a good message that \" it doesn't matter what's the time or what has passed, start your list of actions and you will see the one day coming to you. So all you have is one day\". Guys this is a must watch movie.","label":0},{"review":"Oh please dont go by critique as now everyone is capable to give their own opinion whether it is needed or not needed by the people so watch the movie and go by your emotions😊, this movie is really ausumn and deserves must watch. I love hrithik roshan pair with katrina .....oh wow what a sizzling chemistry ....💥 sexiest pair on earth .........action scenes and romantic scenes are good. Also hrithik has a perfect body to show on the screen .....😙.....love the story and acting.","label":0},{"review":"I was a bit skeptical hearing the critic reviews but I’ve come to the conclusion that they are all absolute rubbish! The movie was entertaining, had lots of action and excitement. It was definitely a movie I enjoyed and there was never a boring moment. If kept me on the edge of my seat. So what if it was a copy of knight and day? I would definitely recommend watching it. Ignore the critics of","label":0},{"review":"One of the Best Bollywood Action Movie.I dont know why people rate this movie too low. This Movie is Too Awesome. No one in Bollywood industry can match the level of the legend Hrithik Roshan. this movie proves every bit of it. this movie deserves better ratings and more love.","label":0},{"review":"it such a good movie. it blended so perfectly. still Indian IMDB Board cannt recognise this \n\ni think this is lack of there vision and creativeness \n\nidk How they Judge A movie for all Indian people out there.","label":0},{"review":"Bang Bang is my favourite film. Hrithik is always good looking. Fantastic action sequences. Katrina is stunning. We can see this more than 100 times. No words to say. It's a rocking film.","label":0},{"review":"Very fantastic and action full movie.\nIt pick up the bollywood level to very high. I love this movie so many times. The songs and dance of hrithik roshan is world class.","label":0},{"review":"Hritik is always awesome with awesome dance steps. Katrina  kaif is the queen of Bollywood with stunning styles and dance steps. The film Bang Bang is speechless because two of  them made the film outstanding","label":0},{"review":"Excellent performence of hrithik roshan sir,best direction Of sidharth anand sir,,best music of vishal shekhar sir and salim sulaiman sir,romantic pairing of hrithik ji with ms. katrina ji was suPer, action packed emotional thrilling and touching movie.","label":0},{"review":"Awesome movie. Full comparable to Hollywood styled movies. Kudos to the director and team. Visually spectacular and of course hrithik sir action and dance.  Very proud of Indian movies.","label":0},{"review":"Nice entertaining movie😊😃, hrithik's acting is superb😇, even Katrina has done well, catchy songs🤗, good dance by hrithik😍, music is lovely😄, if you want some action, romance😆 and little comedy😄, please watch this movie😍🤗","label":0},{"review":"Awesome movie. Dont go on reviews as everyone is a critique now.. watch yourself you will definately love it. Sizzling chemistry of hrithik and katrina make it worth watching","label":0},{"review":"This movie gives us some originality if took in reference with Bollywood. But it's not a lie that it is a copy of Knight and day ,a Tom cruise movie. Hrithik made me smile but Katrina overdramatizes in many scenes. In all the movie deserves a watch .","label":0},{"review":"Hrithik roshan fight against bad people . Hrithik roshan is not bad in real life . I like\n this movie because he was very smart and swimmer champion and thus i also like to swim","label":0},{"review":"If you want to watch Action, Drama, Suspense, An intelligent agent & patriotism, then I recommend you this movie. However it's quite unrealistic, but still worth. Enjoy.","label":0},{"review":"On par with knight and day in terms of acting by HR. HR is perfect for this role and executes every scene with ease like tom cruise. Script is okay. Watch it for HR, bgm and action.","label":0},{"review":"Don't know about the movie story but the songs,location,action, dance, looks &the most hottest,sexiest pair of the planet hrithik & katrina is just fan what do u need 4r more in life......","label":0},{"review":"Rubbish movie. I didn't understand a single story. Actors acting were rubbish. Accept dany degonzas acting was good. Only for hirithik roshan looks this movie has earned well. But he don't have acting quality. I didn't like this movie.","label":0},{"review":"It was a very nice movie..when ever i watched it i forget the original movie altough it was inspired from knight and day movie . Well done hritki roshan. We loved it.","label":0},{"review":"I am a great fan of Hrithik Roshan . I liked this movie. Hrithik Roshan was the charm . his acting and dancing skills were awesome.","label":0},{"review":"Omg \nWhat a spectacular and marvellous movie i ever seen.\nHrithik is my most favourite actor.\nStory is nice and realistic.","label":0},{"review":"Very very interesting and was thrilling to the core!,.BANG BANG really really awesome but one drawback it is based on KNIGHT AND DAY.But better than knight and day","label":0},{"review":"It's not their fault who has disliked the movie,as most of them are not that much \nIntroduced with such Western culture ideas.But for those who understands these\nStuffs,this one is a must watch 👍👍👍👍","label":0},{"review":"Institutionalised racism due to hidden Islamophobia throughout the movie! Absolutely shocking for a secular India. What's more is that the stunts were over exaggerated and completely as well as annoyingly fake. 2/10","label":0}]