[{"review":"A film that made me go on. One of the finest film of 2012. Barfi, a story of a speechless and deaf boy (Ranbir Kapoor), who fall in love with a girl (Illeana D'Cruz) who refused to marry him because of his family pressure. In addition to this, story of a autistic girl named Jilmil (Priyanka Chopra) also goes as her grandfather signed her will in her name. Barfi falls for Jilmil but in trouble when her old love comes calling.\n Movie exceptionally drove you into the world of Barfi and Jilmil. The  ...MORE","label":0},{"review":"A film that made me go on. One of the finest film of 2012. Barfi, a story of a speechless and deaf boy (Ranbir Kapoor), who fall in love with a girl (Illeana D'Cruz) who refused to marry him because of his family pressure. In addition to this, story of a autistic girl named Jilmil (Priyanka Chopra) also goes as her grandfather signed her will in her name. Barfi falls for Jilmil but in trouble when her old love comes calling.\n Movie exceptionally drove you into the world of Barfi and Jilmil. The best thing about the movie is Ranbir  Kapoor and Priyanka Chopra. Their acting skills and emotions made you a beliefs that both are the finest actors of Bollywood. Illeana D'Cruz also shines but her grace is outshine by our desi girl Priyanka Chopra. Beautiful location of Kolkata and direction of Anurag Bash made a film evergreen. It requires a watch.\nI will rate **** stars\nAnd rotten tomatoes I will rate 96%","label":0},{"review":"One of the finest creation of Bollywood. Filled with all emotions  altogether decorated by exuberant performance of Ranbir, Priyanka. Well supported by Ileana and class acting of Saurabh Shukla. Beautiful location of Darjeeling brings freshness. \nIn the end message I got from this lovely movie \" You need not have perfect partner for perfect Love story ...two imperfect souls (by social paradigm) can complete each other, can be perfect for each other, can have soulful love story.\" \nKudos Anurag Ba ...MORE","label":0},{"review":"One of the finest creation of Bollywood. Filled with all emotions  altogether decorated by exuberant performance of Ranbir, Priyanka. Well supported by Ileana and class acting of Saurabh Shukla. Beautiful location of Darjeeling brings freshness. \nIn the end message I got from this lovely movie \" You need not have perfect partner for perfect Love story ...two imperfect souls (by social paradigm) can complete each other, can be perfect for each other, can have soulful love story.\" \nKudos Anurag Basu.\nPhir le aaya dil majboor kya kije...\nRaas Na aaya rehna dur Kya kije......","label":0},{"review":"This is probably the best bollywood movie of all time.\nWithin the first 120 seconds of the movie you already know whats the film about.\nWithin 16.18 minutes you know almost everything about Ranbir Kapoor(Barfi) like his weakness,strength,characteristics and his aim(to find a trust worthy partner).\nAnd  then before 23 minutes you also get to know why Ranbir and D'Cruz(Shrusti) love each other.\nIts just brilliant and a S grade movie","label":0},{"review":"Never watched a movie from Bollywood before but this movie was do beautiful i had to come a leave a review. This has become one of my favorite films. I could even say it better than dome movies in Hollywood. Priyanka Chopras performance is outstanding . One of the movies i will always remember it plays in the back of my head constantly.","label":0},{"review":"Ranbir Sir Is best His Acting Is Awesome. His One Of The Most Loved And Greatest Movies Are AE DIL HAI MUSHKIL, BARFI, TAMASHA, NOW SANJU, YEH JAWAANI HAI DEEWANI. I LOVE HIS ACTING AND CHOICE OF MOVIE MY FAVORITE MOVIES ARE JAGGA JASOOS ALONG WITH ALL RANBIR KAPOOR MOVIES","label":0},{"review":"One of the best movies that I have ever seen . It was funny as well as emotional at the same time . Priyanka Chopra's acting must have been awarded. Ranbir Kapoor , my fav actor again showed his class and after nearly 8 years of this film , I find it equally interesting .","label":0},{"review":"I like the movie, of course..Priyanka Chopra is the best..others are also terrific..but I am upset for Ranbir who shamelessly copied Charlie Chaplin and Buster Keaton, two famous actors of silent film era. The director should acknowledge formally at the opening of the film, that he copied some of the comic situations from silent film actors (which includes  so recent Rowan Atkinson..!).There are so much likeness and similarity between his movie and some Hollywood films. So inspite of being beaut ...MORE","label":0},{"review":"I like the movie, of course..Priyanka Chopra is the best..others are also terrific..but I am upset for Ranbir who shamelessly copied Charlie Chaplin and Buster Keaton, two famous actors of silent film era. The director should acknowledge formally at the opening of the film, that he copied some of the comic situations from silent film actors (which includes  so recent Rowan Atkinson..!).There are so much likeness and similarity between his movie and some Hollywood films. So inspite of being beautiful and classy, Barfi falls into the category of parody or spoof of old foreign movies. We should remember that bengali filmmakers like Satyajit Ray and Mrinal Sen, had made Oscar level films..but never copied Hollywood..!","label":0},{"review":"Ranbir is my all time favourite actor he always comes with a unique character and play it very generously. In this movie I love the character of Jhilmil  (Priyanka). Preety, heart touching movie, with great moral. I give***** stars (5 stars)\nSuprb movie nver gets old also very emotional   movie.","label":0},{"review":"Masterpiece written all over it.\nEverything worked for the film.\nThe effort of the crew can be seen on the screen .\nArt director just nailed it. Awesome script writing. Beautifully shot songs.\nSuperp acting by Ranbir, Ileana. Priyanka just killed it. Good support from others as well. \nScreenplay is so engaging I couldn't get my eyes of.","label":0},{"review":"Barfi (ranvir sir ) although i m not a ranveer fan but his act in this movie is really appreciated....barfi bina kuch khe bhot kuch keh jata h that street light scene in movie that say everything how everyone leave his hand because they think they will get hurt but priyanka stayed as she had trust on barfi ❤ that is really heart touching....they all (Illeana & priyanka mam,ranvir sir)did very gud acting","label":0},{"review":"I would like to thank Mr and Mrs Rishi kapoor for giving us a talent called Ranbir. No wonder this movie was considered for Oscars. Left me speechless, made me laugh, cry, smile like never before. I can give 10 stars out of 5 to this. A cult classic","label":0},{"review":"This is the best Rom-Com in world Cinema yes World not only Bollywood.\nNever ever seen such a priceless beautiful movie before.\nExcellent starcast with on point acting heart touching songs with very emotional moments and the comic timings were just magnificent ❣️","label":0},{"review":"Love has no language, no barriers, no consideration of physical appearance... It's all about happiness u spread around u...\" Itni si hasi itni si Khushi itna sa tukda Chand ka khwabo k tinko  se chal banaye ashiyana..\" it's a amazing movie. All time favourite movie.. must watch this movie💓","label":0},{"review":"Love don't need a language, it only needs emotions to be expressed. Barfi is a sweet & warm movie with which you can cuddle. Anurag Basu's art of Storytelling & Ranbir,Ileana & Priyanka's acting has made this movie a must watch for all age groups.","label":0},{"review":"Amazing art from Ranbir Kapoor,Priyanka Chopra and all the cast, director ,all the meber who have part of it.A movie that say about love and emotions And love is no need to say it will always about feel.\nOne of the best bollywood film ever.","label":0},{"review":"This is one of the best Bollywood movies I have ever watched. Ranbir was just phenominal, not to forget the excellent portrayal of Jhilmil by Priyanka Chopra. This is a must watch movie for everyone.","label":0},{"review":"I love this movie... really it awesome....\n\"Bollywood best love story\" \n    Barfi,Shruti,jilmil is the best part of this movie... refreshing song.. excellent song... story is not common...\nVery inspiring movie\n\n    In a word \n        The movie is supper hit...and\n      My favorite movie......\n\n\n\n10/10","label":0},{"review":"This is my favorite movie 😍\nI jsut love it ,it has everything...\nActing,music,romance,fun,great story,directly catches the heart and just fill it in love...you know love better after watching this movie 💕💟a perfect movie ..","label":0},{"review":"Loved this movie. It's romantic as well as comedy. I guess this was the last best movie of Ranbir Kapoor. Amazing acting by Priyanka and Ileana too.","label":0},{"review":"Someone called romeo and juliet are the best romantic couple ..\nBut for me #barfi and # jhillmil are perfect couple \nThis movie is base on love , happiness and although about how to spend our daily life with our love😃😃😃😘😘😘😘","label":0},{"review":"This is the first bollywood movie which made me cry.... I felt very sad for Shruti Ghosh..The movie as a whole is a Masterpiece Highly recommended for those people who think \nabout their future after falling in love....❤️","label":0},{"review":"It's one of my favorite movie. Watched it umpteenth times and Ranbir's acting is awesome even without uttering a single word, he's flawless. Same goes for PC.","label":0},{"review":"This is a movie which correctly defines that love can be speachless and it is this movie which will leave one spellbound. Each element of the movie is absolutely Perfect and lovely!","label":0},{"review":"It was one of the most underrated performance of Priyanka. And for Ranbir, he was class apart. This movie leaves us with a yearning to find that magical love for ourselves too.","label":0},{"review":"Great movie ...Best ever performance by ranbir ,priyanka ... Outstanding direction by anurag basu 👌👌 Unforgettable music by pritam da 👌👌 ..Ranbir  has risen his level to become one of the finest actor","label":0}]