[{"review":"This movie is pretty good. I thought that this movie didn't work. But Ayushman has worked really well and also Rishi Kapoor.Surprisingly, even Sonam Kapoor has given a decent performance. This movie was 5 years ahead of its time. That's why and because it wasn't marketed well back in 2014, that's why didn't collect the numbers at the box office, if it releases now in 2019, then seeing Ayushman's last 7 hits ,last being Bala, then this movie would have worked. This movie collection was sabotaged  ...MORE","label":0},{"review":"This movie is pretty good. I thought that this movie didn't work. But Ayushman has worked really well and also Rishi Kapoor.Surprisingly, even Sonam Kapoor has given a decent performance. This movie was 5 years ahead of its time. That's why and because it wasn't marketed well back in 2014, that's why didn't collect the numbers at the box office, if it releases now in 2019, then seeing Ayushman's last 7 hits ,last being Bala, then this movie would have worked. This movie collection was sabotaged because of Queen releasing a week before and because it wasn't marketed well by YRF. They came with a hiddengem but didn't sell it well enough.Also it didn't work because when you see the trailer and in parts Rishi Kapoor has given an over the top performance ,should learn from Nawazuddin Siddiqui,he said sometimes a dialouge needs 5% effort, \nthen other 95% is not required, because of Rishi Kapoor's over the top performance in parts and good performance overall, though, the trailer was borring, hence there wasn't excitement for this novie , else it could have been atlwast a sleeper hit.","label":0},{"review":"It is a beautiful movie but very less recognition from the audience as because of Queen movie got released at the same week when this movie released. After 5 years I somehow I saw the poster of this movie and felt that What is this movie, is there movie like this also so watched it online and I was very much impressed by the story. The movie is relatable and so Modern. Do watch it out Guys you will like this masterpiece.","label":0},{"review":"I thought this movie had bombed at the box office and had not watched it until recently. Surprisingly, it turned out to be a wonderful movie with good acting by Rishi Kapoor and Ayushmann Khurana. It is a modern day love story with modern day problems. A must watch!","label":0},{"review":"Saw this movie 4 years after its release and found it to be a hidden gem. Loved the characters and the theme of \"love in times of recession\". Very down-to-earth and true movie with good acting by one and all. 3.5 out of 5 stars from me.","label":0},{"review":"a very happy movie, do watch it when feeling low! it will put a smile on your face. Amazing performance by Rishi sir. loved loved loved this movie. sonam and ayushmann ❤️❤️❤️ 😃.","label":0},{"review":"Aayushman, Sonam and rishi's acting is very good.Movie shows the reality of any love couple and their parents.The movie shows that love and money both are important for a happy life.so , movie's plot is very relatable for us.","label":0},{"review":"Its an awesome movie.\nI request you release it once again.\n\nOnly for the reason that Queen movie got released on the same week, there was an insufficient support from the audience ...","label":0},{"review":"Honestly, I started watching it for Ayushman but I'm surprised how relevant this movie is in our times! A must watch and also a feel-good script 😍","label":0},{"review":"This movie is damn good. Good performances by all three actors. Some movies don't earn money. They earn some sensible hearts.","label":0},{"review":"I think it's a great movie. Pretty nice performances as well as great premise, nice songs and a great story! Super underrated!","label":0},{"review":"Watched recently. Very beautiful movie with nice acting and dialogues. True story of now a days and not a silly fantasy .","label":0},{"review":"I watched this movie after so long \nThis movie got some realities of life\nAnd touched me \nRecommend \nIn one word  dark horse\nAt least for me","label":0},{"review":"I don't know why this movie didn't work at the box office because it's a really good movie that shows a lot of the reality that current corporate employees face, like job security and unemployment. I really liked it and feel bad that it didn't do well in the cinemas.","label":0},{"review":"Saw this movie today..very nice movie. Every body sud watch this movie. Both the young and old generation..loved it..","label":0},{"review":"Truly a recommended movie for all Good movie taste lovers. Really a must watch ✌️","label":0},{"review":"Sonam is amazing in this movie. Love it.","label":0},{"review":"Good one time watch...Watch it for Rishi Kapoor's brilliant performance","label":0},{"review":"It's really a very good movie..not sure why it flopped at the box office.","label":0},{"review":"Really good movie!! Imdb reviews are misleading","label":0},{"review":"I think it is a good one tym watch movie. 👍","label":0},{"review":"Bekar hai don't waste time & money better go to temple & enjoy day","label":0},{"review":"Awesome movie","label":0},{"review":"Good movie","label":0},{"review":"wow lovely movies..........","label":0},{"review":"Don't watch it","label":0}]