[{"review":"It is very good movie actors acting were too good specially Irfan Kan sir and Rajpal yadavs sirs has acted really well . It's very emotional movie sharukh Khan's name was changed Sahir Khan and Akshay Kumar name changed and turned into Abhay Kumar . Last scene I was crying when Shahrukh Khan visited in Irfan Khan's house they were talking about childhood memories and Shahrukh Khan telling him you have to come in my house with your children and with your wife as well and people were cheering up t ...MORE","label":0},{"review":"It is very good movie actors acting were too good specially Irfan Kan sir and Rajpal yadavs sirs has acted really well . It's very emotional movie sharukh Khan's name was changed Sahir Khan and Akshay Kumar name changed and turned into Abhay Kumar . Last scene I was crying when Shahrukh Khan visited in Irfan Khan's house they were talking about childhood memories and Shahrukh Khan telling him you have to come in my house with your children and with your wife as well and people were cheering up to Irfan Kan because he was saying truth' to them .","label":0},{"review":"The entire plot of the movie was so 'classy' exactly like the stories I used to read in my childhood back in the days where the internet was not as widely distributed as today. I think many of us will be able to connect to the characters in the movie and may even be dragged towards the 'Nostalgic' past. In my opinion, Irrfan Khan pulled the lead role very beautifully and all the other main characters including Shahrukh Khan very good.","label":0},{"review":"This movie Billu is very near to my heart. It’s classic story brings happiness and sorrows step by step simultaneously. Excellent story and super acting’s of Irfan, Lara and Shahrukh. A remarkable film.","label":0},{"review":"The story and the acting, of each character is significantly awesome. Its very hard to find such a movie with good story line as well as good acting. Lots of respect to The irfan khan","label":0},{"review":"Very few films are made in our Bollywood which can really give you the satisfaction from bottom of the heart. This movie is the reflection of a real India village. \nCharacter n acting is so beautiful in the movie. I like to watch this kind of movie in spare time.","label":0},{"review":"Great to see that humanity is more important than stardom. We all tend to forget that at times. Good story about not forgetting who you are and true friendship.","label":0},{"review":"SRK's acting is not as good as that of Mammootty in the original malayalam version. Mammootty's acting in the original version made my eyes water.\nHeart touching Scene from Malayalam Film - Kadha ParayumbolYouTube - Feb 9, 2016","label":0},{"review":"Very simple and lovable movie about friendship. Khadaya Khair is my favourite song among all in the movie. Everyone should watch this movie at least once.","label":0},{"review":"One of the finest bollywood film of SHAH RUKH KHAN. I can watch it again n again\nLoved to watch","label":0},{"review":"The movie seems me to be the milestone of hindi cinema.The very praralellism of   friendship between lord Krisha and Sudama of Mohabharat era is the key to its grenduer as a classic.","label":0},{"review":"This Priyadarshan's movie flopped only due to SRK's acting in place of Akshay Kumar otherwise it will be in the list of Hera Pheri, Hungama, Bhagam Bhag, De dana dan, etc & etc....","label":0},{"review":"You are best entertained  the internet user  and I very very thanks to your app","label":0},{"review":"I cant understand why IMDb rated this movie 6.2/10... It was brilliant.","label":0},{"review":"That bet movie for entertainment that nice movie with srk I love you","label":0},{"review":"\"Yes it is a too really friendship relation movie, in between Shahrukh Khan & Irfan Khan Sir, and it is touch in to the everyone heart, that is called real friendship.\"","label":0},{"review":"Brilliant acting by irrfan and rest of the cast.. But Shahrukh khan's acting is average..","label":0},{"review":"Love watching SRK in the movie. He is too good","label":0},{"review":"It was brilliant. Loved it","label":0},{"review":"As always, super acting by Irrfan Khan as well as SRK.... A Krishna and Sudama story....","label":0},{"review":"Outstanding  it is all time hit","label":0},{"review":"It's Based On Poverty Of Villagers I Like Irrfan Khan's Acting But I Don't Like SRK(Shah Rukh Khan)","label":0},{"review":"Excellent movie great story","label":0},{"review":"That. Tamil vision so ok film good movie","label":0},{"review":"Excellent movie","label":0},{"review":"Awesome Movie","label":0}]