[{"review":"A film to be heavily lauded for its experimental approach by dealing distinctly with subjects that are social taboo that receive little or no attention at all on account of complex societal norms. Centering around an unhappy man who suffers from the burden of paying his monthly installments, loans and EMIs and who suffers from a little more than undesirable married life named Dev whose only solace seems to limited within the walls of a compartment in his office bathroom where he does the needful ...MORE","label":0},{"review":"A film to be heavily lauded for its experimental approach by dealing distinctly with subjects that are social taboo that receive little or no attention at all on account of complex societal norms. Centering around an unhappy man who suffers from the burden of paying his monthly installments, loans and EMIs and who suffers from a little more than undesirable married life named Dev whose only solace seems to limited within the walls of a compartment in his office bathroom where he does the needful after stealing photographs of the wives of other employees. So urgent is his thirst to quench his sexual desire that be goes on to hide his face in a mask to steal the photo of his boss's wife and when further precautions are taken he desperately brings in the imaged figure of a woman in exposing attire. And all through, the company where he works....Which promoted conservation of water is prompted repeatedly to the audience in the backdrop through posters and labels stamped on even the bathroom walls which brings out the ironical paradox. The cat and dog chase that ensues after Dev decides to black mail his wife's lover has been skillfully sequenced with equally gripping music to give the tension. Khan speaks through his eyes as he does in all his films, playing the titular character. The supporting cast performed with appreciable consistentsy with Divya Dutta and Gajraj Rao topping them. The screenplay was amazing and Khan had his emotions under his grip to produce it in the most appropriate bits in the most suitable time. I give the film a 3.5 out of 5.","label":0},{"review":"#blackmail #reviews #darkcomedy #irrfankhan #comedy - 3.5 thumbs up 👍👍👍🤙\nBlackmail is comedy of errors with lot of quirkiness and is definitely quite engaging. It has all the ingredients to make it a fun watch.\n\nIt's story of a middle class man and his struggles; monthly EMIs, limited salary, sales pressure and a deceitful wife.\n\nIrrfan Khan plays the role of a middle class man in a pitch perfect manner. He is so submissive to every situation in his life that you pity him. He looks so helple ...MORE","label":0},{"review":"#blackmail #reviews #darkcomedy #irrfankhan #comedy - 3.5 thumbs up 👍👍👍🤙\nBlackmail is comedy of errors with lot of quirkiness and is definitely quite engaging. It has all the ingredients to make it a fun watch.\n\nIt's story of a middle class man and his struggles; monthly EMIs, limited salary, sales pressure and a deceitful wife.\n\nIrrfan Khan plays the role of a middle class man in a pitch perfect manner. He is so submissive to every situation in his life that you pity him. He looks so helpless still you never know what next trick he is ploting in his mind. Rest of the cast play their part impeccably.\n\nDialogues are witty and comedy is situational. Director Abhinay Deo gives another unconventional and offbeat film after Delhi Belly. His direction has that kinkiness and freshness which is not there in most of the bollywood movies.\n\nMoney and the need of it, makes you do crazy things, that's what it portrays. There is no surprise that most of the henious crimes happen due to normal situations turning outrageous.\n\nBlackmail deserves to be watched for it's simplicity and bizzare plot.\n\nP.S. The expense statement is quite chucklesome and hilarious.","label":0},{"review":"Absolutely non-sense and worth avoiding !!!\n\nFirst half makes sense though slow.But second half takes away movie in different and unwanted zones..Too many deaths/murders without any solid reasons. \nThe movie could have been made more lighter without violence and thrilling sequences.\nCops appear in the movie and disappear suddenly.Like this many questions remained unanswered and public comes out of theatre confused. \nActing is superb.Irfan lower than his best due to few dialogues than expected.\nO ...MORE","label":0},{"review":"Absolutely non-sense and worth avoiding !!!\n\nFirst half makes sense though slow.But second half takes away movie in different and unwanted zones..Too many deaths/murders without any solid reasons. \nThe movie could have been made more lighter without violence and thrilling sequences.\nCops appear in the movie and disappear suddenly.Like this many questions remained unanswered and public comes out of theatre confused. \nActing is superb.Irfan lower than his best due to few dialogues than expected.\nOverall a bad movie which could have been made better easily after a good start. Rating 1/5","label":0},{"review":"Blackmail# - This is a movie about extramarital affairs , where in the first half of the movie. Irfan comes to know about it and starts blackmailing the person. Awesome and Amazing one ,Irrfan is superb, even surpassing his own previous brilliant performances. Each character has been played stupendously by such fine actors. Screenplay, casting, narrative everything keeps you glued to the screen throughout the movie!  A thorough entertainer, Most recommended. I rate this movie 4/5.","label":0},{"review":"A brilliant movie which tests the audience's intelligence adding to irrfan khan's brilliance in pulling off this dark humor thriller. Its a movie for smarter audiences. The screenplay and music is decent which adds to the positives of this movie. The only negative is a slow and drab first half, which is compensated by a brilliant and pacy second half. The people who didn't like this movie are probably the ones who love brainless movies like those which Salman khan makes. A must watch.","label":0},{"review":"Movie : blackmail\n\nA very well written screenplay with Sharp narrative. This year's most intelligent storytelling from abhinay deol , the director of movies like delhi belly , Force 2 , Game,etc. Comes with the great sense of a drama narration. This film has lots of twist and turns and will hold you till the end . \nIrrfan Khan has very well​ played the role of a blackmailer who blackmail's his wife's affair in need for money. \nActors like kriti kulhari, Diya dutta has played their role very well ...MORE","label":0},{"review":"Movie : blackmail\n\nA very well written screenplay with Sharp narrative. This year's most intelligent storytelling from abhinay deol , the director of movies like delhi belly , Force 2 , Game,etc. Comes with the great sense of a drama narration. This film has lots of twist and turns and will hold you till the end . \nIrrfan Khan has very well​ played the role of a blackmailer who blackmail's his wife's affair in need for money. \nActors like kriti kulhari, Diya dutta has played their role very well.\nThis one is a must watch film.","label":0},{"review":"An amazing movie, keeps you totally hooked up to your seats especially in the second half. They did an experiment with this film and it turned out quite good. Brainless masala movies will continue to dominate the box office but gems like these will always be remembered! It is so different, so engaging movie to watch!","label":0},{"review":"Blackmail is a dark comedy film about a middle-aged married-man stuck in a full day-time job and unexciting life but things turn after he finds that his wife is having an extramarital affair. Irrfan Khan shines his way through in this quirky film with quite a twisted plot. I had a real good time watching this thanks to the acting of the entire cast and as always superb music by Amit Trivedi. The realistic setting of the plot and the film kept me engaged and it was quite a refreshing watch. DO wa ...MORE","label":0},{"review":"Blackmail is a dark comedy film about a middle-aged married-man stuck in a full day-time job and unexciting life but things turn after he finds that his wife is having an extramarital affair. Irrfan Khan shines his way through in this quirky film with quite a twisted plot. I had a real good time watching this thanks to the acting of the entire cast and as always superb music by Amit Trivedi. The realistic setting of the plot and the film kept me engaged and it was quite a refreshing watch. DO watch it folks...my rating 3.5/5...","label":0},{"review":"From the first 15 min ,you will know why Irrfan is one of the best actor of india ! \nIts one of his best performance \nGo and please Watch this if you love dark thrills.\nThe way Irrfan handle the situation when he saw his wife with another man ,that was awesome . \nNo need of item song bt okkk \n\nDirector is good, screenplay awesome","label":0},{"review":"A really good movie which had an appropriate mixture of comedy, thrill & drama. A must watch! And as always Irrfan Khan nailed it. Arunoday & Omi Vaidya were too good too. Infact, the whole cast was amazing & helped to make this film a really decent one.","label":0},{"review":"Different and awesome. It has suspense mixed with comedy greased with fabulous acting especially Arundoy Singh. Irfan and Omi Vaidya are of course seasoned actors. End of the movie, can't help but feel sad for all characters especially Ranjit played by Arunoday Singh. Awesome movie - definitely worth seeing.","label":0},{"review":"#Blackमेल is about multiple blackmails n multiple characters. A frustrated middle-class man whos unable to manage his EMIs. His colleague-cum-friend with whom he shares his personal issues. His wife whos having an affair with a dumb hunk. The dumb hunk whos living off his rich wife. The rich wife whos ever suspicious of her husband. A private detective who finds out who is the original blackmailer. Heres an interesting, madcap film with good performances. The running time should be reduced by 20 ...MORE","label":0},{"review":"#Blackमेल is about multiple blackmails n multiple characters. A frustrated middle-class man whos unable to manage his EMIs. His colleague-cum-friend with whom he shares his personal issues. His wife whos having an affair with a dumb hunk. The dumb hunk whos living off his rich wife. The rich wife whos ever suspicious of her husband. A private detective who finds out who is the original blackmailer. Heres an interesting, madcap film with good performances. The running time should be reduced by 20 minutes. Rating 3/5.","label":0},{"review":"Blackmail: Awesome and Amazing! Irrfan is superb, even surpassing his own previous brilliant performances. Each character has been played stupendously by such fine actors. Screenplay, casting, narrative everything keeps you glued to the screen throughout the movie!  A thorough entertainer! Most recommended.","label":0},{"review":"I can honestly say that it's one of the best movies I've seen after a long time. \n\nSahabzaade Irfan Khan's acting has proved that there's no one better than him. \n\nAnother thing i liked is the plot : even after a lot of plot twists, Irfan Khan gains Victory in the end.\n\nAnd the funniest part in the movie is when he strips to a boxer and wears a tote bag on his head to disguise himself.\n\nI watched it . I liked it. Hope that you'll like it too.","label":0},{"review":"What should i say about this movie. Its the most entertaining and intelligent movie of recent times. Loved it\nAnd Kudos to the director and actors like Irfan Khan and Arunoday Singh. Man Arunoday did a fantastic job. He deserves the appreciation. I would like to give this movie a 4/5 rating. Enjoyed the movie thoroughly !!","label":0},{"review":"superb film! Irfan Khan and team simply rocks!! one liners are awesome! The comic timing of the characters is also great!! especially the call centre scene - so realistic!! :) Do watch it guys!! It will definitely make you laugh!!","label":0},{"review":"One of the most intriguing dark comedies I have seen... Must watch! The motifs and locations are so well decided, and each actor displays a stupefying performance, the direction and teamwork of the crew transforms seemingly awry plots into a tightly knit story. Hats off!","label":0},{"review":"Not that good, characters were loosely coupled, there was no need of chatur ramalingam in this movie. Even story was quite weak and it ended abruptly. I think it could have written in a nice way. \nI saw that it's imdb rating is 7.2, may be because it's a irrfan khan movie, that's why most of the people gave it a good rating. But I think it doesn't deserve more than 6.","label":0},{"review":"Great movie. It breaks the monotone of Bollywood. The youth will like it for sure. The film tries to find humour, doesn't overtry to inflict humour. It will not make you laugh out loud but will carry out you smile throughout. Story superb. Direction screenplay up to the mark. Great use of background score.","label":0},{"review":"irrfan and arunoday  steal the entire show !  acting was superb , no boring indian melodrama  ! no cheap songs ! the story line is fantastic and supporting cast worth their time on screen ! not at all boring or off line for a minute in entire run  ! Irrfan showed why he is ahead of time ! 9/10 .","label":0},{"review":"Oh my God!!!! I don't have words to describe this right now\nI'm not someone who watches Hindi movies but I stumbled upon this gem and it is so SO fun!\nIt's not a serious movie and does not take itself seriously. It's a must watch.","label":0},{"review":"Awesome movie.. Irrfan  and Arunodaya Singh have delivered stellar performances ably supported by others. 4 stars for story writing, screenplay and direction. Dark humour and eccentricity which is quite eye catching. Overall 4.5/5 , must watch.","label":0},{"review":"Best movie ever watched. A really must watch movie this movie made me laugh so much and ya the guy was very intelligent very sense full movie. Mysterious and drama with thrill and action all in one. Must watch movie ✌🏻","label":0},{"review":"Whoa!!!! I’ve been waiting for a proper dark comedy movie in Bollywood. Abhinay Deo, you beauty!! It was so dark yet so funny. Perfect blend of everything that a dark comedy needs. Loved it. Can’t wait for your next movie.","label":0},{"review":"Brilliant screenplay, astounding cast work and at the top, bringing subtlety to the black comedy after a long time by Abhinay Deo, post Delhi belly with the one and only, Irrfan Khan Sir. \nKudos and looking forward for such ventures to expand.","label":0}]