[{"review":"I think this movie feed my soul and such a wonderful philosophy of life, I think this is the masterpiece created ever with wonderful acting of every single actor and actress on the screen but special appreciation to the Ayesha Kapoor who nailed it as a child artist... I got emotional watching the scenes because we have every sense to see, hear, speak and we use to do is not worth living it.\nThank you for making this masterpiece","label":0},{"review":"I don't think I'm that qualified and have such wonderful words to describe this creation of Sanjay Leela bhansali which is breathtaking and marvelous. I think people should watch this movie once in the lifetime so as to get a motivation to live the life upto it's greatest extent. And nothing much to say about this film its magical and my favouraite film in the Bollywood too.","label":0},{"review":"One of the Finest Film that exist in Indian Cinema. Certainly it deserves OSCAR, It explained the feeling & defined the term 'BLACK' which is a choice of Colour for we People but only option for them. I went emotional at whole point of the movie.\nAnd what a Superb acting u r really a legend sir, and Hattsoff Direction.","label":0},{"review":"I don't have words to describe after watching this movie you don't have words to explain that what has to experience in 2 hours 4 minutes there is only a feeling which left in side you you can't explain anyone with word's that have you experienced in this movie first of all Rani Mukherjee & and one an only THE Amitabh Bachchan who has portrait there character very well that no one can't Sanjay Leela Bhansali the only finnest director in our Indian industry who portraits life through it's movie a ...MORE","label":0},{"review":"I don't have words to describe after watching this movie you don't have words to explain that what has to experience in 2 hours 4 minutes there is only a feeling which left in side you you can't explain anyone with word's that have you experienced in this movie first of all Rani Mukherjee & and one an only THE Amitabh Bachchan who has portrait there character very well that no one can't Sanjay Leela Bhansali the only finnest director in our Indian industry who portraits life through it's movie and it's The Best movie that i have seen till 2019","label":0},{"review":"This is a great film. This film describes the love and affection between a teacher and a student. Sanjay sir worked so great, he made this film so much realistic. And the actors and actresses are just excellent. And Rani ji just mind blowing and also Amit ji. Love this film.","label":0},{"review":"I wanted to watch this movie from five years . But for five years I never got that opportunity. Now today 1st February I watched the movie . This movie deserves OSCAR . But it didn't get it.It is greatest movie of humanity of all time. Thanks to Sanjay Leela bhansali for his contribution and thanks to all the actors for their contribution made.","label":0},{"review":"She is the finest actress ever,this movie really inspire me....i don't know why but in india specially,some great concept, actress are underrated,i mean this movie deserve Oscar,even more than that,great acting skill,i Love this movie,so emotional,new leanings,new concept,which is capable to create compilation to Hollywood,i watch only Rani's movies in bollywood","label":0},{"review":"The creation by Bhansali which can be called a profound one. The work on the light of the 'black' and acting by Rani Mukerji and Amitabh is just what we call superb. But a rare attraction is Sabyasachi Mukerji 's superb work on black dresses and lace work, for which he received national awards.","label":0},{"review":"I always wanted to watch & today I finally did. An extraordinary movie in which u will learn that \"Dreams r not seen with ur eyes rather, they r seen with ur inner soul.\"   Deals with a realistic story of a Blind & Deaf girl who got LIGHT because of her TEACHER.","label":0},{"review":"This is very beautiful movie describing disability. This movie is about hope of life and it describes other senses of ur body. we depends too much on our eyes but there are are other body parts like skin. thanks to create this owsome movie.","label":0},{"review":"I saw it 1st when I was young....with my friend ...he,I and whole theatre  was speechless after it got over...our eyes our soul was wet ....more than 10 times I saw the full movie ... now with my daughter I saw it today again ....it is just amazing ...it is not just a movie for me, an inspiration for life...thank u Sanjay sir....thank u Bollywood....","label":0},{"review":"I got a really good inspiration from them.  Feel so much happy to  be born as a blessed child, not meaning they are not blessed but i have everything my own. thank god help those deafblind people.","label":0},{"review":"I don't think I have ever cried this much in any film up till now and trust me i have seen many . This movie is pure classic. I don't think i am in the right frame of mind to comment . I will come back to review once i am qualified enough to . This movie is gem .","label":0},{"review":"One of the greatest movies I have ever seen, amitaabh sir and rani mam have played marvellous roles. it is incomparable, supreme ,revealing the power of one's faith to change the destiny","label":0},{"review":"This is a masterpiece movie for all time . All the character growing fabulous.  Rani and amitabhji wonderful acting make the  heart satisification .","label":0},{"review":"It's wonderful movie,during the time of this movie on some moments I was unable to stop my tears. It has increased my positive attitude.\nIt tells that nothing in impossible😊","label":0},{"review":"I watched this film when i was a kid so i dont remember each and every moment of this film but as far as i remember it is a wonderful movie, it is one of the best Bollywood movies.","label":0},{"review":"The unique aura of this movie remains the same, doesn't matter how many times I watch this. Hats off to all those who worked for this incredible creation.","label":0},{"review":"A teacher would be the most influential person in a person's life ..why because the progress of a human lies with the memories of past life..where you learnt how to live...I learnt the  definition of a teacher as an aspire teacher......this movie gave me a new experience, new thinking process...and mostly can do spirit....thanks to the movie....","label":0},{"review":"One of the finest movie of Indian cinema. Amazing \nPerformances of star cast the Direction, Screenplay & Musical Scores Are underrated.😍🤗🤗","label":0},{"review":"One of the best movie in the world.\nBest art delivered by amitabh bachan, rani mukharji, sanjay leela bhansali","label":0},{"review":"Amitabh  bachchan ,a legendary actor also my favorite star since my childhood,done  great acting  in this movie, \nStill  today nobody can beat him .","label":0},{"review":"Nice movie.The teacher is inspiration for all of us.Every person should be like him .Amitabh Bachchan''s act is heart touching.","label":0},{"review":"Well...am not at all gud using poetic words to describe BLACK!This film is a miracle...if u get with it then u'll understand  that even ur life starts with the letters B L A C K....BLACK!","label":0},{"review":"One of the film which tells that there is no need for a black board or chalk piece for a student-teacher relation.....\n      (Becz I watched it first time on the teachers day)","label":0}]