[{"review":"Its been more than 7 years but still when I watch it, it makes me laugh, makes me emotional and gives a full entertainment.And yeah I am not happy with some of fighting scene but this film has a great story and the last scene is really so emotional.And it looks like real. At last, movie is movie. This movie has a happy end just like others but in real some traveler never come out from the darkness just like .. and you can look at Salman Khan too. He made mistake a long back and still suffering.","label":0},{"review":"It's one of the best action movies of Salman Khan. The story is quite pleasant. The performances are also nice. Songs are very good. 'Teri Meri'  is my most favorite. This movie gives us a message about loyalty and respect. In between, there is a lot of laughter. The climax is written very well. Of course, it's a must watch.","label":0},{"review":"Yeah this movie is house full movie. .....it made me funny. ..its an emotional movie the story is great. ....last part of this movie is so great it's an lessonable movie m little bit angry on kareena kapoor 's friend but her son sought out all the matter and salman khan played a great role in this movie. .....all songs are good and some are so emotional and good. ...","label":0},{"review":"Fantastic Nostalgic movie, I remember watching it with my love who has left me....I still  cry when I listen to the song 'teri meri', Strange life yet a good lesson learned from it!\nLove you Samreen!","label":0},{"review":"Love u salman and kareena. You both acted superb . the movie was nice and its songs were very good . hit like from me","label":0},{"review":"Bodyguard is a trendsetter in bollywood from where the box office collections of the movie reached 100crores in a week and the onwards audience used to see the collections of the movies after the release depending on the openings the movie is called hit or flop.\nBollywood will never forget bodyguard because bodyguard made bollywood rich.","label":0},{"review":"Excellent movie. Excellent dialogue, story , screen play and aslo excellent music and songs of this movie. Verdict :- ALL Time Blockbuster. Aa Gaya bodyguard","label":0},{"review":"When we watch this movie is fully fantastic, outstanding, super se upar, best ever, action, fun, damaal, every word is small to say about this film","label":0},{"review":"Good movie  i love to watch these movie very march .And i like the song of bodyguard dakho dakho a gaya ha bodyguard .And salman i love you .","label":0},{"review":"This was the second bollywood movie i watched and i still love it. Its still one of my favorites","label":0},{"review":"I cried a lot watching this film and laughed also (it gave me a full entertainment 📽) but the last part was too emotional 😢)","label":0},{"review":"Emotional and sensational love story  in Bollywood industry best movie with set of magical imaginations.","label":0},{"review":"Bodyguard is one of the weakest action films of all time. Despite of having brilliant action sequences and a heartfelt climax,  rest of the film is nothing but a pure disappointment.","label":0},{"review":"This is my favorite movie So far I've seen it 80 times\n\"I am a fan of Salman Bhai\"","label":0},{"review":"This movi make me cry any time anywhere....One word for this move awesome","label":0},{"review":"It's my first time I was wondering and hoping it will be there good film","label":0},{"review":"I think in this movie story is the best..and very emotionally and romantic movie","label":0},{"review":"Worst picture worst story and pathetic act ...\nMay be the director was from nala sopara","label":0},{"review":"This film is very good film.action is brilliant. Song is to romantic.","label":0},{"review":"This is my best movie I seen by 100times","label":0},{"review":"Pure entertainment & full of sentiment too.. nice songs..Salman K.. great ..as usual","label":0},{"review":"Amazing movie by Salman Khan story is OK and best action scenes say 8.6/10","label":0},{"review":"Most hilarious movie ever scene in my life","label":0},{"review":"this move is really great story and action","label":0},{"review":"Amazing acting of salman khan and kareena kapoor.. Superbbb movie","label":0}]