[{"review":"This movie is an anthology of four stories which is all beautifully directed by Karan Johan-'Ajeeb Dastaan Hai Yeh', Dibarkar Banerjee-'Star', Zoya Akhtar-'Sheila' & Anurag Kashyap-'Murabba'. All these four stories exceeds in winning the heart to those who do give it a chance even after watching the very first scene. Although this movie would've received much appreciation and collection if it would've released after 2020. Yet, love it.","label":0},{"review":"\" Achar ka dabbe me kabhi murabba nahi rakhna chaiye\" this dialogue from this flim is also applicable for this movie. The 4 unique story have potential for better. Cast is suparb, but all of them is not justice with the role. This flim should release after 2020, feel audience will accept this flim better then.","label":0},{"review":"In this 100 years we have got greatest talented person and greatest dancer and most beautiful beauty queen of Bollywood ie sridevi India's and Bollywood's first female superstar and Rajesh khanna India's first male superstar ie greatest actress and actors","label":0},{"review":"Excellent movie... Powerful direction by all four \nTalented directors karan johar  ,zoya ,anurag kashyap ,dibakar .. excellent performances too..","label":0},{"review":"I think is really good movie. Yes good movie.","label":0},{"review":"My favourite place Mumbai i love Mumbai","label":0},{"review":"Excellent Movie","label":0},{"review":"Awesome watch","label":0},{"review":"Nice movie..Nawaz acting was best","label":0},{"review":"I think 🤔,, it's a fantastic","label":0},{"review":"Nice movie","label":0},{"review":"Nice  movie","label":0},{"review":"Dibakar benerji's \"star\" is a story by Satyajeet ray named \"Patol babu\"","label":0},{"review":"Yes plz help me to find this movie","label":0},{"review":"You can find this movie on netflix","label":0},{"review":"It is a 100% hollywood type movie.","label":0},{"review":"I cnt find this movies anywhere","label":0},{"review":"Can't find this movie anywhere except this Youtube.","label":0},{"review":"I like this movie.","label":0},{"review":"this movie on the hotstar....","label":0}]