[{"review":"Quite different from other love stories. It shows that emotional and love genre movies can end with death of both lovers in the end. I really appreciate the director,producer and script writers that they took risk of killing them both in the end, as many directors would oppose that. Acting of both the stars is amazing and will definitely pave path if some other movies are made in this genre. The songs are apt to the scenes and very good. After seeing the movie, i do not feel bad and sad that bot ...MORE","label":0},{"review":"Quite different from other love stories. It shows that emotional and love genre movies can end with death of both lovers in the end. I really appreciate the director,producer and script writers that they took risk of killing them both in the end, as many directors would oppose that. Acting of both the stars is amazing and will definitely pave path if some other movies are made in this genre. The songs are apt to the scenes and very good. After seeing the movie, i do not feel bad and sad that both of them are not alive. This is where i give full marks to movie that they spread the message clearly. Please watch this film once, and you will fall in love with it.","label":0},{"review":"This is my all time favorite movie.parineeti Chopra & Arjun Kapoor nailed it!!!!.This movie has a unique plot,that makes this movie so special.& also the fabbb performance of the actors completely fullfill this movie. & the directior also proves his brilliance. It is an complete mixture of romance, action, drama,emotional, aggressive ,etc...&  If you are looking for an good quality, unique , depthy love story,i think it has all the elements .\" Don't miss these kind of movies\" this is my request  ...MORE","label":0},{"review":"This is my all time favorite movie.parineeti Chopra & Arjun Kapoor nailed it!!!!.This movie has a unique plot,that makes this movie so special.& also the fabbb performance of the actors completely fullfill this movie. & the directior also proves his brilliance. It is an complete mixture of romance, action, drama,emotional, aggressive ,etc...&  If you are looking for an good quality, unique , depthy love story,i think it has all the elements .\" Don't miss these kind of movies\" this is my request as a movie lover.","label":0},{"review":"A must watch movie really what a beautiful love story different from other movies. And all the songs are super hit like jhalla walla, pareshan etc. And the last sence of the movie makes me cry ever time. The acting done by arjun and parineethi is superb👍😘😍","label":0},{"review":"Awesome movie Arjun and perineeti done fabulous work . Song story and dance is very good 😍. House Khan also doing fab job. Love the movie always .only ending is painful","label":0},{"review":"An absolute delight to watch. No matter what everybody says you cannot get over the skills portrayed by Arjun Kapoor. Kudos to him and the team !","label":0},{"review":"I think this is the best film of Arjun and he is a very talented actor and he has a super personality and he is so handsome.Though this is his first movie but his acting was super cool in this movie.","label":0},{"review":"This film made my cry sooo bad! Totally loved the story and the brilliant performance of the entire cast, Its a must watch. <3","label":0},{"review":"I think, like the way it happened in the film as the boy cheat a girl like that.\nShe would never accept him again, but the film shows the exact opposite.\nThe story writer could have showed some common sense.","label":0},{"review":"No matter what issues the film puts light on, but surely most of the girls would love \"CHOKRA JAWAAN ISHAQZAADA\" Arjun Kapoor and \"ISHAQZAADI\" Parineeti Chopra. \nWatch the movie once only for the performances of all the actors and songs and direction too!!!","label":0},{"review":"Yeah it's a nice movie to watch creepy arjun had really acted his own life. But it's nice movie to watch.","label":0},{"review":"A film that sends the wrong messages through poor acting and direction. If that wasn't bad enough the ending (the entire film almost) is a complete ripoff of Ram-Leela.","label":0},{"review":"Meri fav movie hai ye... awesome love story... parineeti n arjun very good acting...😘","label":0},{"review":"Awesome pictures hai and wonderful love 😍 stories and allows like this picture parineeti good acting yar","label":0},{"review":"I like this Movie ye meri favourite Movie Hai bahut achhi hai love Story is very good","label":0},{"review":"This is one of the best movie of  bollywood its a must watch 💙","label":0},{"review":"My daughter love Paternity Chopra and her move Hasee toh phasse and lshqzaade","label":0},{"review":"A must watch again movie with a good story base","label":0},{"review":"Ultimate movie, specially the politics of uttar pradesh. Well done","label":0},{"review":"Arjun kapoor is awesome, he is very talented and very handsome","label":0},{"review":"My city Hardoi scene is in  this movie.\nMy favorite movie is Ishqzaade.","label":0},{"review":"Excellent movie with a nice message.","label":0},{"review":"My favourite movies for Arjun kapoor","label":0},{"review":"It's so loving and sad movie","label":0},{"review":"It tells that love makes you a rebel","label":0},{"review":"My fav movie and arjun and pari are my fav couple 💋💋","label":0}]