[{"review":"This is the movie of one brother and his little sister who lost her school shoe. She used to wear her brother's shoe only because she lost her shoe. As you think that she can buy a new ones. But her family is too poor that her father can't afford to buy a new shoe for her daughter. But one day  her brother participate in a race. It is announced that the winner will get a pair of their most favourite shoe 'Addidas' that his siser wants. His brother satisfied her wants by winning first place in ra ...MORE","label":0},{"review":"This is the movie of one brother and his little sister who lost her school shoe. She used to wear her brother's shoe only because she lost her shoe. As you think that she can buy a new ones. But her family is too poor that her father can't afford to buy a new shoe for her daughter. But one day  her brother participate in a race. It is announced that the winner will get a pair of their most favourite shoe 'Addidas' that his siser wants. His brother satisfied her wants by winning first place in race.","label":0},{"review":"The best movie ever. Elder brother and younger sister the siblings relationship . The movie is so realistic it shows even with little means we can lead a happy life","label":0},{"review":"Movie Story is very very charm and good. poverty peoples not leave honestly !! Part of story Little Boy for her sister need like Shoes.. choose wrong path ... after then it cover it.. \nLet's see Movies.","label":0},{"review":"One of the best movie I have seen \nAnd the story is so powerful and the acting also.\n\nGreat movie.   \nI'll recommend everyone to see that film.","label":0},{"review":"Remake of children's of heaven. Still lacks a lot.you can't make a good movie just by coping it.if you watch the real one.you will know the difference","label":0},{"review":"This movie is very useful to motivate the parent,child ,teacher and others who misbehave with child .In this film lot of moral education and learning skills","label":0},{"review":"Good inspirational movie but after sometimes looks like ad film of Adidas & Horlicks.... Certain contents need concern if you consider it a children's movie","label":0},{"review":"Watch the original movie \"Children of Heaven\".. It's 10000 times better..  Dear bollywood.. stop copying... Have some shame.. do something original...","label":0},{"review":"This is a very touching story!!\nI recommend everyone to watch it atleast once.","label":0},{"review":"A complete copy of Chidren Of Heaven (1997) but doesn't create the same magic ( not even half of it ) WATCH THE ORIGINAL","label":0},{"review":"It's a very interesting movie... I jst love it","label":0},{"review":"this is movie is the full copy of iranian movie children of heaven shame on bollywood cannot make movies by their selves","label":0},{"review":"very emotional movie......it perfectly captures the innocence and purity of children..unfortunately it did not get enough credit","label":0},{"review":"Super movie it is not expressed in words","label":0},{"review":"The best movie ever made","label":0},{"review":"this movie is based on \"The Children Of Heaven\" from Mazid Mazidi..","label":0},{"review":"Awesome movie","label":0},{"review":"Interesting actually superb","label":0},{"review":"Remake of Oscar nominated Majid Majidi film \"Children of heaven\"","label":0},{"review":"Poor movie","label":0},{"review":"interesting movie","label":0},{"review":"It's a remake of children of heaven","label":0},{"review":"You cant leave it without watching full","label":0},{"review":"Average movie","label":0}]