[{"review":"Road trips have a unique charm and moviews with that backdrop are exciting and easy to digest. Definetly recommended after a tiring weekday. Lovely philosophical takes on accepting things rather than fighting them!","label":0},{"review":"Great and nice movie I have ever seen..Acting and almost all the events like without ticket train seen ,truck pe  laraji ki journey,red tomato rest.me pawn wsla seen oh no I never miss this film whenever it screened  on T V.Thanks for producing this film","label":0},{"review":"Fantabulous movie ...Vinay pathak is one of the best actor ... His dedication to role is awesome ..Superb...Superlative performance by him..Lara act is good... Shashant shah direction is impressive 👍","label":0},{"review":"A very good message.. Accept things if you can't change it.. And you can do it in your day today life.. In small small matter.. One day you will come to know that you have developed capacity to handle big problem so easily..","label":0},{"review":"Great film. Flavour,emotions,characters all exemplified superbly painting the picture of a diverse,vibrant & colorful,Emotive India! Both Vinay and Lara live their parts","label":0},{"review":"Great message giving UNDERRATED Comedy Drama Movie and delightful concept about the travelling in India and it's Dark side.The lead pair: Lara Dutta(also Producer) & Vinay Pathak nailed it!!\nAkshay's also there as cameo.","label":0},{"review":"unbelievable movie and one of the best adorable,amazing,fascinating and superb new story with lots of fun and enjoyment my ratings for it is 10/10 stars i wanna remake of it","label":0},{"review":"This film was very greatful with comedy & emotions.in this movie LARA DUTTA's  &  VINAY PATHAK's role was very great . I loved this movie by heart","label":0},{"review":"A delightful movie and despite rewatching it now in 2017, i still it lovely, charming, touching and memorable like one feels when going on a journey.","label":0},{"review":"Wow, best movie.very entertaining.Lara dutta is looking fab like always.Vinay Pathak is too good.No cheap jokes.It's a family movie.","label":0},{"review":"One of the best Hindi movie to watch with fantastic climax.\nEagerly Awaiting for sequel 2","label":0},{"review":"Good movie.. One of good travel movie with the great performances by both lead characters specifically by Rajat pathak..","label":0},{"review":"Awesome movie. Enjoyed watching it. Felt very connected and engaged throughout the movie.","label":0},{"review":"Cool ! Vinay Pathak acting is so natural and it reflects the common man's plight ! Must watch movie !","label":0},{"review":"After a long time a refreshing movie... Reminds me of Dil Hai Ki manta Nahin...film based on a journey...simple and enjoyable...loved the movie...","label":0},{"review":"Amazing movie ! Full of fun and drama and emotions too. Vinay Pathak is Legend.","label":0},{"review":"Whenever this movie telecasts on TV,I watch it.\n\n\nThis movie is reality.\nLife is important.\n\nAnd kuchh bhi ho....\n\n\"Kaun si badi baat ho gayi\"","label":0},{"review":"awesome plot and outstanding performances by both lara and vinay. completely enjoyed the film.","label":0},{"review":"Very nice movie I love it Best acting of Vinay Pathak and Lara Dutta","label":0},{"review":"i wanna watch this movie since long time but could not trace it, could any one help me out how could i watch it?? Please. I don't wanna miss it.","label":0},{"review":"Fantastic movie, awesome acting by Vinay & Lara. Comedy, emotions everything.","label":0},{"review":"it's a beautiful remake of planes train and automobiles.\nLoved it.","label":0},{"review":"these is a great film for me i have a very nice experience with these film","label":0},{"review":"Vinay Pathak acting was so much Natural. \n[1.12 GB] use reverse text : /eivom-1102-illid-ollahc-bg-21-1/seivom-yt/moc.tcilfnocsss//:sptth\n\nReverse any Text : spellbackwards(dot)com","label":0},{"review":"Very nice film i saw ever.interesting story.vinay pathak acted very nicely.","label":0}]