[{"review":"This movie was definitely ahead of its time. Despite of having such master piece of entertainment, audiences back in those days were not ready for such new concept. It totally gave me Stephen Chow movies feel. I absolutely loved the choreography and action scenes. Can't believe that even critics had limited perceptions back in those days. I highly recommended everyone to watch this movie again.","label":0},{"review":"Best film of akshay. Bit unfortunate that it didn't do well but the movie is awesome and deservers to be among the best entertaining films of bollywood. This is also has best trp when aired in tv. Go and watch you won't be dissapointed","label":0},{"review":"It's a real fun movie. I would also say it's an Indian live action adaptation of 2008 blockbuster Kung-fu Panda. It has it's great moments and bad moments, but the movie knows what it is and never takes it too seriously. Can be watched when you don't really have much to do. I had real fun watching this movie.","label":0},{"review":"It is among my favourite movies. The comedy, action and story will definitely win your heart. The movie is a total pack of every emotion. Moreover, it is an inspiring movie also. \nEveryone's performance in this movie is simply fantastic.","label":0},{"review":"It's a highly entertaining martial arts action comedy film. You get to see Akshay performing and executing several moves flawlessly. It's an underrated action film and deserved a lot more love than it got.","label":0},{"review":"I love this movie a lot.. I watch this movie many times... And want to watch it many times more...  The production team should  make the part 2 that is Chandni Chowk to Africa early... I'm very excited  to watch this movie... I could not wait soo much.. It is my request to make the part 2 of this movie  earlier... All indians & and all the people from other countries like china should watch the movie.... It is a entertaining and motivational movie... Make the part 2 of this movie -Chandni Chowk  ...MORE","label":0},{"review":"I love this movie a lot.. I watch this movie many times... And want to watch it many times more...  The production team should  make the part 2 that is Chandni Chowk to Africa early... I'm very excited  to watch this movie... I could not wait soo much.. It is my request to make the part 2 of this movie  earlier... All indians & and all the people from other countries like china should watch the movie.... It is a entertaining and motivational movie... Make the part 2 of this movie -Chandni Chowk to Africa... 🙏🙏🙏","label":0},{"review":"Watched this movie again and i will definitely say that this was such underrated movie! I would suggest it to watch. Really comedic with good story line and beautiful also ahead of its time.","label":0},{"review":"Movie is fine .. akshay done full Justice with his role.. in the movie he has done comedy , action and emotional very well.. action scenes is mind blowing specially when akshay learns martial art technique from his mentor... Overall nice to watch...👌👍","label":0},{"review":"It's a good movie basically. But, at the time of release, such movies were not really appreciated in India. Also, one other fault with the movie is that it leaves with a cliffhanger which is really not required. Other than that, it's a good movie","label":0},{"review":"Best motivational movie ever made.\nMixture of comedy and emotions make it the best!\nWorth watching. Akii have done a great job.","label":0},{"review":"Hello .. hope all are doing well ... maybe i think someone didnt noticed the last thing in the movie in very last shot was said that it will be Continued .. Chandni Chowk to Africa .. but it never did happend actually ... well lets see if it comes out someday ... thank you","label":0},{"review":"It's one of its kind. I found it entertaining in many aspects. Underrated for no reason, The story is optimistic in nature, Cast is very convincing and promising action.","label":0},{"review":"Best ever movie. It tell us that never give up in your life whether the way is too hard , always believe yourself as nothing is impossible.","label":0},{"review":"Best ever comedy fantasy action movie seen in my life.Fully entertainment enjoyed.I am still waiting for \"Chandini Chowk To Africa\". When this movie will come..😍😍","label":0},{"review":"The reviews don't make sense to me. The story is not intended to be taken seriously. It's a nonsense film and I like such films. Relatable to many I'm sure.","label":0},{"review":"It is not a. Good film but if you are free and dont have aby other yhan it will help you to pass your time","label":0},{"review":"This is the best movie. I love this movie. Waiting for second part of this movie. Directors should make its second part.","label":0},{"review":"I DONT KNOW WHY THIS MOIVE WAS A FAILURE .... I HAVEN'T MET A PERSON WHO TOLD ME THAT HE/SHE DIDN'T LIKE THE MOIVE..SO MUST WATCH..TOTAL ENTERTAINERA FUN RIDE","label":0},{"review":"It is one of the best entertaining movie.I don't know why many people hate this movie.I am still waiting for chandini chowk to Africa","label":0},{"review":"Its so good. I've watched it many a times. I am waiting for its sequel (maybe Chandni Chowk to Africa). 👌👌👍","label":0},{"review":"Bro don't criticise films like this. Bcz they are created by God's in heaven for not humanbeings for God's like akshay and mithun","label":0},{"review":"Best Movie !! Comedy as well as Emotional...... Love Akshay Kumar and Deepika!!","label":0},{"review":"One of the most entertinig movie of Akshay Kumar. Forget about reviews this movie is one of most viewed movies on tv. whenever I go I saw when this movie aired on tv people watch this.","label":0},{"review":"I think that this movie is motivate to new generation for hard work for success in life .","label":0},{"review":"Very nice movie any one look movie and very fun for mind in life","label":0}]