[{"review":"I checked for my Review. It must have been on Orkut or May be I was not writing in 2007. But I remember writing about this movie. Ya a All time fav. BigB nails the Role to a T and Tabu is Fantastic. Balki Directed it and After This has not Got Such Terrific Screen Play ever in the Following movies. The mom Scenes are hilarious and little Sexy makes your eyes go Moist and then We all lost her in a tragic plane crash. Best part was it did not offend the Fragile Indian Sensibilities back Then. May  ...MORE","label":0},{"review":"I checked for my Review. It must have been on Orkut or May be I was not writing in 2007. But I remember writing about this movie. Ya a All time fav. BigB nails the Role to a T and Tabu is Fantastic. Balki Directed it and After This has not Got Such Terrific Screen Play ever in the Following movies. The mom Scenes are hilarious and little Sexy makes your eyes go Moist and then We all lost her in a tragic plane crash. Best part was it did not offend the Fragile Indian Sensibilities back Then. May be Will see it again Tonight. A sweet Rom-Com to go with Hot Coffee ☕️","label":0},{"review":"Both Amitabh and Tabu are exceptionally good actors who carry their respective roles with aplomb. There is much entertainment. Cancer angle could have been easily avoided except that it serves the purpose of showing that under the veneer of a tough and disciplined boss is a fine human being.\nThe end is weak and abrupt. Unlike  Nishabad there is no lesson to be learnt by the society.\nOn the whole a very watchable movie.\n\nP.S.One common factor in Nishabad and Cheeni Kum is the younger partner givi ...MORE","label":0},{"review":"Both Amitabh and Tabu are exceptionally good actors who carry their respective roles with aplomb. There is much entertainment. Cancer angle could have been easily avoided except that it serves the purpose of showing that under the veneer of a tough and disciplined boss is a fine human being.\nThe end is weak and abrupt. Unlike  Nishabad there is no lesson to be learnt by the society.\nOn the whole a very watchable movie.\n\nP.S.One common factor in Nishabad and Cheeni Kum is the younger partner giving early hints to the older towards advancing the relationship in these age gap movies.","label":0},{"review":"One of best romantic comedy movies of all time.\nI don't know why but it always has a special effect on me and I always feel refreshed and in the perfect mood after watching this movie.\nBig B and Tabu should take a bow. Exceptionally fine acting skills to carry such a difficult role with ease.\nR Balki must also be given due credit for coming up with such refreshing ideas......\n\n**** 4/5 stars...........","label":0},{"review":"Loved the story line.\nYet, I felt- it was lacking in something.\nChemistry was probably assumed by The loyal fans. Dialogues or maybe male lead's character portrayal was weak. The male lead's bond with the little girl could have been better.\nTo sum it up,  I loved story but actual movie need a bit of work","label":0},{"review":"It's tough for any society, not just Indian, to accept such kind of relationship, only because people worry about the partners. Good Movie undoubtedly. Asks us to expand our mindsets a bit rather than living in stereotypical mindsets forever.","label":0},{"review":"Big b and tabu ji,  super divine combination of brain brain beauty beauty brain brain,  love to see them act more movies,  r balki u r the one and only can recreate the magic,  please please sir ji forgot sorry sorry ji,  my friend karthik raja's father,  isaiguru ji","label":0},{"review":"I really love this film and good acting in tabu and amithabhachan ji. Story also good and different with comedy. I love very much illayaraja music.","label":0},{"review":"R Balki has justified the relationship between the duo. The concept of this movie is new & awesome. Fantastic acting of Amitabh & Tabu. Really amazing movie.","label":0},{"review":"Actors acting were too good . Songs were too good . Social message is there in this flim . Age is just a number .  Climax scene was very emotional   .  It's 11 years old movie . 2019 is going on .","label":0},{"review":"Wow! What a movie!!! It give us an inclusive feelings of love ....there have no fixed time to love....really nice to me....","label":0},{"review":"Very well directed, excellent acting by all the four actors including the baby","label":0},{"review":"Nice movie, worth watching, i wish Bollywood make these types of movies","label":0},{"review":"it's a wonderful story! worth watching and with strong message.","label":0},{"review":"Beauty full love story Amitabh and tabu original Mithras\nThanks","label":0},{"review":"Nice movie I love the songs","label":0},{"review":"Smart sense of humor nice movie","label":0},{"review":"Big.G's performance is outstanding","label":0},{"review":"Nice Movie","label":0},{"review":"Good movie","label":0},{"review":"Bothe of them are lovely  actors.","label":0},{"review":"This best movie","label":0},{"review":"Simply m crazy about this movie ❤","label":0},{"review":"My favourite movie","label":0},{"review":"Loved it😍😘","label":0},{"review":"how to play thisvideo full movie","label":0}]