[{"review":"I really like this movie too much. This is right that this movie ( chota Bheem and the throne of Bali) have actions but their are also other things in this movie which I like too much such as_ after saw this, I would feel the expirence of Bali Indonesia, it's greenery also attracts me,it's temples are so beautiful and tourists attractive, as well as many other things .sir(Rajiv chilaka) I really loves this movie.the single thing I like in this movie is only your_ animation and story. Sir I reall ...MORE","label":0},{"review":"I really like this movie too much. This is right that this movie ( chota Bheem and the throne of Bali) have actions but their are also other things in this movie which I like too much such as_ after saw this, I would feel the expirence of Bali Indonesia, it's greenery also attracts me,it's temples are so beautiful and tourists attractive, as well as many other things .sir(Rajiv chilaka) I really loves this movie.the single thing I like in this movie is only your_ animation and story. Sir I really loves this too much and I have _clap! Clap! Whistle!...... Only for you sir.sir I am only in class 9 but in this class I only wanted to be like you.......not famous too I only like to be a cartoon animator as well as I want to write stories and animate_ chota Bheem cartoon on yours name and write new and animate new stories....... Sir if you like this so please think about my passion and do something me to be a cartoon animator\nAt last I only want to say that I am proud of you sir and want to meet you please....\n\nThank you....","label":0},{"review":"This is the best movie of chota bheem which consists of lots of action and thrill , I wish to download this but this is not available on internet","label":0},{"review":"please sir can you upload mighty raju rio calling full movie in Hindi please sir please I very much like this movie please can you upload in youtube","label":0},{"review":"It is very interesting movie this is my favourite movie of chhota bheem please upload on YouTube","label":0},{"review":"sir thanks for directed this movie  but their is one situation is that now this not come on the TV screen sir request to you that send this movie on the TV screen","label":0},{"review":"I love the movie super hit it was everything is perfect","label":0},{"review":"It's Really Heart Touching Movie from All Parts... Suparb Thinking Boss... 😘😘😘😘😘","label":0},{"review":"\"Throne of Bali \"must occupy the 1st place in best movies of Chotta Bheem.2nd place is to \"Curse of Damyaan \"and 3rd place is to \"Crown of Valhallah.\"","label":0},{"review":"This is best movie of chota bheem and my favourite movie 🎥","label":0},{"review":"Chhota bheem  team is very smart  and bheem  is very good personality","label":0},{"review":"IT IS AN ADVENTURES MOVIE OF CHOTA BHEEM.I LIKED THIS MOVIE","label":0},{"review":"This is the best movie of chhota bheem","label":0},{"review":"This is best movie of chhota bheem","label":0},{"review":"Full movie is not available anywhere on internet.To download it is to waste time","label":0},{"review":"This is best best movie of chhota bheem","label":0},{"review":"Please sir send this movie to tv screen I like this movie very much","label":0},{"review":"Best chota bheem movie remembered my childhood 😀😀😀","label":0},{"review":"This movie is not avilabel on internet thats the worst thing","label":0},{"review":"This is the best chhota bheem movie","label":0},{"review":"Please mr rajiv chilka made another series of chota bheem and the throne of bali series with the same characters","label":0},{"review":"It is my favorite movie","label":0},{"review":"Awesome movie","label":0},{"review":"Best movie of bheem","label":0},{"review":"Amazing movie","label":0},{"review":"wonderfull movie everyone like it...","label":0}]