[{"review":"this movie is absoultely awesome. i thought chotta bheem and krishna was good. i thought rajiv chalka was just making movies for the sake for it but no, this movie had gone over my wildest imagination. damyaan for instance had a very villan type voice and the new rise of damyaan movie does not do his voice justice. this movie is awesome.","label":0},{"review":"the movie is wonderful I am thinking in you tube all chota bheem move it can be in tamil then more children will see😀","label":0},{"review":"Hi, my name is Bishal das and my favorite movie chota bheem and the curse of damyaan and I wish you're favorite movie because chota bheem cartoon is a outstanding cartoon c","label":0},{"review":"i like this movie so much my life  exists in this movie. every chotta bheem lover should like this if he does not likes he is not a real lover of chotta bheem like me","label":0},{"review":"My name is sri charan.\nIt is super movie.\nIt is first movie of bheem,\nReleaseing in theatre.\nWe all enjoy by seeing this movie.","label":0},{"review":"My fravoraite movie it's awesome I saw this movie when I was 8 year and my fravoraite charector is bheem & damyaan","label":0},{"review":"Really  good  movie. The songs  are good and the last fight is the best","label":0},{"review":"Amazing movie I want to see the movie once but they are not telecasting I like the song jam jam jambura","label":0},{"review":"I have watched this movie at the age of 8 with my family and my cousin brother in mall","label":0},{"review":"It's a good movie children who loves chhota they definitely like this film","label":0},{"review":"It's a very good movie for children and I like this movie a lot","label":0},{"review":"I'm like this movie very very very very very......................... Much but this is movie is not in you tube and other browser please ye apni movie you tube par daliye full hd","label":0},{"review":"This movie is so good but chotta Bheem incan adventure is fabulous.","label":0},{"review":"I love this movie but this is not available in YouTube and other browsers","label":0},{"review":"In my opinion this will be the best moving cartoon","label":0},{"review":"I love this movie lot of fantasies also","label":0},{"review":"Very nice all children will like this surely","label":0},{"review":"It's a wonderful movie of Chota bheem","label":0},{"review":"It's fine for a one time watch. Lacks novelty though","label":0},{"review":"It is a very very intertesting movie\nAnd I like it a lot","label":0},{"review":"Yes I am the fane and healthy","label":0},{"review":"This film is like a mysterious and adventures","label":0},{"review":"I like this film cures of damyaan","label":0},{"review":"I love this film","label":0},{"review":"Very good movie","label":0}]