[{"review":"Chillar party is an absolute gem of a movie that will crack you up and make you tear up in equal measure. \n\nThis children's film actually has great lessons for adults. The children's principled stand in favour of their furry friend teaches us adults why it is important to be kind, tolerant and stand up for what is right, even when you know you may not win. \n\nI'm glad I saw this movie, even if a few years late.","label":0},{"review":"Awesome movie...That what the calibre of a talented director ..Nitesh tiwari proved his talent. Awesome stellar performances by child actor.  Great ..","label":0},{"review":"Awesome... What a unity... Friendship... Clean hearted... Heart winning.... Specially thinking towards our surrounding faithful dogs...\n\nExcellent direction and acting of children... Teaches and remind us many things....","label":0},{"review":"One of my favorites...as many time u watch it...that many times it will prove...that a movie with such strong script does not need huge production house..or.. glamorous superstar...or some dance number...must watch","label":0},{"review":"Children strength and unity displayed well.  A good film is made with the children and for the children.\nI enjoyed watching chillar Party Hindi movie. Why the movie is named chillar Party.","label":0},{"review":"One of the finest movie I have ever seen... Brilliant combination of Comedy and Emotions... Full marks to the cast and the whole army of the movie...","label":0},{"review":"We should learn from this film about our simple duties to the society . As human beings and as grown adults wat ever we have forgotten has been projected very eell","label":0},{"review":"i think the movie has built a niche for itself and the best at all time after all its the film produced by salman sir so always a blockbuster.Especially  the acting  of irrfan khan.","label":0},{"review":"It's a real example of a bonding of friendship everything thing is possible with trust to each other and love","label":0},{"review":"everyone must watch get positive energy also to children.very good movie. Political environment our children must know.","label":0},{"review":"Fatka was wearing the same old t-shirt and pants and nobody batted an eye? \n\nPlus the fact that he had not much money or a place to stay?","label":0},{"review":"Awesome movie, great Message. \n\nLove to all the child actors. They rocked in movie.","label":0},{"review":"It  is a fantastic.  In this movie  best  team  work  was  shown","label":0},{"review":"Never knew this movie would be so great just loved watching it .Must watch movie guys👍","label":0},{"review":"This is the best movie which make us feel proud and do something for others...","label":0},{"review":"Loved this movie, made me so emotional. Parents need to support their kids like this!","label":0},{"review":"Osm movie,\nFabulous acting by all child artist , specially jangya doing excellent work..","label":0},{"review":"An excellent movie to foster unity and fraternity among children.","label":0},{"review":"Great movie motivating to fight against odd situation.","label":0},{"review":"Nycmovie I have seen it today only\nThe children looks gorgeous","label":0},{"review":"Nice work, need more cinema for kids","label":0},{"review":"My love for this movie is infinity 😍😘","label":0},{"review":"A super i am fan of jangya balwan","label":0},{"review":"This movie is really very good 👍👍❤","label":0},{"review":"It's really awesome love It yaar😊😊","label":0}]