[{"review":"I like this movie because it has a proper family movie which has lots of comedy, drama, love and friendship.I love rani mukherjee a lot and her acting too, she really acted well in the movie. Its a kind of rajshri movie types. In the second half , Pretty zinta is seen in the movie and story line changes from there a lot. I love this movie and recommend it to everyone to watch it and rate 4.3/5.","label":0},{"review":"I love to watch this movie i had watch 100 times this movie but can't feel bor nice story osm comedy everything is perfect.....","label":0},{"review":"Its such a luvly movie..Nd i really luv preity zinta maam... childhood crush..Always love to preity zibta.❤","label":0},{"review":"No 1 punjabi song from this movie best song ever lov so much...oll songs too♥","label":0},{"review":"I love this movie especially madhubala aka priety zinta . I have watch this movie dozen of times","label":0},{"review":"chori chori chupke chupke is the best and amazing movie of my life","label":0},{"review":"Chori chori coupke is bast movie and I like the song","label":0},{"review":"This is a very beautiful movie. I like this movie","label":0},{"review":"Really I like this movie tremendous love story ❤❤❤","label":0},{"review":"Very nice film.every person see the film","label":0},{"review":"Nice concept I loved the ending","label":0},{"review":"2001 best movie...I love Salman Khan,Rani Mukherjee And Preity Zinta's Acting....","label":0},{"review":"chori chori chupke chupke is best movie it give us inspection...","label":0},{"review":"Very good movie I like it","label":0},{"review":"This is a very good movie","label":0},{"review":"Very good story must watch","label":0},{"review":"I this movie and salman khan your 11 years fan vani","label":0},{"review":"Lovely movie wonderful songs","label":0},{"review":"Lovely video song brother","label":0},{"review":"No1 pnjabi is best song👌","label":0},{"review":"The movie is too Emotional ...\nI love it ...","label":0},{"review":"it was great, but the ending was really bad, it's a big no for it","label":0},{"review":"Awesome movie","label":0},{"review":"Awesome movie","label":0},{"review":"is the best movie","label":0}]