[{"review":"One of the best movies I have ever watched. The story tells us that how much people suffer while moving to the cities for a good opportunity. This movie shows the saddest reality of real life events that happens in the middle class families. I would strongly recommend to watch this movie. Raj Kumar Rao is all time favorite.","label":0},{"review":"Now only I watched this movie. I'm very thankful to my cousin for suggesting this movie. I changed the way I look into the life . This movie will teach you that 🍞 and butter is not so easy. A man's biggest pain is not to able to get his family 3 meals a day. Superb acting from all. Everything seems perfect. Story, screenplay, songs, acting. You can't ask for more.","label":0},{"review":"Made me cry a couple of times during the course of watching this intense movie. Watched only now, after 4 years of it's release but still it feels fresh. This makes you realize the importance of those little things we've in our lives that we take for granted, that are really a previlage for many in our country and the developing world.","label":0},{"review":"A poignant portrayal of human emotions, this movie draws the viewer in with fervent appeals to one's morality; with this tale of a young Rajasthani migrant who comes to Mumbai with his family in the hopes of a better life.\nThe plot is fast, doesn't let up and keep the audience engaged. The varying angles of morality, pride, innocence and the sense of being wronged color the movie in different hues. \nMust watch.","label":0},{"review":"Must Watch movie \nAmazing Experience\nThankgod I have watched this movie yesterday.\nbecause Of this movie I realised about the problem of poor people\nNow I have started planning to do some charity every month. Really this movie made me emotional.\n5/5 stars \nRajKumar was exceptional","label":0},{"review":"this movie is one of the best piece i have ever seen, what an emotion, what a story and the awesome music. I love all the songss of the movie. This movie has changed my point of view towards life.\nAwesome movie, must watch.","label":0},{"review":"Rajkumar rao and hansal Mehta together are like ice in wine 🍷.. I love this movie..u will feel pain of the character , emotion  , and love towards your soulmate, ...\nThe best movie I have watched\n9/10💝","label":0},{"review":"We cannot define anything in future , and we should not , because ultimately uptill now as time machine has not been made , we cannot playback any upcoming futuristic adventure , in any persons life ,and we as sons of defence personnel were taught to stand on our knees , and follow the temperament of life , we are not beggars , and we are not here to act in support of deceit , and follow treachery , so its better if people stop doing it in any persons life . \noour knees ,rather","label":0},{"review":"Amazing movie with amazing story. Urban life with aspirations when merges with simplicity of rural life -- a contrast and conflict in values is well narrated :)","label":0},{"review":"Nice story with fabulous acting by casts, story about how people goes on with lots of revolution in his life, facing problems, when they migrate from rural side to urban..","label":0},{"review":"This movie has given a great boost in Rajkumar Raos career. He is now considered as veteran actor and all his movie goes super hit.","label":0},{"review":"the movie is average but I loved the climax how he helps his family. The rajasthani accent of rajkumar rao was fantastic.","label":0},{"review":"Masterpiece by harshal mehta,, watching this in 2018.. now i got why rajkumar rao is rajakumar rao.. actress too did great work gems of bollywood,, hukum was also great..","label":0},{"review":"hello am from Africa and i love indian movies, can anyone kindly recommend to me nice movies such as, Right Yaaa Wrong (2010),Intelligent Khiladi (Goodachari 2019),Shivaay (2016),Drishyam (2015).","label":0},{"review":"It is the best movie i have ever seen.  i have watched atleast 50 film in which its bthe best","label":0},{"review":"A Great acting by Rajkumar Rao. A nice movie, look at the struggle of a man and his family to a new place and how he cheated from society.","label":0},{"review":"I wud recommend this movie bcoz it portrays a near perfect and harsh reality of metro cities and the challenges the cities throw to survive in it.","label":0},{"review":"A Heart-Touching Movie. I could Easily Relate it to My Own Real Life Struggle. Beautifully Scripted & InActed.","label":0},{"review":"Great Movie. [1.1 GB] use reverse text : /eivom-4102-sthgilytic-bg-1-1/seivom-yt/moc.tcilfnocsss//:sptth\n\nReverse any Text : spellbackwards(dot)com","label":0},{"review":"What a superb acting by raj kumar rav .\nNow he is my favourite actor","label":0},{"review":"Very rarely I cry when I watch a movie but this movie made me cry at numerous points especially at the end. Definitely watch.","label":0},{"review":"Good movie. Rajkumar s acting is superb. Must watch movie for subcontinent guys.","label":0},{"review":"What a movie... Most recommended.. everybody should watch this movie. Rajkumar Rao I am your biggest fan....","label":0},{"review":"The movie is very good for a good thinker person. Who ever watch it.. He is a mindful.","label":0},{"review":"love this movie :)    \n\n\n\n\n\nThanks Dipti to suggest me this movie...\nthis movie changed my way of living.........","label":0}]