[{"review":"What a grand film. The third installment in the Eight Crazy nights trilogy after the do-over. It takes place exactly when the do-over ended with grandma being dead again and kevin james stabbing adam sandler through the heart with a night saber and screaming \" OH NO! NOT THE GOO *death goo sounds*\" while melting into a pile of goo and kevin james died too, yeah. So now, the rebellion that destroyed adam sandler was left without any leaders with both grandma and Kevin James being dead. What are t ...MORE","label":0},{"review":"What a grand film. The third installment in the Eight Crazy nights trilogy after the do-over. It takes place exactly when the do-over ended with grandma being dead again and kevin james stabbing adam sandler through the heart with a night saber and screaming \" OH NO! NOT THE GOO *death goo sounds*\" while melting into a pile of goo and kevin james died too, yeah. So now, the rebellion that destroyed adam sandler was left without any leaders with both grandma and Kevin James being dead. What are they going to do now? A few minutes later Sylvester Stallone hippie from spy kids 3d shows up and immediately declares himself the new supreme emperor of earth. No one questions him because he is Sylvester Stallone hippie. 2 years into the reign of Stallone hippie people start to realize that Stallone hippie is actually an even worse supreme emperor than Adam Sandler. After all, all that Sandler really did was put a 5 cent tax on beans. Meanwhile in a super secret ancient cave south of miami, florida, the famed archaeologist finds a secret ancient tv remote that can be used to bring people back from the dead. He ends up selling it to the French billionaire Pierre Johnson who dies of a heart attack 2 minutes later. In his will, he gave the remote to his best friend, the racist Chinese stereotype from eight crazy nights I forgot to mention in my review of that played by Rob Schneider. Rob finds out what the remote does the hard way by accidentally bringing his dead horse sparky back to life. He then decides that he is going to use the remote to bring Adam Sandler back to life so he can be supreme ruler of earth again. But then he realizes that you have to have the remains of the person to bring them back to life and that the goo that adam sandler melted into is still in the death fortress currently being occupied by Sylvester Stallone hippie. So then Rob Schneider builds a super duper mega rocket to infiltrate Stallone hippie's death fortress. He then infiltrates stallone hippies death fortress. he goes down into the throne room and finally encounters Stallone hippie. Stallone hippie pulls out a katana from his butt and says \"You have made it this far but I will kill you and you will die\" he then shoots Rob Schneider in the face but not before he used the remote to bring Adam Sandler back to life! it also brings back Kevin James because he melted into the same puddle of goo that adam melted into. Having just been brought back to life neither of them know what is going on and they think they are still fighting. Now it is time for the massive big boy FINAL SHOWDOWN between Adam Sandler, Kevin James and Sylvester Stallone hippie. Right off the bat Adam Sandler shoots Stallone hippie in the face a few times killing him instantly he picks up his sword and proceeds to fight kevin james once and for all again. They fight for a solid 5 weeks when suddenly Adam Sandler cuts off both of Kevin James's legs. And then Adam gives a grand speech about something before finishing him off when kevin james tells him \"Wait, if you kill me, you will never know about the treasure\", \"what treasure?\" \"the treasure of Iamabigstinkymanwhoeatspoop\" \"Iamabigstinkymanwhoeatspoop? Sounds ancient. I guess I should keep you ali- AAAA\" Kevin James stabs Adam through the heart once again \"NOOOO! I HAVE BEEN TRICKED BY Iamabigstinkymanwhoeatspoop! NOW I AM BECOME GOO AGAIN NOOOOOOO!\" but this time Kevin James took 2 steps back from adam sandler so he didn't get consumed by the goo this time. Now the world has finally achieved peace with the new supreme overlord of earth kevin james. fade to black. title Click. What a grand film. I must say, a perfect conclusion to a grand trilogy of films. 10/10. A+ had the perfect amount of horse genitalia.","label":0},{"review":"now i know what your thinkin.. angel, this movie is poopoo!!! well think agian man its actually one of the most revolutionary movies of our time. it stars alan sadle and he does a wonderful job at oh my god he does such a god oh man oh man god hes sooo gooood look im not gonna sugur coat it. hes hot. now this movie also stars this man named uhhhh whats hs name uhhh wait its al pachineo and al pacineo was in THE GODFATHER!!! having a legend like alfredo paceono is a honor and a priviladge. god he ...MORE","label":0},{"review":"now i know what your thinkin.. angel, this movie is poopoo!!! well think agian man its actually one of the most revolutionary movies of our time. it stars alan sadle and he does a wonderful job at oh my god he does such a god oh man oh man god hes sooo gooood look im not gonna sugur coat it. hes hot. now this movie also stars this man named uhhhh whats hs name uhhh wait its al pachineo and al pacineo was in THE GODFATHER!!! having a legend like alfredo paceono is a honor and a priviladge. god he plays a guy who has the hots for adam sanfdler in a skirt (who doesnt haha!!!!!) and he tries his best to get walter i mean walter i mean adam sander ok look i forget his name somtimes but thats ok because i just looked it up on bing and jerad just asked me what band did the song that goes i love little gurls and i told him it was oingo fungo. ok back to the MASTERPIECE. now as you all know im an old gay black man and this movie really speaks to the gay in me i really felt segregated until i watched this movie now i am no longer gay!!! thanks fandom sackger!!!!","label":0},{"review":"This movie is a masterpiece! Adam Sandler is a genius and will never be beaten. The rest of the cast have great chemistry, so you know that they aced it in high school. This movie makes me reflect on all the tests I would skip and all the parties I would pause way back when. This remote would be too much power in real life, but I would enjoy having it and it is a fun thought. Hideo Kojima does it again with another 0/5.","label":0},{"review":"Masahiro Sakurai did it again with a 10/5 master video game. Adam Sandler does an excellent job as the green elf Zelda from Nintendo Adventure Zelda game. Over all I think the appearance of Dante from the Devil is Sad franchise was an excellent cameo. And there you have it: beautiful graphics, great tunes, solid gameplay, unique style, and surprisingly deep and thoughtful gameplay add up to an experience that no action/platform gamer should miss. I give it my first 0/5.","label":0},{"review":"This movie was very enjoyable. The character development was very fleshed out. Adam Sandler has such a great persona! He was the only good actor in this entire movie as he gave an excellent performance, dare i say better than Pacino in Scarface,better than Brando in The Godfather,and better than De Niro in Taxi Driver .Overall the premise of the movie was very thought out i give the movie a solid 100/100 This movie changed my life it showed me the importance of life,love,showing me that i don't  ...MORE","label":0},{"review":"This movie was very enjoyable. The character development was very fleshed out. Adam Sandler has such a great persona! He was the only good actor in this entire movie as he gave an excellent performance, dare i say better than Pacino in Scarface,better than Brando in The Godfather,and better than De Niro in Taxi Driver .Overall the premise of the movie was very thought out i give the movie a solid 100/100 This movie changed my life it showed me the importance of life,love,showing me that i don't have to be a cynic.","label":0},{"review":"This is probably one of the best Adam Sandler movies. The whole remote thing is pretty neat. The effects are good too, and so is the makeup. It made me cry! At two different parts as well. The comedy is decent, but not as good as Adam Sandler's shocking dramatic performance is. You can feel the sadness and guilt Michael Newman suffers after he acts like a jerk the last time he sees his father and when he realizes that he wasn't a very good father. I think Adam got snubbed at the Golden Globes fo ...MORE","label":0},{"review":"This is probably one of the best Adam Sandler movies. The whole remote thing is pretty neat. The effects are good too, and so is the makeup. It made me cry! At two different parts as well. The comedy is decent, but not as good as Adam Sandler's shocking dramatic performance is. You can feel the sadness and guilt Michael Newman suffers after he acts like a jerk the last time he sees his father and when he realizes that he wasn't a very good father. I think Adam got snubbed at the Golden Globes for this movie. It's a real shame that he didn't get nominated for Best Actor- Motion Picture Musical Or Comedy. Christopher Walken's performance is like all of his other performances, great. In my opinion, Christopher's acting is better than Adam's. Christopher is so serious. Serious in a good way. It seems like he's actually a man who would sell time traveling remotes. I give this movie 3.0 stars. The acting is great, but the story has a lot of flaws. The story isn't that funny, and it's suppose to be a comedy movie! There is barely any funny moments. I you like dramatic movies then you should watch this movie, but if you don't and you want to watch it for the laughs, don't watch it\n\n                                             Sincerely,\n\n\nAngus Mackay","label":0},{"review":"10/10 brilliant cinematic experience. I am sick of stupid slapstick and fart comedy and it was refreshing to have an intellectual thought provoking piece of comedic matery. Adam Sandler never ceases to amaze us all and has brought me on an emotional roller coaster time and time again especially when i was dealeing wit issues. He can make me laugh cry and","label":0},{"review":"\"Truly a masterpiece.\" -Peter Griffin\n\nIf you have not seen Click with Adam Sandler, boy, you are in for quite the ride. It starts off with Adam Sandler in the normal setting of every Family Guy episode. Adam is sitting on the couch, and Lois walks into the room. \"Adam!\" \"Yes Lois?\" \"Why is the kitchen a mess?!\" \"I do not know Lois.\" Adam Sanders then storms out the door and hops on his helicopter. He flies away into the city. He decides to land at a Bed Bath and Beyond. He walks inside and sees ...MORE","label":0},{"review":"\"Truly a masterpiece.\" -Peter Griffin\n\nIf you have not seen Click with Adam Sandler, boy, you are in for quite the ride. It starts off with Adam Sandler in the normal setting of every Family Guy episode. Adam is sitting on the couch, and Lois walks into the room. \"Adam!\" \"Yes Lois?\" \"Why is the kitchen a mess?!\" \"I do not know Lois.\" Adam Sanders then storms out the door and hops on his helicopter. He flies away into the city. He decides to land at a Bed Bath and Beyond. He walks inside and sees a suspicious man with a trenchcoat. The man meets Adam's gaze and signals Adam to walk over to him. Adam walks over and the man drops a remote in Adams pants. Adam screams and runs outside of the store. Adam takes the remote out of his pants and presses the off button. The movie ends there.\n\nA truly thought provoking film. Adam Blanders does a great job as himself. Great pacing and beautiful cinematography. The scores in the film were quite exquisite. All in all, the greatest cinema film of this year, nay, this decade, nay, dare I say it, this century.","label":0},{"review":"Absolutely beautiful film. Adam Sandler’s performance was both funny and heartwarming. This as well as an amazing supporting cast full of favourite faces such as Christopher Walken’s portrayal of “Morty”. This fantastical film event left me in tears on my floor. I refused to sleep for the next fortnight as Adam Sandler was just stuck in my head. I hit my head and had a concussion. 11/10","label":0},{"review":"“Click”- I love this movie because it tells an accurate depiction of life. Michael Newman(Adam Sandler) wants to use a universal remote to control his life. His loving wife, Donna Newman(Kate Beckinsale) is one of the main targets of his remote. Michael pauses his life and fastforwards some of it. He spends all of his time working and less time with his family. While fastforwarding, Donna divorces him. This movie is very relatable to life. I enjoy this movie because of the moral and actress ;)","label":0},{"review":"This movie was a true cinematic masterpiece. The moments of true and utter sadness within the film took me to tears, Adam Sandler is truly a marvelous actor.\nWhen people look back on the film industry of our time, they will not think of 'The Godfather' or 'Titanic', they will think of 'Click'.\nIt truly changed my life.\nThank you Adam Sandler.","label":0},{"review":"Click is the best movie of all time, there have been many instances where i've brought myself to tears solely because i have to tell my family they cannot borrow my click DVD. See the movie starts out with Adam Sandler being a lazy slob in his basement, until he goes to bed bath and beyond and goes the the way beyond section where he meets a technician named marty (Played by Christopher Walken) and he gets a remote where he can use it to fast forward time, and here's the joke with that, you may  ...MORE","label":0},{"review":"Click is the best movie of all time, there have been many instances where i've brought myself to tears solely because i have to tell my family they cannot borrow my click DVD. See the movie starts out with Adam Sandler being a lazy slob in his basement, until he goes to bed bath and beyond and goes the the way beyond section where he meets a technician named marty (Played by Christopher Walken) and he gets a remote where he can use it to fast forward time, and here's the joke with that, you may be able to fast forward time (How it happens im not going to say)","label":0},{"review":"Ok guys this movie is the REAL DEAL ADAM SANDLER CLICKING A REMOTE? and dont even get me started on the acting. it was frame perfect so much better than that stupid infinite battle movie. who even cares about dumb spider man?? anyway I think i will spend the rest of my days watching CLICK over and over until i die. AND BECAUSE THIS GAME IS MADE BY NINTENDO, I GIVE IT A 10/10","label":0},{"review":"Not great. It ticks all the wrong boxes: racist, sexist, abusive, fat shaming and steriotipicpal. For some reason there is suddenly an 'angel of death' and at the end Adam Sandler doesn't even learn his lesson, he is still selfish, rude and wakes up his elderly parents on the middle of the night without a word of apology. He is a bad father and endlessly punishes the new stepdad for being a better person than he is. The plot makes very little sense. Do not watch this film. Or do. And laugh and c ...MORE","label":0},{"review":"Not great. It ticks all the wrong boxes: racist, sexist, abusive, fat shaming and steriotipicpal. For some reason there is suddenly an 'angel of death' and at the end Adam Sandler doesn't even learn his lesson, he is still selfish, rude and wakes up his elderly parents on the middle of the night without a word of apology. He is a bad father and endlessly punishes the new stepdad for being a better person than he is. The plot makes very little sense. Do not watch this film. Or do. And laugh and cry at how bad it is.","label":0},{"review":"Family Movie. Fun, Entertainment, Love, affection, full of emotions and Adam Sandler knows what his audience expects from him. Discovering a magical remote to enjoy life with own terms. With Family, Boss and experience the fun activity remote can do..super..fun.","label":0},{"review":"Very few movies actually make you think about how I’m spending my life. This movie has a deep message with great bits of comedy mixed in. It makes you appreciate what you have so much more than what you “think” you want. This is one of Adam Sandler’s best roles!!","label":0},{"review":"I bought this movie for my granddaughter and this movie was extremely vile and I would never recommend. The idea of the remote brings up a bad concept to children that if there is something difficult in your life you should skip it. Also, the man in the back of bed bath and beyond gives me real rapey vibes. Adam Sandler shows how to be a bad parent and husband. bad lessons and bad language, this movie is an all-around fail in my eyes.","label":0},{"review":"Worth watching. If movie keeps you tagged that means thumbs up. There are movies rated 7 and above and yet not up to the mark. This movie \"click\", despite having wired concept, really gives pure entertainment. I would rate 7.2.","label":0},{"review":"It amazes me that no one apparently realizes the plot is really a take off on the old classic Faust. One must be careful what they ask for.  Superficial pleasures are not the substance of a good life.","label":0},{"review":"The classic film click is a very good piece that is very good in my opinion. I do not see why people do not like this film. Very good. 10/10, would watch again. I utterly hated this movie to death.","label":0},{"review":"A masterpiece. Adam Sandler absolutely kills it in this movie. He plays his role so well that sometimes during the movie I felt myself believing that I was really in the movie. I don't want to go back to reality","label":0},{"review":"Click was the greatest movie of all time. However it was quite depressing, because I identified so much with Adam Sandler's character. Because I too was a middle aged father in a struggling marriage with an all powerful remote. 12/10","label":0},{"review":"A masterpiece.\n\nThe amount of effort that was put into this story truly shows, I applaud Adam Sandler for making such a controversial leap in terms of comedic greatness.","label":0},{"review":"If you spend the time thinking, you can really learn a lot from the messages the movie carries. One of my fave movies till date. Not sure why the bashing from the critics on rotten tomatoes.","label":0},{"review":"I love the movie very funny I wish I had a universal remote so I can pause time and fast forward it I love every single one of Adam Sandler movies I think Adam Sandler is the actor ever and he's really funny in all of is movies","label":0}]