[{"review":"Feel so nice and positive after seeing this movie. This movie teaches you :Everyone in this world has some underlying issue which can't be resolved but we humans should not let that rule and dominate our life. Look around your surroundings and learn to live.  Be positive and calm and make it contagious","label":0},{"review":"Excellent  movie. All the characters are having their own tragedy but still they enjoy a lot. It's a motivational and inspirational film. All senior citizens  must see it.","label":0},{"review":"Awesome.... Kudos to the director for chosing such a subject with excellent star cast, dialogues and script... a must watch... we should have more of such movies... this is what is called world class cinema","label":0},{"review":"Superb....gud piece of work in our Indian cinema...heart touching...very true...very realistic... motivating...worth a watch....gives a lesson in such a light way u can't ignore...death is sure ...unsure is life..live it fully in ur own way...","label":0},{"review":"One of the movie which leave you with a thought for life, Though still some 30 years to enter Club 60 but still a  movie with a thought.\nAwesome Movie\nAwesome Picturization\nAwesome Conceptulisation\n60/60 for CLUB-60","label":0},{"review":"One of the greatest emotional movies.  Gorgeous direction and acting by great artists \nA must watch for anyone who wants to LIVE LIFE","label":0},{"review":"Yes, I just watched very inspiring and full of energy. There is nothing for future. Just be happy and make other happy. We are not permanent here.","label":0},{"review":"Really I feel we must open a place like this as a club 60.I'm really impressed n always luv to watch this movie wenever it comes on any channel","label":0},{"review":"Great movie , so inspiring , full of joy and lots of message and thoughts . \nEach and every characters were awesome , \nAnd mannu Bhai killed by his role.","label":0},{"review":"Saw the film first time on the inauguration of Day Center ,Shehjaar Homes,Haridwar today.\nFilm is very purposefully educative, how to be positive and how to come out of the grief and live life realistically.","label":0},{"review":"An awesome movie showcasing the life from different walks of life!! It give us the essence that whatever happens in the life, to the life, Life goes on 👍","label":0},{"review":"What a fantastic movie. Story editing , dialogue, songs music and all actors and actresses play thi er role well. Well craftre movie. I like too much.","label":0},{"review":"Great movie It will inspire many unhappy people to look at their misfortune differently Star Select is doing a great job by showing these unsung but quality movies","label":0},{"review":"Wish such subjects are encouraged and treated as main stream cinema .. Totally loved the cinema, star cast , fantastic  ..These artists are just wonderful.","label":0},{"review":"It's an xclnt movie.. So fulfilling lesson it conveys.. Thanks to the makers... Live life to the fullest till the last..","label":0},{"review":"Superb  movie. All the characters are having their own tragedy but still they enjoy a lot.","label":0},{"review":"Manubhai plays awesome funny role, all character plays very good role. Fantastic Movie, seeing after long time.","label":0},{"review":"Wonderful movie only acting skills and great story! \nThat's kind of cinema public should be fan of","label":0},{"review":"Must see. It may have its flaws but they are inconsequential. Watch this film. Ponder about life. Smile. Smile wider. Go, live.","label":0},{"review":"Its wonderfull movie. Inspires us to love your life in any circumstances","label":0},{"review":"Very good movie. 100 marks to the director & actors.. must watch by senior citizens & their children.","label":0},{"review":"Too good movie. Really adds positivity in one self. Message nicely crafted and conveyed.","label":0},{"review":"Having been sick of watching violence in movies, this movie was a welcome change...with excellent acting by the senior artists, a good story line and a tight screen play.","label":0},{"review":"It's a must watch movie for everyone, all characters were well portrayed especially Farooq, Raghuveer Yadav, Teenu Anand & Sarika","label":0},{"review":"One of those few movies which will make us rethink our way of looking at things.....and llife every moment if life.\n\nmust watch.","label":0}]