[{"review":"I just love this film. Deepika's acting is just great. Though this is a romantic movie I think it is more about friendship. No matter whatever happens we would want to spoil our friendship and this movie shows that. The only problem i think is that there is more chemistry between Deepika and Saif than Diana and Saif. But I will tell you that it is a must watch. It makes you cry and laugh. I also love the main characters in this movie as we can relate with them.","label":0},{"review":"Totally under rated! This movie deserves a 7.2 rating AT LEAST.  The story is different from the usual Bollywood masala, it's realistic and done very well. The characters are very relate-able and have made the movie very lively and entertaining. What I loved the most is how the plot of the movie revolves around a concept that's so common in our lives. It's definite that we will or have come across SOMEONE like Veronica, Gautam or Meera. Also reflects the hypocritical society that we live in. I g ...MORE","label":0},{"review":"Totally under rated! This movie deserves a 7.2 rating AT LEAST.  The story is different from the usual Bollywood masala, it's realistic and done very well. The characters are very relate-able and have made the movie very lively and entertaining. What I loved the most is how the plot of the movie revolves around a concept that's so common in our lives. It's definite that we will or have come across SOMEONE like Veronica, Gautam or Meera. Also reflects the hypocritical society that we live in. I give it a big THUMBS UP!!","label":0},{"review":"The film is above average, acts were given out very strongly. Every songs depicted every situation in the scenes very well. Yaariyan specially is a song that blew every ears and hearts ♥️. Absolutely nice compose and mohan rao too give their performances like cotton clothes to give gems more brighter.","label":0},{"review":"(spoiler) It's actually very underrated. I feel very bad for Veronica. We all know what it's like to be lonely and left for a characteristic of ours. This movie exploits that. Though it doesn't show it directly. The feelings put on by Deepika! No wonder she's one of the best actors in India. She deserves it. This one is for her.","label":0},{"review":"This film is about our mind,our thoughts about love which is very very complicated. But the film is nothing but a stress remover. Very entertaining. Characters are also strong. It celebrates friendship. I love it and recommend to watch the film who are suffering from boredom.😋","label":0},{"review":"Things that I used think as stupid are now making sense watched this movie today and and thought its really awesome. Story is just fantastic imtiaz ali nailed it.","label":0},{"review":"frankly speaking this movie was about making choice between your crush and her best friend. when you fall in love with the one and other becomes jealous you never know....","label":0},{"review":"Jis Movie me imtiaz ali ka touch ho wo movie khrab ho hi nahi sakti. Underrated movie. Movie is awesome specially songs are amazing loved it.","label":0},{"review":"Having the affection and dare fore love is dedicated in through the film, which brings out the quality for a triangular  love story and gives the route path way for living ❤","label":0},{"review":"Recently watched cocktail movie..........Must watch movie....This movie shows the relationship between True Love & affection.....Lovely Story written by Imtiaz Ali......One of the fine & soulful director Imtiaz Ali..........","label":0},{"review":"This movie was about our psychological thoughts that how we think how we react how we talk with other people etc. Nice movie. So so avareg movie.","label":0},{"review":"Although Saifeena is my favorite actor... This is movie is great... With beautiful love story","label":0},{"review":"Complicated love triangle ...... an average plot which misses out on a good theme which pits friendship against love. Acting good from Saif and Deepika ....","label":0},{"review":"I like this movie 🎥 very much \nThis is best movie.\nSongs are best of this movie","label":0},{"review":"Loved it. imtiaz ali is a genius to write this kinda stuff","label":0},{"review":"loving movie 2019 Diana penty is very much lovable person than ever just loved","label":0},{"review":"Grt movie\nI jst love wth this story n real stort of mine","label":0},{"review":"As a south indian i feel this movie is something different and out of the box🔥💯","label":0},{"review":"DEEPIKA IS MY FAVORITE HEROINE. I LOVE HER HOTNESS AND WORK","label":0},{"review":"Yes it was a difference kind of love story but awesome creation","label":0},{"review":"loved it. Great story line","label":0},{"review":"Good movie show the difference  between real lv nd attraction","label":0},{"review":"Very good movie worth and must watch atleast once worth giving 10/10","label":0},{"review":"Acting is amazing and three of them are fantastic","label":0},{"review":"It was great and a brilliant movie 👍👌","label":0}]