[{"review":"Guys don't waste ur time. I seen so many good and bad reviews but the person who wrote good review bz they may like the songs or just a animation seens. I don't kw why Bipasha accepted this movie. There is no story line and on that Mohabbat barsa song there we can see so many love seens but in movie there is no love like that song and best song added after climax with out any sink with movie. And animation seen is good . \nClimax is pathetic.","label":0},{"review":"Creature 3D is so difficult to resist even once also. Bipasha Basu is a big brand actress don't know why she signed for this type of movie.. Director Vikram Bhatt took every thing as granted so he thought he would pour anything in the glass and we audience would drink anything without any objections...!! \nVikram Bhatt's Raaz 3 is far better than this at least the ghost like creature there is capable of scaring few audiences. \nIf anyone wants to watch this peculiar creature then be ready for seri ...MORE","label":0},{"review":"Creature 3D is so difficult to resist even once also. Bipasha Basu is a big brand actress don't know why she signed for this type of movie.. Director Vikram Bhatt took every thing as granted so he thought he would pour anything in the glass and we audience would drink anything without any objections...!! \nVikram Bhatt's Raaz 3 is far better than this at least the ghost like creature there is capable of scaring few audiences. \nIf anyone wants to watch this peculiar creature then be ready for serious headache.....","label":0},{"review":"The creature was immensely funny, laughable and not eerie at all. The roars and growls it made just had me rolling on the floor. Poor CGI and the confrontation scenes at the end were straight from the Jurassic Park first movie especially the kitchen scene. The only redeeming factor was the one song 'Mohabbat Barsa Dena'. The male lead is just another pretty face and at least loved the female character taking the lead in killing the demon rather than always playing the damsel in distress was some ...MORE","label":0},{"review":"The creature was immensely funny, laughable and not eerie at all. The roars and growls it made just had me rolling on the floor. Poor CGI and the confrontation scenes at the end were straight from the Jurassic Park first movie especially the kitchen scene. The only redeeming factor was the one song 'Mohabbat Barsa Dena'. The male lead is just another pretty face and at least loved the female character taking the lead in killing the demon rather than always playing the damsel in distress was somewhat fresh. Horror movie buffs u will regret watching this.","label":0},{"review":"This movie was superb vikram bhatt sir doing such a great job keep it up but I don't know why all people are saying the cgi model of creature is funny \nBut my review this movie was awesome \nAnd cgi model look like the mummy movie","label":0},{"review":"Must  watch  for all... I just love this movie... Super  scary... Songs are too good... Vikram Bhatt luv u sir.... All the best for 1921...😇","label":0},{"review":"I like this movie very much and also happy to see ahana and Karan as a love couple they looking nice together","label":0},{"review":"It is somewhat an adaptation of the, creature 2011 movie but both of 'em earned the same respect being a flop one... But the acting of, Bipasha basu in hindi and Sid Haig in english was good.","label":0},{"review":"According to Generation both movie creature 3d and Raj  are right. But in dehat high caste man running towards athiest at the name of God only showing going worshiing temple  for vote and government are making India demoralising.","label":0},{"review":"I just love this... I watch it every time it comes on tv....fantastic movie on creature in indian television","label":0},{"review":"Worst do not watch it the shout of the creature easily detected that it's made up it's sound not so real and Bipasha does she always uses medicine in every movie ha ha so cliche","label":0},{"review":"Very Best movie forever Vikram Bhatt dared to make this type of movie ..very nice movie Best horror movie forever ..Greatful & many many thanks Vikram Sir","label":0},{"review":"Very good movie must watch all graphics are awesome i always watch this movie all thanks to vikram sir","label":0},{"review":"Creature 3D is a 2014 movie starring by bipasha basu and Imranabbas and it is a very good movie","label":0},{"review":"Awesome movie , i appreciate creaters work , actors to director has done good work , We should appreciate their work....","label":0},{"review":"Dis muvie iz a mustt watch fur everyones.......itz 2 gud. Bips iz luking to cutie in dis......duh boy iz also vary butiful.","label":0},{"review":"I love this movie really.This is one of my favourite movies.","label":0},{"review":"I love this movie, really. Amazing","label":0},{"review":"Waste of time ..the creature looks so funny.I see here people asaying the movie is good.I dont know what is good in the movie ....","label":0},{"review":"I like this movie it is the best horror and amazing movie.","label":0},{"review":"It is the best horror movie (creature) \n for me.","label":0},{"review":"it is a realy a horror flim and first time i felt that the creature is in my house","label":0},{"review":"Songs are much better than the film.especially sawan😌","label":0},{"review":"Good movie and music also","label":0},{"review":"Horrid but  I don't scared by this movie monster  but monster look was scary","label":0},{"review":"I love this movie\nWow","label":0}]