[{"review":"Dabangg 3\n\nSuper cop Chulbul Pandey in a small town in UP ( Tundla ) is shown living happily with his family. Now from here the story goes back to his past, his romance with Khushi ( Saiee Manjrekar )\n\nThe film tries to add comedy in this particular plot which is not done well. Salman here at times looks like his character of Tubelight☹\nDimple Kapadia is pathetic in that goods carrier train scene😧\nSaiee Manjrekar adding the love angle looks innocent and simple👍🏻😇\n\nAt this point I just happen ...MORE","label":0},{"review":"Dabangg 3\n\nSuper cop Chulbul Pandey in a small town in UP ( Tundla ) is shown living happily with his family. Now from here the story goes back to his past, his romance with Khushi ( Saiee Manjrekar )\n\nThe film tries to add comedy in this particular plot which is not done well. Salman here at times looks like his character of Tubelight☹\nDimple Kapadia is pathetic in that goods carrier train scene😧\nSaiee Manjrekar adding the love angle looks innocent and simple👍🏻😇\n\nAt this point I just happened to yell inside my mind🧐\n\" Prabhudheva Sir.....I am not here to see Hum Saath Saath Hai episode 2.....show me something like your Wanted or Rowdy Rathore\"💪🏻😅\n\nIt seemed my request worked, and there entered the south star, in here as a baddy, Kichcha Sudheepa ( Makkhi wala villain )😈\nProbably the only saving grace of the movie..👏🏻👏🏻...he is awesome\nIf you cannot recollect Makkhi, then remember Bahubali 1, he played a small role of weapons merchant, fighting with Kattappa\n\nForget Wanted, unfortunately Prabhudheva could not make the film, okay enough as R...R...Rajkumar also😒\nHis Action Jackson was also bad, but atleast there Ajay Devgn's fight scenes were well choreographed, here Salman's fight scenes seems repetitive. Even the swags and swinging of the hips looks tiring\n\nDabangg 1 made Chulbul Pandey a brand sort of a cool guy😎🤩. His popularity amongst the mass audience of Northern region also increased, but now almost ten years down, this 3rd installment has no novelty in it and seems worn out\n\nDebutant Sonakshi Sinha in Dabangg 1, doesn't have much screen time here, no catchy dialogues for her, like that famous\n\"Thappad se darr nahin lagta saab, pyar se lagta hai\"......but still adds some fire with whatever role she has👍🏻\n\nNew version of Munni badnaam minus Malaika, fails to lit up the screen\n\nSalman bhai......your career's 2nd innings post Wanted ( 2009 ) is really great, barring some bad films.......sadly this is one of them\nMy advice is\n1. Race films franchise is originally owned by Saif Ali Khan, better give it back to him. 1st and 2nd were amazing\n2. Put the Dabangg series to rest forever\n3. Don't even think of Bodyguard part 2\n4. Tiger series both movies were awesome.......go for the 3rd kill\n\nGuys.....let this movie pass away, do not bother\n\n#salmankhan","label":0},{"review":"Dabangg 3 review :\n\nSalman Khan is back to wish us Merry Christmas. Usually reserving an Eid release for his films, he decides to give his fans an early Eidi this time. Enjoying superstar status like no other today, Khan ticks off all the boxes in the checklist of what his fans typically desire from him. \n\nA hero wali entry- tick\nSlow motion action - double tick\nCheesy one liners - tick tick tick\nOne item gaana - tick\nShirtless scene - tick tick. (Even his pants drop in this one). \nA formidable  ...MORE","label":0},{"review":"Dabangg 3 review :\n\nSalman Khan is back to wish us Merry Christmas. Usually reserving an Eid release for his films, he decides to give his fans an early Eidi this time. Enjoying superstar status like no other today, Khan ticks off all the boxes in the checklist of what his fans typically desire from him. \n\nA hero wali entry- tick\nSlow motion action - double tick\nCheesy one liners - tick tick tick\nOne item gaana - tick\nShirtless scene - tick tick. (Even his pants drop in this one). \nA formidable villain - tick \n\nIn short, Dabangg 3 has everything crammed in its two hour fifty minutes run time just to please the lowest common denominator which comprises Salman's loyal fan club.\n\nWhat the film doesn't have is a story, sense and sensibility. Now now, dont take me to be an elite prude or a Bhai hater! I aint. Infact, I personally liked his Dabangg 1 (2010) and few recent blockbusters like Bajrangi Bhaijaan (2015) and Sultan (2016). I genuinely tried hard to enjoy Dabangg 3 as well but failed. \n\nThe first half is pathetic where nothing - absolutely nothing - happens. The family shamily drama is a yawn and Chulbul Pandey's (Salman obviously) backstory with his young sweetheart Khushi (Saiee Manjrekar) is unexciting, to put it mildly. That debutant Saiee looks like Salman's beti in the romantic scenes makes matter worse. ..\n\nNext, the main villain Bali Singh (Kichcha Sudeepa) enters the frame, falls for Chulbul's girl and begins his full on rivalry with Pandeyji. \n\nOn the films only positive, Kannada Superstar Kichcha Sudeepa plays a truly effective antagonist and actually steals the thunder from Salman bhai in most of the scenes he appears in. Brilliant! \n\nSaiee Manjrekar looks pretty but gets too small a role to prove her acting chops. Sonakshi Sinha, reprising her role of Rajjo, is strictly okay. Pramod Khanna fills in for his late brother Vinod Khanna's Prajapati Pandey role. One misses the original Munni Malaika Arora's sexy thumkas in the 'Munna Badnaam hua' item number. \n\nOn the tech front, editing by Ritesh Soni is below par. Prabhu Deva's direction is even worse. More woe, the songs are not a patch on the previous two installments and they keep popping up every ten fifteen minutes to slow down the already sluggish narrative. The action finale is stretched beyond a point of endurance. \n\nFinally, Dabangg 3 seems to be a hurriedly made and haphazardly assembled product which adds no value to the franchise. \n\nSince a decade or two, Salman Khan has been repeating himself in film after film. Nevertheless, he has achieved remarkable success churning the same outdated content to his star struck fans. The question remains, For how long??!!!!\n\nRegards\nSumeet Nadkarni","label":0},{"review":"This is a really full masala movie..\nAs a Salman fan, it is a really good film...\nWho is not a Salman fan, you can go and watch the movie for entertain yourself and refresh your mind....\nIt has action, emotion, romance and full of entertainment..\nI am really happy..\nWho ever is saying it is not good or it's a weak story, I will not agree with you...\nThe story is awesome..\nThough it is a revenge family drama, which was seen in early 80's or 90's ,\nIt is a interesting story which connect the audie ...MORE","label":0},{"review":"This is a really full masala movie..\nAs a Salman fan, it is a really good film...\nWho is not a Salman fan, you can go and watch the movie for entertain yourself and refresh your mind....\nIt has action, emotion, romance and full of entertainment..\nI am really happy..\nWho ever is saying it is not good or it's a weak story, I will not agree with you...\nThe story is awesome..\nThough it is a revenge family drama, which was seen in early 80's or 90's ,\nIt is a interesting story which connect the audience to the earlier stories..\nI think Salman did a really good job..\nPrabhu sir direct the film for what you will feel south touch in the fighting scenes...\nAnd Saiee did a really good job..\nNow Bollywood industry get a new Actress..\nShe is brilliant in the movie..\nAnd Sonakshi is very familiar to this series..\nAnd, our superhero villain, Sudeep Kichcha,\nOutstanding performance by sudeep,\nHe is really a heroic villain I've ever seen....\nHis screen presence is outstanding...\nArbaaz Khan also did a very good job..\nAnd now last but not the least my Salman did a really really good job..\nMind blowing acting..\nHe is made for play the character Chulbul Pandey...\nHe looks exactly like what he is in real life..\nAnd if you're planning to watch this movie, I will say please, go and watch the movie with your family or friends..\nYou'll definitely enjoy the movie...\nSalman I really love you.❤❤❤❤...\n\nAnd loved your work in the film...\nGo and watch Dabangg 3...\nIt's an awesome movie...\nJust loved it..\n❤❤❤❤❤❤.....","label":0},{"review":"If you loved the prequels, Dabangg 3 is a treat! Chulbul Pandey gets an interesting origin story in the flashback, even though it gets stretched longer due to random placement of songs. The second half also has songs that could've been trimmed (except Munna song). Nevertheless, Salman steals the show with his spectacular action and comic timing. His performance in the interval sequence is outstanding. \n\nAfter two breakneck fights, the first half gets slow due to the flashback episode, while the  ...MORE","label":0},{"review":"If you loved the prequels, Dabangg 3 is a treat! Chulbul Pandey gets an interesting origin story in the flashback, even though it gets stretched longer due to random placement of songs. The second half also has songs that could've been trimmed (except Munna song). Nevertheless, Salman steals the show with his spectacular action and comic timing. His performance in the interval sequence is outstanding. \n\nAfter two breakneck fights, the first half gets slow due to the flashback episode, while the second one is brilliantly executed with explosive action and solid writing. \n\nThe action sequences are just outstanding and breathtaking. Each and every set piece is excellently handled. Technically, this film is a visual masterpiece. Cinematography is splendid. Music is also charming. There are a few very well-written twists as well. \n\nDabangg 3 is in short an entertaining action comedy that has the right mix of action, humor and emotion, despite some slow pacing and abrupt song placing in a few parts. For Salman/action genre fans, this is an unmissable blockbuster worth experiencing on the big screen.\n\n9/10.","label":0},{"review":"Ibhave a lot to say about the movie but first of all I want say in one line this is #SalmanKhanMovie . It has all the the elements for which I can say this is #entertainment I have been waiting for this salman khan since #tigerzindahai . This movie is far better than #dabangg2 it took seven long years to get #chulbulpandey back on screen but I have to say what a come back. There are many things I love about especially the one liner war #phrasesandidioms if you wanna talk about action one word #p ...MORE","label":0},{"review":"Ibhave a lot to say about the movie but first of all I want say in one line this is #SalmanKhanMovie . It has all the the elements for which I can say this is #entertainment I have been waiting for this salman khan since #tigerzindahai . This movie is far better than #dabangg2 it took seven long years to get #chulbulpandey back on screen but I have to say what a come back. There are many things I love about especially the one liner war #phrasesandidioms if you wanna talk about action one word #prabhudeva (the god) is the director so don't expect it is there and it is awesome #Dabangg3 is worth watching I don't want to put bloopers through well the story line was quite clear from the trailer that you will have forth back situation the movie will start in present then we have flashback and then present onece again but what a way to show that. The movie answered so many question like how chulbul gets the locket or the style of sunglasses and many more. How he become the police officer. What is impressive that in the last quater of bollywood that the bollywood is back on track where we can have great #villians I mean from #comando3 via #mardaani2 and now #dabangg3 what the villians we have #sudeepsir(kichasir) is exceptional in the movie what a great villian . the bond of brother duty of police family everything is here. Please go and watch the movie. I love that tha  movie also talk about #socialevils #rape #acidattack. Great work by the team . The movie gives you the correct meaning or #dabangg. I want to say more bit it will be bloopers so without any booleper I just want to say  that undoubtedly #salmankahn is the only actor whom people love to watch #shirtless I love the movie I am a fan I don't go for logic this is worth watching movie. My mom love this movie too she is a great #salmankhanfan. So yes the movie is great please watch.","label":0},{"review":"DABANGG 3 ..... promoting police wala gunda once again \nSalman is so confident about his stardom power and his recent box office records that he activated his father Salim Khan’s writing genes and written the story of this film. Lo bolo, after two hit Dabangg films he remembered why he became Dabangg for the first time? It’s typical Bollywood cum Tollywood revenge story with larger than life fight sequences meaning by one hero beating 15 to 20 villains and sometimes of his double size. It’s out  ...MORE","label":0},{"review":"DABANGG 3 ..... promoting police wala gunda once again \nSalman is so confident about his stardom power and his recent box office records that he activated his father Salim Khan’s writing genes and written the story of this film. Lo bolo, after two hit Dabangg films he remembered why he became Dabangg for the first time? It’s typical Bollywood cum Tollywood revenge story with larger than life fight sequences meaning by one hero beating 15 to 20 villains and sometimes of his double size. It’s out and out Salman’s film and as Chulbul Pande he continued his Ora with screen presence and his staccato speech in dialogue delivery. Songs are speed breakers in the film and comes every 15 minutes making film’s tempo slow.  Only “Munna badnam hua” song is visually delight and entertaining. Two heroines are like ‘aachar paapad’ in the film. Saiee Mahesh Manjrekar is good but very poor chemistry with Salman. She looks like Salman’s daughter or younger sister. Sonakshi has little to do in this film as Salman’s ct all wife Rajjo but their chemistry is okay. But best and impressive character is Baali Singh performed by southern superstar Sudeep ( hero of film “Makkhi”). It seems that there is vatki vehvar between Bollywood and Tollywood. Akshay Kumar and sunil Shetty becomes villain in Rajnikant’s film “2.0” and upcoming “Darbaar” and Tollywood superstars are becoming villains in Bollywood films. Sudeep looks like Javed Jaffrey but his body language and expressive eyes steals the show.  There are so many character artist like Arbaaz, dimple Kapadia, Mahesh Manjrekar, Prabhu deva, Warina Hussain as item girl are like side dishes.  Prabhu deva is director of the film but songs are averagely choreographed except ‘Munna badnam hua’. Like Shammi Kapoor, Salman has his personal in built choreography moves and only they can carry their dancing styles. \n2.5/5.  Salman fans in rest of India and Sudeep fans in southern belt will make it blockbuster.  Timepass entertaining film may soon come on amazon prime.","label":0},{"review":"Dabangg 3 Movie Review: Salman Khan packs in punches and blows in this masala entertainer\n\nThis is the third instalment of the 'Dabangg' franchise, and the audience is well-acquainted with the larger-than-life, lovable cop and his world. Chulbul (Salman) spends his average day romancing his wife Rajjo (Sonakshi), troubling his brother Makkhi (Arbaaz) and fighting and reforming goons. All is well, until he busts a prostitution racket and saves a bunch of girls, which angers the ringleader, the ri ...MORE","label":0},{"review":"Dabangg 3 Movie Review: Salman Khan packs in punches and blows in this masala entertainer\n\nThis is the third instalment of the 'Dabangg' franchise, and the audience is well-acquainted with the larger-than-life, lovable cop and his world. Chulbul (Salman) spends his average day romancing his wife Rajjo (Sonakshi), troubling his brother Makkhi (Arbaaz) and fighting and reforming goons. All is well, until he busts a prostitution racket and saves a bunch of girls, which angers the ringleader, the rich and powerful Balli (Sudeep). Cut to, Chulbul Pandey’s beginnings, a huge chunk of the first part of the film is about his younger days, his love interest – the beautiful and naive Khushi (Saiee) – and the circumstances that urged him to turn over a new leaf and become Robinhood Panday.\n\nThere are ample clap-worthy and seeti-maar moments in Prabhudeva’s 'Dabangg 3' for Salman Khan fans to lap up. Yes, he takes off his shirt, flaunts his well-toned, perfectly-greased body and beats up the goons to pulp. The action is raw and solid, however, some action scenes (like Chulbul's introductory sequence) are unreasonably stretched. While the story is clearly predictable, in this one again, Salman’s star power, swag and style remain intact. There is an attempt to infuse comedy in the story, but it seems rather forced. The storyline is not cohesive and the narrative is loosely strung together.\n\nSudeep is menacing as the baddie, who is out to make Chulbul’s life miserable. The South actor has a great screen presence, which makes the face-offs between Chulbul and him impactful and entertaining. Sonakshi was seen as Rajjo in the first two movies of the franchise, too, but in a film that’s primarily about a tussle between the good and the bad men, she doesn’t have much to do other than play the loving and doting wife. Saiee, who makes her debut as young Chulbul’s lady love, has a pleasant screen presence and is effective, but she could do with expressing more in the emotional scenes. Arbaaz plays his part well.\n\nThe film, with a runtime of 2 hours and 42 minutes, seems very long and could have done with a tighter edit. The narrative is also interrupted by a long line-up of songs, of which, the memorable ones are 'Munna Badnam Hua' and the title track.\n\nOverall, the film has all the ingredients required for a massy masala entertainer — good action, music, drama and, of course, Salman packing all of this in one story. The portions where the actor throws in comedy while doing hardcore action scenes are nicely done. 'Dabangg 3' shows Salman in his element – throwing deadly blows at the villains amidst all the smoke, dust and fire, while you can hear chants of Hudd Hudd Dabangg in the background. And those certainly will be paisa-vasool moments for Salman Khan's fans.","label":0},{"review":"Dabangg 3\nHeights Of Kuch Bhi 1 Star ⭐\nAFTER THIS INSTALLMENT DABANGG SHOULD BE OFFICIALLY MADE CARTOON SERIES LIKE CHOTA BHEEM ON POGO. There was absolutely nothing in the film it was a 2.45hrs of boredom with silly dialouges , over the top overacting,wierd to unacceptable laughter , extreme logicleess action , unnecessary slow motion scenes , poor songs which had no context at all and kept popping up randomly,there is nothing in the name of story or script,from the very start you know what the ...MORE","label":0},{"review":"Dabangg 3\nHeights Of Kuch Bhi 1 Star ⭐\nAFTER THIS INSTALLMENT DABANGG SHOULD BE OFFICIALLY MADE CARTOON SERIES LIKE CHOTA BHEEM ON POGO. There was absolutely nothing in the film it was a 2.45hrs of boredom with silly dialouges , over the top overacting,wierd to unacceptable laughter , extreme logicleess action , unnecessary slow motion scenes , poor songs which had no context at all and kept popping up randomly,there is nothing in the name of story or script,from the very start you know what the climax would be. Seemed like a cartoon more than a film . Overacting was at peaks , the film nor had mass appeal nor there was entertainment . A movie made with no soul, no ideology, no direction sense ,no screenplay all was just left on Bhaism . A movie to skip in the cinemas \n\nTHINGS TO LOOK OUT FOR\n\n>For Bhai Fans its only Bhai that would drive this souless film \n>One Dialouge at the climax about consent of a girl is the only sensible thing in the film\n\nNEGATIVES\n>Nothing new in the story its the same old wine in a new bottle. \n>Screenplay is hodge podge and random , things keep happening randomly for no reason and you would be shocked why its happening\n>Jokes and humour seem too much forced and not soo funny , even the pathetic new laughter introduced in this film is unbearable\n>Action Scenes are laughable and damn funny\n>Except Kichha Sudeep none have done justice to their role , it was all about overacting \n>Poor music and poor songs adds to more of let down \n>v bad editing the film seems so louzy when you know whats going to happen and it is dead predictable from start to its end\n>First Half was very boring and seemed there for no need of it at all\n>Dialouges seem like some cartoon dialouges \n>Cinematography was average nothing outstanding,excpet few locations which were good\n\nFINAL VERDICT\nYou will never regret missing this movie unless you are a bhai Fan . This movie is a 2.45 hrs repetitive film and the worst among its franchiese . After Dabangg3 this franchise needs to Rest In Peace","label":0},{"review":"DABANGG 3 IS 3 TIMES BANGER THEN OLDER SEQUELS!!!!!\n\nSalman khan is at his best.Just the way we wanted him to be.on the other hand sona(rajjo) and saiee(khushi)did justice to their role.but coming to KS,OMG the best villain he has played according to me.\n\nStory starts with the girl trafficking incident and makkhi is introduced ...then comes in the roar of whistles,Chulbul pandey!!!! then it carries through the first hour little bit slowly,before interval the movie comes out to be emotional,And s ...MORE","label":0},{"review":"DABANGG 3 IS 3 TIMES BANGER THEN OLDER SEQUELS!!!!!\n\nSalman khan is at his best.Just the way we wanted him to be.on the other hand sona(rajjo) and saiee(khushi)did justice to their role.but coming to KS,OMG the best villain he has played according to me.\n\nStory starts with the girl trafficking incident and makkhi is introduced ...then comes in the roar of whistles,Chulbul pandey!!!! then it carries through the first hour little bit slowly,before interval the movie comes out to be emotional,And saying that after interval is a bang...literally bang\nThe climax sequence wit slow mo moves is just wow moment.\nWhen Chulbul and Bali interact,its just treat to see both of them...above that ..munna badnaam song ..Just mindblowing\nDabangg 3 is out and out blockbuster wit salman's swag and hilarious comic timing...Will definitely go again tonight\n\nBhai's swag is no stopping and it will show on box office ...No dull moment\n\nBEST MASS ENTERTAINER OF THE YEAR....MUST WATCH!!!!DHAAKKAD!!!","label":0},{"review":"the script follows multiple of formulas used multiple times in many-a-films & mash them up into one. Interestingly, though Dabangg is all about the stout-heartedness of Salman Khan, he shines the most when he displays the vulnerable side of his story.\n\nThe flashback portions really help to connect with a certain innocence Salman carries with him.\n\nPrabhudheva owned this zone with Wanted but he’s kind of repeating himself with Dabangg 3. He still has some tricks left under his sleeves but it test ...MORE","label":0},{"review":"the script follows multiple of formulas used multiple times in many-a-films & mash them up into one. Interestingly, though Dabangg is all about the stout-heartedness of Salman Khan, he shines the most when he displays the vulnerable side of his story.\n\nThe flashback portions really help to connect with a certain innocence Salman carries with him.\n\nPrabhudheva owned this zone with Wanted but he’s kind of repeating himself with Dabangg 3. He still has some tricks left under his sleeves but it tests your patience. He portrays Salman Khan’s heroics in the most heroic way possible. It takes optimum advantage of slo-mo technology. It would’ve been 10-minutes shorter if you speed up the fighting sequences.\n\nA very enthusiastic pair of Sajid-Wajid kills the watching experience multiple times. They throw unnecessarily songs at you fracturing your thoughts about the film. Awara’s placement is good, Munna Badnaam Hua will work with its target audience. The rest of the songs serve no purpose whatsoever. Background score ranges from very good to pretty naive such as using the by-default stock YouTube sound-effects. Liked the usage of the modified Dabangg theme & the sound of ‘bad a**’ in between.\nAll said and done, Dabangg 3 is for every single of Salman Khan fan out there. It might stop intriguing you at places but carries Chulbul’s swag throughout. Sudeep is the bad-guy to look forward to.","label":0},{"review":"Dabangg 3 movie just awesome.. from the very first scene to end it entertain you , Action , comedy, emotions , looks villian , everything is exceptional .. i m not salman fan one i must say his performance in D3 is so powerful his acting in emotional scenes comedy and action he acted like boss ... Kicha is amazing give strong competition .songs are soo good all songs are tittle track , muna badnam , and Awara is is best among all .... Picturization on yu karke and naina is also very good ... Pre ...MORE","label":0},{"review":"Dabangg 3 movie just awesome.. from the very first scene to end it entertain you , Action , comedy, emotions , looks villian , everything is exceptional .. i m not salman fan one i must say his performance in D3 is so powerful his acting in emotional scenes comedy and action he acted like boss ... Kicha is amazing give strong competition .songs are soo good all songs are tittle track , muna badnam , and Awara is is best among all .... Picturization on yu karke and naina is also very good ... Pre interval scene and climax is bomb .the fight scene between chulbul nd gundas who come his house at night soo well made.. Prabhudeva dorection is soo good... I thing best among all dabangg","label":0},{"review":"Dabangg 3 is a one time watch film but not as great as Dabangg 1 which came in 2010 which was high on intense scenes, great dialogues and was not overloaded with crappy songs. The music was great in the first part and almost all songs were chartbusters at that time. The franchise lost its essence after Abhinav Kashyap left the franchise and it can be clearly seen in the last 2 Dabangg films. \nComing back to Dabangg 3, it's almost 3 hr film overloaded with everything that everyone expects from Sa ...MORE","label":0},{"review":"Dabangg 3 is a one time watch film but not as great as Dabangg 1 which came in 2010 which was high on intense scenes, great dialogues and was not overloaded with crappy songs. The music was great in the first part and almost all songs were chartbusters at that time. The franchise lost its essence after Abhinav Kashyap left the franchise and it can be clearly seen in the last 2 Dabangg films. \nComing back to Dabangg 3, it's almost 3 hr film overloaded with everything that everyone expects from Salman's film. But the problem is the presence of too many songs at frequent intervals that really tests the audience patience and with coming of Baadshah as one of the music composers for the film, the music is literally a pain in the ears. Also most of the action sequences are in slow motion and that really puts you off while watching the film. It's surprising how Prabhudeva directed Wanted back in 2009 if he couldn't stop Dabangg 3 from being such a big let down. Also time and again people have disliked Salman Khan singing songs in his own movies but he seems to be unaffected by the criticism for his singing and has continued to sing another pathetic song where he is seen dancing with Sonakshi Sinha. \nThe first thing that many critics and moviegoers must understand that not all films can be preachy, biopics or address social issues in the society. There are movies made just for fun and audience is supposed to enjoy it for 2-3 hrs and leave their brains aside. Dabangg 3 comes under that category.\nCriticising Dabangg 3 just for the lack of logic isn't right because if that's the case then Hollywood has been churning out such movies in abundance every year. Movies such as Terminator series, MCU films, DC films, Mission impossible series, Fast and Furious series and many more. In all these movies the basic plot is a group of people ganging up against a baddie who is on a mission to wipe humanity. So don't listen and bother about critics such as Rajeev Masand, Anupama Chopra or Sucharita Tyagi who will throw some heavy and fancy words from Oxford dictionary and fill your mind with the mentality that whenever Hollywood throws commercial potboilers such as Avengers at you is great but it's not the same when Indian filmmakers do the same. \nOverall Dabangg 3 is a one time fun ride and can be watched once with friends and family. \nDon't go with too many expectations and leave your brains aside while watching the film because if you can accept Rajnikanth, Ethan Hunt (Tom Cruise) and James Bond single handedly fighting underworld dons ans mafias then why not Chulbul Pandey.","label":0},{"review":"Movie Review: Dabanng 3\n\n************* WARNING: MINOR SPOILERS AHEAD**********\n\nIt is unbelievable (atleast for me) to think that the first installment of the Dabanng series came out 9 years ago. Unbelievable, that the universe of Chulbul Pandey is almost a decade long.\n\nI'm a hardcore consumer of escapist cinema - my logic in life is not to see depressing movies on the screen. If I want to see a real representation of life or slice of life cinema, I'd rather watch it on Netflix or on any other  ...MORE","label":0},{"review":"Movie Review: Dabanng 3\n\n************* WARNING: MINOR SPOILERS AHEAD**********\n\nIt is unbelievable (atleast for me) to think that the first installment of the Dabanng series came out 9 years ago. Unbelievable, that the universe of Chulbul Pandey is almost a decade long.\n\nI'm a hardcore consumer of escapist cinema - my logic in life is not to see depressing movies on the screen. If I want to see a real representation of life or slice of life cinema, I'd rather watch it on Netflix or on any other OTT platform. Thats my personal opinion. My life is already depressing, so when I see a escapist movie, I want to see a larger than life character caricature and flying cars and weird dance choreography.\n\nBefore I even try to form an opinion on this flick, lets discuss about the parameters. To judge a Salman movie, you can only compare and contrast it with a Salman movie. Indian cinema is often sub-categorised into sub-genre; comedy, slice of life, horror, etc. And then there is even more minute genres; Rajnikanth, Salman, SRK, etc. These types of genres cannot be compared with any other but themselvds.\n\nSo lets discuss about Dabanng.\n\nLets get the elephant out of the way first - Dabanng 3 is an almost 3 hour long flick just to marvel at one thing alone: Salman Khan. Nothing else is relevant. I often people people love to write off Salman as a star more than an \"actor\" especially in the masala genre. I dont blame them. Salmans strength is also his weakness. Chulbul Pandey is so much of Salman, you dont know when Salman disappears from the screen and Chulbul appears. Salman has lived with this character for almost a decade. You know Ajay, Ranveer and Akshay all has played the quintessential masala cop - but no one can play it better than Salman as Pandey-ji. Chulbul is probably Salmans greatest character ever. Period.\n\nThough one might get offended by some of the homophobic, sexist and ageist \"jokes\" in this film, one could still argue this is plausible in the world of Dabanng. No other character apart from Salman has enough meat or skin to really talk about. Kiccha Sudeep is good, but he didnt get an arc in his characterization. He does terrible things but my favorite villian yet still remains Chedi Singh (i mean how could I forget he killed Dimple in the first installment). Saai and Sonakshi is there. I did miss Vinod Khanna though. \n\nThis movie tries of answer alot of questions that Dabanng 1 raised. Like how did Pandey ji get his name as Chulbul. Or what inspired him to (now iconic) put his shades behind his collar. Or what inspires his paisa-wasool dialogues such as \"hum tume itne chedh kar denge...\" But it also confused and meddled up with alot of other things for me as well. For example, how does it the flashback Chulbul and Makkhi share such a warm relationship. Or why is Pandeyji (senior) nice to Chulbul. Or how did Chulbul didnt know Kushi and Rajjo were related - did he not pick up the photo album ever, in these many years of his marriage?\n\nMy complaint with this movie is with his song choices. Firstly whats the need for forcing a \nI could talk about the story, screenplay or the cinematography - but the end of the day one has to realise this is a Salman Khan movie. Anything and everything is possible in the Dabanng world. It is a good, but not best version of Dabanng. Everything is presented in a larger than life manner. Dont think too much into it - you know what you are to expect when watching a Salman movie. \n\nIs this a movie Im going to remember in a months time? No. Is this a movie that entertained me though? Yes.","label":0},{"review":"DABANGG 3 – MOVIE REVIEW\n\nProdued by Salman Khan, Arbaaz Khan and Nikhil Dwivedi, D3 has turned into a successful franchise after the previous two thriving outings. This time it is Prabhu Deva who wields the megaphone. The success of this film is of importance to SK after his recent fiascos.\n\nStory? Well, this is a SK film, so Dilip Shukla(writer)  doesn’t try much, he lazily mentions some scenes that have made SK the star he is for years. The usual SK frolics is strewn every inch of the screen  ...MORE","label":0},{"review":"DABANGG 3 – MOVIE REVIEW\n\nProdued by Salman Khan, Arbaaz Khan and Nikhil Dwivedi, D3 has turned into a successful franchise after the previous two thriving outings. This time it is Prabhu Deva who wields the megaphone. The success of this film is of importance to SK after his recent fiascos.\n\nStory? Well, this is a SK film, so Dilip Shukla(writer)  doesn’t try much, he lazily mentions some scenes that have made SK the star he is for years. The usual SK frolics is strewn every inch of the screen and his fans might lap it up however laborious it may seem, but for the rest you look around the theatre to see if you are the only one who is not having fun. There are a number of scenes in the name of comedy that are squirm worthy and so unbecoming of the star that SK is. The movie is all about how The Dabangg became Chulbul Pandey(if you truly cared) and for that you get to see the “supposedly” cute side of SK in the screenplay. The angry Dabangg returns post the flashback to haunt us for the rest of the film with no respite.\n\nSalman Khan as usual has worked very hard for the film, not on screen though, but in the gym. Sudeep in an underwritten role showcases briefly why he is one of the finest actors down south. Sonaksh and Saiee do what is expected out of a SK’s heroine, act dumb and look good. The rest deliver their “dramatic” performances to the T.\n\nMahesh Limaye’s cinematography works very well and is at times ingenious too. Sajid Wajid rehash most of their tunes that are badly placed and their background score turns out to be annoying. Dialogues surprisingly are silly, regressive and offer no relief. Editing by Ritesh Soni is half baked. Prabhu Deva disappoints as the director.\nDABANGG 3 is no surprise, for SK fans and not so SK fans.. SlicK for them and SicK for the rest. \n\nDABANGG 3 – DABBA !\n\n1.5/5\n\nB.U.Shreesha","label":0},{"review":"Right now if Salman Khan stands in front of the camera twitching one eyebrow for two-and-half hours, he'll guarantee a 200-crore hit. Dabangg 3 gives you more than that, of course. It unleashes the superstar in full fury and flair.\n\nEssentially, the sequel continues with the idea of giving the genre of comicbook cinema a twist of kitsch. Chulbul Pandey, rockstar cop who gave Salman his newfound mojo with the first film of 2010, was perhaps the apt Bollywood specimen for the job. The film carries ...MORE","label":0},{"review":"Right now if Salman Khan stands in front of the camera twitching one eyebrow for two-and-half hours, he'll guarantee a 200-crore hit. Dabangg 3 gives you more than that, of course. It unleashes the superstar in full fury and flair.\n\nEssentially, the sequel continues with the idea of giving the genre of comicbook cinema a twist of kitsch. Chulbul Pandey, rockstar cop who gave Salman his newfound mojo with the first film of 2010, was perhaps the apt Bollywood specimen for the job. The film carries on with imparting a cocky smalltown spin to the Hollywood Western formula.\n\nIf Dabangg 3 was always about Salman Khan revelling in top form, the superstar doesn't disappoint. He makes Chulbul Pandey even more lovable this time- cool shades, wry humour, crackling stunts and smooth chemistry with the pretty Sonakshi, all very much in place. Did you seriously need any more reasons to watch?","label":0},{"review":"A start which seems as a not-that-great parody attempt of previous Salman's entry scenes.. Followed by painfully slow 1st hour to create context for action scenes to follow. Villian portrays a darker role than previous dabaang movies which possibly is the only intriging part in the first half. Action scenes remind of sultan, jai ho. Slow mo scenes are forced, and seem inspired from few famed south Indian movie scenes. Dialogues are bland and unmemorable, except few instances elucidating origins  ...MORE","label":0},{"review":"A start which seems as a not-that-great parody attempt of previous Salman's entry scenes.. Followed by painfully slow 1st hour to create context for action scenes to follow. Villian portrays a darker role than previous dabaang movies which possibly is the only intriging part in the first half. Action scenes remind of sultan, jai ho. Slow mo scenes are forced, and seem inspired from few famed south Indian movie scenes. Dialogues are bland and unmemorable, except few instances elucidating origins of chulbul's famed dialogues in  movies 1,2. The first half attempts to show sulman's innocence/emotions, female empowerment messages etc. but is painfully slow and predictable if not unbearable at times. Also you miss Vinod Khanna!\n\nThe second half gives hopes to be the start of the movie that fans came to see. It's satisfying to see how n why chulbul becomes dabaang! Prequel explains dabang 1 scenario nicely. Songs are still misplaced and have nothing to offer except the catchyness of munna badnaam, dialogues are atleast hit or miss, action scenes still at 4x speed. Makkhi's character goes on a senseless arc. Bali gives you the perfect villian that you could see chulbul struggling against providing you high hopes for the climax which is kinda flashy with cgi and slo mo but not entirely enjoyable. The complete movie has a South Indian parody-comedy-action movie flavor with the dabaang recipe repeated but somewhat doesn't meet expectations.\nAll in all, only hard core salman fans may enjoy the movie, which otherwise isn't worth a second watch!","label":0},{"review":"When\n(1)  The HERO is the BHAI of the MASSES- SALMAN KHAN\n(2) The DIRECTOR is the KING of MASALA style of movie making & from the land of entertainment- PRABHUDEVA\n(3) The FRANCHISEE is of DABANGG... understandably then the 3rd in the series has to be a full of MASALA POTBOILER & it is ...\nChulbul pandey is back & so is his entry, for the first time i believe here in BOLLYWOOD for one action scene a different action director has been recruited besides the otherwise action director & the result i ...MORE","label":0},{"review":"When\n(1)  The HERO is the BHAI of the MASSES- SALMAN KHAN\n(2) The DIRECTOR is the KING of MASALA style of movie making & from the land of entertainment- PRABHUDEVA\n(3) The FRANCHISEE is of DABANGG... understandably then the 3rd in the series has to be a full of MASALA POTBOILER & it is ...\nChulbul pandey is back & so is his entry, for the first time i believe here in BOLLYWOOD for one action scene a different action director has been recruited besides the otherwise action director & the result is grand with the public clapping & whistling in this introductory action sequence,  not that this is only at the start there are many such action scenes & dialogues to get this feedback again & again, the story in this third part  goes to flashback  showing CHULBUL PANDEYs past & his first love who was killed by the VILLIAN & how then CP came into the police force, the second half  back to present & revenge  time & finishing the villian, of course nothing new but then it is SALMAN KHAN with his style..... critics & classes might call it overdoing,  masses & his fans call it Apne  bhai ki  bhaigiri & they love him for all this & he after the disappointing BHARAT this time delivers, as the villian KICHHA SUDEEP is average playing a cool & calm kind of character, Sonakshi is the same while the new face SAIEE MANJREKAR is a disappointment more or so because of a limited screen time, the comedy track between RAJESH SHARMA & PARESH GANATRA is entertaining & reminds of JEETENDRA movies having KADER KHAN & SHAKTI KAPOOR JODI,rest all actors/characters have hardly anything to do & especially  to see a performer like BHARAT DHABOLKAR being wasted is sad ,Music is a big letdown...\nDABAANG is only DABAANG because of SALMAN KHAN & his style,  his action , his persona...\nNot a loser for sure but not very sure of this going really big especially with the next week having AKSHAY KUMAR & that is   GOOD NEWZZ","label":0},{"review":"Banner: SK Films | Director: Prabhu Deva | Cast: Salman Khan, Sudeep, Sonakshi Sinha, Arbaaz Khan, Saiee Manjrekar\nPlot :The film, a prequel in part, traces Chulbul Pandey’s journey from a young man named Dhaakad to police officer Chulbul Pandey, and his fight with the demons of his past. This is the third instalment of a famous franchise 'Dabangg' and the audience is well-acquainted with the larger-than-life, lovable cop and his world. Chulbul (Salman) spends his average day romancing his wife  ...MORE","label":0},{"review":"Banner: SK Films | Director: Prabhu Deva | Cast: Salman Khan, Sudeep, Sonakshi Sinha, Arbaaz Khan, Saiee Manjrekar\nPlot :The film, a prequel in part, traces Chulbul Pandey’s journey from a young man named Dhaakad to police officer Chulbul Pandey, and his fight with the demons of his past. This is the third instalment of a famous franchise 'Dabangg' and the audience is well-acquainted with the larger-than-life, lovable cop and his world. Chulbul (Salman) spends his average day romancing his wife Rajjo (Sonakshi), troubling his brother Makkhi (Arbaaz) and fighting and reforming goons. All is well, until he busts a prostitution racket and saves a bunch of girls, which angers the ring leader, the rich and powerful Balli (Sudeep).Its a,Chulbul Pandey’s beginnings, a huge chunk of the first part of the film is about his younger days, his love interest – the beautiful and naive Khushi (Saiee)and the circumstances that urged him to turn over a and becoming Robinhood Panday. \nTRADE ANALYSIS: Salman Khan did exceptionally well in action scenes especially in the climax. It is a treat to watch Salman charishma. The film also conveys social messages. Locations are well captured by cinematographer Mahesh Limaye. Prabhudeva as director could deliver much better product.  The story is predictable. Dialogues are well written. The film looks like old one in new package.  Romance between Salman and Saiee Manjrekar does not digest due to age gap. Sudeep is overshadowed by Salman’s character. Warina looks sensuous. Pramod Khanna fills the place of Vinod Khanna well.  Musically a let down.  The movie released in midst of CAA protest will effect the collections.      \nVerdict: Being Entertainer.","label":0},{"review":"Undoubtedly the worst Dabangg..\nDABANGG3\nOr \nKICK 4\nOr \nREADY 5\nOr \nWANTED 7\nWhat difference it makes except for the pencil moustache and keeping the glares hung at the back from the collar. \nSo...\nStory: salman khan.... really?\nScreenplay: Salman and a few others...?!?!did I say screenplay????\nSo, it’s his first love who Re-named him Chulbul.. okay\nSuddenly his equation with his father was conveniently cordial.. ok... hindi movie..\nHis entry this time was..... on a handmade make in India advert ...MORE","label":0},{"review":"Undoubtedly the worst Dabangg..\nDABANGG3\nOr \nKICK 4\nOr \nREADY 5\nOr \nWANTED 7\nWhat difference it makes except for the pencil moustache and keeping the glares hung at the back from the collar. \nSo...\nStory: salman khan.... really?\nScreenplay: Salman and a few others...?!?!did I say screenplay????\nSo, it’s his first love who Re-named him Chulbul.. okay\nSuddenly his equation with his father was conveniently cordial.. ok... hindi movie..\nHis entry this time was..... on a handmade make in India advertising rustic Tank.... phew!!!!!\nSajid wajid’s music has some impact.... you go to sleep. And to top it all Salman sings again.\nPrabhudeva has proven, even Arbaz khan is a Director.\nShould Bollywood stop giving directorial credits if there’s actually none??? Why not. \nSonakshi sinha... she is absolutely the same what uday chopra is for Dhooms.\nLast but not the least.. can anybody give me the address of the dialogue writer..\n\nBut not everything is bad.\nSalman is good.\nAnd the movie is good... better than tubelight, Race3 and Bharat.. \nI won’t argue if you don’t agree.\n\nBut yes\nKeecha Sudeepa, fantastic\nAlways your fan","label":0},{"review":"A must watch movie of the year 2019@Dabangg 3 .... This sequel of Dabangg is out with a Dhamaka Nd wil definitely rule the box office. Bang on performance by Salman Khan as always and as stood up more than the expectations of the audience. His comic timings, his body language, action sequence, dhakkad dialogues , toned body etc. is such a treat to watch the movie 😍 Words are short to express his zabardast performance in the movie.\n\nTo write about the other characters in the Movie, Arbaaz Khan,  ...MORE","label":0},{"review":"A must watch movie of the year 2019@Dabangg 3 .... This sequel of Dabangg is out with a Dhamaka Nd wil definitely rule the box office. Bang on performance by Salman Khan as always and as stood up more than the expectations of the audience. His comic timings, his body language, action sequence, dhakkad dialogues , toned body etc. is such a treat to watch the movie 😍 Words are short to express his zabardast performance in the movie.\n\nTo write about the other characters in the Movie, Arbaaz Khan, Sonakshi Sinha , Saiie Manjrekar Nd the most important Kiccha Sudeep have done complete justice to their characters. Kiccha Sudeep, an established actor of Sandalwood has an aura which drags us to the movie closer.\n\nOverall, a Once again watch movie ... The storyline, the cinematography, the dance songs, dialogues, action sequence . To sum up , a family entertainer Movie.","label":0},{"review":"powerfull action bonaza  \nA great actor is always one who never acts. Salman Khan is Chulbul Pandey & vice versa. Post spending so much time with this character, Salman knows the traits very well and he knows where to use what. Without any doubt, he’ll be a messiah of entertainment for his fans, but there will be exceptions. He gets multiple heroic entries, nailing every one of them. He’s all set for many ‘seetis & taalis’ amongst the single screen audience.\n\nSudeep is perfect! He’s the best vil ...MORE","label":0},{"review":"powerfull action bonaza  \nA great actor is always one who never acts. Salman Khan is Chulbul Pandey & vice versa. Post spending so much time with this character, Salman knows the traits very well and he knows where to use what. Without any doubt, he’ll be a messiah of entertainment for his fans, but there will be exceptions. He gets multiple heroic entries, nailing every one of them. He’s all set for many ‘seetis & taalis’ amongst the single screen audience.\n\nSudeep is perfect! He’s the best villain in the entire franchise & provides a worthy face-off to Salman Khan aka Chulbul Pandey. One major flaw with his character is that it’s not sketched properly. He’s a routine man mimicking some routine dialogues. He deserved a better role.","label":0},{"review":"The loyal Salman Khan fans will come to theatre and they would not be disappointed by Bhai. Bhai is back with his Dabangg Avatar. his muscle power unprecedented but unbelievable as well. Bhai will be shown spreading humourless dialogues at the police, villian and at his unusually fearless wife who seemed to acquire pandey ji's bravery only for her very first appearance in the movie and remained neglected (has nothing to do with the story except routinely appearing in songs). he is shown shirtles ...MORE","label":0},{"review":"The loyal Salman Khan fans will come to theatre and they would not be disappointed by Bhai. Bhai is back with his Dabangg Avatar. his muscle power unprecedented but unbelievable as well. Bhai will be shown spreading humourless dialogues at the police, villian and at his unusually fearless wife who seemed to acquire pandey ji's bravery only for her very first appearance in the movie and remained neglected (has nothing to do with the story except routinely appearing in songs). he is shown shirtless (occasionally pantless as well), fighting with hundreds of goons at once, intentionally trying to induce some humour with his very nasty jokes and annoying repetitive dialogues. the movie is powered by slow motion scenes( his girlfriend, a medical aspirant, chess champion, never detected at college, was shown slowly drifting downwards, tears rolling down her cheeks, her expression changing rapidly and then blood stained face of Bhai, (apparently failed to save her)). the scene was ridiculously long, further lengthening the already long movie. \n\nThe movie presents a back story about how an unemployed, muscle man became inspector Chulbul Pandey (  the name 'chulbul' earns itself a sub-story), who the villain is, his horrific crimes and his encounter with Bhai. villain was supposed to be killed by Bhai himself ( as a revenge ). but he returned again in Pandey ji's present life, threatening his family, continuing his crimes. \n\nThe movie is action packed but the plot is boring, story not compelling enough to be able to impress wider audience (not only bhai fans). songs are induced at random places making no sense at all.","label":0},{"review":"It’s a very good movie, very entertaining, keeps audience engaged right from first scene till the end. I must say story was very intelligently written and is executed very well. The story connects well with it’s previous versions. This should be the winning point because it’s a very tough job to align a story line that are sequel. Fresh plot and staying true to the theme “Dabangg” or “Chulbul Panday” brand. The only flaw I think would be that movie was bit lengthy but it even’s out for all the g ...MORE","label":0},{"review":"It’s a very good movie, very entertaining, keeps audience engaged right from first scene till the end. I must say story was very intelligently written and is executed very well. The story connects well with it’s previous versions. This should be the winning point because it’s a very tough job to align a story line that are sequel. Fresh plot and staying true to the theme “Dabangg” or “Chulbul Panday” brand. The only flaw I think would be that movie was bit lengthy but it even’s out for all the good it offers to the viewers. I didn’t like “Munna Badnaam” song because it fails to create the same magic as Munni Badnaam or Fevicol song.\n\nP.S: please stay away from negative people who don’t understand the meaning of “sequel” and just say “same story”. These are the same people who applaud Star Wars, MI, Jason Bourne, Bond series but talk nonsense when they watch a good Bollywood sequel.","label":0},{"review":"Whoa!.... I can't describe it in words but wow this movie totally blew my mind away. At first what i was expecting from chulbul pandey Is exactly the same, comedy, full of emotions, actions and feelings. Best part of this film is who named him chulbul panday and the story behind it is totally perfect. Story is all about the past like bahubali 2. Salute to salam sir because he's the story writer of this film and directed by prabhu deva sir. If you wanna compare this from the others two then this  ...MORE","label":0},{"review":"Whoa!.... I can't describe it in words but wow this movie totally blew my mind away. At first what i was expecting from chulbul pandey Is exactly the same, comedy, full of emotions, actions and feelings. Best part of this film is who named him chulbul panday and the story behind it is totally perfect. Story is all about the past like bahubali 2. Salute to salam sir because he's the story writer of this film and directed by prabhu deva sir. If you wanna compare this from the others two then this part will be chosen the best. I think you guys should watch this film not because he is Salman khaan actually this movie worth to watch. And if we talk about songs. All songs are amazingly choreographed. I would prefer to say that songs are romantic too. So guys without wasting your time you should watch this...... So for more information you have to watch what happens to chulbul why he called chulbul pandey.....?  \nThanks for reading","label":0},{"review":"Dabangg 3 continues the legacy further from its prequels with super Dabangg vibes and is a Christmas gift from Bhaijaan to his fans. The movie's story plot is set in a small town of Uttar Pradesh named Tundla and Salman Khan is playing his legendary character of the Supercop Chulbul pandey while being in charge of the local Police Station.\nThe movie starts with Bhai style entry scene and continues further with initial fight sequences followed by few story unfolding scenes. It's undoubtedly a wow ...MORE","label":0},{"review":"Dabangg 3 continues the legacy further from its prequels with super Dabangg vibes and is a Christmas gift from Bhaijaan to his fans. The movie's story plot is set in a small town of Uttar Pradesh named Tundla and Salman Khan is playing his legendary character of the Supercop Chulbul pandey while being in charge of the local Police Station.\nThe movie starts with Bhai style entry scene and continues further with initial fight sequences followed by few story unfolding scenes. It's undoubtedly a wow movie for Bhai fans, but a couple of actions and other scenes are totally out of this world.\nThe movie #dabangg3 contains a mix of gravity law breaking moments, a few funny scenes and lots and lots of fight sequences along with super lineup of songs. All in all a Salman style movie but something execptional, one time watch.","label":0}]