[{"review":"Here is a review of the movie Darna Mana Hai(2003)\n\n\nRatings:3.5/5\n\nStory: A group of seven friends are stuck in a middle of a forest when their car doesn't work. For the time being they sit in a house-like place and starts reciting spooky stories to each other. Things get mysterious when each of them starts disappearing.\n\nWhat's Good: It is terrifying in contrary to Indian horror movies. Some tales like Ghostly Lift and No Smoking and other stories plot also is a good thing to see. Brilliant ac ...MORE","label":0},{"review":"Here is a review of the movie Darna Mana Hai(2003)\n\n\nRatings:3.5/5\n\nStory: A group of seven friends are stuck in a middle of a forest when their car doesn't work. For the time being they sit in a house-like place and starts reciting spooky stories to each other. Things get mysterious when each of them starts disappearing.\n\nWhat's Good: It is terrifying in contrary to Indian horror movies. Some tales like Ghostly Lift and No Smoking and other stories plot also is a good thing to see. Brilliant acting portrayed by everyone and almost every story takes you to the edge of your seat. And you don't expect horror movies giving message!\n\nWhat's Bad: Stop/Move story is really slow and is stupid at some point. Apples story lacks in content and the ending seems all rushed up.\n\nLoo Break: None.\n\nReview: Darna Mana Hai is a fine movie and terrifyingly terrifying.\n\nTo Watch or Not To Watch: It is scary enough to watch.\n\n                                                                                                                                                A HASAN'S REVIEW","label":0},{"review":"A enjoyable horror movie. As an anthology the story branches out into many separate stories told by different characters. It's a cosy movie and full of unexpected twists and turns that leave audience members at the edge of their seat wondering what next. They can never guess the extremely imaginative twist and turns in the stories. A unique movie. It reminds me of another horror movie of a similar name structured in a similar format but the stories between the two movies are completely different ...MORE","label":0},{"review":"A enjoyable horror movie. As an anthology the story branches out into many separate stories told by different characters. It's a cosy movie and full of unexpected twists and turns that leave audience members at the edge of their seat wondering what next. They can never guess the extremely imaginative twist and turns in the stories. A unique movie. It reminds me of another horror movie of a similar name structured in a similar format but the stories between the two movies are completely different.","label":0},{"review":"A good movie and well delivered thriller. If you see it alone you will realise RGV can scare you only  by an apple. . .","label":0},{"review":"Great innovative format. Only RGV factory can pull off such psychological thrillers.","label":0},{"review":"this movie is pretty good but it scares little kids from eating apples","label":0},{"review":"Interesting fear tales with popular cinema artists to make excitement and horror.","label":0},{"review":"Must watch movie with short stories and nice ending","label":0},{"review":"Excellent movie I missed to watch in cinema😞😞","label":0},{"review":"Awesome movie. I watched it as a kid.","label":0},{"review":"GENIUSSSS I LOVE ITTTTTT","label":0},{"review":"Fantastic movie","label":0},{"review":"awesome !! a must watch","label":0},{"review":"tattimovie.. total waste of time","label":0},{"review":"nostalgia , superb stories","label":0},{"review":"Average.Like horror Hindi TV serials!!","label":0},{"review":"Very horrible movie","label":0},{"review":"Very nice.","label":0},{"review":"good movie","label":0},{"review":"The first horror movie of its own kind nice concept","label":0},{"review":"cult montage of short psychological and horror thrillers","label":0}]