[{"review":"It's an amazing movie. Storyline direction presentation was very good. Actors acting were brilliant  specially vinaya phathaks acting was amazing . They have given us good message that till last breath we should  lead our life with positivity and happily. Then we can show our happiness face to other people . Songs were real good. This movie remind me rajesh khannas and amitabh bachan anand movie same topic.","label":0},{"review":"I must have seen thousands of movies till date,i can easily say that it will always be in the top three among that all;it has a heart-warming storyline,leaves you with a beautiful messsage.\n          You never know what will happen next in your life,life is not forever,so just make the best out of it.","label":0},{"review":"Well it's remind me Anand movie of rajesh khanna, it's seems it's inspired from that platform. During those days people might not have wish bucket list ehich they wanna live . nowdays people have it.  Very good movie and Rajat pathhak is real gem of bollywood.","label":0},{"review":"Very interesting movie. Better to watch in home may be alone and not in theater. Movie is about the last 10 wishes of a person who is about to die in few months. How he finds happiness in life. Who will cry when you die.","label":0},{"review":"I watched it today. It's an amazing movie very entertaining and a good messenger as well. I was not able to blink my eyes thorough the entire movie. 10/10. Highly recommend a must watch movie.","label":0},{"review":"I can't cry even when I feel like doing so. But I have cried buckets when I saw this movie. You feel so good and begin to love your life after you finish watching this one.","label":0},{"review":"I m crying.. I want to cry so loud that every person should hear it especially those who exploited my life. Yes it's me. And it is my life... Unfortunately","label":0},{"review":"I loved this movie,   later I cried.. My wife too saw.. She dint like.. U know  she ditched me,   got married to other person...","label":0},{"review":"I never seen this type of movie in my whole  life, it was outstanding performance by all actors specily Vinay pathak... 💯/💯 Rating.","label":0},{"review":"Saw this movie, just wanted to say what a gem this movie is???? Stay happy with your life cos u will never get one is something which I learnt.","label":0},{"review":"my teacher said mei to watch this movie and there was very rare when he like any movie and really after I watched it i was wordless to explain what I feel that","label":0},{"review":"This movie is really tich my heart ♥ and I'm  very big fan the making this movie","label":0},{"review":"Beautiful movie of life.\nDon't wait for wish to come for you,go to your wish","label":0},{"review":"Beautiful Movie. [995 MB] use reverse text : /eivom-8002-ayinadivsad-bm-599/seivom-yt/moc.tcilfnocsss//:sptth\n\nReverse any Text : spellbackwards(dot)com","label":0},{"review":"Amazing movie ! Simplicity, Logicality and Sweetness at it's best !!!","label":0},{"review":"Found  this gem very lately . It's  a must watch movie. Couldn't  blink  my  eye throughout  the movie","label":0},{"review":"Another Emotional movie filled with sweetness. Vinay Pathak is Awesome.","label":0},{"review":"Lame copy of Ikiru. Watch the original. It's a masterpiece.","label":0},{"review":"Vinay pathak is superb at acting. Storyline is simply amazing.","label":0},{"review":"Brilliant acting by Vinay and dialogues is matching with real life","label":0},{"review":"Amazing movie and I like it, I have learnt how to live life...😊😊","label":0},{"review":"Hat's of one of the best movie I ever seen .","label":0},{"review":"Its an amazing movie... must watch u will feel isnpired❤","label":0},{"review":"About a life that we are missing in our busy lifestyle","label":0},{"review":"Its one of the best movie of my life","label":0}]