[{"review":"A typical ''leave your brain behind'' comedy flick. The movie is excellent in terms of the performances weather by actors or crew or the music. It has become quite a good combination. The move is full time pass and I had a great time watching.\nThe story is on a similar lines as Herapheri. Akshay Kumar and Sunil Shetty are friends and want to get rich as soon as possible otherwise their girlfriends would be forcibly married by their family to someone else. Their scheme of getting rich lands them  ...MORE","label":0},{"review":"A typical ''leave your brain behind'' comedy flick. The movie is excellent in terms of the performances weather by actors or crew or the music. It has become quite a good combination. The move is full time pass and I had a great time watching.\nThe story is on a similar lines as Herapheri. Akshay Kumar and Sunil Shetty are friends and want to get rich as soon as possible otherwise their girlfriends would be forcibly married by their family to someone else. Their scheme of getting rich lands them in Pan Pacific Hotel where Paresh Rawal is trying to get his son Chunkey Pandey married with Sameera Reddy. Now starts the confusion of mistaken identity, lies and what not. All the confusion reaches its summit and explodes in the end.\nThings I like in this movie ~ some good funkiest dialogues, some funny punchlines, some funny scenes that holds your attention, whole Katrina Kaif and some good songs...","label":0},{"review":"'ddd' did avg.business on box office but the  film was capable to do very good business on b.o. Fantastic comedy storyline as compared to previous film of priyadarshan. Hats off to script, story, screenplay writer. A very big multistarrer film in modern era. This type of film were made by manmohan desai. Priyadarshan handled very carefully every character. The main USP of the film is supporting actors who have given full justice to their role.70% co-actor has taken the responsibility on their sh ...MORE","label":0},{"review":"'ddd' did avg.business on box office but the  film was capable to do very good business on b.o. Fantastic comedy storyline as compared to previous film of priyadarshan. Hats off to script, story, screenplay writer. A very big multistarrer film in modern era. This type of film were made by manmohan desai. Priyadarshan handled very carefully every character. The main USP of the film is supporting actors who have given full justice to their role.70% co-actor has taken the responsibility on their shoulder. Not easy work to direct so many actors  hard work can be seen. Every character whether it is small/big has important role. After hrishikesh mukherjee, Priyadarshan is the only director who can give good healthy comedy film. 'DDD' can be watch 1000 times as compared to todays foolish films.\nMANTRA for  comedy films - NO SPACE FOR EMOTIONS IN COMEDY.","label":0},{"review":"I'm sure it took a lot of talent and skill to assemble the story line and ensemble cast to develop the film. \n\nI thoroughly enjoyed the first 45 minutes of the film when everyone is introduced and the jokes made me laugh out loud, especially from Akshay Kumar, Johnny Lever,  and Shakti Kapoor.\n\nThe remaining 2 hours were the drag where I lost pretty much the whole plot. Jokes were not present at all,  just confusions. \n\nThe back ground music is exactly the same for 2 hours of the film and I got  ...MORE","label":0},{"review":"I'm sure it took a lot of talent and skill to assemble the story line and ensemble cast to develop the film. \n\nI thoroughly enjoyed the first 45 minutes of the film when everyone is introduced and the jokes made me laugh out loud, especially from Akshay Kumar, Johnny Lever,  and Shakti Kapoor.\n\nThe remaining 2 hours were the drag where I lost pretty much the whole plot. Jokes were not present at all,  just confusions. \n\nThe back ground music is exactly the same for 2 hours of the film and I got sick of it.\n\nThere are 5 story lines and only one is solved.  And that too of a fraud. \n\nAkshay Kumar spent 70 percent of the film locked in for closet. And all girls apparently just love money.  The love stories would have ended if the money did not come in the hand of the men.","label":0},{"review":"This movie is good and funny and can keep you entertained. It had good performances and some scenes can keep you laughing on and on. It's not the easiest to understand though, i had to replay parts of the movie over and over to fully understand it. So if you like simple to-the-point movies, De Dana Dan is not for you. However if you like movies that have complex plots and different storylines, i say go for it and watch this movie, definitely recommend it.","label":0},{"review":"Hilarious.  I loved it and can watch it over and over again.  I loved Akshay, he has great comic timing.  It was a total laugh riot.  Not boring for a minute.  Fast paced and it was very good movie on comedy of errors.  Even the music was catchy and enjoyable.  Rishte Naate song is the one I loved.  You can watch this movie over and over.","label":0},{"review":"De Dana Dan was second utter rubbish movie. I didn't understand a single story. Its not a comedy movie it's jokery film. I don't no why indian audience support this kinds of jokery movies which dosnt make any sense at all. Just for earning 2 to 3 corer ruppess they select this kinds of movies. And still this kind of movies become highest grossing and earning a lot in box office . Its a totally rubbish movie.","label":0},{"review":"Great movie..Dont know how it was unrated!Really funny and relaxing movie. Great Actors and performance of each individual is awesome. Well done. You must have a good focus on the movie, and you will really enjoy. Too good","label":0},{"review":"Saw it in 2019 and if they could have kept it more tight it would have been a better movie.\n\nThey played with confusion and comedy and I loved the comedy part. \n\nBrains have to be left aside. \n\nCG effects - we know you loved it - Director Sir but you should have used a little editorial sense to chop it a bit.","label":0},{"review":"good comedy film. the story can be understood if watched from starting to end. but it can be watched even from the end and will surely make you laugh. this kind of film does not needs complex storytelling,  it's Just fun","label":0},{"review":"This movie is really watchable. Very comedian 😋 and keep you entertaining till the last. Some scenes are very very 👏👏funny. Excellent performance by Akshay kumar and Sunil Shetty 👍","label":0},{"review":"One of the best blockbuster comedy movie by \" Priyadarshan\". Each and every scene of the movie is comic due to big confusion with different meaning of the same event which caused me naturally to laugh and one of the most special thing about this film if someone who really enjoyed may be👇\nTo repeat each and every scene of the movie by rewinding to completely enjoy that scene and then forwarding the movie...","label":0},{"review":"It is hard to believe that the movie could not fare well at the box office.... The comedy is situational and not infused unnecessarily merely for the sake of laughter....... \nTo maintain the story with the significant part of each character is just great....","label":0},{"review":"Like seriously one of the bestest movie ever... Akshay, Paresh Rawal, Johnny Lever... everyone was totally great. Loved it. It deserves full 5 stars. Amazing movie.","label":0},{"review":"a very funny movie.It has many situations mixed and jumbled up.If you want to understand it correctly, must watch it from start to end.This film comprises of many noble actors and actresses.You will definitely laugh at every scene of the movie.The movie is very creative.","label":0},{"review":"Confusion is the mool mantra of this movie . 2 boys are in desperate need of money and want to marry their respective girlfriend . The thing which I want to tell all is the last scene the most funniest.","label":0},{"review":"This is so amazing movie in the world for because of its casting. This is the most complex movie in the world.I think this movie only understand,who have intelligency and creativity about films and direction.","label":0},{"review":"Best comedy film in the world\nAll the characters are perfect in their roles\nAnd in this movie Akshay Kumar is my favourite\nI have watched this movie 30+ times but never bored","label":0},{"review":"It has to be the epitome of funny movies where the second half is all about hilarious confusion. This movie does it best.","label":0},{"review":"Absolutely terrific! Never seen such a comedy thriller with this many twists and turn in the story.","label":0},{"review":"One of the names which comes to everyone's mind for romantic comedy. It's one of the best comedy movies out there!!!","label":0},{"review":"This movie has good comedy scenes and comic mixture of different stories which we have seen in all Priyadarshan movies.","label":0},{"review":"Awesome movie love all the roles\nJohnny lever\nAkshay kumar\nParesh rawal and it should be watch","label":0},{"review":"Ultimate chain of sequences....yet another marvel from priyadarshan....can't resist watching it every time whenever it comes on tv.","label":0},{"review":"Best comedy movie ever har ek twist and plot pe laughter h very funny movie 5 star movie 😊😊","label":0},{"review":"Wow very nice movies as very funny comedy...... This movie genreted at second part so very happy....","label":0}]