[{"review":"This is the best movie of Ajay Devgan in a negative role and I will put it ahead of Darr and Bazigar if you take out songs from them. Ajay is my favorite actor because he is versatile. Performs any role with dialogue delivery at ease. Great work Ajay. Though, I should call you Sir but calling you by name makes me feel, you are near to me. Amitabh and you are the two. Keep up doing great work and we Fan's will will keep on waiting eagerly for your every films.","label":0},{"review":"Though the movie is loosely based on 1996 Hollywood movie Primal fear it is one of the very intriguing movie from bollywood.\nAjay Devgan Sahab plays a musician named Tarang Bhardwaj who has a split personality disorder. Akshay Khanna plays a lawyer named Raj Goyal and Urmila Matondkar plays Sargam: the love conflict between them.\nIt is the first movie where Mr. Devgan played a negative role and he nailed the role and overshadowed everyone else in the movie.\nIf you haven't seen it yet watch it fo ...MORE","label":0},{"review":"Though the movie is loosely based on 1996 Hollywood movie Primal fear it is one of the very intriguing movie from bollywood.\nAjay Devgan Sahab plays a musician named Tarang Bhardwaj who has a split personality disorder. Akshay Khanna plays a lawyer named Raj Goyal and Urmila Matondkar plays Sargam: the love conflict between them.\nIt is the first movie where Mr. Devgan played a negative role and he nailed the role and overshadowed everyone else in the movie.\nIf you haven't seen it yet watch it for Ajay Devgan Sahab and his tricky disorder!","label":0},{"review":"Lol, inspired by Primal fear which is an absolute master piece... No one can even do close to the acting Edward Norton has performed, in an outstanding way. Shut this up and go watch Primal fear...","label":0},{"review":"mUCH better than Richard Gere's Primal Fear.\nLove songs, love acting of all three awesome actors, full in their character","label":0},{"review":"it's a copy of Richard garr movie  that was awesome movie but i like it too caz it's show ultimate talent of AJAY devgan and Akshey also have given a wonderful performance","label":0},{"review":"Wow wow. Today 29th May 2019. Ajay acting of split personality is awesome. I feel part 2 toh banta hai","label":0},{"review":"I have not seen this movie. But recently I watched it ...what a masterpiece! Hats off to Ajay..","label":0},{"review":"Raj Goyal is so handsome in this movie ;3. I have \"deewangee\" on repeat, so good!","label":0},{"review":"This movie is Mind Blowing. Ajay Devgn & Akshaye Khanna good acting in this movie.","label":0},{"review":"One of the best movies. Thoroughly engaging","label":0},{"review":"Nice plot not boring at All \nAkshay And Ajay both actors gave splendid performance 👍👍👍","label":0},{"review":"One of the best thriller and what a brilliant acting by Ajay Devgn","label":0},{"review":"'Primal Fear'  - Undisguised in every way. \nNo where near Ed Norton but Ajay devgan's performance somehow appreciable.","label":0},{"review":"Copy of Primal fear movie. But both was great to see.","label":0},{"review":"this is the best movie thai i can watch again again this movie's great","label":0},{"review":"Good movie,,,but ajay still can't beat Edward Norton in acting","label":0},{"review":"Excellent performance of Ajay Devan and well written.","label":0},{"review":"SUPERB acting by Ajay Devgan as a Villian.","label":0},{"review":"One of the best thrillers of bollywood","label":0},{"review":"One of my favorite movie of AJ","label":0},{"review":"One of the my best movie.","label":0},{"review":"Superb Movie","label":0},{"review":"Chor sala bollywood you tried to act like Edward Norton lol😂","label":0},{"review":"just a copy of primal fear","label":0},{"review":"Completely nailed it ,hands down","label":0}]