[{"review":"Great Story! Abshiek Bachan's acting was incredible. He has proved that he can play any role of any kind. I'm a true fan of Abishiek Bachan. Man I miss him on screen these days. You know one more thing about Abshiek Bachan, ok I met him around 10 years ago in L.A. when he came to perform a show. A man came and told my parents that Abhishek Bachan is there and he wanted to meet me. At first I didn't believe him but I thought ok this young man might right. So, I just started following him. When we ...MORE","label":0},{"review":"Great Story! Abshiek Bachan's acting was incredible. He has proved that he can play any role of any kind. I'm a true fan of Abishiek Bachan. Man I miss him on screen these days. You know one more thing about Abshiek Bachan, ok I met him around 10 years ago in L.A. when he came to perform a show. A man came and told my parents that Abhishek Bachan is there and he wanted to meet me. At first I didn't believe him but I thought ok this young man might right. So, I just started following him. When we finally, reached I saw somebody opening the door, and guess what it truely was the charming Mr. Abishiek Bachan!!!😍😍😍 He was looking dashing in his Blue shirt and OMG he was so humble. He was gracefully talking to me. I love him. The movie is very nice. Anyway Happy Bollywood Movie Day to you all and be safe.","label":0},{"review":"I don't know why some of them are feeling disappointed after watching this film and saying they've wasted 3hrs of their life?\nOkay, we all understand it's your opinion and you can definitely review your thoughts but it should be reasonable and clearly understandable. There's no need what so ever to blindly criticize any movie you don't like. Delhi 6 is a movie which clearly tells us that how to be \"United\" and word religion shouldn't destroy any relationship or friendship. The movie also gives u ...MORE","label":0},{"review":"I don't know why some of them are feeling disappointed after watching this film and saying they've wasted 3hrs of their life?\nOkay, we all understand it's your opinion and you can definitely review your thoughts but it should be reasonable and clearly understandable. There's no need what so ever to blindly criticize any movie you don't like. Delhi 6 is a movie which clearly tells us that how to be \"United\" and word religion shouldn't destroy any relationship or friendship. The movie also gives us an example of a Black Monkey which clearly indicates that in every human being there's a bad side or a demon which should be burned and shouldn't let get heavy on anyone.","label":0},{"review":"It's a great movie...very subtle.. something you can learn from. Abhishek is really great and Sonam too did her job well. The plot was great. I think people don't get along with subtle plots really well. This movie very artistically talks about dark aspect of human behaviour. It talks about the correct way of seeing things is based on humanity and not on religion. I thoroughly enjoyed the movie.","label":0},{"review":"I love this movie. I've watched it many times over the years and it always moves me to tears. The plot is subtle and full of meaning. It encourages you to philosophize on different issues such as religious tolerance, family values, morals, love, etc which is what a good story is supposed to do.The script is written with sensitivity and despite some of the horrendous situations that face the characters no one is completely villainized. The story tries to teach you that everyone has good and bad w ...MORE","label":0},{"review":"I love this movie. I've watched it many times over the years and it always moves me to tears. The plot is subtle and full of meaning. It encourages you to philosophize on different issues such as religious tolerance, family values, morals, love, etc which is what a good story is supposed to do.The script is written with sensitivity and despite some of the horrendous situations that face the characters no one is completely villainized. The story tries to teach you that everyone has good and bad within them, that we are a reflection of God and the devil equally, that we are responsible of our own actions.","label":0},{"review":"Great bunch of actors, everyone did there part pretty well. Interesting details and film making is unique. Overall its a must watch (Especially a delhiites will enjoy it).","label":0},{"review":"We should need to watch this movie I have watched this after 10 years since the release. I think imdb is rating to low for this. People at that time where not as mature to take this. \nAll the character in the movie were fantastic. \nI want u all should get 2.30 hours for this movie it's very similar to nowadays situations.","label":0},{"review":"The movie has shown some underlying issues in our society. Not a normal masala film. So set your expectations right and start feeling the movie. You’ll not get disappointed. The story and songs are so meaningful.","label":0},{"review":"Great story with Great Acting accompanied by Great Music By Great A R Rahman.\nA must watch movie with perfect combination of intense and humour storyline.\nThis movie has social message also which everyone has to think about.","label":0},{"review":"Storyline was really good. Actors did a good job. movie did not do well coz it came out during a period when masala movies were becoming hit.","label":0},{"review":"Such a powerful film. I've never seen an Indian film that has crammed so much of India's history & culture all into one movie. This film deserves so much more recognition than it has gotten.","label":0},{"review":"This film makes me feel nostalgic about the time when there was no cellphone, no internet, no social media yet rumours spread like wildfire and one of them was the kalaa bandar which could be seen through red glasses, like that","label":0},{"review":"Great bunch of actors + great story line + +awesome music + no hesitation in showing good and bad aspects of lifes =  DELHI 6\nJust feel the movie ,you will not regret","label":0},{"review":"One of the best movie watched in a while. Such a subtle way to highlight so many social problems in our country India. Great direction.","label":0},{"review":"Just finished watching it. Has a great social relevance. Good Music. Many problems are covered in a subtle manner. Human behavior is portrayed on a larger way.","label":0},{"review":"I loved this film totally it may be a flop film but it is an  enduring classic in my version great story and great action by cast especially abhi,sonam and aditi😊😊😊😊","label":0},{"review":"Slow movie.. Not sure to show what they wanted us to know.. Only Rehman's music keeps us surprising thru the movie.. Simply waste of time but only 2c all gr8 yesteryear actors 2gthr..","label":0},{"review":"Abhishek Bachchan Is the most Underrated Finest Actors in Bollywood... His acting in Delhi 6 is the proof of it... He has done tremendous job...","label":0},{"review":"Superb movie, Abhishek and Sonam have done a great job, their acting was so natural...all the characters reach the audience and it has a deep message....","label":0},{"review":"Watch if you want to experience cinema,love,hate,India!  AMAZING MOVIE. ONE OF THE BEST MOVIE OF ABHISHEK BACHCHAN","label":0},{"review":"Un-imaginative and cliched plot. Shoddy acting. Wasted 3 hours of my life that will never come back. (Only songs are nice).","label":0},{"review":"abhishek destroyed the movie.he is an absolute cliche.the story revolves around a great concept.unoccasional songs surely bore you out.some extraordinary moments.not a fan of the making either.average movie","label":0},{"review":"Abhishek Bachchan did a wonderful job in this movie..he is lot better than most of the actors and it's a great loss to bollywood if they don't recognise this..","label":0},{"review":"I loved this movie a lot Abhishek Bachchan is a awsome man I love him and even Sonam Kapoor is cute","label":0},{"review":"Great story of cute love and black marks of society .cool acting of akshay and sonam too....... awesome movie.","label":0},{"review":"Pathetic movie. Just say pass and let it go. I am so unhappy with myself for watching this movie","label":0}]