[{"review":"A hilarious film ! The three lead actors , Imran Khan, Vir Das , Kunal Roy Kapoor have rendered nearly flawless, crisp performances.\n\n Vijay Raaz has played a suave, droll villain - very amusing . \n\nThe script, direction and editing is on the money.\n\n A refreshing & very 'unbollywood' like movie. Wish to see more films like this one from the Indian fim industry. \n\nBe warned-foul language in the film .\n\n ( Frankly , the censored version of the film is a lot less funny than the original one )","label":0},{"review":"One of the best pitch black comedy films yet. Its mere existance is a feat to behold. Bollywood usually doesn't make this kinds of satirical films. Its characters,  vulgar language, somewhat disjointed storytelling and dark comedy reminded me of a masterpiece named \" Pulp Fiction \" not kidding.  Even though it is a completely different film. Delhi Belly 's overall vibe did remind me of the sleek, cool and dark world of gangsters ( Pulp Fiction )  .","label":0},{"review":"Fully entertaining movie.. I couldn't  stop laughing till the end... Everything is too good in this movie. We can call this a masterpiece of comedy movie. The whole cast done there jobs superb. Music is good..and the main thing the dialogue are hilarious... We need more movies such like","label":0},{"review":"After long time I saw this movie again..I first saw this when I was in college...and now I when I am working. I found this movie more interesting with new perspective. This is how it works with movies when you watch them at different phases of  your life you found something new. This movie is like an epuc movie for Indian cinema. Thanks to aamir and team.","label":0},{"review":"A great Bollywood movie . Wishing more like this to come. An absolute gem. Doesn't seem like its Bollywood that's the beauty .Its really different from the mainstream Bollywood movies ,go and watch it if you haven't ,and if you loved it then certainly you have a great taste of movies .","label":0},{"review":"Really a very very funny and mind blowing way to entertain even a very tense people...I hv seen this movie 3 times.\nAnd this is the film that encourage me to be an script writer.Thanks....AKSHAT SIR AND AAMIR SIR. NOW i can feel that god has sent me to write.","label":0},{"review":"The movie is really good and it has some really funny scenes and action scenes . Vijay raj and vir das both had given really impressive performance. Its an adult movie so u can enjoy with friends.","label":0},{"review":"Just watched the movie. Can't get over the fact tht such a badass movie even exist in bollywood. This is probably the best performance of Imran Khan's life while all other characters r also flawless. Can't watch it with family but surely a movie 2 watch & njoy with frnds","label":0},{"review":"It's my very first time, you can't believe that me and my friends laughed throughout  all the time. Full of entertainment. In Bengali we say 'JHAKKAS'. If you've time and wanna to laugh crazily, then watch this film.","label":0},{"review":"Awsm Movie, Great comedy over all, unique concept and all characters acting superve and plz don't watch it with your family because it has many abusing words like bhe****, Ch***** & many more....But Must Watch","label":0},{"review":"Total enjoyment... And full of comedy. Didn't expect that it would be good. After 7 years of release, I've just watched, and it did not disappoint me.","label":0},{"review":"A beautifully made movie that is just as much character driven as it is plot driven. Story aside the technical aspects of the movie impress just as much. Brilliant movie overall.","label":0},{"review":"It's a young youth movie where on lots of vulguarity in languages.\nGud story & actions .\nPlease keep children out of reach under 18. Parents r decided to  watch with their own opinions.\nHope we(youth) shall watch  it's 2nd part .","label":0},{"review":"This is my fifth  time.... I watched first time when I was in college and now when I get stress through some extraaa work I put this movie on TV .....I think this movie more versatile and realistic....imran Khan can be great actor","label":0},{"review":"Superb film full timepass .\n\nGood acting  by all\n  \nNice comedy script\n\n\nWorth watching again & again .\n\nAfter alll its Aamir Khan Production","label":0},{"review":"This movie is termed as black comedy, but in my view it's a hilarious story, with amazing performances by everyone. It's a must watch","label":0},{"review":"An amazingly creative movie which answers several questions underneath it's hilarious cover. It deserved more acclaim than what it had received during its theatrical release.","label":0},{"review":"what a hilarious movie this is, you should watch this movie with your friends i'm sure you will enjoy. this movie has epic comedy scenes.","label":0},{"review":"Cant  watch the movie with family but you should watch the movie with friends it has comedy anddd am sure you would love the movie and will be exited to watch for every next scene not a boring movie \nDate:-10/15/2017","label":0},{"review":"Watched the movie recently..almost felt as refreshing as it was first time when I saw during college time.\nMasterpiece movie of Amir khan Team..","label":0},{"review":"Great movie. Wow, it has comedy, action, and what not.?\nAnd Of course fantastic acting by imran...👍","label":0},{"review":"This movie is just amazing. \nAmazing acting , hilarious comedy :v","label":0},{"review":"Real good comedy.\nMust watch for those who like entertainment in movies.","label":0},{"review":"i love this movie  every  new year i see but everytime its refreshing","label":0},{"review":"This movie keep you busy and a good entertainment","label":0}]