[{"review":"This is one of few rubbish bollywood movie that I actually like. Akshay and John have great chemistry which is awesome. Just don't use too much brain and enjoy this movie. It is actually hilarious.","label":0},{"review":"well this akshay kumar and john abraham duo always do wonders. Garam masala , Desi boyz and Housefull 2 all films are comedy packed. Desi boyz is a light comedy film . 3.5/5","label":0},{"review":"Bollywood only copy plagrise if whole movie is not copied they take scenes from different movies. Like they took stripping scene from Billy Madison movie. But even in copying you need mind. And bollywood & other indian movie industries only copies and sucks.","label":0},{"review":"Nice fantastic .one of my chilhood movie .songs i like it very much.featured song ie subha hone na de is one of my best song .hopeall of  you too enjoy this flim","label":0},{"review":"Akshay kumar you are so beautiful and cute and deepika padukone is beautiful but special you no 1 world the best. My name is nazia zadran i am muslim i am 10 year old girl.BYE","label":0},{"review":"I like the pair of John Abraham and Akshay Kumar. I love the movies of their combination.Both together spreads super entertainment and great comedy in scenes!","label":0},{"review":"one of the greatest movies i have ever seen in my 18 yo life great john and akshay are bombs","label":0},{"review":"John sir deepika mam and akshay sir and sunjay dutt  very nice movie I like your movie\nAnd expression and you also best in movie\nVery hard work on picture nice work  roco \nAnd hunter","label":0},{"review":"The best time was that when AKKI leaves john\nAnd he got her crush\nI like chitrangda acts And her too.","label":0},{"review":"Such a wonderful movie\nEvery time I see I do not get bored....its a comedy and a movie on friendship...","label":0},{"review":"a nice movie.at first you may feel a little bored but after that its a good movie.","label":0},{"review":"Boaring movie . Storyline direction presentation was utter rubbish. I am akshay Kumar fan.  😤🤛👊👋","label":0},{"review":"A good comedy movie it is i think everybody should watch it","label":0},{"review":"The movie is very good entertain for  my friends","label":0},{"review":"Nice movie, the movie shows the friendship that we need in hard times.","label":0},{"review":"i love this movie it has great songs","label":0},{"review":"Creat one  more  movie  with  all  this  stars...  Believe u will  break  all  records","label":0},{"review":"I just loved this movie....Nd want to download....need sites which actually works","label":0},{"review":"Love u akki sir.\nU r my Role model","label":0},{"review":"Must watch good movie what a chemistry","label":0},{"review":"Desi boyz full movie Best  move","label":0},{"review":"My Favorite Heros Is Akshay Kumar","label":0},{"review":"This movies is very good movies","label":0},{"review":"I am akshay kumar fan but desi boyz movie is too boring","label":0},{"review":"Nice movie and songs","label":0}]