[{"review":"It was spectacular.  Cast was a perfect choice, lyrics & acting, songs were delightfully pleasing.  Still a most popular movie today songs included.  \nThe beautiful actresses Aishwariya and Madhuri a best  combination of beauty grace and charm in this ever-loving movie.\nShah Ruhk undoubtedly brought this movie to blockbuster and Jackie Shroff splendidly executed his role. Second cast members were all pleasing to watch.  The choreography for the Dole La Re dance was fantastic!  Well done.  10/10  ...MORE","label":0},{"review":"It was spectacular.  Cast was a perfect choice, lyrics & acting, songs were delightfully pleasing.  Still a most popular movie today songs included.  \nThe beautiful actresses Aishwariya and Madhuri a best  combination of beauty grace and charm in this ever-loving movie.\nShah Ruhk undoubtedly brought this movie to blockbuster and Jackie Shroff splendidly executed his role. Second cast members were all pleasing to watch.  The choreography for the Dole La Re dance was fantastic!  Well done.  10/10 for this movie.","label":0},{"review":"this movie is awesome and it's my fav movie all the 3 staring charecters are my fav....srk played his role so wonderfully and the love of paro(aish) towards devdas(srk) was explained such nicely. even madhuri dixit did a great job in this movie. In the ending when  devdas (death of devdas0 made me so emotional that even i was crying and was not able to stop my cry....BEST MOVIE OF BOLLYWOOD....WITH THE  3 LENDARY ACTORS staring in the movie","label":0},{"review":"Its really fabulous no one can imagine  the acting skills and struggles of shah rukh khan behind this movie and also the role  of paro was awsome i have no words to say about it and my fav song maar daala is there so i only want to say that maar daala hai maar daala . Thank you so much Mrs. Sanjay leela bansaali for releasing this extraordinary movie and i hope your all movies be as hit as this one 😍😘😗😗😍😘😗","label":0},{"review":"This film was majestic in every way. The sets, the story, the acting, the music, the dances, everything was great. Sanjay Leela Bhansali really delivered his best with this remake. Shahrukh, Aishwarya and Madhuri were really great in their roles. Showed what a gem they were when they constantly made the audiences really felt the pain through their eyes.","label":0},{"review":"I think it is the one of the best bollywood movie ever made. I have seen this movie and acting was awesome, I mean I can't describe the song 'Dola Re Dola' it made me speechless. Great acting by all actors. One of my favourite movie. Great movie by sanjay leela bhansali sir.","label":0},{"review":"This movie is gorgeous in many ways, All the actors did more than PERFECT. The songs were AMAZING, Dole re Dole still remains one of the best songs yet. \n\nIf you love this Version of Devdas I recommend watching the older version which includes one of the most talented actor ever, the one and only Dilip Kumar.","label":0},{"review":"I think This Movie have a Separate Fan Base. It Show a true love story that fill much more better than other love stories. Devdas's Love power till end in Last Breath. I Suggested it to Great & Most watched Love Story Ever.","label":0},{"review":"what could i say about this movie?\nspeechless and all.\nthe best movie ever in all category and i always love to see the cinematography and the dancing.\nthe dialogue is presented very poetic\nSanjay Leela Banshali always give us true meaning of what great indian movie looks like.\ni've seen this movie in 2002 and still watching it in 2019.","label":0},{"review":"Its a great film I should say. If I take songs these are also amazing really. And the set was brilliant. But if you watch the devdas of 1978 by dilip kumar then you will enjoy the movie more than this devdas","label":0},{"review":"This is a great movie. One of the best role played in this movie by our actors and actresses. I think second part should also come in another way according to this movie. While watching this movie i carried too much. Many days i thought about this movie only.\nThank you","label":0},{"review":"It is one of the best movies  I have seen till now .\n Srk's acting was amazing , aishwarya , madhuri dikxit at their best ... Fabulous film \nSanjay leela bansali's direction was great , songs were heart touching","label":0},{"review":"Best movie i have ever seen. I remember most of the dialogues. Pure mixture of dance drama song and emotions. In my opinion this is a flawless movie. Bollywood is proud of it.👌👍","label":0},{"review":"It's very Amazing & Epic movie!!! All lead actors do justice to their role respectively, specially Aishwarya rai & Srk's acting in this movie is outstanding...& Madhuri Dixit also played her part well, The Chemistry between Paro & n Dev is Wonderful","label":0},{"review":"just hats off.my favourite song in that film is dolare dola.lots of spins ,tuff movements ,unique steps,joyful mood,surprising effect,etc etc are there.one of the great film in hindi film industry .no words to explain the beuty of it.story line is really heart touching.it is popular in foreign countries also.it announces the luxurious feminine  beuty  of India.","label":0},{"review":"Starting from Acting, Music, Dancing to Sets, Costumes and Dialogues... Everything is best, great and captivating. It's my favourite film to date and one of the best movie in World Cinema ! ❤","label":0},{"review":"one of the master piece of Bollywood. The fabulous acting of King Khan and the awesome dance performance of Madhuri Dixit and Ashwariya Rai Bachchan. The stroy was really awesome. Hats off to you saroj chanda chattapodhay.","label":0},{"review":"Although I'm not a regular movie viewer, some movies sometimes put their souvenir which impresses the viewer like me to watch the movies recurrently....Very awful,awesome,amazing movie that touches the Heart so deeply with It's climax...Moreover, The movie is so fabulous in different ways that most of the part of the movie may reflect it’s an endless love but at some points, somebody may wonder why this & that is happening with finding no answer...All the characters executed their roles respecti ...MORE","label":0},{"review":"Although I'm not a regular movie viewer, some movies sometimes put their souvenir which impresses the viewer like me to watch the movies recurrently....Very awful,awesome,amazing movie that touches the Heart so deeply with It's climax...Moreover, The movie is so fabulous in different ways that most of the part of the movie may reflect it’s an endless love but at some points, somebody may wonder why this & that is happening with finding no answer...All the characters executed their roles respectively, Amongst all PARO & DEVDAS,Their untold love story which burnt them afterwards was really shocking & heart rending to see up to end...","label":0},{"review":"What a movie, dialogue acting music etc..nd my all time favorite srk sir..\nAishwarya nd madhuri you are done great work in this movie.\nI have seen this movie 1000 time but..\nI have never felt boring..","label":0},{"review":"The great movie in the history of  Bollywood.  Really deserve to more appreciate . I hv never see such a great movie ever . King khan . The father of Bollywood . Luv u Srk","label":0},{"review":"Such a nice movie here we can see the luxury of our country attitude posture rutba Madhuri Dixit Aishwarya Rai and Shahrukh Khan awesome actors no words for them you relieve in my heart by this movie","label":0},{"review":"Just awesome movie. Acting Emotions Dancing greatly Done By legendary actors but no one can say about the story which is from the Saratchandra  chattopadhyay Nobel Devdas..The story is fabulous","label":0},{"review":"I haven't read the book but the problem for me was the story line .Although the production was great, It's an endless and unacceptable sad story. it makes you cry for ridicules reasons. Most parts of the movie try to say it's an endless love but at some points  you wonder why this and that happens and you find no answer.","label":0},{"review":"shah rukh, aiswarya, and madhuri. thats an amazing cast! so i obviously watched it, but the story line was just so bogus. and the ending was so sad (spoiler) wen the candle snuffed out n he died.","label":0},{"review":"Its is SRK's best movie i've ever seen in my life.what an acting.....Shahrukh and Aishwarya both was very good.And Sanjay Lela Bansali you are also best.Love the movie.","label":0},{"review":"This is my favourite movie, because my favourite actresses Madhuri dixit and Aishwarya Rai is in the cast.\nThe best dance of this movie is \"Dola_Re_Dola\"... \nI like it so much..","label":0}]