[{"review":"Best of the best movies. Must watch for all....Brings life to dead, such funny movie. It has great scenes and amazing stuntful comedy with an immersive journey of the characters to find a treasure.\n\n\n\nAwesome!\nThanks","label":0},{"review":"This has to be funniest movie ever. Such a powerful and amazing writing and acting. Not a single dull scene. Specially Manav takes you to the mightiest of laughter riots of your life. Quirky,  funny,  hilarious and equally mad.","label":0},{"review":"I can just declare this movie as the best comedy movie of India. It is so good that you can't stop laughing forna single minute. I would have just watched it 100 times. Ohhhh god what a movie","label":0},{"review":"Nice funny movie style handsome and expression emotional  mention movie night core pati million direction to me that he was not aware that you will see what happens is just an automated response from your DVR and expression fighting style you can use","label":0},{"review":"I have watched this movie several times...........\nNearly 1000 times \nBest comedy movie given up by bollywood....\nI would never forget this movie in my whole life period..........\nWatched from childhood and till death","label":0},{"review":"Very good movie I have seen so far. Very well acting was done by all the actors. Comic timing was very well maintained by the actors . The movie was well directed by Indra Kumar","label":0},{"review":"Missing such comedy films these days. Each and every scene in this film will make you laugh out loud. Must watch fr comedy genre lovers.","label":0},{"review":"Best comedy movie ever watched \nIt is family movie also.no abusing or double meaning jokes  Characters are so funny. Overall this is paisa vsool muat watch 😘😘","label":0},{"review":"Best funniest movie of the Bollywood. Must watch. This is a very family friendly movie....\nI watched this movie 100s of times\nThanks","label":0},{"review":"This is the best comedy film i ever seen. All the actors done a very good job.","label":0},{"review":"funniest movie i have ever seen!!!! i have watched it almost 7-8 times... i still burst with laughter on watching this movie everytime 😁😂","label":0},{"review":"Good content with full of humour. I had watched it more than 10 times but still it is funny","label":0},{"review":"A scene by scene copy of the hollywood classic\"Its a mad mad mad mad world\".The reason the second part was a flop since it was not copied and was an anyhow script.Will see the 3rd installation from which movie they copy again.","label":0},{"review":"Very good movie sequel 1 is also better where we see the film we will forget everything and start laughing","label":0},{"review":"Very good movie. Unlimited comedy. I like this movie very much and watch again and again","label":0},{"review":"whata nice movie all actors best javed jaffery superb an up coming total dhamaal all the best to u all","label":0},{"review":"I was in college.very good comedy. All characters work is good","label":0},{"review":"This movie is amazing guys \nVery funny scenes is there in movie \nSo give the feedback","label":0},{"review":"Best Movie Ever. One of My Childhood Favorites.","label":0},{"review":"Hillarious throughout. From the beginning till end, fully fun packed...","label":0},{"review":"A very superfantabulas movie.\nMost specialized character I like in it was Javed jafri sir (manav)","label":0},{"review":"frankly speaking one of the best comedy movies from start to end","label":0},{"review":"best bollywood movie i've ever watched in my life in terms of comedy !","label":0},{"review":"I had seen this movie 50 times still I'm not bored from last 8yrs","label":0},{"review":"What a movie very interesting and comedy full movie and I like it very much","label":0}]