[{"review":"This movie taken in awesome story line, the rating has to go high, this movie speaks actual reality happening today, the actor went beyond his perfection in role, songs beat high to speak the reality, yes we need to see some section of society which went in crimes in Police custody, we need more laws and regulations which make the inequity vanish from society, its one of best movie by Bhatt Sahab, from my movie will touch 4/5 ratings, i request the people of today's world watch this awesome movi ...MORE","label":0},{"review":"This movie taken in awesome story line, the rating has to go high, this movie speaks actual reality happening today, the actor went beyond his perfection in role, songs beat high to speak the reality, yes we need to see some section of society which went in crimes in Police custody, we need more laws and regulations which make the inequity vanish from society, its one of best movie by Bhatt Sahab, from my movie will touch 4/5 ratings, i request the people of today's world watch this awesome movie.","label":0},{"review":"Sometimes movies like these come and go and we Dhoom kids miss some true cinema. Miss Bhatt's one of the best work unarguably.","label":0},{"review":"One of the best films I have seen wonder why muzzamil have not caught the attention of good filmmakers","label":0},{"review":"An underrated movie still relevant in today's time...Watch it if you like sensible movies.","label":0},{"review":"This movie needed better main actor and actress \n\nThe story line is absolutely  superb","label":0},{"review":"Some genuinely good songs in the movie! Love Anjana Dil and Kab tujhe...","label":0},{"review":"Love this movie... Really inspiring","label":0},{"review":"One of the best movie","label":0},{"review":"in love with song roya re .... literally  misssing some one badly...","label":0},{"review":"Very good movie","label":0},{"review":"This is the must watch film, it is based on reality.","label":0},{"review":"Some time I'm missing my old days) listening thus song 😢","label":0},{"review":"Nyc and amazing movie....","label":0},{"review":"Against truth","label":0}]