[{"review":"This movie is one of my favourites of all time!!\nRAJPAL YADAV is one of my favourite actors.\nHe has done many of my Favourites like De dana dan, Kushti, Bhool bhulaiya, Etc.\nHe is one of the actors who has made legends in COMEDY actor world!!\nRespect to SIR Rajpal yadav.","label":0},{"review":"Awsome film .. great. Job .all .actors. . Rampal yadav is the best. And all members. . .I watch 100 times. But. Very . Very. Excited. All time watch this movie is the best. Please make a part2 of dhol. .sir. Please make a dhol 2.","label":0},{"review":"Tushaar sir you are best in the world \nAnd songs expression fighting style good looking into a great nice movie and\nFunny movie you so great  we love you all team","label":0},{"review":"Sooooo Entertaining Movie Than Tanshree Dutta You looking Beautiful in the Movie,,,,,,,,Kunal U Always looking smart But RAJPAL YADAV is one of my favorite Actor He Is Legend of Comedy 😊","label":0},{"review":"It Is my favourite film and the roles played by the actors is very very..... Good. I request to the director priyadarshan to make the second part of the film in year 2018.","label":0},{"review":"This is one of the underrated movies. I've watched this movie many times and I still enjoy it.","label":0},{"review":"Most comedy film Bollywood can ever produce \nNo other movie can challenge this in terms of comedy in this century \nRajpal Yadav is my personal favourite","label":0},{"review":"Rajpal yadav... i think aftr Johny Lever he is the one of the finest comedian in Indian cinema... Raj sir Hats of to you...","label":0},{"review":"One of the best comedy movies of all time in bollywood...they should consider to make sequel of it!","label":0},{"review":"Best comedy movie ever. Mje to abi b hasi aari h kch scenes yaad karke 🤣🤣🤣","label":0},{"review":"One of the best comedy Movies I am never going to be get bored of this Classic.","label":0},{"review":"Awesome. Must watch clean comedy movie which will surely make u laugh.","label":0},{"review":"I think that this movie and it's actcors both are very very good, and they are very perfect for this,, i like it...","label":0},{"review":"Great film ,nice cast and hats of the writer of DHOL respect to rajpal yadav ( martand)","label":0},{"review":"You can't bored ever from this movie fabulous movie this movie is best m best movie in all bollywood movie","label":0},{"review":"It's very funny and also sad move.  I  really like it and also love it.","label":0},{"review":"Ultimate comedy....  Must watch.. Especially rajpal  yadav acting...  Laugh riot 😂😂😁","label":0},{"review":"I am very happy so your video song \nYou geusse sometime","label":0},{"review":"Ultimate movie yaar... Always love to watch...","label":0},{"review":"This movie is best in world my favorite actors in kunal Khemu","label":0},{"review":"This is pure comedy movies Raj pal yadav is outstanding","label":0},{"review":"Amazing movie rajpal yadave is amzing actor love is comedy","label":0},{"review":"#Epic Comedy Movie #Must Watch #Memories 2007 #Rajpal Yadav’s Best","label":0},{"review":"According to me a very nice movie and a must watch movie..and awesome songs","label":0},{"review":"Rajpal yadav is full of awesomeness in this movie.","label":0}]