[{"review":"Dhoom3 is outstanding movie of aami r.\nAction romance funny tragedy complete Masala...5.7 vs 5.9 height of Jodi like AKkk. \nTop class cinema..aamir proved himself as God of cinema...mr.passionate..\nGreatest dhoom3 ...nice mind blowing acting  by aamirsaab...i felt aami r in th is film has no negative role but very positive dynamic character as samarsahir khan...biggest movie star of the world aami r her plz come with thugs of hindostan Mahabharata season 4 sj. .salute is Bharatratna aamirkhan.ac ...MORE","label":0},{"review":"Dhoom3 is outstanding movie of aami r.\nAction romance funny tragedy complete Masala...5.7 vs 5.9 height of Jodi like AKkk. \nTop class cinema..aamir proved himself as God of cinema...mr.passionate..\nGreatest dhoom3 ...nice mind blowing acting  by aamirsaab...i felt aami r in th is film has no negative role but very positive dynamic character as samarsahir khan...biggest movie star of the world aami r her plz come with thugs of hindostan Mahabharata season 4 sj. .salute is Bharatratna aamirkhan.actor ko...love u sir...","label":0},{"review":"This movie is just a waste in the DHOOM series. Dhoom and Dhoom 2 are fully based on the story of cops and thieves. But this is only based on the deep life story of the thief which is rubbish and exhausting. It has no Dhoom feeling. It's no way related to the franchise. It doesn't have robberies, thefts, mind blowing plannings, good Indian feel like fun, has no original bike stunts, etc. Dhoom and Dhoom 2 were superb, they had them all. Dhoom 3 has extraordinary stunts, scenes, transformation of ...MORE","label":0},{"review":"This movie is just a waste in the DHOOM series. Dhoom and Dhoom 2 are fully based on the story of cops and thieves. But this is only based on the deep life story of the thief which is rubbish and exhausting. It has no Dhoom feeling. It's no way related to the franchise. It doesn't have robberies, thefts, mind blowing plannings, good Indian feel like fun, has no original bike stunts, etc. Dhoom and Dhoom 2 were superb, they had them all. Dhoom 3 has extraordinary stunts, scenes, transformation of bikes, futuristic features ( which are only possible in our imagination, not in real life )and most importantly it's completely based on the life of a thief which makes it unwatchable. Dhoom and dhoom 2 had dhoom feelings. I don't know why people love this movie?","label":0},{"review":"Dhoom 3 was just a one time watch. Didint really like it at all. Just too emotional and sentimental for a series suppose to be off fun and entertainment. To me Dhoom first part was the best and second part was also entertaining. But Dhoom 3 was very disappointing. Also the anti climax ruined the party completely.","label":0},{"review":"No doubt,Aamir Khan has done brilliant job in this film.But the film is a bit boring and lagging behind because of unnecessary extension till 3 hours and some of the very kiddish and funny action sequences (especially by abhishek and uday) which will make u laugh a lot.The lame jokes by uday chopra and poor acting of abhishek will give u headache.It has a weak story line which lacks entropy that was present in Dhoom 1.Dhoom 1 was far more better than Dhoom 3.But however since it is an Aamir Khan ...MORE","label":0},{"review":"No doubt,Aamir Khan has done brilliant job in this film.But the film is a bit boring and lagging behind because of unnecessary extension till 3 hours and some of the very kiddish and funny action sequences (especially by abhishek and uday) which will make u laugh a lot.The lame jokes by uday chopra and poor acting of abhishek will give u headache.It has a weak story line which lacks entropy that was present in Dhoom 1.Dhoom 1 was far more better than Dhoom 3.But however since it is an Aamir Khan movie u can watch it once just for fun and some bike thrilling action sequences.","label":0},{"review":"There are some movies that an actor does for monetary benefits, its one of those. Yrf made an offer which even a sensible actor like AK couldnt refuse. Overall it was fun watching it. An advise: drop ur brains and enjoy the show.","label":0},{"review":"Movie is great, I enjoyed the incredible actions, though there are too many effect. Thumbs up to the Director, Producer, Cinematographer etc, for a Job well done.","label":0},{"review":"Average movie but Aamir acting was brilliant &my all time fav.katrina looks beautiful and cute &did well 4r her role but a very small role in the film which I don't like but now I wanted to see her with sushant,shahid &arjun kapoor bahut hua in old seniors ke sath kam they all cross 50  except hrithik &u still 34 just don't waste ur sexy figure for them.....","label":0},{"review":"Bad thing about this movie was like there was no strong villain in this film. The twin brothers were doing anything whatever they wanted to do. But no one was protesting against them. It seemed like they were Superman. Dhoom3 had no strong villain like Don2.","label":0},{"review":"Aamir's acting skills are extraordinary..kamli was awesome 😍..story is amazing..the movie had that iconic climax.but the stunts make no sense at all..even a kid can tell that they are fake. abhishek and uday chopra's acting is below average 😑 they totally ruined the movie.","label":0},{"review":"I rarely watch Bollywood movies so  this is the best movie ever to watch. I loved the movie and it's story line, great work! 🙌","label":0},{"review":"Third class movie i had never seen before. I would like to choose another movie apart from this. Dhoom 2 starts are rock. Katrina kaif are awesome.","label":0},{"review":"This movie is mostly based on The dark knight(2008). No doubt aamir played a brilliant job and actions were also good but two special elements who made it to 5.4/10 from imdb were no doubt was officer Jay and his partner.","label":0},{"review":"It's just one time watch film with little bit no logic somewhere but aamir khan is superb as always, but dhoom 1 n 2 were forever be my favourite hritik n john was too good as villain n I don't think there is someone else like hritik roshan to play dhoom series it belongs only to him and dhoom 2 was best, love, action, romance n what else we need in a film","label":0},{"review":"Dhoom 3 is the best amongst the previous two movies.Story,Script,Music and Acting Wise. Hats off to Aamir for carrying this movie on his shoulders at this age","label":0},{"review":"I loved it too much! I don't know why people don't like it...It has suspense and everything that a perfect movie needs","label":0},{"review":"Dhoom 3 is biggest blockbuster on 2013 Abhishek & Aamir performance is outstanding in this film But dhoom series all  instalment is Dhoom & Dhoom 2 was better than Dhoom 3👌👌👌","label":0},{"review":"this has been my fav movie since I was 8 and it still is!!   ITS THE BEST MOVIES EVER","label":0},{"review":"Dhoom3 is watchable for only aamirkhan. Otherwise it will flopped. Direction is waste. Aamir unnecessary signed thugs of Hindustan of director vijay","label":0},{"review":"Worst film in dhoom series. All about bad stunts and emotions. Dhoom 1 is far better than this.","label":0},{"review":"Amir 's performance is outstanding more or less in every movie he always does exceptional performance in his acting proffesion","label":0},{"review":"Aamir Khan's acting was good as usual, Katrina Kaif was good, Abhishek Bachchan was a good cop\nBut the story line is disappointing it basically didn't live up to the standard of Dhoom 1 and 2","label":0},{"review":"Best test movie ever by Aamir has nice movies like Lagaan 3 Idiots PK Dangal Secret Superstar sarfarosh Dhoom 3 and Raja Hindustani","label":0},{"review":"Poor storyline, abrupt screenplay and average performances. This movie is nothing more than an irrelevant & unworthy attempt to cash in the success of Dhoom & Dhoom 2.","label":0},{"review":"After watching Dhoom 3 and Race 3 I just pray SRK doesn't make a Don 3 .. the number is unlucky I guess.. why Aamir and Katrina..Hritik and Aishwarya were best..","label":0},{"review":"Dhoom3 is the best action movie made in India.But has not real dhoom factor.It has no robberies only escape and Chase.They have made it almost like Tom and Jerry.","label":0}]