[{"review":"#Dobaara seems to be a sincere remake of the 2013 horror movie \"Oculus\". It is sophisticated, subtle, scary n precise, which is a very rare combination in Bollywood. There is a brother-sister jodi, their parents, a hot-looking model n an antique mirror. This mirror is responsible for the ruthless murders of its owners. It is also intelligent n knows how to protect itself. Real-life siblings, Huma n Saqib star as the reel-life brother-sister, Adil n Lisa play the parents. Director Raman extracts  ...MORE","label":0},{"review":"#Dobaara seems to be a sincere remake of the 2013 horror movie \"Oculus\". It is sophisticated, subtle, scary n precise, which is a very rare combination in Bollywood. There is a brother-sister jodi, their parents, a hot-looking model n an antique mirror. This mirror is responsible for the ruthless murders of its owners. It is also intelligent n knows how to protect itself. Real-life siblings, Huma n Saqib star as the reel-life brother-sister, Adil n Lisa play the parents. Director Raman extracts good performances from everyone. The narration keeps switching between past n present, thereby adding to the suspense. Worth watching. Rating 3/5.","label":0},{"review":"I can't understand why Indian film makers copy the HOLLYWOOD movies theme... Perhaps they don't have talent like Hollywood and can't use their own brain ...☺☺ Movie is copy of OCULUS 2013... People who are die hard fans of horror tadka should go for Hollywood to satisfy their taste... Infact Bollywood movies stand nowhere near Hollywood movies... and my  another Wonderful Advice to viewers...  If you want to watch COMEDY MOVIES then go for Bollywood HORROR MOVIES .....I will give 0/ 10","label":0},{"review":"At first the movie was going okay but later I couldn't get what was going in the movie. Someone standing here went somewhere else  I could not understand whether I was watching a movie or I was dreaming. Absolute rubbish. One of the worst movies I have ever seen. It does not even deserves 0/10. This is the result of making a remake of a Hollywood movie in Bollywood style. One of my worst experience.","label":0},{"review":"Songs are good and the movie is also nice for those who want to look for horror movies","label":0},{"review":"Let me watch it once again...er...I mean Dobaraa then will give you my views;)","label":0},{"review":"i think the production team of this should not tell that it is an adaption of another film then the movie looks great","label":0},{"review":"Plot isn't that good. If you like horror movies then go for it.","label":0},{"review":"I love the music. Speacially Ab raat in female voice.","label":0},{"review":"You should watch the original movie oculus this Bollywood remake has ruined the movie.","label":0},{"review":"Fabulous songs and movie.","label":0}]