[{"review":"Adapted from Malayalam film, Razzaq's,'Perumazhakalam' ( Monsoon season ), this beautifully shot movie is set with arid & beautiful Rajasthan as the backdrop .\nZeenat (Gul Panag) , a self-reliant Muslim lady , travels from Himachal Pradesh to Rajasthan on a desperate mission to get Meera ( Ayesha Takia ) a cloistered Hindu haveli bahu, to sign a 'maafinaama' that will stay her husband's execution in the Middle East .\n\nZeenat is so tranquil that her composure belies her precarious situation while ...MORE","label":0},{"review":"Adapted from Malayalam film, Razzaq's,'Perumazhakalam' ( Monsoon season ), this beautifully shot movie is set with arid & beautiful Rajasthan as the backdrop .\nZeenat (Gul Panag) , a self-reliant Muslim lady , travels from Himachal Pradesh to Rajasthan on a desperate mission to get Meera ( Ayesha Takia ) a cloistered Hindu haveli bahu, to sign a 'maafinaama' that will stay her husband's execution in the Middle East .\n\nZeenat is so tranquil that her composure belies her precarious situation while newly-widowed Meera flits around in the background of her in-laws' haveli like a fragile shadow .\n\nApart from the major themes of forgiveness , friendship & other philosophies , the most riveting one was of the dark tentacles of exploitation creeping up around a financially dependant widow , illustrated by Meera's father-in-law, Raghubir ( Girish Karnad ) , a seemingly dignified , mustachioed patriarch ; who, inspite of all his external appearances turns out to be a weak , sleazy man who secretly agrees to barter the lovely Meera to lascivious factory owner Chopra ( Nagesh Kuknoor ) for financial recompense . \n\nOne of the most arresting scenes was of Raghubir seizing Meera by her elbow ; who inspite of her vulnerability & powerlessness , calmly orders Raghubir to release her arm , since she'd granted only his son ( her dead husband ) the right to touch her & not Raghubir .\n\nApart from Ayesha Takia's fragile-as-dried-petals & yet incorruptible & hard-as-crystal portrayal of Meera & Gul Panag's self - reliant yet vulnerable grace of Zeenat ; other notable roles are \nrendered by Uttara Baokar ( Dadima ) & Shreyas Talpade, a charming, petty thief who accompanies Zeenat on her journey .\n\nA poetic & moving film.","label":0},{"review":"Dor- aptly justified by the content of the film. The story revolves around the core theme that One has to rise among all odds take the \"dor\" of one's life coz life can't go on like in utter despair forever. There would be hurdles to cross to ,to be bumped again & again doing what one pleases as Zeenat says u have get ready to face the consequences of ur decision as the power to take decision comes with a conditions but at least u would be following ur heart.\nThe mesmerising backdrop of Rajasthan ...MORE","label":0},{"review":"Dor- aptly justified by the content of the film. The story revolves around the core theme that One has to rise among all odds take the \"dor\" of one's life coz life can't go on like in utter despair forever. There would be hurdles to cross to ,to be bumped again & again doing what one pleases as Zeenat says u have get ready to face the consequences of ur decision as the power to take decision comes with a conditions but at least u would be following ur heart.\nThe mesmerising backdrop of Rajasthan has put class to the story line.\nThe melancholy satire on the way the society functions just as the society demands to be ,deciding everyone's life like a catapult throwing from one corner to another as it wishes. Life is too short for such narrow concerns & following the heart can only lead to satiation of one's existence.\nThe last scene was truly touching when meera catches the train along with Zeenat portrayed that living a life where u r not happy is worthless better to throw that away & begin afresh coz life dor  should be in ur own hands not expecting a \"farista\" to come & change everything.. That is I believe why God has provided a brain for...Let the perception of society go to hell, at the end of the day what really matters is the happiness of one's own soul.","label":0},{"review":"This is the best movie. It potrays a lovely friendship between two ladies with great innocence. The traditional cultural atmosphere of rajasthan created in this movie alongside the parched lands of rajasthan is mesmerising. The lonely temple far away from the havelis somewhere between the sand dunes where the two friends mingles fills the viewer's heart with great joy and peace at the same time.","label":0},{"review":"This film is awesome. There is only one condition to watch, it is when you are feeling low, depressed and do not know what to do next. Just watch this movie. It will fill you with hope to move forward with momentum. Especially the song, \"Yeah Hosla kaise jhuke..\". It is my perception of this film.","label":0},{"review":"Awesome movie...just wondering why I took so many years to experience this gem kind of movie. Gul panag was mind blowing...Ayesha takia n shreyas talpade were also good...last scene was just lovely...Goosebumps 👌👌👌 Great movie...n 'Ye hosla' song 👏👌","label":0},{"review":"The ending is fantastic , after watching  this movie it laid me down in thought how beautiful it would be to suddenly get a friendship  like this as it shown  btwn the two girls and its a great msg to our society plzzz give freedom to girls if every family is like that widows family this world would have change and freedom to all the widows","label":0},{"review":"One of the best movie I have ever seen.The work of each and every cast in this movie is phenomenal. The cinematography ,the screenplay all the things in this film makes u to drown into the stream of positive vibes.","label":0},{"review":"Lovely movie by Nagesh once gain .It shows the awesome relationship between two woman,greater than any religion.a woman can only understand the problem of another n great song yeh honsla by amanat ali","label":0},{"review":"This is an excellent movie. Have some messages and thought provoking ideas. Great to watch. Film Montaz is very touchy and shots are outstanding.","label":0},{"review":"Although it starts with a little bit of no go but the story picks up with u with a most mesmerising crescendo. Beautiful movie with a forceful message regarding the forgiveness. I would have titled it as such.","label":0},{"review":"Absolutely loved the movie. That's a know how for women to take a flight for their own upheaval. Amazing plot that transcends the reality onto screen.","label":0},{"review":"' Dor 'is a movie which is narrative between two states of India, namely Himachal Pradesh and Rajasthan. It depicts the traditions regarding the widow after the death of her husband. But a Muslim woman, Zinat awakes from the traditional status of women. She crosses the home boudries of family and their society.","label":0},{"review":"Remake of Malayalam movie \"Perumazhakkaalam\" (released in 2004) ..Just like the Malayalam film, this one is also beautifully made.. The story is very sensitive and highly touching..","label":0},{"review":"Real Gem of Bollywood.Must watch this movie.At the end you change your mindset forever.Everything is possible with love faith and friendship,Loved this movie😘😍","label":0},{"review":"Dor is one of the best movies I have seen in Theatre. \nAnd What a Great Music by Suleman brothers.","label":0},{"review":"It's a very impressive movie which shows friendship between two women's who belongs to two  different regionals and shows humanity. ...","label":0},{"review":"It was beautiful and emotional 👌👌star performance was brilliant.last seen of the movie was amazing 👏👏","label":0},{"review":"Such a piece of Art and strong content...i can never forget my experience of watching this Gem.","label":0},{"review":"..no words from my side...If this forgiveness starts happening in My Nationa..My India will be the world leader.\nEven Quran ranks the FORGIVERS the HIGHEST RANK.","label":0},{"review":"A meaningful movie with great story and out standing performance by all characters.","label":0},{"review":"got a nice feedback from friend that it is a most imotional movie.   its a must watch","label":0},{"review":"Really a great movie with a depiction of life of a indian rural women","label":0},{"review":"A must watch , sensitive movie.Superb acting by all characters.","label":0},{"review":"My most favorite movie of all time, all languages, all genres.. ❤❤❤❤","label":0},{"review":"Excellent movie.The content is really heart touching.","label":0}]