[{"review":"True friendship never die. That the film says. Ek saccha dost apne dost ke jaan bhi de deha hai. Yehi hai yeh kahani. Akshay and bobby both plays the true friendship character. They are very good friend. They do anything to make each other happy. The  script was bit old. But truly to say in acting wise and a friendship story wise i personally love this movie. Sach mein aaj kl aise dost nehi milta.","label":0},{"review":"This is literally the best movie about friendship. It shows the importance of a friend. It’s really emotional and the best part is that there are good songs in it. I recommend it for other people.","label":0},{"review":"True friendship multiplies the good in life and divides its evils. Strive to have friends, for life without friends is like life on a desert island… to find one real friend in a lifetime is good fortune; to keep him is a blessing","label":0},{"review":"Mutual Understanding is too Good in between both friends, both are Supportive each others, Memorable Movie, I have seen this movie 20 times in 1 Year. Lovely Superb yaar","label":0},{"review":"My daughter says she wishes 2 be in such a beautiful movie which is indeed directed beautifully. The best film of her life.","label":0},{"review":"It is favorite movie bcoz this film is totally belonged to frnd n love......I lv this film very much....I have  many frnds bt one frnd is very close to me.... She far away from me.... Bt our frndship never broken.... True frnd n true never ends..... I believe that.....","label":0},{"review":"We can get good and new friends. I dedicate song yeh dosti to my friend Sarang mende","label":0},{"review":"I loved this film.It tells us the true meaning of friendship and friends care for each other","label":0},{"review":"I love this film. True friendship.. Both friends each other... So love him","label":0},{"review":"Very emotional movie.....  in 2nd half part one just keep on crying.... At the same very nice movie","label":0},{"review":"Friendship is the part of life and it  helpful in life at every event of difficulties and sorrows.","label":0},{"review":"akshay  kumar i love your dosti movie and i love you \nmy name is nazia zadran","label":0},{"review":"It's my favorite movie. I love this movie","label":0},{"review":"It is so amazing movie \nThis is true of love and friendship","label":0},{"review":"Very very very very very Nice movie fantastic story behad ache song so Beautiful actor . Actoress","label":0},{"review":"Best friendship never die, best friend always lived in the heart","label":0},{"review":"Very very good movie\nOne of the best movie on friendship","label":0},{"review":"Wow what a film! This film  impressed me,outstanding story","label":0},{"review":"Nice movie of this my FB. Twitter . Instagram All friends,","label":0},{"review":"Very nice movie 🙂it's touch my heart","label":0},{"review":"Heart touching movie .i like this film nice movie","label":0},{"review":"Nice movie  dosti ke liye best movie h bilkul osm movie h","label":0},{"review":"I like this movie allot...it's story is very nice","label":0},{"review":"Nice movie specially for our friendship relation","label":0},{"review":"🌷🌷🌲. A Good Film, -( a.khanna. ) \" DOSTI :Friends movie,","label":0}]