[{"review":"Another Direct lift from Hollywood!\nTony Scott directed 'Man on fire'(2004) which starred Denzel Washington in lead role supported by Christopher Walken, Radha Mitchell, Dakota fanning and Mickey Rourke.\nApoorva lakhiya directed our Hindi version with legendary megastar Amitabh Bachchan reprising Washington's part. Arjun Rampal got the Walken's part though in the Hollywood's version Walken's character was a nice guy and in ours version Rampal's character was the mastermind behind the girl's kidn ...MORE","label":0},{"review":"Another Direct lift from Hollywood!\nTony Scott directed 'Man on fire'(2004) which starred Denzel Washington in lead role supported by Christopher Walken, Radha Mitchell, Dakota fanning and Mickey Rourke.\nApoorva lakhiya directed our Hindi version with legendary megastar Amitabh Bachchan reprising Washington's part. Arjun Rampal got the Walken's part though in the Hollywood's version Walken's character was a nice guy and in ours version Rampal's character was the mastermind behind the girl's kidnapping.\nThough lakhiya made a very good watchable movie which I personally liked very much. Arjun Rampal was quite good as a nice guy and in the climax when we find him the mastermind bad guy even he was better than Mr. Bachchan for few minutes before his death!\nAnother change that director Apoorva lakhiya did was saving the lead character : in the original version Denzel's character dies of his gun wound but our hero survives.\nOverall it is a decent good movie for a single watch!","label":0},{"review":"it is a superb tight actionpacked thriller movie having the legendary superstar Amitabh bachchan's no nonsense acting. it keeps you stuck to your seat till the end. just watch it & you would definitely fall in love with               mr. bachchan.","label":0},{"review":"Mr Bachchan and Mr rampal are always perfect.  So both of them deserved a better script.  Storyline was average but a truly poor script damaged the movie.  Action sequences are well built.  So is the casting.  But the director had to work harder on the script.","label":0},{"review":"I don't Know what made People not to watch the movie but it's n awesome.. great thriller movie.. its a must watch..\n\nYoung or Old for sure all women will fall for Mr. Bachchan's styling..","label":0},{"review":"Superb Acting by Bachan Sir and Arjun Rampal really liked the movie !! U can watch it for onetime go as suspense in the last will leave u thrilled ..","label":0},{"review":"One of my favourite movie. Amitabh's best look. Ism action thriller suspense movie. Loved it","label":0},{"review":"Amitabh bachhan ji is Always a A legend.So no doubt About this movie ,What a action...And dialogues fantastic..Arjun Rampal ji is a great actor too.....","label":0},{"review":"It is an action-thriller movie, with Amitabh in leading role. Story, Direction & acting...all are superb. Worth watching it","label":0},{"review":"Few years ago I saw this movie and I recently saw Baghi 2.\nThere is no comparison between these.\nBig bea is just awesome. !!!","label":0},{"review":"Amazing movie!! \nSuperb acting by entire cast especially Shri Amitabh Bachchan Sir!","label":0},{"review":"It's a copy of Hollywood movie Man on Fire. Big B did the role of Denzel Washington.","label":0},{"review":"Why to lift straight from Hollywood?\nAre u running short of scripts\nKab tak copy karoge???","label":0},{"review":"One of mine favorite!!!","label":0},{"review":"Amitabhji always great","label":0}]