[{"review":"The mystery movie starts with a typical Indian girl named Sarika played by Urmila Mathondkar learning to live an independent lifestyle in Mumbai city. Everything is in tune in her life until her new boyfriend Karan, played by Saif Ali Khan calls her asking to host his newly arrived friend.\n\nThroughout the first half of the movie, Sarika hopelessly fails to recognise the truth. After realising being a victim to the trap, it gets interesting to witness the personal growth of the female protagonist ...MORE","label":0},{"review":"The mystery movie starts with a typical Indian girl named Sarika played by Urmila Mathondkar learning to live an independent lifestyle in Mumbai city. Everything is in tune in her life until her new boyfriend Karan, played by Saif Ali Khan calls her asking to host his newly arrived friend.\n\nThroughout the first half of the movie, Sarika hopelessly fails to recognise the truth. After realising being a victim to the trap, it gets interesting to witness the personal growth of the female protagonist, a simple dutiful girl who is now planning to avenge in hunger.\n\nThe movie is a head of its time representing a strong female lead. Accompanied by smart camera transition techniques, it made the story telling(cinematography) creative and exciting. However, few scenes were just dull and unrealistic. Nevertheless, the movie deserves a better rating; it is a thought provoking story for an early 2000s movie.\n\nThe ending isn't the happiest, so I recommend this movie to those who are in the mood to enjoy a two hour thrill of ex couple revenging.","label":0},{"review":"A decent movie with some usual not-possible scenarios but overall enjoyable movie. Very surprising but finally delighted to see a movie in which the hero does not have to be a good guy all the time. Focus is on the heroine and well done. This and NH10 were two of truly great movies focusing on the heroine.","label":0},{"review":"Edge of the seat excitement. Never knew we could hate nice guy saifu as much as we did in this movie. Rooted for Urmi all the way thru.a masterpiece.","label":0},{"review":"Well worth a watch\nSome nailbiting moments, Urmila is a smooth actor, she leads up to a suitably grisly ending. Yes, absolutely, Ek Hasina Thi. Saif makes for a glossy villain, notching up his acting chops in the film.","label":0},{"review":"Loved this movie, well ahead of its times on concept on female vigilante. The female lead avenges her oppressor by leaving him in a remote cave with mice.\nOne of the under rated movie.","label":0},{"review":"Nice.  Enjoyed. Urmila is so beautiful.  All actors did justice to the story.  Recommending o my daughter in the USA. 👍👌","label":0},{"review":"Most of the movie is a combination of extremely unlikely events. Nevertheless, overall it's a great movie. Urmila and Saif have given a brilliant performance","label":0},{"review":"Awesome movie\nTwists & turns\nUrmila shone as innocent girl becoming tough\nSaif act was 2 good\nGreat thriller","label":0},{"review":"A dark revenge story... Great work by Sriram Raghavan... Hat's off ...\nUrmila's performance was superb...","label":0},{"review":"Thoroughly enjoyed this movie.Superb acting by Saif and urmil.The suspended lingers till the end.","label":0},{"review":"Awesome movie. Must must must watch. Rasika Joshi and Urmila steals the show.","label":0},{"review":"This movie was so ahead of its time....Well directed...Great plot...Amazimg screenplay...Epic performances","label":0},{"review":"Excellent performance of saif ali,urmila,great performance of other artists,salute to ramgopal verma.","label":0},{"review":"A movie of that decade , super and it is way ahead of its time.","label":0},{"review":"Amazing acting by Urmilla.\n\nShe takes you in an emotional ride","label":0},{"review":"Excellent movie. \nSaif stylish","label":0},{"review":"Awesome stellar powerhouse performance by urmila ...Great direction by  sriram raghwan...👌👌","label":0},{"review":"One of the classic movies I've ever seen in bollywood.","label":0},{"review":"Started off like any boy meets girl film and then........edge of the seat all the way. 👍🏼","label":0},{"review":"Top class movie. Must watch","label":0},{"review":"Great movie 💗 urmila is best","label":0},{"review":"Greatest Indian movie on women empowerment ever !!!!!!!!!!","label":0},{"review":"Jabardast movie Urmila best in film","label":0},{"review":"Good  unique","label":0},{"review":"Best movie of Urmila Matondkar..","label":0}]