[{"review":"Honesty loved the first part of the movie it was one of the best I had ever seen and then came the second honestly this movie could have been a hit they totally mess up I mean ok why dint they develop a better story it had so much potential even if they ended being friends after so much things happening towards the end if the movie he is like I'll marry her somehow they don't have character at all, it just doesn't make whoever wrote the scrip the ending they don't show what happened to the paren ...MORE","label":0},{"review":"Honesty loved the first part of the movie it was one of the best I had ever seen and then came the second honestly this movie could have been a hit they totally mess up I mean ok why dint they develop a better story it had so much potential even if they ended being friends after so much things happening towards the end if the movie he is like I'll marry her somehow they don't have character at all, it just doesn't make whoever wrote the scrip the ending they don't show what happened to the parents I mean why not they should have mentioned what happened to them closure is important and have no idea what the movie wanted to tell the audience 🙈","label":0},{"review":"This movie is a perfect combination of drama and comedy and i loved the part when rahul expressed his feelings to his mom and dad  but in the end there was still confusion between rahul and rihanna but rest of the movie was really nice","label":0},{"review":"My favorite movie of all time! The soundtrack is beautiful and so is the plot line of the movie! I totally ship Imran and Kareena <3","label":0},{"review":"One of my favorite movie. Sweet and simple. Big fan of Kareena always. 💕💕","label":0},{"review":"Beautiful movie...I love the last part of this movie mostly bcoz they not getting married.Their friendship is beautiful.","label":0},{"review":"One of the best rom com movie ever made strongly recommend everyone if this movie to everyone.","label":0},{"review":"This movie is about two different parenting styles in which both hero and heroine brought up....where they both have different living styles including their perspectives towards life.","label":0},{"review":"Best Romcom Movie.Camaraderie is amazing.Kareena is mind blowing as always.So is imran","label":0},{"review":"Friendship is main priority in the life not always love","label":0},{"review":"This movie was good i loved it","label":0},{"review":"Dramatic, Romantic and I loved It.","label":0},{"review":"Greatest movie ever","label":0},{"review":"This movie was very boring man","label":0},{"review":"Best indian romcom","label":0},{"review":"Boring Boring Boring","label":0},{"review":"funny story but I enjoyed","label":0},{"review":"Mast movie h Osm","label":0},{"review":"Gulnaaz Hello","label":0},{"review":"haven,t seen it.","label":0}]