[{"review":"Sridevi is truely a superstar. She was such a versatile actor that no matter what role was presented to her , she did it in her own beautiful way. This film , like every other Srideiv's film is unique in its own way and also one of my favourites.\nThe movie is very thought provoking and leaves and impact on how we treat our mothers at home or what and how much respect do we pay to housewives. The story also has a touch of inspiration in the way Shashi (Sridevi) is determined to learn english but  ...MORE","label":0},{"review":"Sridevi is truely a superstar. She was such a versatile actor that no matter what role was presented to her , she did it in her own beautiful way. This film , like every other Srideiv's film is unique in its own way and also one of my favourites.\nThe movie is very thought provoking and leaves and impact on how we treat our mothers at home or what and how much respect do we pay to housewives. The story also has a touch of inspiration in the way Shashi (Sridevi) is determined to learn english but there is also a true motherly touch at the same time that more than anything else, her family is above all for her. \nAll the charachters have performed so well that it left a smile on my face.\nLastly , I would to recommend this film to all the people who enjoy watching such sweet and simple films.","label":0},{"review":"This movie is sheer perfection. It captures one of the best performances of the great actress- Sridevi ji. She will always be remembered for this film. Gauri Shinde has done a remarkable job! Thank you for such a motivational and light hearted movie ma'am. I have watched this movie many times  and can watch it for dozens more! I  would recommend this movie to each and every person out there <3","label":0},{"review":"This movie is great in every department be it acting, music, direction, message . The acting of whole cast is fabulous and there doesn't feel anything that is done extra or done less. The music is great , credit to Amit Trivedi for creating such great music. Sridevi's will to learn English gives a powerful message that we should work very hard to achieve our goals and be ultimately successful. I have watched about a dozen times and can watch it about a dozen times more , such family movies are a ...MORE","label":0},{"review":"This movie is great in every department be it acting, music, direction, message . The acting of whole cast is fabulous and there doesn't feel anything that is done extra or done less. The music is great , credit to Amit Trivedi for creating such great music. Sridevi's will to learn English gives a powerful message that we should work very hard to achieve our goals and be ultimately successful. I have watched about a dozen times and can watch it about a dozen times more , such family movies are a rarity these days. Overall 10 on 10 for the movie.","label":0},{"review":"Truly a realistic cinema instead of a women oriented cinema.. Never classify movies like queen, fashion, kahani, chandini bar... and this as women oriented cinema... These are to be named as real cinemas... Movie had best story, direction,visualization and perfomances.. \nSridevi was really a superstar who is correct choice for Shashi. Her personality is apt for the role as she is very innocent.. \nThank you Gauri shinde for this movie... Mother are to be respected at home their big qualification  ...MORE","label":0},{"review":"Truly a realistic cinema instead of a women oriented cinema.. Never classify movies like queen, fashion, kahani, chandini bar... and this as women oriented cinema... These are to be named as real cinemas... Movie had best story, direction,visualization and perfomances.. \nSridevi was really a superstar who is correct choice for Shashi. Her personality is apt for the role as she is very innocent.. \nThank you Gauri shinde for this movie... Mother are to be respected at home their big qualification is love.... Srideviji deserves the national award for this role","label":0},{"review":"Beautiful movie!! Sridevi does not merely act, she lives, that's how extremely talented she is. Shashi potrays every Indian middle class housewife, always working for her family without a thought of herself, her comforts, her little needs , her joys or her insecurities. It's always the family ( most often thankless and uncaring towards her, always taking her for granted). It's a thought provoking movie that everyone should see.","label":0},{"review":"ðŸ’¯ â­ï¸each time you watch this movie!\nI am sure it gonna make you smile, the screenplay is impeccable. Leave the rest to the actors each of them reminds me of my own self somewhere!\nAnd Lt. Sridevi gets honorary salute!\nHer last masterpiece of this modern era!","label":0},{"review":"I recommend this movie to everyone because of the story line and specially Sridevi and her acting. I love the story of sridevi as she is a great parent but has issues with english and by chance visit America and gets an opportunity to learn and understand English and speaks fluently too.The movie has drama,emotions,friendship and the climax is really good. I rate this movie 4.8/5.","label":0},{"review":"Shows how much effort an Indian lady has to put in to get appreciation from her own family. So nicely filmed in the great city of NY adds to the very well filmed narration of the film.\nSad that Sridevi is no more. We expected more of such performances from her.","label":0},{"review":"Sri devis acting was superb. They have given nice message that now a days English is very important because without knowing English nobody is going to give respect to us. They will call uneducated . That's why English is very important. But in last scene Sri devis English specch was fabulous. Her daughter and husband were dumb.","label":0},{"review":"Wonderful film .Sridevi was living like shasi.Such an fantastic motivational film .l love the music too ,thanks for Amit Trivedi.There are many life's in India like this.living only to take care of family but there hardwork  is not always appreciated .l hope the film will make change in that attitude.","label":0},{"review":"I love this movie very much I watch this movie on 29 jan 2012 also final of kurshetra on that day...this film inspire us .this movie we saw on tv with my family.my mother told me i am was excited to watch film becauase of shridevi ..i love her and missed her i m weitting on 28 feb 2018 at 5 pm before her funeral....missed her so much great one ...salute her.....","label":0},{"review":"After Mr India; sridevi has done it again in English vinglish.  \n\nThe movie speaks of middle aged women trying to learn English. She did brilliantly in the wedding where she was asked to give speech to the guest.\n\nIn the film , middle aged woman dates a young cook  which is hilarious.","label":0},{"review":"SRI DEVI WAS ONE OF THE MOST TALENTED AND BEAUTIFUL ACTRESS . SHE WAS INDEED A PERFECT ACTOR . WHATEVER ROLE WAS GIVEN TO HER , SHE PERFORMED IT AS IF SHE  WAS IN THE SAME SITUATION . LOVE  UH SD AND ALL UR FILMS ....... HEART CATCHING FILMS","label":0},{"review":"this movie is sooo good i honeslty loved it there are so many things to learn Gauri Shinde did a really good job this movie inspires me alot the cast is amazing, story acting ,destination all of the things were fabulous i loved this movie alot i won't stop watching this movie its been like 100 times i have watched this movie ðŸ˜ðŸ˜ðŸ˜ðŸ˜€ðŸ˜€ðŸ˜€ðŸ˜€ðŸ˜€","label":0},{"review":"I recommend this Movie to all to commemorate this great Actress as we would not see her best performance  in the New Movies henceforth, but will always cherish the ones on record. A Great Loss To Performance Lovers.","label":0},{"review":"This movie compels us to feel. The whole movie is inspiring and let you feel the essence of life. We are humans. We want to be superior and make fun of inferiority around us. \nShridevi's performance is loud enough to elucidate that inferiority can be overcome.","label":0},{"review":"This is the best movie I had ever seen. Really I recommend all to see this movie.  See the acting of Sridevi in movie then you will come to know why she is called as First Female Superstar.","label":0},{"review":"This movie is my first favourite movie I was wondering about this movie but I was thinking about sridevi  death. My wishes always my favorite actress. I hope if Sri Devi is here she will be do more work in other movie","label":0},{"review":"I want to watch it again and again , it will have you on the edge of your seat until the very end. I really admire her amazing acting, especially the expression of being hilarious , worried and being embarrassed was on her face. She played the role very well. ðŸ‘ðŸ‘ðŸ‘","label":0},{"review":"Awesome movie with a great message..\nNever loose hope..\nNever give up..\nAlways try to be the bestðŸ‘ŒðŸ‘Œ\nAgain very great movie\nMust watch","label":0},{"review":"This movie is amazing and it motivate  woman's to do what they want to do.  This movie tells them that how a woman can do anything if she decides to do it .\nSo this movie is very good","label":0},{"review":"A lovely movie telling everyone what a person can do if he/she wants to.... Sridevi ji is just amazing. Highly recommended.","label":0},{"review":"Extremely soothing film. Sridevi is awesome. She is a real superstar. She has excellent acting skills. The movie leaves a very good message. Overall a must watch film.","label":0},{"review":"Sridevi's best evergreen performance. No matter how many times you see the film,the climax is the best part of the movie and always will stand out .....Just inspires you not to give up no matter the challenges/obstacles ahead.","label":0},{"review":"Awesome movie, stunning stellar performance by sridevi ..Award winning performance.. Excellent direction & screenplay . Sound editing & mixing by Oscar winner Rosull pokutty ...Must watch it..","label":0}]