[{"review":"If you don't apply logic, this movie is fun to watch. Not a great plot though. But yes entertainment provided in a nutshell. This is a one time recommended watch.You can watch it with your family.\nWatch it for Akshay and his perfect comic timing. He is outstanding and brings down the house with his antics.\nWatch it for the great performance of Junior (Dog).\nWatch it for some good humor, cinematography, songs and great supporting casts.\nAnd last but not on the least, watch it for very sexy Tamman ...MORE","label":0},{"review":"If you don't apply logic, this movie is fun to watch. Not a great plot though. But yes entertainment provided in a nutshell. This is a one time recommended watch.You can watch it with your family.\nWatch it for Akshay and his perfect comic timing. He is outstanding and brings down the house with his antics.\nWatch it for the great performance of Junior (Dog).\nWatch it for some good humor, cinematography, songs and great supporting casts.\nAnd last but not on the least, watch it for very sexy Tammanah, who lights up the screen even when she is out of it.","label":0},{"review":"Beautiful movie depicting a love for a pet the climax is really touching.... The movie is overall an OK direction suggesting and surrounding about pets.... The acting is definitely superb but the plot could have been strengthened... At the middle of the movie it grew to be boring but the finishing was great.... As it says all's well that ends well... So it is a must watch film that gives u a good impact... I give it a 3.5/5","label":0},{"review":"Very,very beautiful! Entertainment,songs are very good! Emotional and fantastic movie! And the story is the best!I love dogs ,cats and all animals so this is my favourite movie!","label":0},{"review":"Kind of comic but good entertainer. Don't be too logical, just enjoy this fun movie with couple of really emotional scenes. Special for me because this is one of the last movie watched with my ex!!","label":0},{"review":"Best movie... I'm a Dog lover and liked this movie a lot...  Should make the part 2 please ... Everyone should watch the movie it is a fantastic movie... And the story is also 👌👍....eagerly waiting for the part 2....","label":0},{"review":"Good film. Enjoyed a lot with kids. Have watched it with kids several times.Every time it is fun ride. Songs are also good.","label":0},{"review":"Entertainment enjoy every movement with full of  entertain people and with joy fun, comedy, drama, emotions, life transform demand of character and do the best.","label":0},{"review":"Nice movie but flop just because of very high budget Akki done another fantastic job in comedy like he does my fav. Akki","label":0},{"review":"Entertainmaint is very good and emotional movie.this movie teach animal is a very good &kindly.man isn't help in sad time but animal help in this time.","label":0},{"review":"Entertainment movie is very funny and action movie and character so funny.the best funny and a action movie. Actors is so beautiful and active.","label":0},{"review":"I lvd this movie n it ws quite Crazy n entertaining film n yet this movie gives a gud msg for Pets { Specially dogs}......😘😘","label":0},{"review":"Awesome movie! 5 stars! Enjoy the comedy and emotion!","label":0},{"review":"Entertainment best movie for loving pets.\nReally amazing friendship.","label":0},{"review":"I think it was a great movie from the morality of the pets importance and bravery","label":0},{"review":"Awesome because of the love and friendship between  that dog and akhil and also the comedy was stupid 😃😃😃","label":0},{"review":"Hello \nI am santosh kumar \nMy youtube  channel\n all enterteinment \n\nMe aapka  your welcome","label":0},{"review":"This is the best.dogs are awesome.help them and secure the animal nation","label":0},{"review":"Leave your brains behind type of comedy.. Very enjoyable.","label":0},{"review":"This is the best movie I have ever seen","label":0},{"review":"I love dogs so this is my favourite movie","label":0},{"review":"The best way to have a friend like Dog 🐕🙏","label":0},{"review":"Good morning my dear friends it's good movie #","label":0},{"review":"Best comedy of JOHNY LEVER \n                             AKSHAY KUMAR","label":0},{"review":"It covers the part which we expect from a comedy movie - entertainment.","label":0},{"review":"find this post unhelpful and this movie will no longer matter to you","label":0}]