[{"review":"The movie revolves around modelling which was really brilliant.  Although it had 2 queens in it. But the fact that matters is success is not an easy task to handle. Arrogance and wrong use of your profession can even destroy your courier. Which is truly reflected in the film.  But the movie was awesome I love it especially kangana's walk on ramp and final walk by priyanka.  Really appreciated their works.❤📸","label":0},{"review":"This is a great movie ... i hv goosebumps whenever i use to watch it ... it does not matter how many tines i hv watched this movie , i never ger bored of it ... it is based on real story ... and the glamoure of fashion industry ..This film makes even those people aware about about this field who never been go through it .. Both actresses done very well in the terms of attitude and style and acting as well as .. and the other supportive actors either .. all of them together made a movie which wil ...MORE","label":0},{"review":"This is a great movie ... i hv goosebumps whenever i use to watch it ... it does not matter how many tines i hv watched this movie , i never ger bored of it ... it is based on real story ... and the glamoure of fashion industry ..This film makes even those people aware about about this field who never been go through it .. Both actresses done very well in the terms of attitude and style and acting as well as .. and the other supportive actors either .. all of them together made a movie which will be known and likely to be seen by the upcoming generations even with a same enthusiasm and a lot of eulogization ...","label":0},{"review":"Realistic movie ... Mr.Bhandarkar's one of Best ... Awesome acting by Priyanka Chopra ... Truly deserves the National Award for best actress ... \n    Three stages of modelling career.Initial, success and downpour... It's a real for all models filmstars ...","label":0},{"review":"Awesome movie. Great plot. Based on real life journey. Can be watched as many times a person wants, definitely!  A lot of values to be learnt from this amazing movie.","label":0},{"review":"I really loved the movie when I saw it for the first time. The movie is about the life of the models . Hat's off to kangana and Priyanka . They both acted superb. I loved Kangana in the dress and her attitude was superb . I really loved the movie","label":0},{"review":"It was awesome as it says the dark secrets of models which we dont really know and Madhur Bhandarkar's page 3 was also good and i knew this would also be a good movie because he is one of the good director😊👌👍","label":0},{"review":"Osm movie.... I luv this movie bcoz it's all about model life journey. I watch movie in many times...l luv uuu....priyanka chopera your acting or attitude is fabulous in this film....","label":0},{"review":"Nice shot indeed \nI salute the performance the producer and sound department as well. But the film is similar to world fashion and I don't like repeatable act","label":0},{"review":"Literally best movie every beginner and small town girls become a model to going on Mumbai should watch because this movie show realistic story","label":0},{"review":"Loved every bit of the movie. Perfectly portrayed how things work in fashion industry underneath and how the corporate world is..","label":0},{"review":"I really loved the movie when I saw it for the first time. Realistic movie. Hat's of to Priyanka. I love you pc,,,,,","label":0},{"review":"I think Priyanka is amazing i just love her so so so much .it teaches us that we should work hard to get our goal","label":0},{"review":"Brilliant movie,one of the best women centric film in Indian cinema,this movie talks about some harsh realities of fashion industry","label":0},{"review":"Kangana and Priyanka are killer actresses. I mean they are beautiful and talented. Well can't find that kind of a combo easily","label":0},{"review":"It's a nice movie . priyanka chopra and kangana ranaut acting is fantastic must watch movie.","label":0},{"review":"Amazing movie and priyanka mam such a amazing actress and acting this film  , very powerful  character in this movie","label":0},{"review":"fantastic movie .\nI'm really so impressed .I see this movie again and again .","label":0},{"review":"Movie which made me insipre last nyt...to chase my dreams again...\nIt's best....loved it...","label":0},{"review":"This I would consider one of the stepping stones in Kangana's career. Her career best","label":0},{"review":"Really i had been gone through with this situation... No words to say when ever i watch this movie it will take to there....","label":0},{"review":"a small town girl finally realise a super modal it is very nice film","label":0},{"review":"One of my favorite movie, outstanding acting by kangana and priyanka","label":0},{"review":"Osm movie pc .....supr acting for u... Priyanka Chopra mam..your a great actress.....so cute mam","label":0},{"review":"I haven't seen the movie but love the song jalwa","label":0},{"review":"I love this movie.....love u pc\nU r always best performance","label":0}]