[{"review":"It is an amazing movie... just at some points viewer might feel a little dragged but then again in some minutes it catches again.\nBoth characters are strong and well defined. Story is a simple grounded no so romantic bit super practical one, which actually lured me more towards \"Fidaa\". Its unlike any random bollywood and vwry simple film, it has no extra masala making it too sorted to digest as a very practical story. I am sure many from new gen will love it's simplicity and would enjoy and che ...MORE","label":0},{"review":"It is an amazing movie... just at some points viewer might feel a little dragged but then again in some minutes it catches again.\nBoth characters are strong and well defined. Story is a simple grounded no so romantic bit super practical one, which actually lured me more towards \"Fidaa\". Its unlike any random bollywood and vwry simple film, it has no extra masala making it too sorted to digest as a very practical story. I am sure many from new gen will love it's simplicity and would enjoy and cherish watching it atleast once. Take away is a very simple message of life - Love is beyond everything and you don't need to live with already set outlines for married couple.","label":0},{"review":"The highlight of this film must surely be the screenplay written by director Shekar Kammula himself. That special Telugu dialect of the people of Telangana is seen in every frame beautifully crafted and directed by him. People still recite the punch lines even months since the film became a hit.\n\nAnd of course the lead performers Varun Tej and Sai Pallavi. Varun is gifted and underplays his role on purpose. \n\nAs for Sai Pallavi she is at her best as anyone can ever be. This magnificently beautif ...MORE","label":0},{"review":"The highlight of this film must surely be the screenplay written by director Shekar Kammula himself. That special Telugu dialect of the people of Telangana is seen in every frame beautifully crafted and directed by him. People still recite the punch lines even months since the film became a hit.\n\nAnd of course the lead performers Varun Tej and Sai Pallavi. Varun is gifted and underplays his role on purpose. \n\nAs for Sai Pallavi she is at her best as anyone can ever be. This magnificently beautiful and talented chit of a girl has won the hearts of people everywhere for her sterling performance in this film. She has that bubbling effervescent presence and special tone in her voice that will mesmerize both young and old. She has become so much of the character Bhanumathi from the film that people address her as ‘Bhanu’ even in real life now. Her graceful movements during the dance sequences must be the envy of every dancer in town. \nWith hardly any makeup throughout the film, Sai Pallavi brings that element of realism that is so needed for the character to be believed. We laugh when she recites those punch lines with devastating effect and we cannot but help root deeply for her when she cries. She has become something of a sweetheart, sister and daughter for all of us.\n\nCongrats to the makers of this glorious film.","label":0},{"review":"A lovely tale of two individuals completely opposite to each other finding their way out in love. The performance of Sai pallavi and Varun Tej is phenomenal. This movie has that lovely vibe where you are able to experience sadness, happiness and mixed emotions all at the same time. Shekhar Kammula sir is a hero in terms of narration of the plot. Being a person who's not well versed with Telugu I still felt the magic of story and could guarantee it's such a lovely tale of love. A must watch ❤️❤️.","label":0},{"review":"Fidaa ( Malayalam dubbed)\nYear-2016\nCast- Varun tej,Sai pallavi\nGentre-Drama,Romance\n\nComing to the review\nWe all know that Fidaa became blockbuster in Telugu language.But there is no such scope about that when it release in Malayalam.The movie is very simple.It only gives another face of love.The first half goes very beautifully with a small stunt and songs.As the songs are dubbed,it's not very good to listen.The dance of Sai pallavi made the songs entertained.The first half goes very fastly.Co ...MORE","label":0},{"review":"Fidaa ( Malayalam dubbed)\nYear-2016\nCast- Varun tej,Sai pallavi\nGentre-Drama,Romance\n\nComing to the review\nWe all know that Fidaa became blockbuster in Telugu language.But there is no such scope about that when it release in Malayalam.The movie is very simple.It only gives another face of love.The first half goes very beautifully with a small stunt and songs.As the songs are dubbed,it's not very good to listen.The dance of Sai pallavi made the songs entertained.The first half goes very fastly.Coming to the second half,after 15-20 mins,the film is lagging as it has no story buildup and the viewers can understand what happens in a romantic movie.The climax is not up to a level.Just watch for sai's character.There's nothing but as it is a Telugu movie,the viewers of that states can enjoy because of another concept.\n\nPositives- Sai pallavi made the film entertainer (little).The first half is better.As it is a telugu movie,they used a good logic story.\n\nNegatives-The film lacks because we all know what happens next.Climax makes me non-satisfied,as the movie don't gives an emotion @ last.\n\nOverall,if you want to watch a romantic movie and if u are a Sai pallavi lover,just watch 1 time.\n\nMy rating is 2/5","label":0},{"review":"Beautiful romantic drama which is a perfect example of why teleugu film industry is miles ahead of others in terms of content ..Fresh casting,great writing,melodious music and great direction..will not be surprised if it gets remade or free made by Urduwood. This movie has one of the best female lead roles in recent memory .\nShekhar kammula brought back memories of Anand and Godavari with this one..with a strong independent female lead and real idealistic Male lead..Unmissable!","label":0},{"review":"One of the major features of the film is the different dialects of Andhra Pradesh and Telangana mouthed by the characters. In that sense, director Shekhar Kammula seems to have tried to bring about an integration of sorts between the people of the two regions using cinema as a medium. Sai Pallavi’s dialogues come across as unique and also high on wit. But her characterisation is reminiscent of Kamalini Mukherjee’s character in ‘Anand’ — her attire, independent streak of mind, dancing in the rain ...MORE","label":0},{"review":"One of the major features of the film is the different dialects of Andhra Pradesh and Telangana mouthed by the characters. In that sense, director Shekhar Kammula seems to have tried to bring about an integration of sorts between the people of the two regions using cinema as a medium. Sai Pallavi’s dialogues come across as unique and also high on wit. But her characterisation is reminiscent of Kamalini Mukherjee’s character in ‘Anand’ — her attire, independent streak of mind, dancing in the rain etc. She does a great job as Bhanu and carries the film on her shoulders.","label":0},{"review":"Fall in love with the character \"Bhanu\".Want to meet her one day.I think, after watching the movie  many bachelor will rethink about their future wife.After a long time I have seen a love story like this.Director had portrayed all the characters really well. As I saw the Hindi dubbed version so songs were missing.Wish to watch the movie with all songs.Last but not the least,the background score is really match with pace of the movie.I would recommend this movie for the couple who fall in love an ...MORE","label":0},{"review":"Fall in love with the character \"Bhanu\".Want to meet her one day.I think, after watching the movie  many bachelor will rethink about their future wife.After a long time I have seen a love story like this.Director had portrayed all the characters really well. As I saw the Hindi dubbed version so songs were missing.Wish to watch the movie with all songs.Last but not the least,the background score is really match with pace of the movie.I would recommend this movie for the couple who fall in love and separated.Out of 5 I will give 3.5 to this movie.","label":0},{"review":"This is my favourite movie. Fortunately, I watched the Telugu version first. The story, characters, scenes and songs all are amazing. Thanks to Fidaa team for making this wonderful movie. Unfortunately in Hindi version the real flavour of the movie is missing and songs are also cut. All my 3 favourites are in this movie, first the movie itself, second Osupodu song and third one Sai Pallavi.","label":0},{"review":"A wonderfully fresh take on male - female relationship. The film very subtlely suggests that love and being a good human is above all man- made norms. The female lead is a very strong character that every tomboy girl can identify with, and the happy ending is truly happy unlike the stereotypical expected end","label":0},{"review":"This movie is bad. Why was there so much hype around it?  There is nothing new. The first half is such a drag!  Can't talk about the second half coz after a point i was done with the movie and stopped! \nThis isn't what a 90 crore grosser ought to be like. There are far more well made and interesting films made in malayalam. Other industries simply keep selling  the same old wine in a new bottle,  sometimes the same old bottle. Seriously learn something from Malayalam industry!","label":0},{"review":"Avarage movie overall ratings is 3 infact it's just a normal movie with just more common sense. One thing cinematography is good . But story is a common track ,u won't find anything new, but if u r senti guy inside yes it may touch u. Don't expect anything specific nd special it's kind of a simple family drama where any one can guess next scence.","label":0},{"review":"Simple n neat love story. Practical story which is beautifully depicted.\n\nLag inbetween is because of practical. \n\nVarun's love for Sai pallvai n her anger towards him, everything is beautiful n practical. \n\nWish to watch it again and again. Lovely movie.","label":0},{"review":"It's a beautiful love story... I liked the movie very much.... I saw negative comments.. actually guys the movie clearly says it's a love story, then wat else you guys are expecting.. but actually you have  all the rights to give your opinion...but I don't know y people are expecting more action and thriller and more defining ending.....","label":0},{"review":"A refreshingly portrayed simple love story. Shrkar Kamula once again proved his strong zone. Sai Pallavi nailed the movie. The flavour of language wins heart. Nice movie, I strongly recommend this movie to watch. I will give 3 on 5.","label":0},{"review":"It's a good movie 😊 to watch .\nFidaa is a good village love story to watch.\nIt just tells that the prince always doesn't take the princess with him but remains with her.\nGood movie from 2nd half","label":0},{"review":"such a lovely movie. it is really nice but i feel that this one is very lengthy. their acts r awesome. i love both hero and heroine. nice time to watch this film was during rain","label":0},{"review":"It is an awesome movie I have seen.I really loved the love between varun and Sai pallavi.Family relationships were shown very expressively.Love and affection between sisters was the first most thing I loved.Songs played  the marvellous role in the movie.......Of the whole,judgement can be given as movie is excellent.I loved varun's love on pallavi a lot.","label":0},{"review":"I cannot express but Something is very Unique & Different in this Film. After watching this Movie I Always visualize Regarding to this movie! I didn't understand that why i was Much Much Much Like that Film.\nIt is Superior. ❤","label":0},{"review":"Fabulous Movie. I just watch the Hindi dubbed. What a fabulous performance by every actor. I just can't able to remove my mind from Sai Pallavi and Varun Tej's Role. Just Wow.","label":0},{"review":"Chemistry between Varun and Pallavi has worked out. One of the biggest hits in Varun's career and will be remembered for a lifetime. Sai Pallavi is not so gorgeous as she was portrayed as a middle-class Agricultural Scientist. The plot was good so was the story and Shekar Kammula has given a BlockBuster after Happy Days.","label":0},{"review":"It is nice family movie whenever it's coming on my television I just can't stop my self to see this movie .\nThe cast has done it so well that if the movie is shown to anyone in the world even in telegu they will not be able to understand the language and feelings but could definitely understand the feeling.","label":0},{"review":"It is a very good love story and very good movie to seeing.\n    \n\n    Sai pallavi,her acting was very excellent.. \nGood movie and good songs.. Hey pillagada this song was very popular and one of the debut song of sai pallavi.","label":0},{"review":"Very very too good . heart touching. sai pallavi's acting & dancing lovely. In this flim two songs i like very much just awsome. The song \" HEY PILLAGAADA\" beautiful awsome.","label":0},{"review":"Excellent movie to watch.. Nice story.. Songs... And role played by both actors are damn good.. \nI am just requesting you to dubbed this. Movie in Hindi language or with subtitles.. Because I understand Telugu language  little bit only....","label":0},{"review":"So lovely move ...\nSuper\nSuper\nFidaa move is super duper hit 10 star's\nFidaa I hv seen Mr then 10 tms\nPlease see ths lovely move OK friends\nThs so spcl fr me friends \nHindi films sa 100% ache hai","label":0}]