[{"review":"Be a Fantasy..but it is ideal for a true Honest COP. Somehow the Movie Fights are best and we believe such intense fights 💪 are truly inspiring.Only difference between Baby of Akshay Kumar & FORCE is Baby is intelligent plot. But I rate these movie a high score bcoz it's concept is right and Fights sequence are the  best","label":0},{"review":"Really really awesome.Vidyut Jamwal has performed excellent as an badass villain genelia also acted very well. Action scenes in this moVie are top notch.Background music is excellent. You just can't miss this movie. Watch it for Vidyut and John.","label":0},{"review":"Definitely an underrated film! Bollywood needs more such sensible movies... I don’t understand the fact that films like kick score great victories at box office and such an amazing film earns a mere 90 cr. \n6.4 imdB rating.. such shame","label":0},{"review":"An underrated film in terms of performance and intensity. May be a better message could have been conveyed through this, but definitely a brilliant film. Deserved good ratings","label":0},{"review":"Well John Abraham vishwa and niyati pankaj and Harsha liked u but I don't like u at all ur kata phata face . Ok don't show or make ur advertisement in my house.i don't like ur kata phata face. This comment is exactly done by shtrughna Sinha. He enlightened me","label":0},{"review":"Really awesome.  All actors were so awesome. John, vidhyut, jenelia and other.  \n\nFilms needs villains like vidhyut jemwal","label":0},{"review":"Imdb should rest in peace after giving such ratings to this movie ..by far the best action movie .. loved it 😘😘","label":0},{"review":"It's complete copy of Telugu film. Gharshana in which venkatesh is the hero and asin is the heroine.. And in this \"force \" one song tune is exactly that of Telugu film Munna in which prabhas is the hero","label":0},{"review":"One of my favourite movie. Vidyut Jamwal changed the definition of a villain in Bollywood","label":0},{"review":"It touches two factor- love & action ...and Indian's love these factors","label":0},{"review":"One of the best action thriller in the recent times","label":0},{"review":"V nyc movie and one of my favourite","label":0},{"review":"This movie is remake of Telugu film GHARSHANA..! Great movie..","label":0},{"review":"Simply UNDERRATED! IMDb ratings lol. Critics need to grow up. ..","label":0},{"review":"What a movie....\nNo actor can do such actions and thrills that john abraham can do..","label":0},{"review":"Awesome movie love it","label":0},{"review":"best action movie out there","label":0},{"review":"Awesome movie","label":0},{"review":"Nice movie strong action movie","label":0},{"review":"Favourite movie","label":0},{"review":"Amazing movie","label":0},{"review":"So nice movie my favourite John Abraham","label":0},{"review":"Very good music","label":0},{"review":"Very good movie","label":0},{"review":"a real action movie not like some super human action in most of indian movie","label":0}]