[{"review":"I normally don't watch latest Hindi movies especially because of the ongoing trend of remakes and remixes--which are honestly an insult to original movies and songs!\nAfter a lot of contemplation I recently watched Fukhrey online. This was such a refreshing movie. I totally loved it!\nThe plot was original and the performances were topnotch! What a talented bunch of actors! Honey & Choocha are realistic characters-you definitely find such slackers somewhere in every family! Lali and Panditji were  ...MORE","label":0},{"review":"I normally don't watch latest Hindi movies especially because of the ongoing trend of remakes and remixes--which are honestly an insult to original movies and songs!\nAfter a lot of contemplation I recently watched Fukhrey online. This was such a refreshing movie. I totally loved it!\nThe plot was original and the performances were topnotch! What a talented bunch of actors! Honey & Choocha are realistic characters-you definitely find such slackers somewhere in every family! Lali and Panditji were also so real!\nSuch actors deserve more work and recognition. Hindi film industry should stop going after the inhouse star kids brigade with their  limited talent and give these powerhouse performers some serious opportunities!","label":0},{"review":"It's an excellent movie giving realtime portrait of youth those times in 2013s...\nHonny a character well justified by actor with hand in hand co artist Choocha - Heyy Choocha , yeh kaisa naam hai bhai!\nWatch a movie to get answers for such questions in Fukrey's eshtaaiylll...\nBest luck , I saw this movie post Fukrey Returns was released to get hang up with sequence. And do wonder how did i missed out the part one in 2013.","label":0},{"review":"Excellent fresh script and situations. Narration was fabulous. Actors too were very impressive. The only sad part is such talented people find it difficult to get opportunities and betas, banjas, Bhadijas and bhdjis do not find difficulties in finding opportunities. Long live nepotism.","label":0},{"review":"Mind blowing comedy particularly honney and choocha haha fantastic comedy superb. The chemistry btw honney and priya also beautiful  nd excitement love no words to explain 10 out of 10 my fav movie all d time nd I love honney charecter","label":0},{"review":"awesome movie... awesome comedy...\nchoocha's fab acting ... perfect friday entertainment\nDont listen to these newshubs who review it badly.... They hardly have the acumen to rate it ..... Its a fun riot\nMust watch","label":0},{"review":"Excellent movie! totally fresh cast and very engaging script. Knocked out other movies out of the box. Hoping the latest edition will be much more enjoyable.","label":0},{"review":"Very new concept in Bollywood...each and every character is justified and has an important part... storyline is good..you don't feel bored in any of the scene...choocha is a legend btw....I give it 5 out of 5 for the fresh story and dialogues.. I'm watching it 5th time!!!","label":0},{"review":"Great movie from Bollywood. Comedy, Dialogues, Screenplay everything is awesome. I'm looking forward to watch next part of this series","label":0},{"review":"My Favorite Movie Of All Time......\nRabba song is just suitable for this movie....and characters are also very best selected....😍😍","label":0},{"review":"I like this movie very much n one great thing about dis movie is dialogues are Fab, yes no doubt u will never feel bored.......","label":0},{"review":"Comedy is overflowing in the movie . all the characters are great . i watched is around 60 times . never feel bore . great movie .","label":0},{"review":"Ultimate comedy... dialogues r very crisp and to the point. Fresh feel. Can be watched several times.","label":0},{"review":"I love this film.\nIt is very good and this film is filled with comedies and especially the  guy \nCHOOCHA","label":0},{"review":"yarrr, very intresting movie, cool characters. this make you happy and more important that is you laugh very much.","label":0},{"review":"The movie comes with a fresh flavor of comedy. Acting was good. It's a  full entertainment material.","label":0},{"review":"Awesome movie . It's as good as previous one.\nDon't listen to Indian critic's they don't know anything.","label":0},{"review":"Great movie, must watch! Choocha is one of the funniest characters ever created.","label":0},{"review":"Fantastic movie, all the actors have done well, Richa Chadda as bholi punjaban is simply superb!!","label":0},{"review":"One of the best movie... Also expect to see more of such movies or series of fukrey... In upcoming yrs","label":0},{"review":"I just loved the song Ambarsariya and full is also better for o e time show","label":0},{"review":"Wow it was fantastic.. Chuncha was really awsme.. Too much fun lovedddddddd it","label":0},{"review":"A perfect blend of real life instances of youth or in forth in a comic way.","label":0},{"review":"Fukrey 2 made me laugh more than any movie in recent times...a great comedy movie!!","label":0},{"review":"Really nice, the humour is the Central attraction of the movie, and really good continuation of the first part","label":0},{"review":"Superb movie please watch it and I am waiting for the fukrey return ml 😐😐😐","label":0}]