[{"review":"It's not simple movie. It's about a fighting true love.. Hats off to anil sharma for awesome direction, anand bakshi for his lyrics and udit for voice.\nMeih nikla gaddi leke is 👌👌👌👌\nGhar aja Pardesi... \nAmrish puri is best in this movie. \nAmisha Patel is decent. \nSunny no need to mention.. \nThis movie is all about India Pakistan separation and between that a small love story between a punjabi hero and Pakistani heroine \nSakhina played by amisha \nHer family escapes to Pakistan but due to some ...MORE","label":0},{"review":"It's not simple movie. It's about a fighting true love.. Hats off to anil sharma for awesome direction, anand bakshi for his lyrics and udit for voice.\nMeih nikla gaddi leke is 👌👌👌👌\nGhar aja Pardesi... \nAmrish puri is best in this movie. \nAmisha Patel is decent. \nSunny no need to mention.. \nThis movie is all about India Pakistan separation and between that a small love story between a punjabi hero and Pakistani heroine \nSakhina played by amisha \nHer family escapes to Pakistan but due to some reason she can't escape and sunny saves her, they both stay together and fall in love marry each other and have a son. \nShe comes to know that her family is alive in Pakistan so she calls them, due to some circumstances sunny and his sons can't accompany her so first she goes alone and one she enters Pakistan her father forces her to marry some other person. \nSunny somehow comes there and rescue her. \nBut effort of his are marvelous. \nLast chasing scene of train is 👌👌👌\n17/06 /19","label":0},{"review":"It is a  excellent  movie ever\n\nI request to Anil sharma please make part2  of Gadar  as soon .\n  I think without Sunny deol and Ameesha patel and jeete. The film is not possible \n  Those are present then the film is going to super hit.\n\n Its Story is based on vibajan of Hindustan  \nThe songs are very good\nThis type of film i have ever seen .\n\nSunny deol.  Is a good actor. And actress \nAmeesha is also their role in this film is important \nThanks","label":0},{"review":"Awesome Movie I just loved it... One of the most brilliant movie I have ever seen... With such an amazing story by the Director of the film and such a powerful star cast, I loved the son of sunny deol jeetey who is looking so handsome now in Genius... The story is fantastic with a great meaning and lesson. The way the movie was shot is just excellent.... It is full of Entertainment just loved this movie...","label":0},{"review":"Gadar is one of the best movies I have ever seen. Performances by Sunny & Amisha are superb. Sunny has delivered his best ever performance. He is equally matched by Amisha who looks very beautiful in the movie. The music is also superb. Gadar is a true story based on the partition of India. It is one of the biggest hits of bollywood and is a movie every Indian should see. Perhaps the only ones who wouldn't like this movie will be Pakistanis.","label":0},{"review":"Sunny Deol is best actor than other actors why he is son of Dharmendra.. Best performance  ever in Gadar movie. It's direction  is too good storyline is very good Indo -Pak 1947 diveded period premkatha best movie very good Uttam Singh Anil Sharma Great Direction He is directed other very good Dharmendra 's movies 1.Hukumat 2 Elan-E -Jung 3.Tahalka very good Song 1 Ud jaa kaale kawa 2. Musafir Jaanewale.","label":0},{"review":"Very good movie.Every time when I see this movie playing on TV channel I end up watching it .Action by Sunny Deol is superb .This is one of the gem stone of Bollywood.\n i watched this movie around five times  this is my favourite movie  n the songs in this movie are really good..love you sunny paaji...& Amisha Patel...everyone should watch this movie atleast once.","label":0},{"review":"Very good movie.Every time when I see this movie playing on TV channel I end up watching it.More interesting the child actor in movie is real son of the director of the movie.Very good back ground music.And power pack action by our Sunny Deol pajji.\n\nWhen I want to relax and when I want to feel like I watch this movie.This is one of the gem stone of Bollywood.","label":0},{"review":"Super movie. Awesome acting by both Sunny and Ameesha. It's a story of Muslim and Hindu/Sikh families during India and Pakistan partition. Very heart touching movie with excellent story line and beautiful acting by all the stars. Songs are also melodious.","label":0},{"review":"One of the best movies I've ever seen. It lets me to imagine that I am living in the real world. Every character in this film has really done a brilliant role which is totally mesmerising.","label":0},{"review":"I have grown up watching this movie, it's not just a movie but an emotion for me.. Uttam's music, udit narayan's voice, script n everything.. still usafir jane wale gives me goosebumps, all scenes suit perfectly on sunny paji, this movie is love..","label":0},{"review":"Excellent movie till now. My favorite movie.\nSunny n amisha's had great chemistry. Amisha deserved better place in industry. She is really a great actress.","label":0},{"review":"Best film ever Indian history, Sunny will always shine, I call Sunny the only super star of bollwood they have, people's say Sunny Deol is an action hero what do we call GADAR Is not a love story super super hit film, let's be honest.this is not the first time Sunny Deol made super hit movie,Sunny Deol made a big history in bollwood, he does not need introduction to anybody. Thanks to Anil Sharma","label":0},{"review":"I love it this is a very special movie i watched this movie arraund 💯 time this is my favourite movie everytime love of songs in this movie... Udja kaale kaavaan..... musafir jaane wale ....all......love you sunny paaji...& Amisha Patel......amrish puri also.. all starcast and team....Tq .... Gadar","label":0},{"review":"I love this movie for all time . Fantastic acting by all actor & actress.no wards to tell about of this movie. Sunny Deol my all time Great Hero","label":0},{"review":"one of best Bollywood movie ever made.  story acting song play everything is perfect and very touching movie . i will suggest everybuddy should watch this movie","label":0},{"review":"This movie is really beautiful and will remaind me my parent's love in their genresion because their loved happen as this film. Very nice film.","label":0},{"review":"Such a Great Movie which has Action,Love, Drama,Songs etc Their many movies better than this but this is my all time Favorite movie of Hindi Film Industry","label":0},{"review":"The cast, the acting everything is brilliantly scripted in this movie which is necessary considering the topic the movie focused on along with the golden singles from Udit Narayan, this movie is really a masterpiece of it's time","label":0},{"review":"My favorite movie ever I request to director to make also 2bd part of this movie and I give very congratulated to sanyy paji to joined bjp thanks this is Aditya","label":0},{"review":"All Time Blockbuster of Hindi Cinema...\nSunny Deol & Amisha Patel...\nBeautiful movie, Beautiful Love Story...\nNo doubt Sunny Deol is The Action King Of Bollywood...","label":0},{"review":"This movie is really beautiful n will remaind me my parent's love in their genresion bcos their loved happen as this film😊","label":0},{"review":"Very good movie.Every time when I see this movie playing on TV channel I end up watching it.More interesting the child .","label":0},{"review":"Loved this movie such a iconic movie this is. It will be always my favourite, best ever love story movie","label":0},{"review":"Perfect movie with all kinds of emotions mixed ,all together it's a complete package for entertainment great work by all the characters","label":0},{"review":"Gadar is the best movie in Indian Bollywood history,movie shows a real situation of 1947 situation. Songs are to good .","label":0}]