[{"review":"Heart touching, so emotional... ghandi was unable to help his own son, despite being a well loved pulic figure.. it just means that in life, we become who we are destined to be regardless of the family we may come from... I feel ghandi didnt push hard enough to bring his son closer to him, he was fighting for his people but his own son, he couldn't fight harder for him..he may av also caused the boy's failures in life as he denied the boy basic education when he was still a kid.. by the time he  ...MORE","label":0},{"review":"Heart touching, so emotional... ghandi was unable to help his own son, despite being a well loved pulic figure.. it just means that in life, we become who we are destined to be regardless of the family we may come from... I feel ghandi didnt push hard enough to bring his son closer to him, he was fighting for his people but his own son, he couldn't fight harder for him..he may av also caused the boy's failures in life as he denied the boy basic education when he was still a kid.. by the time he realized the implications, it was too late.","label":0},{"review":"One of the best movie ...Director deserve standing ovation for depicting different side of gandhiji ..& outstanding performance by  darshan zari wala ..He adorn it like cherry ..  Impeccable screenplay ,direction is USP of movie .","label":0},{"review":"This movie lead the new generation to walk in the path of truth and devote toward our parent's .. \nAbout the acting AK is just awsome..great acting..\nAnd every cast of the film has done great walk..👌","label":0},{"review":"Every person in the family cannot think big. Harilal wife was great inspiration for him, but she wanted her husband to follow MKG. After her death his situation started deteriorating.","label":0},{"review":"It was really a great movie everyone should watch this movie once\nHow much struggle is there behind our freedom But today the freedom our nation is incomplete because of widespread corruption due to Britishers system \nLots of Indians definitely didn't knew that..","label":0},{"review":"I don't want to comment on the film but want to say that mathama ghandi was the best, is the best and in future he will be the best on one was, is and will take place of him thanks","label":0},{"review":"We should seriously think of exposing real Gandhi to world. He was characterless cunning man who was kiddy and brought severe damage to India. Hi should have been hanged for crimes against India and insult to democracy. He ousted Sardar for corrupt Nehru. Shame","label":0},{"review":"An amazing movie.Soaks in the viewer and sensationalizes the viewer Gandhi's personal life struggles , challenges he faced , the balance he maintained and the entire core of the Indian story of Independence..","label":0},{"review":"Very good movie . Outstanding performance by all the actors .","label":0},{"review":"really good story which explores a father and son relationship. A must watch","label":0},{"review":"A very good movie depicting the inner conflict between ganghi ji and his son.","label":0},{"review":"An amazing movie that i have seen","label":0},{"review":"Best Bollywood Movie Ever","label":0},{"review":"You feel sympathy for mahatma gandhi after watching this movie.","label":0},{"review":"Excellent movie.","label":0},{"review":"Heart touching movies","label":0},{"review":"Akshay khanna is so under rated! May be because he is not Khan?","label":0},{"review":"an untold story..","label":0}]