[{"review":"This movie can easily be ranked among Ajay Devgan's top 10 movies without a doubt. The script, potrayal of characters, background score, and execution of the movie are superb. All actors including those actors who played negative roles in the movie did a fantastic job. I have watched this movie more than 50 times and it still remains evergreen to me.","label":0},{"review":"The character of ajay devgn proves that if the police officer think he will do properly they can it easily. We want every police man like ajay devgn of gangajal. Country with a good police officers can change the social cultural and the community. Thanks to ajay devgn as a good and effective police SP.","label":0},{"review":"Good film, Ajay devgan at his best. He looked like a real sp. Otherwise other actors do not leave up to the expectations. They have long hair, shirt button open. I have only seen 2 actors who looked like a real policemen. Iftekhar & Ajay devgan.","label":0},{"review":"this movie is an evergreen movie for me.I never get bore after watching it.I have already watched it more than 20 times and still watch it whenever it comes on Stargold.👍","label":0},{"review":"What an amazing movie. Watched it many times but still it will be a fresh movie every time I watch. Hats off to Prakash Jha.","label":0},{"review":"A story of an honest, motivating & inteeligent IPS officer and her lovely spouse. A positive movie for Civil Services aspirant.","label":0},{"review":"first of all.This movie is far better than Priyanka's Gangajal and second Ajay Devgan is truly actor of Bollywood.whenever i watch.I enjoy this movie.","label":0},{"review":"Excellent movie, very good acting by Ajay devgan and the entire crew member of the movie. Masterpiece direction by prakash jha.","label":0},{"review":"This is very nice movie. I want that director of this film should make the new series of this film with other issue.  Lead actor of this film should be Ajay Devgan only","label":0},{"review":"don't know how many times i have seen this movie and still on, one of the best movies in last decade... worth watching again and again....","label":0},{"review":"What a realistic movie ,Ajay Devan act Soo awesome he Lok like real SP and all the characters done very well","label":0},{"review":"Gangaajal movie is also best movie of Ajay devagan  this movie has story to good nd inspired many police officer for their job","label":0},{"review":"One of good film from Prakash Jha n Ajay Devgan performance is the backbone of this movie, nice movie to watch any time.","label":0},{"review":"I think this is best film of ajay devgan. Good acting of all character's especially ajay devgan.\nI like all dialogue of this film. especially abuse....","label":0},{"review":"It's a excellent film ajay devgon character is superb,nice story good direction one of my favorite movie of ajay","label":0},{"review":"It is a very nice film it inspires me a lot to wash away all evils of society\nThanks","label":0},{"review":"This movie is not good, I watched it the scenes of destroying eyes, which is not good, please do not watch this movie with family and also put your kids away from this, if destroy your thinking.","label":0},{"review":"A classic movie and great acting by Ajay devgn and the supporting cast especially by Yashpal Sharma and Mukesh Tiwari","label":0},{"review":"I think this is the best movie which Motivates an individual who is preparing for IPS","label":0},{"review":"Awesome movie. Great characters. Showed the real face of society.","label":0},{"review":"This movie teach beauracrates they can do  their job darely ajay devagan roles is fit on an ips officer","label":0},{"review":"What a movie and what a peformance of Ajay Devgan. The Greatest Actor of Indian Cinema.","label":0},{"review":"The film represents the truth about indian police department and shows a clear image of hardships suffered by honest people working under the debris of corruption...","label":0},{"review":"Really it's a good entertaining film showing the truth prevailing in the society","label":0},{"review":"v good movie. quite intense on human emotions w.r.t Indian politics and values.","label":0}]