[{"review":"Direction of the movie is awesome. Acting of each character of this movie has made it pretty exciting. Movie is not only to watch but should be understood as well. Very simply shown complex human emotions.","label":0},{"review":"Truly one of its kind ! That’s a lot of emotions by each actor in the film - very nicely done movie. Great after watch feeling.","label":0},{"review":"Nice movie.Watched it couple of times .not boring . I give 4.9 / 5 . She is very hard working and she earns 45,k in 3 years to buy a gara sari 👌👌👏👏👍👍","label":0},{"review":"Very touching movie. Acting of sarita joshi and mita vasisht is down-to-earth and rivetting. Going to recommend it to Fashion Design students to watch it! Happy that i saw it.","label":0},{"review":"Wow what a heart touching. I am still in it's hang'ver. I saw it with my wife and we liked it very much. Please watch it for it's protogonist. Nice story, superb cast.","label":0},{"review":"Very nice movie, saw this type of movie after a long time, nice direction and natural acting by everyone.... Felt distressed and refreshed after seeing this on Sunday in TV....","label":0},{"review":"Simple story, powerfully presented. Common human emotions so delicately yet clearly portrayed. Kudos to Sarita Joshi Ji.","label":0},{"review":"Move is very nice it gives you learning that you can get what you desire if you are determined and work towards it religiously","label":0},{"review":"A very nice heart touching movie. May not be realistic, but one wishes humans are more like this.","label":0},{"review":"Aftr hrishikesh mukhrji's decent  peacefull n soothing muviez ...long time watchd such muvi...gr8!!! superb!!!!","label":0},{"review":"Simple and effective story. Nicely presented too. Great watch.","label":0},{"review":"A Feel good movie... watching this marvelous piece of art just fills the heart with lot of emotions....","label":0},{"review":"Really nice and sweet movie. Simple story yet very touching","label":0},{"review":"What a wonderful movie it was..hangover more effective and enjoyable than Black Dog","label":0},{"review":"Very nice. Love to see manisha and gangoobai in another cast.","label":0},{"review":"Nice heart touching movie. Happy to see sarita ji.","label":0},{"review":"Don't miss it for anything! It is only in India that a film this good goes unnoticed.","label":0},{"review":"Fantastic movie with a strong message for the present day people","label":0},{"review":"Superb. Why can't we see such good movies in theatres.","label":0},{"review":"Beautiful movie.... Just loved it","label":0},{"review":"very heart touching movie .. believe in dreams , do not calculate worth of your dream just go and get it..","label":0},{"review":"Superb movie.i liked it v much.","label":0},{"review":"Beautiful movie with excellent message","label":0},{"review":"Thanks\nI am the costume designer of the fim.","label":0},{"review":"Nice movie.. teaches the value of life..","label":0}]