[{"review":"Undoubtedly one of the best gangster films of not only Bollywood but also all film industries, this Indian 2 part crime film is a flawless masterpiece directed by Anurag Kashyap. Portraying the crudest forms of social evils, conflicts, vengeance ridden acts, gang wars, class difference, illegal arms and drugs dealing, craze for Bollywood, sexual drives, betrayal, love, lust, hatred, competitiveness, corruption, adulteration and hooliganism, Kashyap's attempt to bring it all in front of the audie ...MORE","label":0},{"review":"Undoubtedly one of the best gangster films of not only Bollywood but also all film industries, this Indian 2 part crime film is a flawless masterpiece directed by Anurag Kashyap. Portraying the crudest forms of social evils, conflicts, vengeance ridden acts, gang wars, class difference, illegal arms and drugs dealing, craze for Bollywood, sexual drives, betrayal, love, lust, hatred, competitiveness, corruption, adulteration and hooliganism, Kashyap's attempt to bring it all in front of the audience just as it really is was nothing less than great. The ensemble cast of Bajpayee, Siddiqui, Chadha, Dhulia, Khan, Mishra, Ahlawat, Rao, Tripathi, Singh and (perhaps the youngest of them...)Kumar acted out their roles with utter realism and conviction by engulfing themselves in hardcore method acting which was so well lubricated by the aptly directed music of Sneha Khanwalker and GV Prakash Kumar which provided a rural score depicting the usual tendencies of villagers to dress up and maintain their hair styles imitating celebrities (mostly if not always- filmstars). The bloody, hostile, vengeance ridden, power hungry portrayals of each and every character is likely to stir you into reality and a much harder and unfortunate version of it then we are acquainted to....Where all the dirt and mug of the society seems to ensemble in the form of abstract commodities. The film feeds even the most minute of details....Owing much to Subodh Srivastava's costume design, Rajeev Ravi's cinematography and the Shrikant Desai-Zubi Johal-Rajiv Sunna trio's makeup. A crime and blood saga, Gangs of Wasseypur deserves a full 5 on 5 according to me.","label":0},{"review":"Gangs of Wassepur - Part 1 is a bloody, vindictive, purposeful, intense and most of all superbly entertaining movie. Obviously, the movie is intended for mature/adult audience. \nSo the story is basically the same as in any other gangsta movies. Crime, crime, crime and crime. The essence of the whole cinema is crime and encapsulates criminality in a very dark, colorful and astute manner. Criminality in terms of physical, emotional and responses to temptations is brilliantly portrayed throughout.\n ...MORE","label":0},{"review":"Gangs of Wassepur - Part 1 is a bloody, vindictive, purposeful, intense and most of all superbly entertaining movie. Obviously, the movie is intended for mature/adult audience. \nSo the story is basically the same as in any other gangsta movies. Crime, crime, crime and crime. The essence of the whole cinema is crime and encapsulates criminality in a very dark, colorful and astute manner. Criminality in terms of physical, emotional and responses to temptations is brilliantly portrayed throughout.\nThe coal mafia and a sneak peek in it's den, is depicted in a very blunt and dramatic way with an awesome yet unorthodox soundtrack.\nAnother interesting thing about the movie is it's astute rendering of the characters: eccentric, sudden, explosive and yet lovable, funny, optimistic. \nManoj Bajpayee has done absolutely outstanding and is easily the heart beat of the entire movie. The supporting actors' performances were enthralling as well.\nI would say IMDB rating of 8.2 (which is outstanding) maybe justifiable by hinting at it's unrealistic approach to handling crime, immaturity of lead characters (not actors) and overuse of abusive language. Perhaps, this is the reason it did not get a 9/9+ rating (which it was capable of). \nI would personally rate this movie a 8.9/10.\nFinal Verdict: If you are above 18, watch the movie I am sure you would not hate it.","label":0},{"review":"IT'S NOT full of MASALA, Like most of the BORING, LIFELESS and HOPELESS Bollywood movies.The whole film looks real... It's Dialogue, it's action, it's Cunning, it's every man for himself based life story.. It's intense, vengeful.. It's the BEST MOVIE i have seen in my life...And it's name would be written in Bollywood HISTORY as Best of the BEST... And Eagerly waiting for Gang of wasseypur PART 3...!!!!!!!","label":0},{"review":"One of the best movie I have even seen. If you like determination and boldness, then this movie is for you. This is a must watch movie. Every character teaches great values. I know it is quite abusive, but then what are the gangsters all about. It shows two gangs history and interference of politics. \n\nBest line.....\n\nGoli nahin marenge saale ko,\nLeh ke lenge uski.","label":0},{"review":"One of the most ambitious and sprawling gangster movies of all time. This one undoubtedly is one of the best Bollywood movies of all time. The earthly music, the mesmerizing actings, the pinpointedly intricate direction, the pulverizing plot,  the amazing editing, the list is simply uncountable. I have seen it more than 7 times and still looks so fresh and so visionary.","label":0},{"review":"One of the best movies that has come out of bollywood if not the best in recent times. Brilliant direction by Anurag Kashyap. Manoj Bajpayee arguably one of the best in bollywood along with Richa Chaddha has done a terrific job. The Bhojpuri accent has added another flavour to the movie. It's a must watch.\nCheers.","label":0},{"review":"One of the best thriller ever.. Its a must watch film. The dialogue delivery, the natural acting, the bihari accent, characters everything was best. Even today if someone says \"are vo scene yaad hai\" then with that scene the dialogue also gets stuck to mind. Must watch. Incredible work from Anurag Sir","label":0},{"review":"Gangs of Wasseypur - Part 1 is outstanding crime Indian film ever made.\nOutstanding written and directed by Anurag Kashyap, marvelous story by\nZeishan Quadri. Manoj Bajpayee outstanding played the role of Sardar Khan and others, Tigmanshu Dhulia, Richa Chadda, Pankaj Tripathi,\nNawazuddin Siddiqui brilliantly played theirs role. This is one of best Indian\nFilm.","label":0},{"review":"Crime movie at it's best... Anurag kashyap has this uncanny talent to mix humor even in the darkest of situation... Intense, Gripping, Bloody, Violent, Funny, Dark. Must watch if you have the stomach to digest it but of course this is not for the faint hearted.!!!","label":0},{"review":"One of the finest movies from one of the finest directors of contemporary Bollywood. It's truly a treat watch natural acting of Faizal and Sardar khan. Typical Bihari language and culture leaves you in awe after watching. A must watch film for a movie buff.","label":0},{"review":"After Sholay probably the finest movie ever made . The ethnic touch the script music .wonder why it wasn't nominated to Oscars . Those who have moved in dhanbad area will relate to the movie . Power packed performance by all . Music is soul stirring .","label":0},{"review":"One of the best directions ever in a Bollywood movie. A total different path from hopeless and unnecessary editing to single shots in Maximum of the scenes. Times being the essence of the movie, it portrayed every character progressive as the era proceeds. Hats off!","label":0},{"review":"Don't need to say anything about the film. It is just amazing. Good story, good dialogue not only that the sound of firing owsam. Great job by anurag ji.","label":0},{"review":"An awesome movie to watch.Being a Bihari the dialect used in the film touched me. Manoj ji, Piyush ji, Pankaj ji & each n every character in the film did a commendable job. Must watch for everyone","label":0},{"review":"What a movie.. Fabulous. Excellent  direction with marveklous screenplay and acting if all actors. Story drama songs editing cinematography dialogues all are perfect.. Its one of my fav. Movie..","label":0},{"review":"The best revenge movie watched till date. Making is so good that it looks so natural. Everything in the movie; cast, acting, story, DOP, dialogues, folk music, direction is perfect.","label":0},{"review":"I'm so upset that i missed these gems to watch in cinema (both parts). watched them 3days ago And there is no such film in Indian cinema, this brave and amazing, truly a masterpiece by anurag kashyap and team.","label":0},{"review":"Manoj Bajpeyi is one of the greatest actors in the Indian film industry. I am also be the actor and I work with these great actors and director like Manoj Bajpeyi, Nawazuddin Siddiqui and the my favourite director Anurag Kashyap sir.","label":0},{"review":"Strong and engaging narrative, compact storyline,brilliant sound effects,commendable acting performances,layered characters , dark , funny , realistic , vindictive , powerpacked , bloody , unique and  a must watch if u love genuine action and boldness in content","label":0},{"review":"one of the best movie in bollywood that i have ever watched .....horrific gun fights ..ambush...full scenic movie (gangster ). I am amazed by the acting.I even thought it was real while watching the movie","label":0},{"review":"Godfather of Bollywood!  Yes, this was the word I heard about this movie before watching. Best crime thriller movie ever in the history of cinema.What a direction , dialogue delivery and acting . Simply awesome.","label":0},{"review":"One of the greatest movies of all time . Totally  flawless , absolutely stunning and a great ensemble cast .Absolutely  no reason to hate this movie","label":0},{"review":"One of the greatest movies of all time . Totally  flawless , absolutely stunning and a great ensemble cast .Absolutely  no reason to hate this movie. 9 out of 10.","label":0},{"review":"This is one of the best movies of Hindi film industry that has amazing story line, unique music score, performed by brilliant actors and closest to reality! Hats Off!","label":0},{"review":"Blood shedding gory movie. Best gangster movie of indian cinema. The character sketch is one of the highlights of this movie. Truly, indian cinema will be remembered for this type of movies only.","label":0}]