[{"review":"Best movie in Bollywood.... don't know why some people blame this kind of movie and say hate speeches which is a reason to have this movie underrated!!!not a blockbuster!!... that's shame on Bollywood...\nthis is a masterpiece and the most heart touching movie ever..\nMy favorite one is this..\nThe question mark of this movie \"the reality of sanjay singhaniya hidden from kalpana till her last breath\" makes not only me crying but also everyone 😣😣...","label":0},{"review":"This was a real thriller on social stigmas and romance. There's soo much that can be stuffed into a review of this movie. Rock & roll, and Amir Khan once again proves why he deserves my utmost respect. I saw the complete movie today, 21st October ,2018. TBH, even I after 10 years from its' release , it's one of the best Bollywood work-outs ....","label":0},{"review":"Everyone involved have played their part to perfection no doubt but overall a highly hyped movie. Just saw Sajan 1969 movie on zee classic. The USP of ghajini  movie is the way the lead characters meet and that has been fully cut copy and pasted from Sajan. Rest all the movie is about maar Dhaad which is an ode to 80s kind a masala cinema . Infact after watching ghajini your mind is heavy. If someone is looking for pure entertainment watch movies on zee classic instead .","label":0},{"review":"This movie is a thriller filled with \naction,violence  and romance. The story of a young businessman and how he meets the love of his life who later on is killed. The seeks revenge by killing the murderer the way his lover was killed. The girl who was killed was trying to help a bunch of girls who were sold as slaves to man. The man kills two of them and she couldn't stand that. Later on, the man suffers from memory loss every fifteen minutes. Overall the movie is a award winning movie.","label":0},{"review":"Just saw the original hollywood on which this movie is based. Memento is the name of the original hollywood movie. I am a big hollywood fan. But seriously, the Bollywood adaption is pretty neat. Only the basic concept is the same. The story line ia completely different. I thought this was a freakish movie earlier. After watching the original, I have more respect for Aamir Khan and the director of the movie. It is clearly not a copy paste job. It takes more than that to copy a movie like Memento  ...MORE","label":0},{"review":"Just saw the original hollywood on which this movie is based. Memento is the name of the original hollywood movie. I am a big hollywood fan. But seriously, the Bollywood adaption is pretty neat. Only the basic concept is the same. The story line ia completely different. I thought this was a freakish movie earlier. After watching the original, I have more respect for Aamir Khan and the director of the movie. It is clearly not a copy paste job. It takes more than that to copy a movie like Memento into Gajhini !","label":0},{"review":"We need more good person like Kalpana this days.It is really very sad when Ghajini kills Kalpana.Movie is so awesome.I can watch many times without getting bored.Every part is so perfectly made.Asin and Amir both are superb actors.","label":0},{"review":"Really Add to your Must Watch List Now.\n\"Love makes you stronger\"\nGreat Story and Emotional Value Balanced, Songs will let you feel the Pain and Love together.\n\nLoved it.","label":0},{"review":"I loved this movie, it’s really really touching, I mean I have watched this like a thousand of times it never gets old and the feelings that comes when kalpana gets hit and when he goes crazy I mean damn that hella touching I loved this movie THANK YOU SO MUCH FOR MAKING THIS MOVIE","label":0},{"review":"It happens very bad with sanjay singhania.i cry when i watch this movie. 5 out of 5. You should go for it. Best movie. Heads of to aamir sir.Aamir sir and Srk sir are my favourite.","label":0},{"review":"I have was having no interest in bollywood movie then I watched this movie It was different from other movies \nIt is very emotional, heart touching, and memorable.. I love this movie... Must watch..","label":0},{"review":"This is very very excellent movie. It was my first movie which I watched. Aamir khan is a brilliant actor. He is my favorite.  I can watch this movie any time.","label":0},{"review":"Ghajini is one of the best films I have ever seen. Thanks for Aamir Khan for making this film much more interesting. Indeed, he is a wonderful actor.","label":0},{"review":"Iam a huge fan of Suriya sir . His eyes is truly magical 🙆 and Gajini is superb!!!! I'll suggest everyone to watch this movie 💕💕💕💕💕","label":0},{"review":"It really sad that I cannot find the link of this awesome movie anywhere in the Web.. I just want the move..no matter whats the resolution...So guys..pls submit the link if you have....and thanx in advance","label":0},{"review":"Ghajini is a good Indian version of Memento but Memento is a best psycho thriller movie and feel realistic you must watch Memento then you can understand what I am trying do say","label":0},{"review":"A must watch film. It is a perfect film containing great romance, action, and comedy. If you have not watched this film yet you are missing a great thing.","label":0},{"review":"Powerpacked adrenaline pumping action movie... Stellar powerhouse performance by Mr Perfectionist Aamir khan... Excellent direction , Rehman music is awesome..","label":0},{"review":"The movie is awesome and indeed a deserving movie to be remade in other languages as well.As always suriya sir did a great job in this","label":0},{"review":"Great movie as expected from a great actor...\nJust ignore them who r being brutal this level of work of Mr. Perfectionist...sir Aamir khan.","label":0},{"review":"The movie was not so good. The Tamil version of Ghajini was so excellent. But Ghajini in hindi version is not so good. AAmir Khan acted well in the movie. But the movie is so boring.","label":0},{"review":"Such a wonderful casting by murugadoss. And cast and crew performance is very nice as same as in both language","label":0},{"review":"A great hit film of its time which was different and the combination of surya so acting + asin's cuteness.","label":0},{"review":"An super movie in tamil Film industry \nWhen i see this film then iam a hard fan of suriya","label":0},{"review":"One of the best thriller movie👍👍hats off to whole team 👏👏 Suriya & Asin did a great effort 😘😘😘","label":0},{"review":"A r murugadas a big lier and thiesis. Thief .he theft. Christopher nolan work and he is still on deneing mode\n\nWatch real watch momento","label":0}]