[{"review":"Ghost- What a movie, from direction to story line, from acting to expression game and increasing curiosity with each passing scene was excellent. It has element of engaging audience till end. No melodramatic scary affects, no unrealistic ghost vfx affects, sutble portrayal of WHAT FEAR OF SPIRITUAL ENTITIES AOUND US, is. \nOverall best movie of the day on which am happy to spend money on. I will recommend audience to go watch this movie, its worth watching. If audience rating matters then i will  ...MORE","label":0},{"review":"Ghost- What a movie, from direction to story line, from acting to expression game and increasing curiosity with each passing scene was excellent. It has element of engaging audience till end. No melodramatic scary affects, no unrealistic ghost vfx affects, sutble portrayal of WHAT FEAR OF SPIRITUAL ENTITIES AOUND US, is. \nOverall best movie of the day on which am happy to spend money on. I will recommend audience to go watch this movie, its worth watching. If audience rating matters then i will love to give 3.5 for Sanaya Irani's acting, Vikram's direction, cinematography, perfect blend of intense, romance, horror, thriller element in story plot and soulful BG Scores.","label":0},{"review":"Blockbuster. Amazing movie.  \n\nWords are missing to describe this masterpiece. Mesmerizing performances and a good horror scenes that really scares you, this is by far one of the best in Indian cinema and will set higher standards. Coupled with an intelligent script, great background score and beautiful locations, this movie is a delight to watch. The storyline is not boring even for a second and will keep you on the edge of your seats. Sanaya owns the movie but the others performed so well. \nTh ...MORE","label":0},{"review":"Blockbuster. Amazing movie.  \n\nWords are missing to describe this masterpiece. Mesmerizing performances and a good horror scenes that really scares you, this is by far one of the best in Indian cinema and will set higher standards. Coupled with an intelligent script, great background score and beautiful locations, this movie is a delight to watch. The storyline is not boring even for a second and will keep you on the edge of your seats. Sanaya owns the movie but the others performed so well. \nThe performance of Sanaya Irani is sublime, her body expression, her look in each scene, her pain and of course her facial expressions.... the emotional scenes she expressed so well.... that you can feel her feelings. And the music of the movie are amazing. No wonder they became hit immediately. Very very good!!!! Brilliant Ghost👏👏👏 Everyone should watch this masterpiece!","label":0},{"review":"Ghost review :\n\nAfter Ramsays in the 80s, it is Vikram Bhatt who has been the torchbearer of horror genre in Bollywood. Delivering campy (at times cheesy) products like 'Raaz' (2002), '1920' (2008) and 'Haunted' (2011), Vikram has tasted fair amount of success mixing liberal doses of sex with horror. His latest film 'Ghost' is similar to 'Raaz' and '1920' in terms of theme but falls a tad short in the scare quotient. Moreover, even the sex scenes are quite thanda here..\n\nA morphine addicted lawy ...MORE","label":0},{"review":"Ghost review :\n\nAfter Ramsays in the 80s, it is Vikram Bhatt who has been the torchbearer of horror genre in Bollywood. Delivering campy (at times cheesy) products like 'Raaz' (2002), '1920' (2008) and 'Haunted' (2011), Vikram has tasted fair amount of success mixing liberal doses of sex with horror. His latest film 'Ghost' is similar to 'Raaz' and '1920' in terms of theme but falls a tad short in the scare quotient. Moreover, even the sex scenes are quite thanda here..\n\nA morphine addicted lawyer (Sanaya Irani) takes up the case of a politician (Shivam Bhaargava) accused of murdering his wife. \"I didn't do it, a ghost did\", is his defence. Before we can say boo...the lawyer starts experiencing the paranormal. She also falls hopelessly in love with her client. It's all too familiar and far too predictable. \n\nOn the films positive, the London setting lends the film a glossy look. A couple of songs are pleasing to the ears and well shot. \n\nLeaping from TV to the silver screen, Sanaya Irani is impressive as the lawyer turned lover who gets entangled in this bhootiya case. She not only looks hot and sexy in the bold scenes but is equally convincing in the courtroom. The lady can look forward to more mature roles in Bollywood! \n\nOn the other hand, Shivam Bhargaava is absolutely dull and wooden even in an author backed role. He appears dazed and lost in most of the scenes. Emraan Hashmi, you are missed!!\n\nFinally, Ghost, justifying its title, is just a ghost of Vikram Bhatt's past successes offering nothing new. BOO HOO! \n\nRegards\nSumeet Nadkarni","label":0},{"review":"Sanaya acting wow she is amazing she bs her movie are so underrated. So talented yaar . Waiting for to see more of her in Bollywood other than all the actors with no talent only there because of their parents. God bless sanaya wish her more happiness and success . The movie has a lovely story and the actors Chemistery really good","label":0},{"review":"The wealthy hero is accused of murdering his wife. He claims hes innocent n the murder was committed, in his absence, by a ghost. Why would anyone believe him in todays times? Who is this ghost? What is its intention? Why do extra marital affairs always have sad endings? #GhostTheFilm is shot on excellent locations. But when will Vikram Bhatt understand that the audience cant be spooked by hideous faces, flickering lights n creaking doors? Sanaya Irani is good n deserves to be seen in better fil ...MORE","label":0},{"review":"The wealthy hero is accused of murdering his wife. He claims hes innocent n the murder was committed, in his absence, by a ghost. Why would anyone believe him in todays times? Who is this ghost? What is its intention? Why do extra marital affairs always have sad endings? #GhostTheFilm is shot on excellent locations. But when will Vikram Bhatt understand that the audience cant be spooked by hideous faces, flickering lights n creaking doors? Sanaya Irani is good n deserves to be seen in better films. Rating 1.5/5.","label":0},{"review":"I generally hate horror films, it makes me frightening!\nbut only for Sanaya I watch #Ghost and it's worth watching!\n O God ! Heart came in mouth. What a story it is! Sanaya totally slayed as Simran Singh, its one of her best performances!\n.Sanaya looks pretty looks like a doll, she owns every scene in it.\n Go watch her in the cinemas\n#GhostTheFilm #SanayaIrani","label":0},{"review":"Although story could have been better you just can not miss the performance of the female lead. Sanaya Irani plays a tormented, conflicted soul as only she can - in a manner that is both deeply affecting and disquieting. It is a role that is both emotional and physical - she stays on top of its demands all the way through. Music is catchy.","label":0},{"review":"Sanaya Irani makes her good performance so far. Music is the key point of this movie. The Bg score is something that u want to listen it again & again. Some of the scary moments is there, u gonna love that. Must must watch for horror fans. Not missable movie.","label":0},{"review":"8.8/10 \nOh god ! What a shameful it is 😂😂 \nWorst movie of 2019. Production team and makers of this film had given 5 stars and positive reviews that's why rating is so high I know this film makers planning but as you know it is vikram bhatt's typical worst horror film.🤣 \nShameful film for horror genre. Ghost are like cartoons in this film 😁","label":0},{"review":"Good movie with excellent sound effects. It's the vikram bhatt style with daar elegance & intimacy .\nIt keeps you glued till the end .\nSongs are good ..\nPerfect entertainer and definately one time watch ..","label":0},{"review":"A great watch! Actors have done a convincing job in portraying their characters. Vikram Bhatt's direction is amazing as usual and songs are melodious just like any VB movie.","label":0},{"review":"Beautiful film its not like zombies movies or people transfer to snakes lol its based on true story actually sanaya irani holds this film on her shoulders amazing performance and her chemistry with shivam was incredible there is everything horror drama romance beautiful love story overall amazing film","label":0},{"review":"The movie was a waste of time and money. The acting was really bad in the whole movie, except for some parts. It was scary for like 20 minutes of begining and then it just kept getting boring. The cringe use of jump scares and loud music made it the worst. \nThe songs were quite good but seriously. It felt like a horror movie from the 90s.","label":0},{"review":"have seen how fantabulous talented #sanayairani in dal maang  scene \nthis is nothing infront of rest scenes she has in #GhostTheFilm believe it absolutely nothing \nWhen watch it u will rediscover masterpiece called sanaya \nand have all ur emotions ready fear sad romantic  #GhostReview","label":0},{"review":"high level & great PERFORMANCE🔝💥🏅💯👍MASTERPLASE !!!  BEST director, BEST actors   , BEST music... 🔝💥 this movie deserve more good wishes and victorias! Respect whole team","label":0},{"review":"The movie is not so much scary but the story is too good. A big shout out to Vikram sir for the story. Sanaya and shivam nailed their characters.. Perfect acting.","label":0},{"review":"OMG I just loved the movie,Sanaya is,was & always will be my fav actress since her television days & once again she proved,why she's so brilliant,just loved her","label":0},{"review":"Worst Horror movies of 2019..... Director should quit now making such disaster horror movie.....I would recommend stay out of this movie.....\nAlso Director should at least watch horror movies of James Wan such as conjuring verse to know how to make a movie.....","label":0},{"review":"It is not the most scary movie out there but definitely has a gripping story and thrilling turns. One should give it a watch!","label":0},{"review":"My congratulations to the entire team for composing such a great heart winning music ! all the songs are worth listening any time of the day...","label":0},{"review":"Pure Bakwas..No story.. No reality feeling..bad direction..bad acting...bad dialogues...minus 10 rating will be better for this type of movies. Just waste of money and time. Its better to watch some old black and white horror movies than this.","label":0},{"review":"A story-line that kept me engaged throughout. Definitely has the \"creep\" factor. Awesome soundtrack. Great acting by the newbies.","label":0},{"review":"True story my foot, come on Yar it seems u guys have a nice budget but can not produce a decent movie.. though Indian love horror movie but movies like this is more sort of comedy than horror..RIP to Indian horror movies","label":0},{"review":"Story can be good but what they made??they started faltu ki Love story in that.people watching horrer story not love story.ghost can kill anyone can do anything but in this movie ghost is doing planing to trap hero🤣 last me vahi ghost se mara maari.","label":0},{"review":"mast movie\nsong dil maang raha ha mohallat is so much lovely \nand sanaya irani is so pretty \nthis movie will have great going","label":0}]