[{"review":"Amazing comedy drama movie. Actors acting is real good. Specially Paresh sirs acting is superb he was looking like a real blind old man wearing black glasses . Storyline direction is superb. Golmaal one is good but now a days Golmaal series are not good only jokery is there a lot sorry to say that Rohit sir but as a audience I am saying that to you. Otherwise its a nice movie.","label":0},{"review":"I am crying that nowadays these movies are major missing, hera pheri, golmaal, dhol, de dana dan, bhaagam bhaag, hulchal, dhoom1, in this era only fukrey movie the must watch comedy movie those songs unki baat hi kuch aur thi. Those old casting were better nowadats new actors are so flop dumbs overactor.\nthis is my one of the faviourate movie","label":0},{"review":"One of the best comedy films out there which you will never get bored of even if you watch it a thousand times. U will never get such kind of films in bollywood ever again in the future. Its a masterpiece.","label":0},{"review":"I am crying that nowadays these movies are major missing, hera pheri, golmaal, dhol, de dana dan, bhaagam bhaag, hulchal, dhoom1, in this era only fukrey movie the must watch comedy movie those songs unki baat hi kuch aur thi. Those old casting were better nowadats new actors are so flop dumbs overactor.","label":0},{"review":"Mind blowing comedy. Cannot stop laughing. Beautiful script and most awesome dialogues. Perfect comic timings between each and every actors.","label":0},{"review":"Still it remains the best among all the sequels.\nPure family drama no vulgar content still brings out tears of laugh and it has a proper ending which ties up all loose ends.","label":0},{"review":"One of the best comedy movie ever ever,\nI love this movie and i promote e:sri ajaya devguna ji (ajay devgun)a best role in golmaal so i give him six stars⭐⭐⭐⭐⭐⭐","label":0},{"review":"Golmaal is truely fun unlimited.\nNot taking Sharman Joshi and paresh rawal in other sequels of golmaal is the only reason of not being success of other parts of golmaal.","label":0},{"review":"Really it has fun unlimited...... still it is the best film I have ever seen. I have been looking this since it released.","label":0},{"review":"The best Hindi movie ever can re watch a million times. Will always remain my favorite! Yayyyy!!!!!!!!!!!","label":0},{"review":"This is a Funny film.one of the best comedy films ever made in this country starring Ajay Devgn.","label":0},{"review":"its a very nice movie nice acting among all the sequel of this moviesthis is my favourate movie ever","label":0},{"review":"The movie was awesome and really funny. Bole toh full paisa wasool movie hai...😉😉","label":0},{"review":"Its really funny and comedy movie in 2006\n       It is a one of most best movie in 2006","label":0},{"review":"A lovely movie and a comedy film .love you rohit shetty for shooting this movie","label":0},{"review":"One of the best written script and amazing comedy , Rohit shetty's best directorial movie","label":0},{"review":"amazing acting and comedies. it was such a good movie","label":0},{"review":"One of my favourite movie...\nLove u Ajay sir n Arshad sir..","label":0},{"review":"Best ever comedy you found is in this film.Liked aaa lot!!","label":0},{"review":"This is the best comedy movie I ever seen","label":0},{"review":"Nice movie Mr Ajay devgan for fun . I like Mr Ajay devgan","label":0},{"review":"wo ajay devgun n other heros ka comedy mind blowing","label":0},{"review":"One of the best comedy movie of that time","label":0},{"review":"I doesn't bored to watch this movie 1000 times","label":0},{"review":"I thimk this is a only movies \n\nIn the movie there are comedy seen and romantic and crying  seen","label":0}]