[{"review":"Super movie, excellent screenplay, dialogues.\nStory is good too, every character has portrayed its role superbly like Dukki Bana, Ranvijaya Singh etc.\nMusic & Lyrics by Piyush Mishra adds to its beauty.\nOverall a must watch.. 9 out of 10.","label":0},{"review":"A movie which I have watched most in my life.....Each time feels like watching it first time....Hats off to writer-Director....A mile stone set for Bollywood.....Became biggest fan of Anurag Kashyap after this movie.\nIn last for its music and lyrics .....Salute to Piyush Sir.....Love you always sir..❤❤❤","label":0},{"review":"What a movie with great story and acting. Why these kind of movies doesn't come in T. V.  Yarr. T. V mein babal macha denge ye movies","label":0},{"review":"Excellent screenplay with a good story line and garnished with powerful dialogues. script is a bit slow. Who want a movie which mirrors the ground must watch.","label":0},{"review":"Really very nice script.nice acting by all actors specially piyush Mishra 5/5. Songs are very good and heart touching \nGiving 4.6/5.","label":0},{"review":"Cult. Class. Pathbreaking.\nOne of the most underrated movies in the history of Indian Cinema. \nBetter read some histroy of Rajputs before watching this Gem.","label":0},{"review":"Big fan of this movie theatre me dekhi TV pe JB bhi aayi dekhi YouTube par.really a great movie acting wise and story wise.","label":0},{"review":"Shown truth of seperated Rajputs from 1000 of years till now. During our rules if we loses than that is because of seperation. What Rajputs all need is UNITY.","label":0},{"review":"Extreme! When story is potrayed in a way which makes you think in one direction where you see mirror of society, values, sarcasm.","label":0},{"review":"Whenever i see this movie i feel it breaks all records. Best story ever.","label":0},{"review":"Best movie everyone should watch this movie GULAAL excellent","label":0},{"review":"one of the best bollywood movies of all time","label":0},{"review":"Best acting, meaningful songs... Hates off Piyush Mishra.","label":0},{"review":"Very good and outstanding movie till date about democracy and india liberal.","label":0},{"review":"Superb screenplay, quirky characters, a modern classic !","label":0},{"review":"One of the best films in Bollywood","label":0},{"review":"A masterpiece by master anurag kashyap.\nJai rajputana 🙏","label":0},{"review":"a nice movie\none time must watch","label":0},{"review":"Nice movie .kk is real actor.","label":0},{"review":"nibe muvei! very cromdey castings and super duper hit actsion!","label":0},{"review":"Special thanks to star cast, director and script writer. What a marvel!","label":0},{"review":"Awesome movie","label":0},{"review":"Nice movie nice concept....","label":0},{"review":"Super movie","label":0},{"review":"Most bore movie I have seen","label":0}]