[{"review":"Juhi Chawla did her best. She acted as if she lived with one currupt family based at UP to learn their life style. Great acting by Juhi Chawla. Watching second time.","label":0},{"review":"Truly speaking, I watched the movie in 2018 and I'm regretting for not watching it in theatres. I'd definitely recommend this movie. Thumbs up 👍","label":0},{"review":"Its a nice movie and can be watched atleast once... Too many songs ruined it though...\nRatings- 3/5","label":0},{"review":"It's got two talented actors and a great story. But it's still lacking something and I don't know what it is.","label":0},{"review":"It is a good movie and it shows the actual condition of a village.  All the actors did their job well.","label":0},{"review":"Through this movie l understood the currupt chain of politicians, police and other civil officers. I highly recommend this to watch once.","label":0},{"review":"Love Juhi, you all better do too... an amazing actress and started respecting her after her performance in Gulaab gang.","label":0},{"review":"loved the movie and juhi and madhuri both were great and I watched this movie in 2019, I'm seriously regretting now Why I didn't watch it earlier? I wonder why this film got flopped ?","label":0},{"review":"India's sad reality exposed!! one of the greatest indian movie i've seen so far!","label":0},{"review":"It is wonderful film..juhi chawla is great doing her job..ending was suberb!","label":0},{"review":"Juhi Chawla gives an outstanding performance but that isn't enough to aflot this film with an intensely misguided approach towards the real fearless woman","label":0},{"review":"This is the big voice for all women,\nVery nice movie ,","label":0},{"review":"Madhuri Dixit was do good.. as the movie with a sound message... It is a movie gone unnoticed","label":0},{"review":"Superb movie it can be A superb movie ever","label":0},{"review":"This film is not for those, who like to eat up the S#!T fed by Rohit Shetty, Karan Johar, Bhansali, etc....","label":0},{"review":"very nice movie 1 no. acting is very  good","label":0},{"review":"Juhi chawla is awesome in this movie","label":0},{"review":"Juhi chawla acting is excellent in movie","label":0},{"review":"So GOOD!!!!!!!!!Now that's called a real film!!!!!","label":0},{"review":"Very good it was","label":0},{"review":"This movie taught lessons of women power.","label":0},{"review":"Nice movie","label":0},{"review":"Awesome movies 👍👍😍","label":0},{"review":"Respect women 🙏","label":0},{"review":"Shows the real picture of india.","label":0}]