[{"review":"Gunday is a movie which is set in between the chaos of Bangladesh and West Bengal- basically a story set in the era of 1980s. There are two best friends who fall in love with one pole dancer who is appointed as a medium by the cops. Friendship shatters and comes passion, hunt and determination to get that one lady they are commonly interested in- an idea adapted from the traditional story of a damsel called Tilottama- who was the root cause of rift between two brothers who were demons disturbing ...MORE","label":0},{"review":"Gunday is a movie which is set in between the chaos of Bangladesh and West Bengal- basically a story set in the era of 1980s. There are two best friends who fall in love with one pole dancer who is appointed as a medium by the cops. Friendship shatters and comes passion, hunt and determination to get that one lady they are commonly interested in- an idea adapted from the traditional story of a damsel called Tilottama- who was the root cause of rift between two brothers who were demons disturbing people living on the planet. The idea also seems to dwell upon some major classics India's cinema industry is proud of. \nThe only thing I like about this movie is- costumes and sets! and the music! You could always dance on 'Tune Maari Entriyaan' or wear sexy lingerie for that night...and it's a pleasure to watch Kolkata in all its retro vibes.\nAs for the writing, its worst when it comes to this movie. Ranveer Singh has fallen victim to a false script, and Arjun Kapoor fails to create any sequence even when it is his game. Priyanka Chopra and Irrfan Khan perform quiet well despite the scene is not good. Well, concluding by talking about the climax- I don't like and I felt hurt about the idea that the festival of joy and life turns the festival of dark and death in this movie- Durga Puja. \nI don't like this movie. Sorry for the fans.","label":0},{"review":"This movie was really an average movie.\nPositives: Ranveer Singh shines in his role and physical appearance, locations,songs,Irfan Khan also did his role well but not that perfectly as he looked unsuitable as a cop. Action scenes were over the top but still good,1st half was good,powerful dialogues. Good BGM by Julius Paickam.\nNegative: Arjun Kapoor and Priyanka Chopra overacted all along in the movie, Fake Bengali Accent by all actors which irritated a lot,weak editing,sort of boring 2nd half d ...MORE","label":0},{"review":"This movie was really an average movie.\nPositives: Ranveer Singh shines in his role and physical appearance, locations,songs,Irfan Khan also did his role well but not that perfectly as he looked unsuitable as a cop. Action scenes were over the top but still good,1st half was good,powerful dialogues. Good BGM by Julius Paickam.\nNegative: Arjun Kapoor and Priyanka Chopra overacted all along in the movie, Fake Bengali Accent by all actors which irritated a lot,weak editing,sort of boring 2nd half due to weak screenplay.\nOverall it's one time watch moVie for those who have love movies directed by  Ali Abbas Zafar.\nRatings:5/10.","label":0},{"review":"Actors acting were too good . One thing we had learned from this movie that we should never lose hope . Ups and downs is there in each and everyones life we have to accept . Even if a billionaire or millionaire also have ups and downs in their business because they always has stress about their profit and loss they are always dealing with that . We think that they are roaming in Mercedes and in jaguar staying in 5 star hotels roaming in business class they are very happy but it's not like that.  ...MORE","label":0},{"review":"Actors acting were too good . One thing we had learned from this movie that we should never lose hope . Ups and downs is there in each and everyones life we have to accept . Even if a billionaire or millionaire also have ups and downs in their business because they always has stress about their profit and loss they are always dealing with that . We think that they are roaming in Mercedes and in jaguar staying in 5 star hotels roaming in business class they are very happy but it's not like that. Even we think that mr Mukesh Ambani  is very happy with this lifestyle staying in 27th storied house like antila and he has600 staffs  with three helipads we think that he is very happy but it's not like that he alwaysthink that my bussiness is not running in loss or my son has not done any bad thing because this kinds of thing always roaming in his mind","label":0},{"review":"Gunday is set in the emergency of Bangladesh and West Bengal in 1980.. Vikram and Balla(Ranveer Singh and Arjun Kapoor) struggle their lifes through this emergency period.. They are the best friends who shares everything with each other. But the caoes begins when these best friends fall in love with an charming lady (Priyanka Chopra)....\nAfter the entry of Priyanka Chopra the movie falls under same genre triangular love-story and misunderstandings gradually the movie lacks it's trp and becomes r ...MORE","label":0},{"review":"Gunday is set in the emergency of Bangladesh and West Bengal in 1980.. Vikram and Balla(Ranveer Singh and Arjun Kapoor) struggle their lifes through this emergency period.. They are the best friends who shares everything with each other. But the caoes begins when these best friends fall in love with an charming lady (Priyanka Chopra)....\nAfter the entry of Priyanka Chopra the movie falls under same genre triangular love-story and misunderstandings gradually the movie lacks it's trp and becomes regular movie type.... So I can't tell this movie is outstanding.. just ok for time pass...","label":0},{"review":"Gundaay 2014\n\nScreenplay - 73/100\nCinematography - 48/100\nScript - 50/100\nActing - 34/100\nDirection -  71/100\nVFX - N.A\nMusic/Songs - 88/100\n\nIMDb rating - 2.1/10\n\nMy Rating - 35/100 or 3.5/10\n\nAbout the script it is just a classical bollywood story with a friendship and everything in the movie is clean predictable moment.  The plot is all recurring all over the bollywood movie with the romance and betrayal with viewers already knew what's going to happen.\nAli Abbas direction makes the movie a l ...MORE","label":0},{"review":"Gundaay 2014\n\nScreenplay - 73/100\nCinematography - 48/100\nScript - 50/100\nActing - 34/100\nDirection -  71/100\nVFX - N.A\nMusic/Songs - 88/100\n\nIMDb rating - 2.1/10\n\nMy Rating - 35/100 or 3.5/10\n\nAbout the script it is just a classical bollywood story with a friendship and everything in the movie is clean predictable moment.  The plot is all recurring all over the bollywood movie with the romance and betrayal with viewers already knew what's going to happen.\nAli Abbas direction makes the movie a little watchable while we see the pale acting from Ranveer , Arjun and Priyanka . The movie has nothing spectacular to offer rather Bengali plot.","label":0},{"review":"I loved the movie.. Its the movie of friendship.. Yarriyoon.. Who have not best frd i think he also unlike this movie.. The movie is superb #ranveersinghandarjun doing awesone.. Ranveer bst","label":0},{"review":"Who the hell is this give 2.1 to this movie?? It deserves 8 out of 10.... One of the best movie I ever scene in my life.... Arjun Kapoor is Much better in this movie.....","label":0},{"review":"One of the best movies of this genre. All the cast performed flawlessly. But for once i thought arjun kapoor scored over ranvir singh.","label":0},{"review":"who the hell voted 2 out of 10 for this movie? it should be probably 7+ imdb rating. i might also rate it 8 out of 10.\ni really liked  this movie","label":0},{"review":"A spectacular movie. A true amalgamation of the realistic sense of action with insanity. Describes all the moods of boys in their life.","label":0},{"review":"I’m legit only giving a review cuz I don’t understand how this movie has been rated a 2 out of 10!? IT WAS A GREAT MOVIE IT SHOULD BE 10/10?!?","label":0},{"review":"It was a excellent movie . According \nto 2014 it was a bit different and gave a strong message on friendship","label":0},{"review":"One the worst movie I ever saw if i had to rate this movie I will just give 1.0 But seeing according to friendship the Movie is good","label":0},{"review":"Gunday movi supr movi.start now gunday2movi.This movie of my life \nBest movi","label":0},{"review":"very interesting  movie, with cool songs, i really like the dailouges of the movie","label":0},{"review":"best movie of my life i have never seen a better movie","label":0},{"review":"Those who think that the movie is bad should just stay away instead of insulting all the hard work that is put in.","label":0},{"review":"a good movie. gives value and meaning of friendship...","label":0},{"review":"2.1 is just too much...Such movies should be banned to even feature on the imdb list!","label":0},{"review":"The movie is quite good at least it deserves 7/10","label":0},{"review":"Good movie to pass the time for senior citizens","label":0},{"review":"I like this movie , and there song tune maari entries yaar","label":0},{"review":"I like this movie because your friend ship very nice","label":0},{"review":"Ranvir Singh Is Amazing Acting This Movie!!","label":0},{"review":"3.5/5\nits an above average movie\nranveer outshines arjun","label":0}]