[{"review":"I don't know what tooks me so long to watch this movie.It's just outstanding.The performance of abhishek sir is just outstanding. Well the main lead of the story Guru bhai just inspired me a lot.\n\"Change with time or else change time.\"\nHe just showed what a dreamt is meant to be .The sound tracks of this movie is just amazing. You will mesmerise it even after the movie ends.This movie also teach us what a relationship is meant to be.As a couple you not only share happiness together but also shar ...MORE","label":0},{"review":"I don't know what tooks me so long to watch this movie.It's just outstanding.The performance of abhishek sir is just outstanding. Well the main lead of the story Guru bhai just inspired me a lot.\n\"Change with time or else change time.\"\nHe just showed what a dreamt is meant to be .The sound tracks of this movie is just amazing. You will mesmerise it even after the movie ends.This movie also teach us what a relationship is meant to be.As a couple you not only share happiness together but also shares the hardships,pain and sufferings together.\n\"Dream requires soundless sleep to see whereas Aim requires sleepless night to achieve.\"\nPersonally i don't think any words could seldom describe the brilliance of this movie.It was just awesome.","label":0},{"review":"It's really too good movie . Who says that Abhishek Bachchan don't have acting skills he has played this Dhirubhai Ambani role very beautifully. Actors acting were too good and realistic . This movie is about Ambani family biography . That how they had utilise their inteldgience and they have achieve success . Climax scene was very inspiring and motivating . His father was criticising him though he was son of maths teacher and he failed in maths and his mother and brother was motivating him and  ...MORE","label":0},{"review":"It's really too good movie . Who says that Abhishek Bachchan don't have acting skills he has played this Dhirubhai Ambani role very beautifully. Actors acting were too good and realistic . This movie is about Ambani family biography . That how they had utilise their inteldgience and they have achieve success . Climax scene was very inspiring and motivating . His father was criticising him though he was son of maths teacher and he failed in maths and his mother and brother was motivating him and his journey begins from Turkey he was doing job as salesman. We had learned something from this movie that we should never losse hope in our life . If someone trying to demotivate us you should always avoid that person because you should think that person is megalomaniac and oversmart. If someone is motivating to you then you should follow their steeps. Songs were too good. But I didn't understand one thing that why they haven't show mukesh ambani and anil ambani .","label":0},{"review":"This movie has been my favourite, don't know exactly, how many times i have watched it..  and everytime it seems so fresh and so so inspiring, The acting of Abhishek Bachchan is so impeccable such praiseworthy performance.. He really deserves accolades for this film.. and the soundtrack composed by none other than Mr. A.R. Rahman is sensational and truly outstanding especially the two songs- Tere Bina and Barso re.. Just beautiful, mesmerising!!","label":0},{"review":"This is my favourite movie , Guru bhai is excellent and also his wife Aishwarya. Mithun Chakraborty is also speechless. \n\nDhirubhai Ambani is the father of every Indian businessman. Salute to his fighting and genious character. I have inspired in my early stage of career by watching this flim by Maniratnam . What a director he is!!!\nI watch the movie every time when I feel depressed .....it's a ocean of energy and confidence. It's not only my favourite flim, rather it's my charger of soul. Thank ...MORE","label":0},{"review":"This is my favourite movie , Guru bhai is excellent and also his wife Aishwarya. Mithun Chakraborty is also speechless. \n\nDhirubhai Ambani is the father of every Indian businessman. Salute to his fighting and genious character. I have inspired in my early stage of career by watching this flim by Maniratnam . What a director he is!!!\nI watch the movie every time when I feel depressed .....it's a ocean of energy and confidence. It's not only my favourite flim, rather it's my charger of soul. Thank you Maniratnam ji , for making such wonderful flim.","label":0},{"review":"It's the best movie i have ever seen on business it's really amazing masterpiece. Acting ny Abhishek Bachchan is really crowd pleaser. He amazingly did a great job. All characters were good. And song jaage hain by ar Rahman and ks chitra is really pleasing and best of this movie. Overall 9.5/10 its amazing 😍","label":0},{"review":"If a movie can lead to real life bonding between Male and Female lead,it must contain some trueness in it. It portrays perfect chemistry between Aishwarya and Abhishek. \nThis movie is about how an ambitious small town guy,with moral support of his wife can rise to become the biggest tycoon in Business circles.\nFrom Roza to Guru, one can watch any of the Mani Ratnam's classic movies with AR Rahman compositions.","label":0},{"review":"It's an outstanding  inspiring movie!\nOften I watch this movie. Simple step by step , with strong will and  definite urge to make a place for himself,  against all social odds!\nHis crisp but soul touching speech before inquiry commission , I always admire. Ashwarya role is perfect !","label":0},{"review":"This was the career best performance of Abhishek, making Amitabh Ji a proud father. Movie is just a favourite one for a lot of entrepreneurs like me. Many a friends I have heard uttering a famous dialogue “Itna darenge to Dhandha kaise karenge!?” \n\nMost unfortunate part is non availability of its original DVD in the market. I have never seen this movie on any movie or other channels as well. It was a master piece.","label":0},{"review":"If you want to watch a better amitabh bachchan You can watch in this very content high movie. Everything form starting to the end this movie is a pure gem. It is just marvelous. Must watch every businessman","label":0},{"review":"guru film is the best film. the man who became richest in the world by his thinking power,and by taking risk in any business. And the actor and actress who played this role is perfect jori.","label":0},{"review":"This movie is damn awesome... Specially being a gujrati... Extra love for movie❤ and also as an indian... More extra love❤ for the india's biggest tycoon.... Every indian should watch this movie... Atleast once...","label":0},{"review":"The movie inspire all the people who want success in there lives. It is fire 🔥 of motivation. The attitude of Abhishek bachchan is mind-blowing. Owsam","label":0},{"review":"This film is very good, from casting of actors to cinematography and music. Some people might not like the 2nd half because the tone changes but it is still good.","label":0},{"review":"We can see the greatness of Maniratnam sir and the acting brilliance of Abhishek Bachan, Aishwarya Rai, Vidya Balan, Madhavan and Mithun. This movie is a big pride of Indian cinema","label":0},{"review":"The movie was so good. Abhishek Bachchan acted good in the movie. The story was also good in the movie. Songs were not good but BGM was good in the movie. Suriya's voice for Abhishek Bachchan was excellent sync.","label":0},{"review":"Guru Film has earned Aishwarya Rai Bachchan and Abhishek Bachchan the reputation of best couple in said  industry... They are seen as a .... ..... ...... I love their Chemistry both inside and outside of the screen.","label":0},{"review":"Salute to Abhi bhai.....natural & pure like transparency in depth. \nLove you bhai as much as Amitabh Ji Sir.\n\nGreat Job everytime.","label":0},{"review":"It is the best movie for developing generation.\nI will be inspired this movie.\nIt is Based on Dherubhai Ambani Life Story & his struggle.","label":0},{"review":"One of the best movies I've seen.... Very close to my heart!!! Movie for every aspiring Indian Entrepreneur.","label":0},{"review":"Awesome direction by mani ratnam sir, fabulous acting by Abhishek Bachchan,aishwarya & music is fantastic ever forever by A.R. Rahman.\nSuper hir movie.","label":0},{"review":"Superb film, this is a milstone  for indian cinema,after 100 year our future also love this film.and may be proud for their past.","label":0},{"review":"Superb movie by Abhishek Bachan really feels somewhere this movie belongs to few entrepreneurs in the world .\nMani Ratnam Sir is great director 😊😊🙏🙏🙏🙏🙏🙏","label":0},{"review":"It's a one of the best motivational and family entertainment movie in the Indian cinema history. A.R.Rahman and Maniratnam holds the soul of the movie","label":0},{"review":"Even though the movie was good, it became quite hard to get along the story in the second half, because Mani Ratnam tries portray Guru as a messiah even though he built his business empire through illegal means.","label":0},{"review":"Movie moves silent with Hard time story.\nIshwarya lead a fabulous role.\nSuriya voice fantafabulous....","label":0}]