[{"review":"This is the most emotional movie i have ever watched in my entire life. Hrithik as always has nailed his role to perfectionist, Aishwarya rai is just like salt in a dish which isn't noticed much but without which the dish would have been incomplete, in the same way she has spiced her role in this masterpiece. Sanjay leela bhansali one epic director has given the best vision to the movie. Wat else can I say, i have cried the most for this movie. The movie was just 2 hrs long but made me weep fore ...MORE","label":0},{"review":"This is the most emotional movie i have ever watched in my entire life. Hrithik as always has nailed his role to perfectionist, Aishwarya rai is just like salt in a dish which isn't noticed much but without which the dish would have been incomplete, in the same way she has spiced her role in this masterpiece. Sanjay leela bhansali one epic director has given the best vision to the movie. Wat else can I say, i have cried the most for this movie. The movie was just 2 hrs long but made me weep forever thinking about it.\n \nThis movie isn't for all types of audiences especially not for the ones those who don't have patience. \n\nI just cannot understand why was this movie an utter flop? Hrithik doesnt deserve this kinda audience we have depreciated such an overwhelming performance by one of the greatest actors of all time\n\nI was always the biggest fan of hrithik but after watching this movie he made me worship  him\nWhenever he laughed in this movie, i wept, i wept, i wept and i just wept... \nThis is a must watch movie for all the movie lovers","label":0},{"review":"Movie is amazing with a great question.\nWhen we have a right to live with dignity then we must have the right to die with dignity.\n\nBut also here Ethan lost his hope here which delivers very bad example. We don't get everything but ending life is not the solution. I expected that after marrying he would skip the idea of death. \nSnake does not have legs but they are great predators. Animals have lesser IQ than human do they kill themselves.\n\nI have my opinion but still this may vary from person t ...MORE","label":0},{"review":"Movie is amazing with a great question.\nWhen we have a right to live with dignity then we must have the right to die with dignity.\n\nBut also here Ethan lost his hope here which delivers very bad example. We don't get everything but ending life is not the solution. I expected that after marrying he would skip the idea of death. \nSnake does not have legs but they are great predators. Animals have lesser IQ than human do they kill themselves.\n\nI have my opinion but still this may vary from person to person.\n\nMovie is truly a master piece, well directed with great actors.\n\nJust want to add, see this movie alone and with a good mood, because other people perspective or bad mood may affect your taste of the movie.","label":0},{"review":"I just avoided the movie from 8 years just because Everyone said its no good, nothing to watch, boring etc etc. \nLet me tell you that this movie is not for every one. Specially for the ones who use mobile while watching movie.\n\nThis is the movie I cried the most watching it in my entire life. \nNever been moved this much. Hrithik Roshan is a class actor and knows his craft. Ash, First time I liked her performance(Yes i did not like her even in devdas)\nBrilliant story telling and reality. After wa ...MORE","label":0},{"review":"I just avoided the movie from 8 years just because Everyone said its no good, nothing to watch, boring etc etc. \nLet me tell you that this movie is not for every one. Specially for the ones who use mobile while watching movie.\n\nThis is the movie I cried the most watching it in my entire life. \nNever been moved this much. Hrithik Roshan is a class actor and knows his craft. Ash, First time I liked her performance(Yes i did not like her even in devdas)\nBrilliant story telling and reality. After watching the movie I feel how privileged I am to walk, pick things.\nNever been so thankful to god. This movie has a lot to offer, if you are ready to accept and understand what its meant for. \nIts not a weekend movie. Its a movie where you learn about life. Specially about yourself. \n\nPS. sorry for this over emotional review but Its the fact, I am totally moved!!!!!","label":0},{"review":"Wow.. I mean imagine how a movie effects the mind of a person...so what does this movie inspire the disabled people to do?.. you can guess yourself...Let me give you a true example- So It happened 2 years back when my uncle being quadriplegic choose to end his life after watching this movie as even he thought that there was no other way to live then accept your faith of being disabled..\n\nI don't understand why a person cannot survive if he or she is disabled..I mean in life you need only one goo ...MORE","label":0},{"review":"Wow.. I mean imagine how a movie effects the mind of a person...so what does this movie inspire the disabled people to do?.. you can guess yourself...Let me give you a true example- So It happened 2 years back when my uncle being quadriplegic choose to end his life after watching this movie as even he thought that there was no other way to live then accept your faith of being disabled..\n\nI don't understand why a person cannot survive if he or she is disabled..I mean in life you need only one good reason to live  no matter what circumstances we face!\nWhy to give up?\nSTEPHEN HAWKING never gave up ... because he knew the true sense of living..\nWhy promote movies like this to make someone end their lives.... Thanks for inspiring my uncle to give up ..I LOVED HIM..","label":0},{"review":"It's not easy commenting on this movie coz how does one comment on a masterpiece.  The fear is that your words will be almost always undeserving. \n\nThis is Sanjay Leela's best ever and i really do not expect him to better this coz that good is this one.  The amazing direction with the surprise which Hrithik delivers makes it an amazing watch.  Aishwarya lights up the screen. The rest of the cast along with some awesome visuals and editing makes this a must watch! \n\n\nRating: Just watch it.","label":0},{"review":"It's a wonderful movie just like one of the dialogue of movie \" Life is beautiful\" . Hrithik and Aishwarya were fantastic. This movie makes you think that euthenesia or mercy killing should not be illegal. In some situation it must be legal. In this movie Ethan Mascarenhas is a very strong man who shows us that even in worst situation we can smile. One of my favourite scene of this movie is when a fully paralyzed man says \"zindagi bahut khoobsurat hai\" . In the whole movie not even for a second  ...MORE","label":0},{"review":"It's a wonderful movie just like one of the dialogue of movie \" Life is beautiful\" . Hrithik and Aishwarya were fantastic. This movie makes you think that euthenesia or mercy killing should not be illegal. In some situation it must be legal. In this movie Ethan Mascarenhas is a very strong man who shows us that even in worst situation we can smile. One of my favourite scene of this movie is when a fully paralyzed man says \"zindagi bahut khoobsurat hai\" . In the whole movie not even for a second Ethan looks frustrated because of his paralysis. This is one of the best movie I have ever seen.","label":0},{"review":"Don't know Why didn't I watch this masterpiece before. I know i'm super late, to be specific 9 years. The time when the film was released there was some negativity about it & I thought Agar log bol rahe hai ki acchi movie nhi hai to nhi hogi. But that's not true everytime. \nAnyway this is such a brilliant film. The emotions portrait by Hrithik sir is out of this world. Best actor for a reason! ❤️❤️❤️🙌","label":0},{"review":"It takes years to understand the depth of this movie. Brilliantly made, felt and crafted. \nEach character is an epitome of commitment in this movie. I personally moved by Sofiya. The Epitome of service to mankind and commitment for it. \nI wish more Sophiyas in the world to make it better to live.\nIts THE BEST Bhansali Till date. I know Best is yet to come from him. I wish him all great work.","label":0},{"review":"It's a very heart touching movie.The same things happens with the patients of \" DMD i.e.Duchense Muscular Destrophy \".But the only difference is that the lifespan of these patients is near about 16 to 17 years, and we have faced the problem in my family.\nAnd so many times I feel that this is failure of Medical Science and Research.There is still no medicines developed for the disease of DMD.\nThe movie is very true...Now only God can stop such incurable diseases.","label":0},{"review":"This movie is not for every sort of audience. It needs a sense of sensitivity and awareness to understand and feel this movie. Hrithik has done exemplary job by portraying a handicap. Aish looks & screen presence is next level. If u love and appreciated black movie u will be touched & moved by this too.","label":0},{"review":"It's a MASTERPIECE.. the detailing, art direction, cinematography, direction, music everything is perfect. Though it's not for everyone, everyone should give it a try. Hrithik gives his career best performance playing Ethan here. Great/Outstanding would be an understatement.. Aish is also fantastic.. Bhansali's best along with BLACK.","label":0},{"review":"Its a gem by Sanjay L Bhansali. It was tanked at BO but I assure you once you watch this movie you will fall in love with movie, with every scene, with every character, with every dialog and with every screenplay.\n\nGod there has been some scene where my wife literally cried and my eyes were deeply wet.\n\nAfter so many years I saw a movie which has capability to captivate you and make you so emotional with dialogs and show.\n\nMust must must watch.","label":0},{"review":"a great movie which shows raw emotions from the heart ....\na person going through such a suffering has the authority to stop his suffering......\nBrilliant work by all the actors ....Hrithik what an actor ...\nYet again he proves to be one of the top actors in the world.....\namazing direction by SLB ........\nGreat work","label":0},{"review":"This movie is emotional through and through. The mother in the film has the most beautiful dialogue and it really sticks with me as a highlight. I'm so happy and sad at the same time overall about this film, but in the best way possible. One of my favorites now. <3","label":0},{"review":"I feel like\"me before you\" and \"Guzaarish\" are the same....and its about how the film is directed..... it's Hollywood and this is Bollywood.....and the message is same in two different versions....so I love it........thank u Sanjay sir for giving it to India☮💖also hatsoff to Hrithik sir for wonderful and unique performance....... seeing Hrithik Roshan sir playing a character like this.......was just amazing....😊","label":0},{"review":"Wonderful movie. .... Hrithik Roshan's actingg is juz like cherry on top of the cake 😍 .... N it is also an emotional movie ..... But the whole concept , the cast , the direction , screenplay everything is perfect!!!!! Loved it absolute marvelous 😘😘a big thumbs up 👍👍👍👍👍👍","label":0},{"review":"This has been the first movie in my entire life in which I was not able to control my teers. Such n emotional movie. A trailblazer and a masterpiece.  Lots of love to whole ensemble cast and to Ethan👍👍👍👍👍","label":0},{"review":"After a long time of its release today I watched the full movie- GUZAARISH..... so many people told me that this film is utterly ridiculous, boring. But trust me this is marvellous. It's philosophy impressed me....this is a highly psychological film.. the people who says that this is boring I really think they don't have the ability to understand the relevance of this film.","label":0},{"review":"Masterpiece, every frame of it. HR is d actor, the director don't need to write d script keeping him in mind....he can pull off any god damm role...Ash is lob❤,,,, SLB is undisputedly the best director in India......emotions, direction, cinematography and the spirit of the movie are just perfect.....","label":0},{"review":"This movie has one of the most heart touching moments. Absolute must watch movie which includes most beautiful faces of bollywood but in serious roles. I think this flopped because we were used to regular love romance movies.","label":0},{"review":"Such a soulful performance by the great actor Hrithik Roshan! Dedication and Commitment to the role. Nailed it. Kudos to Direction too.\nVery few would love this movie, because few appreciate art","label":0},{"review":"This man has... a different level of talent...till now Bollywood is unable to reap best..of HR. Going by certain scenes of his movies..I conclude that 90% of his potential is ...still unutilised. The best of HR...is yet to come. #hopeful fan #gud luck for  Super30 ☺","label":0},{"review":"Extra ordinary\nI mean it's about someone who wants to end his life . No one can feel his pain as he do.\nAnd at last a biggest thumbs up for sanjay leela bhansali\nSuperb","label":0},{"review":"sometimes it feels like our life isn't so long ,and we have some thing that some people don't ,this movie is one of the best story line and amazing acting and also i feel something special when ever i watch it.\nit is Mohammad Aatif Khan \n                                      over and out","label":0},{"review":"absolutely stunning. \na masterpiece by sanjay leela bhansali.\nstellar performances by the leads & so well supported by others.\nsuch art is made once in a lifetime.","label":0}]