[{"review":"Vishal Bhardhwaj's magnum opus.\nLike Omkara's dark horses,Saif Ali Khan & Deepak Dobriyal : Haider has its very own dark horse - Kay Kay Menon & his gripping rendition of  Khurram Meer / King Claudius.\n\nBhardwaj has interestingly adapted Hamlet to the rise of Pakistani-sponsored-terrorism in the formerly peaceful South-Western parts of Jammu & Kashmir in the '90's - the most interesting being , Irrfan Khan's cameo, Roohdar,as the Ghost of Hamlet's father.\n\nRoohdar carries the message of retribut ...MORE","label":0},{"review":"Vishal Bhardhwaj's magnum opus.\nLike Omkara's dark horses,Saif Ali Khan & Deepak Dobriyal : Haider has its very own dark horse - Kay Kay Menon & his gripping rendition of  Khurram Meer / King Claudius.\n\nBhardwaj has interestingly adapted Hamlet to the rise of Pakistani-sponsored-terrorism in the formerly peaceful South-Western parts of Jammu & Kashmir in the '90's - the most interesting being , Irrfan Khan's cameo, Roohdar,as the Ghost of Hamlet's father.\n\nRoohdar carries the message of retribution to Haider against Khurram Meer & just like the Old King's ghost asked Hamlet to spare Queen Gertrude for heavenly justice, so does Dr.Hilal Meer request the same for Ghazala Meer.\n\nBhardwaj hasn't shied away from Prince Hamlet's/  Haider's Oedipal complex & the undercurrent between him & Ghazala - a beguiling portrayal by Tabu with echoes of ambiguity like Desdemona/Dolly (that confused Othello/Omkara)\n\nGazala is tantalizingly ambiguous,leaving Haider confused about her guilt till the very end - ambiguous about her adultery, her true intent in Hilal's arrest & her manipulation of Haider with threats of suicide.\n\nArshi,like Ophelia is trapped in her loyalty to both Haider & her father Polonius / Pervez Lone.\nBhardwaj has inserted a little red scarf into the film, that poetically traces its path from Arshi to Pervez to Haider & back to Pervez & finally to a grieving Arshi - the scarf being unravelled by the same hands that knitted it.\n\nHaider burns in the same confusion as Hamlet did. While Hamlet doubted his father's ghost as a deceptive demon: Haider fears choosing between Roohdar's & Khurram's contradictory versions of Hilal's death.\n\nHaider's dilemma is resolved when he finally overhears Khurram's confession while at prayer,displaying the remarkable self-awareness that Claudius possessed while he prayed,  \"O, my offence is rank,it smells to heaven\"\nKapoor trembling with a gun,behind an oblivious Kay Kay Menon is one of the several electrifying scenes in the film.\n\nOther adaptations from Hamlet are Liyaqat being used by Khurram to kill Haider as Laertes was by Claudius , Haider holding Arshi in her grave as Hamlet did with Ophelia , Haider's wedding dance like Hamlet's play to test Claudius' guilt.\n\nIn contrast to Hilal's request for revenge,Haider's paternal grandfather's ( Kulbhushan Kharbanda ) voice resonates till the end when Gazala reinforces his wisdom,that revenge starts a vicious cycle & no true freedom is to be attained through it,when he pointed out the ridiculousness of people demanding for freedom when they were already free.\n\nAfter collapse of the USSR in '91, the militants who warred against the Soviets for a decade were unemployed - this dangerous, unsavoury population was put to work by the likes of Zia-ul- Haq ( after humiliating defeats in 3 wars with India-'48,'65,'72 ) who transferred this blood-thirsty crowd from the Western Af-Pak borders to the Eastern Indian borders & started infiltration,brainwashing & bloodshed in the peaceful state in the '90s.\n\nHaider is a victim of this brainwashing & shows delinquent tendencies as a schoolboy when he's caught carrying a gun in his schoolbag & defies both parents when they try to send him to Aligarh to save his future from ruin.Later Haider shows no qualms in murdering a guard,bludgeoning two acquaintances ( the Salmans- Rosencrantz & Guildenstern ) to death & killing Arshi's father.\n\nGhazala risks her life to save schoolboy Haider's future & education,while Haider suspects her tactics as manipulation. She obligingly puts an end to her ambiguity when she ultimately sacrifices her life for Haider ( like Gertrude drinks the poison, Claudius arranged for Hamlet )\n\nIn the blood-curdling finale, Khurram demonstrates that ,though guilty of fratricide - his love for Ghazala was true. While everyone fled from Ghazala, Khurram shockingly & bravely runs towards her .\n\nFinally when Haider could've had his revenge & has conflicting voices of his father in his mind clashing with his grand-father's & mother's, he walks away. His grand father & Gazala's voice prevailed.","label":0},{"review":"Loved this movie, and this was a the perspective on Kashmir conflict that was left out by mainstream movies(although there are some good documentaries on it). I just want more movies to unravel perspectives of all sides.Story is about grieving son's search for his missing affectionate father. Tabu (Ghazala) played an extremely complicated role at par with excellence. Role of Shahid (Haider) is no less complicated. Hardly any mother-son relation can be more complicated. With such haunting Kashmir ...MORE","label":0},{"review":"Loved this movie, and this was a the perspective on Kashmir conflict that was left out by mainstream movies(although there are some good documentaries on it). I just want more movies to unravel perspectives of all sides.Story is about grieving son's search for his missing affectionate father. Tabu (Ghazala) played an extremely complicated role at par with excellence. Role of Shahid (Haider) is no less complicated. Hardly any mother-son relation can be more complicated. With such haunting Kashmir's political and emotional scenario around Tabu and Shahid, pain can be sensed in every scene. Shradda Kapoor struggles - to win space in torn-broken anger filled Haider and continual pressure from family opposing her relationship with Haider. Irfan Khan as usual steals every viewers attention for a while. Unusual suspense unrevealed and build at the same time with his entry. Movie had a fantastic end.In my opinion, Haider is wonderful piece of art, yells in pain with poetic narrations, complex sentiments and immense emotion.","label":0},{"review":"≡≡Exceptional≡≡\n\nVishal Bhardwaj known for his adaptions of Shakespeare's plays. No doubt, he is one of the best director of this time and in my opinion only suitable director to direct a  hindi version movie of Shakespeare's plays. And he is the only one which knows how to bring out the real actor from Shahid Kapoor. And believe me, when this Jodi comes together, the output is goose bumping. (Just like Kaminey)\n     Haider is an adaptation of Shakspeare’s Hamlet and the third and final instalme ...MORE","label":0},{"review":"≡≡Exceptional≡≡\n\nVishal Bhardwaj known for his adaptions of Shakespeare's plays. No doubt, he is one of the best director of this time and in my opinion only suitable director to direct a  hindi version movie of Shakespeare's plays. And he is the only one which knows how to bring out the real actor from Shahid Kapoor. And believe me, when this Jodi comes together, the output is goose bumping. (Just like Kaminey)\n     Haider is an adaptation of Shakspeare’s Hamlet and the third and final instalment of his Vishal’s Shakespearean Trilogy after Maqbool and Omkara. The soul of the film lies in - In depth acting by Shahid. This is one of the best role of his career (Kaminey's double role was his second best role in my opinion). The plot is just same as Hamlet with the addition of Kashmir's present situations. Stick with Shahid.. He is the best asset of the movie, Love him.. his role.. just wow.. \n     K.K.Menon is a perfectionist, he's too good in his role. Tabu plays Shahid's mother was great. Late Narendra Jha plays Shahid's father was also good in his dialogues delivery and it is one of the best role of his short film career. Irfan Khan as Roohdaar got the characteristic tune of Haider. As always.. He is brilliant. Which brings us to lovely Shraddha Kapoor.. although her performance was just OK nothing much add in the storyline. She looks cute and quite sexy because of her red-red plumpy cheeks. She's really looks like Kashmiri. \n    At the end, Shahid's best performance, great cinematography, songs, best dialogues & Shraddha hold my attention till the end. I really enjoyed this movie.","label":0},{"review":", This latest adaptation of Hamlet has a lot of taste-makers, which together make a soup of all, and leaves a strange taste in the mouth. This is not a story of Kashmir, but a story which happens in Kashmir. A story full of brilliant performances and picturesque cinematography. A story with strong characters and stronger emotions. A story which gets an instant applause at the end. In terms of adaptions, this would be a long remembered one.\n\nI'd say that while Haider is a brilliant Shakespearan r ...MORE","label":0},{"review":", This latest adaptation of Hamlet has a lot of taste-makers, which together make a soup of all, and leaves a strange taste in the mouth. This is not a story of Kashmir, but a story which happens in Kashmir. A story full of brilliant performances and picturesque cinematography. A story with strong characters and stronger emotions. A story which gets an instant applause at the end. In terms of adaptions, this would be a long remembered one.\n\nI'd say that while Haider is a brilliant Shakespearan reconstruction, it also has themes of Orwellian ideas in it. The existence of mass graves, detention centers, disappeared people, torture camps, and a police state on Indian soil with all the freedoms of the Indian constitution is nothing short of the Orwellian notion of doublethink. Another example of doublethink is when a lawyer advises a grieving father of a detained person to sue his son so that at least he goes to court and hence won't 'disappear'. Indict someone with a crime to prove he's innocent. Classic doublethink.","label":0},{"review":"In 2014, I was very young and found it very slow so stopped watching it halfway. But In 2019, I got to know about Kashmir and then I watched Haider and I can seriously say It's one of the Best Works I've ever seen! This movie didn't miss a single mark to be called as a Masterpiece. This movie is Perfect!","label":0},{"review":"Life is tragic in itself. This is less a movie n more a life long sorrow of kasmir. Truth, revenge, oppression, depression, rage, love, loyalty.... everything that makes a man to do certain things. Nothing is fairly right or wrong unless different perspective is used. No one is truly wrong, we just have differences. Some ppl accept those differences, whereas few choose to deny n accuse everyone n everything. Ppl aren't fond of watching harsh reality. That's why Haider isn't a hit. But a tinest p ...MORE","label":0},{"review":"Life is tragic in itself. This is less a movie n more a life long sorrow of kasmir. Truth, revenge, oppression, depression, rage, love, loyalty.... everything that makes a man to do certain things. Nothing is fairly right or wrong unless different perspective is used. No one is truly wrong, we just have differences. Some ppl accept those differences, whereas few choose to deny n accuse everyone n everything. Ppl aren't fond of watching harsh reality. That's why Haider isn't a hit. But a tinest part of ppl is still there who loves n dare to watch such amazing work.\nThis movie is for those few ppl like me, who loves to watch n explore life experiences in numerous way.","label":0},{"review":"I've done my graduation in  mechanical engineer working 7 years in my relevant field in different locations and of course in every field like fabrication, design ,quality and purchase etc but no where I got satisfaction during this period I was also active in reading and writing and it ends when I first saw Vishal Bhardwaj's Maqbool on Silver screen as I read Macbeth. He knows how to direct the particular character dialogue with active emotion, action and the background score in every movie it's ...MORE","label":0},{"review":"I've done my graduation in  mechanical engineer working 7 years in my relevant field in different locations and of course in every field like fabrication, design ,quality and purchase etc but no where I got satisfaction during this period I was also active in reading and writing and it ends when I first saw Vishal Bhardwaj's Maqbool on Silver screen as I read Macbeth. He knows how to direct the particular character dialogue with active emotion, action and the background score in every movie it's awesome I mean no words to say.Iam big fan of this guy and whole team and want to be a part of it .","label":0},{"review":"One may smile, and smile, and be a villain.This one is epic.To be or not to be, that's what comes to our mind when we think about Hamlet,and to me this one is the best adaptation of Shakespeare's Hamlet.The film is very much intense and powerful.Strong performance by the actora make this movie much more powerful than the epic work of Shakespeare.What else can we demand from a director when he tries an adaptation of such a well known,highly acclaimed work.The powerful visuals along with the power ...MORE","label":0},{"review":"One may smile, and smile, and be a villain.This one is epic.To be or not to be, that's what comes to our mind when we think about Hamlet,and to me this one is the best adaptation of Shakespeare's Hamlet.The film is very much intense and powerful.Strong performance by the actora make this movie much more powerful than the epic work of Shakespeare.What else can we demand from a director when he tries an adaptation of such a well known,highly acclaimed work.The powerful visuals along with the powerful music add more intensity and depth to this film.This is Shahid Kapoor's best performance till date.Haider is a must watch movie and the best adaptation of Hamlet.","label":0},{"review":"I loved this movie. It portrays the existing insecurity and human rights abuse in Kashmir. It’s a 2014 movie but the situation in Kashmir still the same, even worse right now in 2019 because of Modi government conspiracy. It’s one of the best Indian movie I have ever seen. The director was not afraid to show the real picture through his movie. Heads off, Vishal Bhardwaz! You did really a good job!","label":0},{"review":"One of bharadwaj's best works.definitly one of the best movies on serious issues made in recent times.the discourse on the inevitability of death is handled extremely well and the music used to potray it is beyond compare.hamlet(i.e.haider)moral dilemma is show very well.the film has all the existentialism of the original text along with the boold shed,yet the plot is tight and you will not be bored for a single moment even if you arent a fan of shakespeare or dark existentialism.","label":0},{"review":"It is a great film and analyses the Kashmir problem excellently in an analogous way. \nIf we see, Gazala as Kashmir and Khurram as India, the problem becomes clear.\nThe solution has been indicated but escaped in the film. The solution lies in a genuine effort to forgive but looks impossible. Only the trust between Khurram and Haider could have solved the problem. But why Haider should trust? It is a question for Indian government.","label":0},{"review":"This movie is great because in this film about the kashmir life and more information about Kashmiri people. Kashmiri people iS not a terrorist not a stone Pelter .some people in kashmir stone Pelter means .100%in 5%people as a stone Pelter  I  also Kashmiri person i love india kashmir not a part of pakistan not a part of other kashmir is only muslim majority no aloud hindu , cristian,sikh , and other only Kashmiri people  make a house here in the kashmir jai hind jai bharat and jai  muslim major ...MORE","label":0},{"review":"This movie is great because in this film about the kashmir life and more information about Kashmiri people. Kashmiri people iS not a terrorist not a stone Pelter .some people in kashmir stone Pelter means .100%in 5%people as a stone Pelter  I  also Kashmiri person i love india kashmir not a part of pakistan not a part of other kashmir is only muslim majority no aloud hindu , cristian,sikh , and other only Kashmiri people  make a house here in the kashmir jai hind jai bharat and jai  muslim majority and I salute kashmiri people .I love my kashmir only kashmir","label":0},{"review":"This film is totally anti national and against our armed forces.\nThis film only tells about sufferings of kashmiris but not about the sacrifice made by Indian soldiers,who are sacrificing their today for our tomorrow.\nThis film does not tell about army's initiative \"SADVABNA\" or crpf's initiative \"MADADGAR\". This film does not show the brutality of stone pelters who do not even spare children .kashmiris are wanting 'azadi' but not from India but from violence\n And only for this reason daily 2100 ...MORE","label":0},{"review":"This film is totally anti national and against our armed forces.\nThis film only tells about sufferings of kashmiris but not about the sacrifice made by Indian soldiers,who are sacrificing their today for our tomorrow.\nThis film does not tell about army's initiative \"SADVABNA\" or crpf's initiative \"MADADGAR\". This film does not show the brutality of stone pelters who do not even spare children .kashmiris are wanting 'azadi' but not from India but from violence\n And only for this reason daily 21000 kashmiri youths are submitting application to join Indian armed forces.\nJai Hind","label":0},{"review":"Adapted from Shakespeare play hamlet  haider has everything you want from the movie with great concept and story to best acting by shahid ...The movie will mesmerize you in every possible way with focusing on son father relation to the problem and issues with  Kashmir \nOverall rating 4/5","label":0},{"review":"one of the best movies i ever watched. And it is an adaption of shakespeare's Hamlet.Talking about Haider here you can't find who is wrong and who is right,if you looking for a romance movie,you can't find it here,i don't want to spoil the story so watch the movie and thank me latter.😉","label":0},{"review":"I love this movie sooooooooooo much,  excellent outstanding work by sir Vishal bhardwaj jee,  loved Shahid kapoor & Tabu mama's work.  I don't have words to describe this awesome phenomenal movie.","label":0},{"review":"One of the best movie i had ever seen. Story and acting was really great. Really an awesome movie. Must watch once in life.","label":0},{"review":"One more amazing act of art by Vishaji and whole crew. To have Shakespeare at Bollywood is matter of proud. Such a wonderful treat!","label":0},{"review":"I am Fan of William Shakespeare's \"Hamlet\". Haider is outstanding an adap-\ntation of William Shakespeare's \"Hamlet\" on Kashmir background by Vishal\nBhardwaj and outstanding act by Shahid Kapoor, Tabu, Kay Kay Menon, Irfan\nKhan, exc. This film is my most favourite film of Bollywood.","label":0},{"review":"This movie is mere glorification of people who help militants or people who are militants. It sympathising the militants life. \n\nThere's no human rights for those who indulge in militancy or terrorism. There must not be any sympathy or empathy on those.","label":0},{"review":"Not at all best Movie of indian Cinema. Acting quite good. A lot of effort made in acting which is quite visible. Movie got all national awards except for best movie. which seems fair..!","label":0},{"review":"one of the most underrated movies of Shahid. Bharadwaj beautifully potrayed that how the clashes of egos between the two countries have destroyed the paradise while no body gives a damn about the locals who are living there and suffering the consequences.","label":0},{"review":"Based on Shakespeare's tragedy 'Hamlet'. theatrical screenplay gives complete feel of a play. All actors gave their best. A Vishal Bhardwaj's masterpiece.","label":0},{"review":"An anti national movie and all what shown is wrong and false actually is the doctor helps terrorist he is also a commiting a crime and this movie leads youth to think negatively that Indian Army is torturing them but they haven't shown who protects them saves them who sacrifices live to save those dumb kashmiris and they women all wha shown is false and promoting wrong image of Indian Army","label":0},{"review":"This movie kept us intrigued and entertained throughout the entire time which is much more than we can same about some of the latest Bollywood releases we wasted our evenings on.","label":0}]