[{"review":"One of the best movies to come out of Dharma. A nice feel good rom-com with many many good moments... Ad film maker Vinil Matthew's feature film debut is brimming with expertise of catching character nuances and perfect reactions from its talented star cast. It's unconventional yet familiar... slightly over the top characterisation yet rooted in the reality of modern times' interpersonal relationships.","label":0},{"review":"One of the best movie of all time. Will definetly make in my top 10 movie list. Fresh love story, amazing screenplay & direction. Cherry on top is it's lovely music & songs. Parineeti & siddharth have both done justice with their roles. Just wish that movie had some different title. Coz of this title I didn't dare to watch in theatre :p.\nDo watch this movie at least once!","label":0},{"review":"One of the best Movie I Had ever Watch Or My Most Fav MOVIE Of All Time Maybe the best movie ever Made. This movie is always fun watching and completely family entertainer. Comedy. Interesting love story. Unique love triangle. Never gets old. Every time I watch. It's always as good as it was the first time. And Parineeta, hats off!!\nI love Her","label":0},{"review":"Why didn't I watch this in the first place. I watched in Jan 2019 and let me tell you one the movie is simply amazing.  Siddharth and Parineeti have done justice to their roles and make good jodi. This is definitely in my top ten. IMDB should revise their rating.","label":0},{"review":"A movie who ask you to become selfish and only only think about yourself .\nA garbage movie , i wish i can throw out this garbage from my mind which wasted my 2:20 hour of my life .\nThe main character , i don't remember her name exactly , i think meeta she stole money from own father and ran away and she returns to just steal once again .\nNot just this but also she made her father the gurantor illegally .\nReally really rubbish , unentertaining , rotten different sotry movie .","label":0},{"review":"Brilliant movie, a must watch! A very new storyline with new Star cast who are stealing the show with their acting which is subtle yet so captivating! Music again is so freshing and cherishing.. creates memories that lasts forever!!","label":0},{"review":"This will definitely make to my top 10 all time favourites. A very rare feel good movie with all the right things at the right place. The cast is hilarious and soothing screenplay. Must watch!!!","label":0},{"review":"One of the best. Maybe the best movie ever. This movie is always fun watching and completely family entertainer. Comedy. Interesting love story. Unique love triangle. Never gets old. Every time I watch. It's always as good as it was the first time. And Parineeta, hats off!!","label":0},{"review":"One of the most most most most interesting and loving movie . Loved this movie . Loved a lot . Really really great work done will always be on the top of the films that have made a impact on me really really happy after watching this movie.","label":0},{"review":"An amazingly refreshing romantic movie which has been surprisingly under rated by the public. The songs are amazing and the acting of all actors in superb. Ms. Chopra has proved her acting skills in this. I would rate it 10/10.","label":0},{"review":"This movie is really fantastic idk why IMDb rated it only 6.9 it deserves 8+ and tbh this movie is 100 times better than many overrated love story movies...every actor did Great job and the songs are heart touching.... trust me such movies in Bollywood will not be made again.","label":0},{"review":"It has become my top favrt listed movies I have watched yet I can  watch it over n over it's based on the reality \nOf a relationship where people r together bt not happy and  some temporary people comes with some much of happiness  in our life that we make them are permanent people great motivation for the youth...","label":0},{"review":"Awesome Movie...amazing acting by everyone and an interesting love story. Definitely deserves more rating! One of movies which can be watched again and again...beautiful songs... loved it too much!","label":0},{"review":"I absolutely loved this movie, can watch it over and over again, cute romantic  moments  with beautiful songs and all characters have played so well.Comedy is also so refreshing, Parineeti's comic timing is great!Also the flim looks very realistic, nothing overboard!","label":0},{"review":"Wow  there is some thing relatable and easy going about this movie... So refreshing..there was hardly any dull moment in this movie  the characters the casting, plots and music was fairly adorable...a fun to watch movie with a twist ..","label":0},{"review":"Parineeti and Siddharth proved that they are mature actors and this is a fantastic movie no loudness no actions. Everyone in this movie performed nicely. A Family entertaining movie.","label":0},{"review":"A movie which I could never miss. One of the best movie of bollywood and mine too with blockbuster hit script and superhit songs. A must watch film in life","label":0},{"review":"very good and sensible movie with wrong name. it has everything romance, comedy, family relations and  women emancipation woven in fresh story line.\ndialogues and acting too good. I love it","label":0},{"review":"This is one of the most entertaining movies. It’s a must watch. I have seen it over 10 times and still can’t get over it. Watch it. It will make your day 🙂","label":0},{"review":"Must watch movie, with beautiful song specially ishq bulava the story is good and Siddharth and parineethi did their best. I have seen 3 times loved it😘😘👍😍","label":0},{"review":"This movie is really awesome. The love story is so cute and heart touching that I ever watch..star cast are also doing very great job that seems so natural..less melodramatic also..","label":0},{"review":"Omgggggg! m watching this in 2018 ! Why I didn't watch it earlier! my bad! This movie is the best! Absolutely relatable and story line is superb.","label":0},{"review":"Surprisingly good movie, unlike mainstream bollywood, actors actually behave according to their roles and the dialogue are thought out well. Also, the songs are a big plus and the ending's emotional","label":0},{"review":"The name of the movie and trailer will make you think that this is yet another cliched rom com.\nBut it is surprisingly good movie which keeps you involved throughout.","label":0},{"review":"This is my favorite movie. I feel like watching the movie over and over again. I m in love with this movie. They acted wonderfully and I get Connected..","label":0}]