[{"review":"Movie is just OK. Vishal Pandya did a good direction and Songs in the movie were too good and awesome. Sushant Singh looks badass in his role and one of the cruel villains ever. BGM by Sunny and Inder Bawra was good. But what lacks here is good screenplay. Screenplay needed a good treatment but sadly screenplay is sort of average. But still you don't get disappointed with the movie.","label":0},{"review":"Very different story i just love this movie it shud be biz office hit movie but bad luck ,surveen acting is outstanding ,after seening her movie I becm fan of her ,socha tha she will get more movie for her outstanding performance in hate story2 but but her bad luck but guys she deserve round of applause for this movie.","label":0},{"review":"one of the very very few films i found utterly annoying and disgusting. the plot was too boring. the screenplay was further flat. the storyline was dull and predictible and everything was out of place. bad film. the director probably didn't have a clear visioj while making this one","label":0},{"review":"Best movie in this series till now. The revenge was good and Surveen's acting was way better than the other movies she has acted in.","label":0},{"review":"Surveen should not have fallen pray to this screenplay of such story. I an audience, i felt hurt on having seen her in this role.","label":0},{"review":"Outstanding act doing by surveen.\nTotally Amazing movie.","label":0},{"review":"I like this movie and I liked surveen perfect actress in this movie nice acting","label":0},{"review":"Good entertainment\n.heroin's acting is superb.Direction is also good.","label":0},{"review":"Nice things\nSo lucky you","label":0},{"review":"Good song just for hearing","label":0},{"review":"i also love this movie","label":0},{"review":"Nice movie my favourite","label":0},{"review":"Is very nice story and nice movies .","label":0},{"review":"Lovely movi","label":0},{"review":"Relationship preparation about life\nAnd stay life","label":0},{"review":"Excellent movie !","label":0},{"review":"Nice movie","label":0},{"review":"Nice movie","label":0},{"review":"Hate story 2 movie hd download","label":0},{"review":"My favourate heart touching movie😍😍😍😍😍😍","label":0},{"review":"I love you","label":0},{"review":"So interesting","label":0},{"review":"So very sexy","label":0},{"review":"Hate Story 2 full movie HD","label":0},{"review":"Hate Story 2 kubsurat pictures","label":0}]