[{"review":"This is my favorite movie ever. Because I think I have some thought in this story. This move realize by every single person, have to thought that what the hell is this going on when have to face same condition. It also thought that the concept of before 80 years past to go the boy character where heroin is waiting for someone. But she don't know, is her life is risky or not but when the boy character is fully entirely her life then she realize this is man is coming form future for save me my lif ...MORE","label":0},{"review":"This is my favorite movie ever. Because I think I have some thought in this story. This move realize by every single person, have to thought that what the hell is this going on when have to face same condition. It also thought that the concept of before 80 years past to go the boy character where heroin is waiting for someone. But she don't know, is her life is risky or not but when the boy character is fully entirely her life then she realize this is man is coming form future for save me my life. But until the end part is very sadly because director had a genius mind to come back to real life of hero and heroin. And finally again she wrote a different message for REHAN. Beautiful amazing 😍","label":0},{"review":"I think that I'm literally in love with this movie. It had a fascinsting script and thrilling scenes. The acting was strong and fabulous. The music was inspiring and deeply moving. The film catches both, a sense of terror and sadness at the same time.\n\nThe concepts of the ghosts was done really well. Tia Bajpai's acting was beautiful. I am really glad that this movie exists.  In my opinion, no other horror movie can beat THIS truly amazing masterpeice.","label":0},{"review":"This movie is underrated!!\nThis movie has an uneven screenplay but convincing plot.\nRegarding the direction aspect,there is something missing.\nThe direction could have been better!!\nAlthough the twists and turns in the plot makes it an exciting watch.\nMusic is very well composed and is very strong aspect of the movie.\nActing is okayish..you can't expect much from newcomers!!\nThey lack still the experience of method acting.\nRating: 2.75 out of 5.","label":0},{"review":"Very. Nice well. Plotted movie. Really touches your heart. The pain and the agony that was trapped for the past 80 years was truly saddening. From the beginning till the end the movie was scripted nicely. Loved all the movie tracks. A man who loves a woman who was alive 80 years back and fights with the destiny and time to save her was amazing.","label":0},{"review":"Whenever I hear word of horror from bollywood, firstly it reminds me this movie...\"HAUNTED 3D\". What a Epic movie.. The story line was very interesting and every charectar in the film was Greatly showcased. My Favourite Horror film ever from Bollywood❤️👻","label":0},{"review":"Haunted 3D is an honest approach by the gifted Filmmaker  Vikram Bhatt. All the actors had delivered their roles with gusto. Message of the movie is touching. Some of the scenes are really scary. A well made horror flick. Don't miss it.","label":0},{"review":"Hi this is awesome movie.Great story and lovely romantic songs ever .Little sad have sawed on ending.But it's seems real as we see each of scene and not feel bore even one second till end without break.","label":0},{"review":"I was only 8 years old when I watched this film, very scary and horror acts was there in the movie.Amazing and lovely story the girl who was trapped for 80 years by evil spirit of iyer. It was my favourite❤️❤️ movie and first horror 3d movie.","label":0},{"review":"I very like this movie .it is my favourite horror movie and Tia bajpai is my favourite actress.l am her biggest friend .she is so good acterss and singer . This movie was Soo wonderful. It was very Hart toching movie and Tia bajpai (meera) is a big mystery.l so likeddddd it","label":0},{"review":"The movie is actually good. It has a plot - has an emotional sense and a sadness as well as well as happiness lingers by the end of the movie - and nothing overdone. Has a perfect closure.","label":0},{"review":"The film is abounded with pathos . In my life this is the film , I have ever seen , which has a happy ending without consolation .\n\nSuperb , pleasing , romantic , pathetic and even consolatory ... .. .\n\n\nBollywood has never had this type of genius conception of film .","label":0},{"review":"Super Movie. I always love this movie. I can watch it number of times. Good music. Akshay acted very well. It's my favorite movies","label":0},{"review":"Nice Acting. Nice Story. Nice songs still now i listen the songs and a must watch horror movie . It is much better than current horror movies","label":0},{"review":"Seriously movie is really awesome,,,how the director played with a sweet couple of love by sending hero to earlier days,,taht imagination was really awesome...i have never seen like this,,,pure love you can see....👌👌👌","label":0},{"review":"It was amazing concept better than any other Bollywood or Hollywood movie i jzzz love this movie ..... Totally unexpected theme but interesting, tia bajpai m a huge fan of urssss","label":0},{"review":"I love this movie..it was very heart touching story with joined amazing nd lovely songs......\nThis movie not just a horror film but also a  real love...","label":0},{"review":"Really nice horror movie... heroin is very beautiful and concept is too good which is those who are try to cheat our closer persons then their situation must be like this..","label":0},{"review":"Awesome yaar I am listening it's song from 2011, 9 years of loving it and feeling song and I can't never get bore from it\nLove you And Love this movie and best ever song\nLove you","label":0},{"review":"It is a great movie with a fully new type of story. And the romance shown in this movie was also good.","label":0},{"review":"Favourite movie ever in horror from india...\nBest songs, best concept, and tia's best performance which actually depicts the pain the character underwent ....","label":0},{"review":"I LIKE THESE MOVIE SO MUCH . MY FAVORITE MOVIE IS THESE . IN HORROR MOVIE LIST ,THESE IS THE BEST HORROR MOVIE IN INDIA.\n      \n                                  THANK  YOU ...\n\n                                         FROM\n                              SUBHAM'S  WORLD","label":0},{"review":"One of the best horror movies more movies like this should be made \nReally luved it what a story line simply awesome","label":0},{"review":"a beautiful heart touching love story wrapped in a cover of horror. A story of unconditional love . Just loved it.","label":0},{"review":"This is my best horror movie ever... I just love this story... Superb movie😍","label":0},{"review":"First half was really scary but second half was full of overacting and dumb story narration. Songs were really good in this movie but director unnecessarily added a love story which was sort of Boring.","label":0}]