[{"review":"Amazing movie. Storyline direction presentation was very good of this movie. Actors acting were superb specially karrena kapoors acting was real good I didn't  thought that she will act so well in this movie.  Dialogues were motivational . Good movie. Songs were good too. Nice movie . Family drama felling was there. Keep it up.","label":0},{"review":"I loved the movie a lot. This movie was really inspiring. This shows that this profession is not at all easy. And what to say about Kareena.  She was amazing in this movie. Since this movie she has became my favorite actress.","label":0},{"review":"Kareena your stunning. I think arjuns and kareenas chemistry was more or less there. Fan movie and moreover a realistic movie","label":0},{"review":"Since I'm a die hard kareena fan and since I make it a point to watch every film of hers, this one was a disappoint on the script level.. but if u love Kareena then it's a treat!! So for me the film worked only because of Kareena!!!","label":0},{"review":"I  really  like  this  movie  and  kareena  acting  it's  osm my  profession  is  also  acting  this  film  show  many  difficulties  face them in    female  actors  destiny  to  prove  your  self","label":0},{"review":"It’s a very motivational movie , I saw it for the First yesterday ! And I loved it !!","label":0},{"review":"i like this movie a lot.superb fantastic,and mindblowing role of kareena kapoor","label":0},{"review":"I loved this movie a lot . Outstanding acting by karena Kapoor.","label":0},{"review":"Bakwas movie! I don't comment on movies but this one made me do it.","label":0},{"review":"Extreme  fabuLous  movie  Kareena's  Superb  Performance _ _ _","label":0},{"review":"This movie was awesome and amazing","label":0},{"review":"Outstanding","label":0},{"review":"Kareena kapoor is simply superb ❤️❤️","label":0},{"review":"Cute Cute Cute","label":0},{"review":"Amazing movie...  Kareena mam totally rocked...","label":0},{"review":"I think it is good movie","label":0},{"review":"This movie is amazing","label":0},{"review":"Its fantastic through all things...💖","label":0},{"review":"i like this movie very much . i spend so much time for this movie","label":0},{"review":"Fabulous movie❤️","label":0},{"review":"An excellent movie...❣️❣️","label":0},{"review":"Kareena was fantastic in the movie.","label":0},{"review":"Very nice movie","label":0},{"review":"Oh! karena is very good actors.","label":0},{"review":"Good movie🎬","label":0}]