[{"review":"I think it is funny especially when the baby does the 'accident' in the beginning! Akshay is so funny! I also recommend the housefull 1, 2 and 3!!!! Can't wait for number 4","label":0},{"review":"I love this  veerryyy cute  baby  and film also best and I also wNt to watch his movie  sooryavanshi  . Akshay is best and her daughter  nitara  is also  cute performance","label":0},{"review":"This was  very heart touching  and i cried while  watching  it . Everyone must watch the movie.  Its amazing .🙂👍😔","label":0},{"review":"The movie is watchable only for its 1st half because the comedy scenes were good in 1st half only. 2nd half of the movie was a complete mess and you just don't care about the movie \nRatings:6/10.","label":0},{"review":"This is the best comedy movie...\nI have watch full movie...it is very interesting... I hope you enjoyed this movie...","label":0},{"review":"Great movie, I whatched this movie when i am 5 year old and I still remember the full movie scene by scene.","label":0},{"review":"akky is always funny keep it up man I am here to laugh","label":0},{"review":"This is very fabulous movie and baby is very cute, a lot of I like it.....","label":0},{"review":"its funny.i liked it too much .i liked the akshay kumar's role the most","label":0},{"review":"i love this movies and i heartly loves the cut baby","label":0},{"review":"I just say ..The best comedian is Akshay Kumar..love u akshay","label":0},{"review":"Super film i love the film sajId bhai hats off","label":0},{"review":"I just love babies.... .great movie.....thanks akkshay for being a father...","label":0},{"review":"COMEDY MOVIE SONG MAST KALANDAR  VERY GOOD","label":0},{"review":"Best comedy movie of all time","label":0},{"review":"One of the best movie of akshay kumar","label":0},{"review":"The baby is very cute I love angel","label":0},{"review":"vidhya is such a talented and beautiful actor..","label":0},{"review":"Very funny I really like it","label":0},{"review":"Childhood memories","label":0},{"review":"I love this film","label":0},{"review":"Nice movie","label":0},{"review":"Nice movie","label":0},{"review":"I haven'tseen this movie but here is 5 stars","label":0},{"review":"Love this movie","label":0}]