[{"review":"So A Nice Story Beautiful\nSome Place Veera Tripathi  He Liked Enjoy Riding And She Wants Riding Fresh \nAlia Acting Was Good\nHighway is a visual and aural treat, a refreshing break from the monotonous story lines of the mainstream Bollywood cinema, a medley of emotions, an intricately woven cinematic tale of love, freedom and adventure. It is a wonderful representation of the unconventional Indian cinema from the likes of Anurag Kashyap, Dibakar Bannerjee and Raju Hirani. And because it scores wo ...MORE","label":0},{"review":"So A Nice Story Beautiful\nSome Place Veera Tripathi  He Liked Enjoy Riding And She Wants Riding Fresh \nAlia Acting Was Good\nHighway is a visual and aural treat, a refreshing break from the monotonous story lines of the mainstream Bollywood cinema, a medley of emotions, an intricately woven cinematic tale of love, freedom and adventure. It is a wonderful representation of the unconventional Indian cinema from the likes of Anurag Kashyap, Dibakar Bannerjee and Raju Hirani. And because it scores wonderfully on all above parameters, it is a great movie. Loosely based on the Stockholm Syndrome, Highway has stellar performances from Alia Bhatt (actor), Randeep Hooda (actor) and the rest of the supporting cast as well. Alia's character had a lot of interesting quirks and a few grimy tales from the past which made for some excellent seasoning. She completely owns the house during the final 20 minutes of the movie. Rarely before have I witnessed a completely silenced audience, with their eyes glued to the big screen, unflinching, almost mesmerized by every frame. Rahman's music, as always, is tailor-made for every situation in the movie. From the sufi beginnings of \"Patakha Guddi\" to its rock outro to the soothing reverberations of Tu Kuja, every song is stupendous.The ending is what one can call \"bittersweet\" - it will leave you laughing, it will leave you crying, it will leave you mesmerized.Must watch movie!\n\n\nThanks Imtiaz Ali for presenting us with such a Wonder meaningful movie....","label":0},{"review":"Highway is a visual and aural treat, a refreshing break from the monotonous story lines of the mainstream Bollywood cinema, a medley of emotions, an intricately woven cinematic tale of love, freedom and adventure. It is a wonderful representation of the unconventional Indian cinema from the likes of Anurag Kashyap, Dibakar Bannerjee and Raju Hirani. And because it scores wonderfully on all above parameters, it is a great movie. Loosely based on the Stockholm Syndrome, Highway has stellar perform ...MORE","label":0},{"review":"Highway is a visual and aural treat, a refreshing break from the monotonous story lines of the mainstream Bollywood cinema, a medley of emotions, an intricately woven cinematic tale of love, freedom and adventure. It is a wonderful representation of the unconventional Indian cinema from the likes of Anurag Kashyap, Dibakar Bannerjee and Raju Hirani. And because it scores wonderfully on all above parameters, it is a great movie. Loosely based on the Stockholm Syndrome, Highway has stellar performances from Alia Bhatt (actor), Randeep Hooda (actor) and the rest of the supporting cast as well. Alia's character had a lot of interesting quirks and a few grimy tales from the past which made for some excellent seasoning. She completely owns the house during the final 20 minutes of the movie. Rarely before have I witnessed a completely silenced audience, with their eyes glued to the big screen, unflinching, almost mesmerized by every frame. Rahman's music, as always, is tailor-made for every situation in the movie. From the sufi beginnings of \"Patakha Guddi\" to its rock outro to the soothing reverberations of Tu Kuja, every song is stupendous.The ending is what one can call \"bittersweet\" - it will leave you laughing, it will leave you crying, it will leave you mesmerized.Must watch movie!","label":0},{"review":"True spirited CHARACTER VEERA TRIPATI....\n\nImtiaz Ali mesmerizes us by bringing true life of people loving each other for what they are, beautiful story telling, screenplay is outstanding, locations play equal role as the characters does......BRILLIANT....\n\nRandeep has smashed it more than by living the character, his breakdown while \"getting inside the hut\" before climax speaks more of him as true spirited soul and personality\n\nAlia....has lived the character truly and emotions she undergoes po ...MORE","label":0},{"review":"True spirited CHARACTER VEERA TRIPATI....\n\nImtiaz Ali mesmerizes us by bringing true life of people loving each other for what they are, beautiful story telling, screenplay is outstanding, locations play equal role as the characters does......BRILLIANT....\n\nRandeep has smashed it more than by living the character, his breakdown while \"getting inside the hut\" before climax speaks more of him as true spirited soul and personality\n\nAlia....has lived the character truly and emotions she undergoes post her loss of randeep takes us to \nempathize what it means to love a person truly and how does it feel after missing such person for the entire lifetime........\n\nGlimpses of randeep's mother, binds the movie together keeping us glued to live the movie....\n\nAR RAHMAN has made us to feel the locations, characters and over all story line by his soulful music, real  touching one is especially the track of KAHAN HOON MAIN....\n\nIt does not end right without bringing into notice the character of the helper guy (trio) who dances with Alia for a western score has beautifully caught the true soul of honest person as well....\n\nCould not control myself watching this movie and the climax is really powerful and takes us to think back on what life are we living daily basis and what we need to think for us....\n\nThe message of child sexual abuse and how does it affect a person is a message for all viewers telling us that children are not safe inside home aswell....\n\nThanks Imtiaz Ali for presenting us with such a meaningful movie....","label":0},{"review":"Women who experienced sexual abuse by her close person, will completely understand and feel the same feeling as of Veera. I don't know if the director understood it and focused on it or not, but this completely resonates with me who also has a similar experience. She goes insane but with a reason, feel her home at a completely strange place, this is apparently hard to understand for her parents. They just watch. I'm saying, a person who doesn't have that experience, would not understand. It's ac ...MORE","label":0},{"review":"Women who experienced sexual abuse by her close person, will completely understand and feel the same feeling as of Veera. I don't know if the director understood it and focused on it or not, but this completely resonates with me who also has a similar experience. She goes insane but with a reason, feel her home at a completely strange place, this is apparently hard to understand for her parents. They just watch. I'm saying, a person who doesn't have that experience, would not understand. It's actually very right and very correct dialogue by Veera in the movie, \"It's so mixed! It's so confusing!\" \nExactly, exactly...\nThat confusion about our world, is a confusion that never has an answer. \nAnd with that feeling, women with such an experience live with it, fighting herself alone, until life gives her a momentum to reveal all emotions out.\n\nBut, still, that confusion has no answer.\nIt's just something that we some women had to experience it fiercely to its heart of darkness. The feeling is experienced to its very extreme, as if you are the one who must establish an answer for that by yourself.  \n\nAnd ironically enough, that's why she feels safe in an odd place, and with a seemingly odd person, whom you never imagined of building a bond with. \nBecause the home must be the safest place in this world, but when it's upside down, it's too much a hard pill to digest, so actually feel safer in a total stranger's bad behavior, it does not feel scary, it doesn't really matter. \n\nVictims of sexual abuse, or child abuse, they actually have a very hard time in revealing that. And I think it's because of the confusion of our world itself which is not fully comprehendable, at the end of the day.\nThe mindset of predators.\nWho are mostly at the same time hiding it, turning the blame to the victimized woman.\n\n\"I'm stupid! I'm bad! And I'll remain stupid!\"\nYes, stop being a nice girl, that's the first thing we need.\n\nAs a non-Indian, I really liked its uniqueness and acting.\nAnd the music in it, the lyrics are something divine.\nI don't know if it sounds to Indians as the same old pattern,\nbut maybe it's because I read the subtitles, it comes more as subtle and deep, than as a cliche.\n\n\"Admire the diamonds that bare the hammer, the deceitful cannot hide their flaws. Don't display your diamonds in front of others, keep them close to your heart, and go your way\"\n\nThat's what I want to say to all we hard-core living women (and also men who fight for the justice) in this troubled world.","label":0},{"review":"Fabulous,Awesome, Mind-blowing movie. Highway will always stand top in the list of my favorite movies. Allia Bhatt acted well as usual and prove herself as always. Both Allia and Randeep shows a heartwarming bonding with each other. Highway is a mixture of Love, Attraction, Sentiments, Feelings, Determination and Dedication of a girl towards a men. Highway was the Second movie of Allia Bhatt in Bollywood. \nHer face expression is too good and changed according to the situation. Location is beauti ...MORE","label":0},{"review":"Fabulous,Awesome, Mind-blowing movie. Highway will always stand top in the list of my favorite movies. Allia Bhatt acted well as usual and prove herself as always. Both Allia and Randeep shows a heartwarming bonding with each other. Highway is a mixture of Love, Attraction, Sentiments, Feelings, Determination and Dedication of a girl towards a men. Highway was the Second movie of Allia Bhatt in Bollywood. \nHer face expression is too good and changed according to the situation. Location is beautiful, too good and memorizble. Song sung by Noora Sisters is heartouching and  effective. Randeep Hooda also effected me very much. He is superb and do justice with his character as always. Magnificent heartwarming music by A.R. Rahman .Too good direction by Imtiz Ali and effective work by his team. From my side 10 out of 10. It's a must watch movie.","label":0},{"review":"This movie is obviously not eveyones cup of tea ..... This movies gets connected only with few people.... But leaving tat apart the movie makes us travel with veera ( the lead character) and some off us wish that we were in her place😁 . The movies has mixes of great emotions ,scenarios tat everyone will want to experience in their life. The locations and the places they travel is amazing and a treat to watch ..dis movie will be a special one for teenage girls and very relatable ....the songs ta ...MORE","label":0},{"review":"This movie is obviously not eveyones cup of tea ..... This movies gets connected only with few people.... But leaving tat apart the movie makes us travel with veera ( the lead character) and some off us wish that we were in her place😁 . The movies has mixes of great emotions ,scenarios tat everyone will want to experience in their life. The locations and the places they travel is amazing and a treat to watch ..dis movie will be a special one for teenage girls and very relatable ....the songs take the movie to the next level and just adapts to every situation . If u guys hav not watched the movie yet ..please try it out..it will be in ur mind and heart for the next whole year","label":0},{"review":"Okay so I must say that this movie has won my heart! Really! And Alia Bhatt has acted really well in this movie and her acting moved me so much that my eyes got teary. And I'm not a fan of Bollywood movies . I only watch asian dramas including Korean , Japanese , Thai dramas etc but this movie was being shown on star gold channel so I decided to watch it just like that and it did not disappoint me at all! It was worth my precious time! Just a brilliant movie . the relationship between mahabir an ...MORE","label":0},{"review":"Okay so I must say that this movie has won my heart! Really! And Alia Bhatt has acted really well in this movie and her acting moved me so much that my eyes got teary. And I'm not a fan of Bollywood movies . I only watch asian dramas including Korean , Japanese , Thai dramas etc but this movie was being shown on star gold channel so I decided to watch it just like that and it did not disappoint me at all! It was worth my precious time! Just a brilliant movie . the relationship between mahabir and veera was shown in very real way which I really loved and I also loved how their relationship was growing throughout the movie! ALIA BHATT DESERVES AN AWARD FOR THE BEST ACTRESS! her acting is no joke. Highway is a must-watch movie","label":0},{"review":"I don't actually find words to describe how deeply this movie has made a mark in my heart and soul. The characters were so real and terrific that they made me cry and smile at the same time. Watched one of the best movies that bollywood ever made. I wish this movie never ended.Hats off to everyone who made this beautiful, realistic, heartbreaking piece of art. And I gurantee You that, you will feel the real you hidden within yourself after you watch this movie. So what are you waiting for?","label":0},{"review":"All tym fav movie... it was not premiering actually on television in Simple Definition(SD) and was premiering only in High Definition(HD) .. and i was unable 2 watch it... but finally after 3-4 years it premiered in V channel.. it was so amazing and worth watching it. Now also it was so good not like old.. its so good.. please everybody should watch it..  story is so good .. with a so deep message.. and .. after watching also.. it reminds u.. please its a must watch movie.. and now comes in V ch ...MORE","label":0},{"review":"All tym fav movie... it was not premiering actually on television in Simple Definition(SD) and was premiering only in High Definition(HD) .. and i was unable 2 watch it... but finally after 3-4 years it premiered in V channel.. it was so amazing and worth watching it. Now also it was so good not like old.. its so good.. please everybody should watch it..  story is so good .. with a so deep message.. and .. after watching also.. it reminds u.. please its a must watch movie.. and now comes in V channel at 2-3 weeks gap... acting of all the actors are awesome.. specially.. randeep hooda.. so good & original acting... alia bhatt also have that special acting in her eyes which sometimes made us smile as she smiles.. and make us cry when she cries.. must watch it ..🙏..","label":0},{"review":"Highway has been one of the most complex Indian movies of the modern decade. Many of us are divided about the quality of the film and how well-made is it. But what's undivided is the film's commitment to beauty and boredom. Starring gifted actors like Alia Bhatt and Randeep Hooda, this is easily Alia's best performance as an actress after Raazi. But the rest of the film is majestically to fare in its share to darkness plus storytelling. Romance is good, because in most of the reviews to my Imtia ...MORE","label":0},{"review":"Highway has been one of the most complex Indian movies of the modern decade. Many of us are divided about the quality of the film and how well-made is it. But what's undivided is the film's commitment to beauty and boredom. Starring gifted actors like Alia Bhatt and Randeep Hooda, this is easily Alia's best performance as an actress after Raazi. But the rest of the film is majestically to fare in its share to darkness plus storytelling. Romance is good, because in most of the reviews to my Imtiaz Ali films has been that when he doesn't do romance 'exclusively' and 'only', he does romance perfectly. Like in Rockstar. But here, romance wasn't needed. Grip is already loose. Out of five, two stars.","label":0},{"review":"It's a beautiful movie which captivates the heart of the viewer. A story of two battered souls who wants liberation-Veera ,from the norms and regulations of upper class society and Mahabir from his criminal life ((which he realises towards the end). This story is about the quest for identity,the purpose of life ,in other words based on existentialism rather than stockholm syndrome. Because in the middle we don't find any kind of love between Veera and Mahabir. She just wanted to breath freely wi ...MORE","label":0},{"review":"It's a beautiful movie which captivates the heart of the viewer. A story of two battered souls who wants liberation-Veera ,from the norms and regulations of upper class society and Mahabir from his criminal life ((which he realises towards the end). This story is about the quest for identity,the purpose of life ,in other words based on existentialism rather than stockholm syndrome. Because in the middle we don't find any kind of love between Veera and Mahabir. She just wanted to breath freely without any boundation. Awesome Movie.","label":0},{"review":"One of the best movies of all time, I wonder why it has only average ratings at IMDB. I mean the movie has it all- impeccable acting (an understatement) performances by Alia Bhatt, Randeep Hooda, storytelling like only Imtiaz Ali can and the background score and the songs which are gonna stay with you forever (on your playlist, too) are equally the hero of the movie, kudos, A.R. Rahman Sir for that!\nThis movie is a journey within and without. Watch it NOW!!Right NOW!!\nOr probaly later ;)...but d ...MORE","label":0},{"review":"One of the best movies of all time, I wonder why it has only average ratings at IMDB. I mean the movie has it all- impeccable acting (an understatement) performances by Alia Bhatt, Randeep Hooda, storytelling like only Imtiaz Ali can and the background score and the songs which are gonna stay with you forever (on your playlist, too) are equally the hero of the movie, kudos, A.R. Rahman Sir for that!\nThis movie is a journey within and without. Watch it NOW!!Right NOW!!\nOr probaly later ;)...but do watch it. Thank me later.","label":0},{"review":"This is the best movie, I have ever seen till date. Acting by alia bhatt and randeep hooda is amazing. The story line is good and the movie has emotions, drama, love, friendship. Its is a complete package movie for friends and family to watch. Alia does not want to end the trip going on , but it ends after sometime. I recommend everyone to watch this movie and I rate it 4/5.","label":0},{"review":"I'll love to describe in a one sentence.\n\" A very heart touching movie.\"..\nLiterally as many times I see  my tears won't stop..\nIt's one of my favorite movie..not only it comes up with travelling scene but also with love that unexpectedly develop between mahi and Veera..\nVery well named 'veera'. A very strong character in the story. Best part of the movie is to watching Alia Bhatt as Veera ..\nMust watch this movie guys..\nIt's tremendous ..","label":0},{"review":"One of the most beautiful movies I’ve watched. It’s so so heart touching. The acting is superb. The end always makes me so emotional even after watching it so many times(bcoz I love this movie). The songs are like icing on the cake. Love love love this movie. A must must watch. Can make you cry so don’t forget to carry your tissues with you.","label":0},{"review":"I liked the movie Highway. I am watching it after many years of its release but yet I feel it resonating the present conflicts both external and internal. Imtiaz Ali has done a wonderful work. The relationship of the victim and the kidnapper elates to the Stokholm Syndrome and in that respect the movie has done great justice. However to suit the audience there were many chances to make the road trip more interesting at every check post. Too much screen-space is given to the Highway which becomes ...MORE","label":0},{"review":"I liked the movie Highway. I am watching it after many years of its release but yet I feel it resonating the present conflicts both external and internal. Imtiaz Ali has done a wonderful work. The relationship of the victim and the kidnapper elates to the Stokholm Syndrome and in that respect the movie has done great justice. However to suit the audience there were many chances to make the road trip more interesting at every check post. Too much screen-space is given to the Highway which becomes monotonous. Overal I woupd rate 3.5/5.","label":0},{"review":"I'm out of words to explain my love towards this movie. Those characters, their acting skill, the story blends in to create an unforgettable experience. Thank You so much for putting a movie like this out there in the world where movies based on adult comedy and eroticism are taking over. This love will go on...... ❤️","label":0},{"review":"People are always gonna see Veera's feeling as stokholm syndrome. But I am gonna say you know what we think is just a play of wires in our mind, is not really it. People really fall in love. Veera fell for him, because she felt secured at the same time, (thanks to the himalayas and the reblenishing scenery) she felt happy. Mahi saved her from that assault. Veera could confide in him. Thats why she fell in love. We are robots. Love is love. Why call it a disease? \"Stokholm syndrome\"","label":0},{"review":"Became fan of both director and actors..A well depicted movie of stokehom syndrome..Randeep and alia nailed it..Randeep ..u were amazing, u gave life to the character and how should be that person in real life with such background..Felt so happy after seeing mountain seens..Imtiazz Ali..hats off ..Alia as always did justice to the role","label":0},{"review":"This movie is a masterpiece... This movie has a soul.. What a beautiful journey and what a beautiful bond.. It depicts love so beautifully.. And then comes amazing work of Alia and Randeep and the breathtaking nature.. A must watch to leave yourself in deep thoughts for days..","label":0},{"review":"One of the best movies the bollywood has ever made. Highway is not just a movie about domestic violence, it also redefined love and affection.  Spectacular cinematography, superb storytelling, along with a career best performance by Alia bhatt, it's a must watch.","label":0},{"review":"What an amazing movie ...I just watched it and regret why I haven't watched it earlier...The story is amazing ...actors did a fabulous job ...especially Alia Bhatt...I completely got lost into the character and the movie kept me attached to it throughout ....after watching this movie I understood that we should not regret what do we have but instead of that we should live life to the fullest....I didn't even felt not even once that I am watching a movie I just loved it ...but the end was sad but ...MORE","label":0},{"review":"What an amazing movie ...I just watched it and regret why I haven't watched it earlier...The story is amazing ...actors did a fabulous job ...especially Alia Bhatt...I completely got lost into the character and the movie kept me attached to it throughout ....after watching this movie I understood that we should not regret what do we have but instead of that we should live life to the fullest....I didn't even felt not even once that I am watching a movie I just loved it ...but the end was sad but that's ok ...sometimes to make feel things more valuable and precious we had to face this...👌👌worth it","label":0},{"review":"I don't really watch Bollywood movies but this was on in the he background when my mother in-law came and I was truly hooked.\nThe actors were all amazing the the movie was funny and emotional at the same time.\nReally enjoyed this highly recommend.","label":0},{"review":"1. Veeras action good in some places many places irritatating.\n2. What director wants to say. Girls don't have protection from house but she will from kidnapper. Stupid line.\n\n3. Pls consult with kidnapped girl , how she is living those days .\n\n4. Are you trying to say that kidnappers are good. \n\nScreen play worst, director says that if you are come out from home you are safe and no one will rape you. \n\nBad movie and bad inspiration.","label":0},{"review":"Must watch movie.The  actors have played the characters judiciously, Randeep Hooda nailed the role and Alia was just incredible. She has broken all the shackles and performed out of ordinary, anyone could fall in love with the cuteness and innocence that she exhibits in her role.The  movie will change the perception about life.","label":0}]