[{"review":"The movie was set with an objective of remaking 1983 Himmatwala with latest star cast. The story line is poor, story so very predictable and scenes are much different from the original version. Watch it only for Tamanna because she is the only watchable thing in the entire movie.","label":0},{"review":"you really have to be a HIMMATWALA & not essentially an INTELLIGENT or rocket scientist\n\nSuchha bakwaas remake of a classic by SAJID KHAN\nAjay Devgn looks fools \n& talented actor like Mahesh Manjrekar wasted\n& Paresh Rawal damn worst of his illustrated career\n\nWatched on UTV & am sure Ronnie Screw-this-WALA\nHAHAHAHAHAH","label":0},{"review":"It is an wonderful film ever seen. Sridevi and Jeetendra so romantic  when dancing and singing. so fantastic","label":0},{"review":"Itne ache film Ko 63% kyun??\nVery good and comedy film , I like so much","label":0},{"review":"Don't watch just boring movie with no logic poor story and bringing 80s cinema in this era will not work  movie is full boring","label":0},{"review":"This is not a movie.\nThis is a TORTURE for 150 minutes.\nThis should be shown as a punishment to the criminals in jails across India.\nZero/5","label":0},{"review":"Not bad I think 1983 is best because my parents are loving that movie","label":0},{"review":"Ajay devgan tammana Bhatia is very good couple in this movie and wonderful job this movie","label":0},{"review":"A full package of drama with excellent performance of Shridevi ji","label":0},{"review":"Sridevi  ji was a  diva and divine  beauty .I will pay her tribute.she is unique nobody can be like her whether  beauty and acting","label":0},{"review":"This is one of my favarote movi l like tosaw agaian and agian Himatwala","label":0},{"review":"Well and best fighter for sisters mothers and wife","label":0},{"review":"Superb movie sajid sir please make himmatwala 2","label":0},{"review":"Nice ...Ajay Devgan acts v natural...funny scenes","label":0},{"review":"Nice movie👌👌 & best entertaining😁😁","label":0},{"review":"Good film  for anybody","label":0},{"review":"Ajay and Bahama very nice film","label":0},{"review":"Nice movie \nAmazing","label":0},{"review":"Worst movie ever I watched","label":0},{"review":"Good movie","label":0},{"review":"this movie is really worst then humsakals","label":0},{"review":"Still find 1983 Himmat wala better than new himmat wala.","label":0},{"review":"I don't know why this film was flop","label":0},{"review":"Must watch movie.. Just wow","label":0},{"review":"Nonsense🤐 bakwas","label":0}]