[{"review":"The movie was decent it said what it was about and that's what they gave you!! Snake queen went looking for kidnapped snake king and did some killing doing so!! In India they worship snakes this one snake god in particular not crazy about  movies involving snakes so i tried to cover my eyes most of the time especially when she changed into  human form gross!!!  One thing about it even though she was in human form she always stayed in snake mode!!! I would recommend it!! Thank you!","label":0},{"review":"One question I'll ask to director:\"Why the hell you made this movie???\"\nPositives:Only Make Up of Serpent on Mallika.\nNegatives:Worst Direction,Screenplay,Editing,Storyline,Star Cast,Fights sequnces,Vfx, Cinematography,   Songs, Everything is worst.\nI don't know why the hell the movie was made.\nRatings:1/10.stars","label":0},{"review":"I Shud say i was so lucky to have got a chance to view the movie on the day of Navaratri the day of female goddess...credits to the director and the technical team..the way she has portrayed the crappy world we are living is really astonishing..and the way life Shud be lived...really was amazed with ever scene and dialogues which had the hidden meanings within them..","label":0},{"review":"Good entertaining movie, very well done by Malika .Worth seeing place in every plateform of the movie.","label":0},{"review":"This needs to be watched purely for how hysterically terrible it is in every way.","label":0},{"review":"Very nice movie.. superb..and nice acting is Mallika serawat","label":0},{"review":"I love this movie and mystical graphics ..","label":0},{"review":"Awsome Movie Best acting","label":0},{"review":"great movie and vfx","label":0},{"review":"i love like this acting","label":0},{"review":"horrible movie.waste of time and money","label":0},{"review":"It is a good movie...","label":0},{"review":"nice movie","label":0},{"review":"It's not clear about the death of Nabin, the mate of Irfan","label":0},{"review":"It's fantastic","label":0},{"review":"Super movies \"\"\"\"\" LOVES","label":0},{"review":"I like tha movie..","label":0},{"review":"its okay but not the best","label":0},{"review":"Fuddu movie","label":0},{"review":"Don't know","label":0},{"review":"I like it....","label":0},{"review":"It's okay goods","label":0}]