[{"review":"This is one of the finest action movie ever made especially when akshay jumped from one wall to another without using any body doubles ohh god that's truly pulsetting , performance wise akshay did a phenomenal job sinakhshi was also nice overall thousand time better than other\nMy favourite action thriller. First saw in theatre four years ago and still watch it anytime. Not only does the film have some of the best thriller moments, it also features mindblowing action sequences and pays a whole-he ...MORE","label":0},{"review":"This is one of the finest action movie ever made especially when akshay jumped from one wall to another without using any body doubles ohh god that's truly pulsetting , performance wise akshay did a phenomenal job sinakhshi was also nice overall thousand time better than other\nMy favourite action thriller. First saw in theatre four years ago and still watch it anytime. Not only does the film have some of the best thriller moments, it also features mindblowing action sequences and pays a whole-hearted tribute to the army and their families.\n\nThankyou....","label":0},{"review":"This is one of the finest action movie ever made especially when akshay jumped from one wall to another without using any body doubles ohh god that's truly pulsetting , performance wise akshay did a phenomenal job sinakhshi was also nice overall thousand time better than thupaki","label":0},{"review":"My favourite action thriller. First saw in theatre four years ago and still watch it anytime. Not only does the film have some of the best thriller moments, it also features mindblowing action sequences and pays a whole-hearted tribute to the army and their families.","label":0},{"review":"One of the finest movie done by akshay kumar. When they shoot the sleeper cells. Let akshay kumar do such movies again and again. The dialogue are extremely popular in my school. Sonakshi has also done good work.","label":0},{"review":"This movie boosts my confidence and pushes me to think like the Army man in all situations. In short, be alert all the time and connect the dots. A movie that teaches one to love the country and put everything second...Indian Army and Akshay rocksss always. Jai Hind..","label":0},{"review":"A awesome movie as akshay kumar has done many movie and all were a huge hit and Rustom,Airlift,Jolly LLB 2 and  Toilet -ek prem khata was also a huge hit and seriously saying he is ultimate actor and after seeing the tamil version I thought it will also a huge it and my prediction was true \nJai Hind 🇮🇳","label":0},{"review":"Very impactful and well done. Effectively conveys the grit, the commitment and fearlessness of our bravehearts. Quite salary to think officials in the highest rung of society/government etc are a part of this terror Nexus.","label":0},{"review":"Hats off! to the commandos who are ready to serve the nation till the peril of their life, Akshay Kumar's holiday describes the above sentence very well. I have seen Khiladi Kumar in many movies portraying the role a commando but this time he played the role very well.","label":0},{"review":"This movie is really superb movie..my son  who is11 years old have seen this moive 100 times ..still everytime he watches it s much intrest as he watchingcit as a first time","label":0},{"review":"I'm asita akshay sir you know me na your holiday film is so good and you are a few days to come in my birthday my birthday is on 29 may but shonaksi mam you are so fat","label":0},{"review":"AR Murugadoss is super copycat. Please make movies by creating your own content. Don't copy and paste if you would like it then buy rights and do the films. I loved film but not copy paste strategy of director.","label":0},{"review":"The dialogue which Akshay Kumar was saying with A.C.P Ashok Gaequard...and the sleeper cells shooting...nice songs...the dialogue with sub inspector... action of last scene...nice comedy with Sonakshi Sinha and with Govinda...fantastic movie...i loved it...proud to be an INDIAN 🇮🇳🇮🇳","label":0},{"review":"This movie is really osam.and superb. ...seriously I like army and also akshay kumar. ...thnku sooo much akshay. ...for this movie. ...thnku sooo much my army ....man....u r superb soldiers. . ..love uh all of u...","label":0},{"review":"Nice movie. Shown that what Indian Army is capable of in terms of intelligence. Also, got awareness about sleeper cell which is like cancer to our society","label":0},{"review":"one of the best action movie. Akshay acting is very good.screenplay and direction was amazing, but the original flim thuppakki also same director.","label":0},{"review":"Akshay Kumar aur sonakshi sinha aur govinda  nice movie good soldier best songs expression fighting style and expression of interest you will need happy your self  good one","label":0},{"review":"Very good movie in all aspects. Very good treatment. Good work from all actors. Every thing in movie is excellently done","label":0},{"review":"My one of the favourite movie ,one of the best Akshay Kumar's movie\n\nCredit goes to AR Murugadoss \nWell movie done sir.\nI like to watch our ARMY movies","label":0},{"review":"He (Virat ) is ready to die for our country such a great and a logical and brain game movie.I like this film HaAts Off to Akshay a great actor.","label":0},{"review":"Really a good movie and role of akshay makes me to think to join indian army how smartly he served himself and shows the intelligence  of indian solider ...","label":0},{"review":"tamil version is better than this movie even though akshey kumar is  a fine actor in world cinema tamil superstar vijay nailed it and vijay looks more stylish in thuppaki (holiday)","label":0},{"review":"I loved this movie \nAnd kudos to the soldiers who keep us safe\nThe movie was beautifully directed and excellently executed","label":0},{"review":"This was one of the best movie of that year.... Really enjoyed with whole family members","label":0},{"review":"I think this is the best ever movie seen by me because in that movie dailocs said by akshay was fantastic","label":0},{"review":"A super film by akshay kumar.army is great. I also want to be an army after watching this movie.","label":0}]