[{"review":"Housefull 2 is a fantastic movie. It was so interesting. I can't control myself. Because this movie is full of comedy from first to end. Akshay Kumar, john Abraham, rithesh desmukh is really awesome. But I don't know the 4th hero, but his acting is nice. My favorite hero is rithesh desmukh. He is a best comedian. The third part of this movie is super. But , the best is second part. This is a family entertaining movie. The best movie I have ever seen. 😍😍😍😍","label":0},{"review":"Nice movie with nice comic timings of the actors . Both Rishi Kapoor and Randhir Kapoor were superb in their own ways . All the actors chemistry was superb . If your sad and depressed  just go and watch house full 2 . I think this movie will make sure you laugh .","label":0},{"review":"housefull 2 is peng (AMAZING) mate. number 1 was boring asf broooooo but 3 was good n 4 better be good too.... me n hawwaa gonna se it ;)","label":0},{"review":"Akshay kumar is personally my favourite actor, so yeah, I loved this movie. and this was my favourite movie from all, housefull, housefull 2 and 3.","label":0},{"review":"Akshay Kumar and Ritesh Deshmukh is my favorite actor. when both he done work in same film then the film become my favorite film","label":0},{"review":"One of the most depressing version of comedy movie... It sucked till the end but worked for the mass population of India who like to laugh on anything popular actors say.","label":0},{"review":"Good time pass...! Director Sazid has put good efforts to knit the otherwise complex script...!!","label":0},{"review":"Good and Best Actions and Acting for Entertainment, Thank You So Much.....All Stars","label":0},{"review":"Very good movie you should watch it's previous part and upcoming part.","label":0},{"review":"It's just an awesome movie and I loved it really..","label":0},{"review":"The main hero is Akshay Kumar. The othes are just useless actresses done their jobs good.","label":0},{"review":"Arguably the best movie of all housefull movies","label":0},{"review":"This is the musical instruments and my group and my self perform this show","label":0},{"review":"rekwires to much head pwr\ni luv akshay sir ji but this not ossum\nnot mast mast, not good farty movue","label":0},{"review":"Superb outstanding funny movie\nBest movie ever Aeye","label":0},{"review":"I loved every one's performance but I liked ritiesh expressions","label":0},{"review":"only watch if you are akshay fan\n\nworst acting by bobby deol","label":0},{"review":"SUPER HIT MOVIE LIKE STORY","label":0},{"review":"It's a amazing film,,,i like this film","label":0},{"review":"Awesome movie,just loved it","label":0},{"review":"One of my favourite movie","label":0},{"review":"It is very awesome film","label":0},{"review":"Nice movies best comedy","label":0},{"review":"Just ossom","label":0},{"review":"Super hit movie I like","label":0}]