[{"review":"Not that I thought Housefull 4 to be a serious film on India-China relationship, but never expected it to be this absurd either. Well, as Housefull franchise’s brand ambassador Aakhri Pasta (Chunkey Pandey) says, ‘I am joking.’ This is exactly what the trailer promised it to be.\n\nRight in the beginning, while punching a co-actor, Max (Bobby Deol) thunders, “Aaj mera fast hai isiliye thoda slow maara (I punched you slow because I am fasting today),” and the audience immediately recognises the set ...MORE","label":0},{"review":"Not that I thought Housefull 4 to be a serious film on India-China relationship, but never expected it to be this absurd either. Well, as Housefull franchise’s brand ambassador Aakhri Pasta (Chunkey Pandey) says, ‘I am joking.’ This is exactly what the trailer promised it to be.\n\nRight in the beginning, while punching a co-actor, Max (Bobby Deol) thunders, “Aaj mera fast hai isiliye thoda slow maara (I punched you slow because I am fasting today),” and the audience immediately recognises the setting. It’s the same one in which covert lovers make out in front of the girl’s sleepwalking father, or the one where a python grabs someone’s balls. The point is that Housefull films were never meant to be intelligent. These are literally slap and stick comedies, if you dare say.\n\nThe story is about three London-based brothers—Harry (Akshay Kumar), Max (Bobby Deol) and Roy (Riteish Deshmukh). They want to marry three daughters—Kriti (Kriti Sanon), Neha (Kirti Kharbanda) and Pooja (Pooja Hegde)—of a rich businessman, played by Ranjit, who keeps switching to ‘beti’ from ‘beauty.’ I wonder why they didn’t use Kriti Kharbanda’s real name!\n\nHarry, who gets flashes from his past life 600 years ago, believes his brothers and everyone around them, were part of a bizarre story that took place in 1419. The credit must be given to Kumar who is wholeheartedly into this ridiculous set-up, and wants us to believe him. Some of us did as I heard whistles around. However, it wasn’t actually wonderful to see Deol reminiscing in the tune of ‘soldier, soldier,’ and Deshmukh playing an effeminate character. You know how they introduce him: Isne gender ka tender nahi bhara. I don’t know how to translate that accurately.\n\n\nLet me break it down for you: It’s one of those films where the actor would ask the actress, “Bees ke baad kya aata hai (What comes after 20),” before kissing her.\n\nOr, somebody would come and tell the camera, “London me do hi cheez famous hain, Big Ben and big bhai, (There are only two things famous in London, Big ben and big brother).”\n\nBig Ben and Big Bhai! Ben-Bhai! You get the drift!\n\n\nSomebody says ‘don’t be horsing around’ and the next shot is of horses. If you still don’t find it intriguing enough then the director Farhad Samji will present you the Royal family of Britain, dancing to thoughtfully penned song ‘Chumma.’\n\nAs if this was not enough. A character faking pregnancy says, “Main abla hoon tabla nahin,” and somebody immediately retorts, “Ye Katappa toh ek hi cut me pappa ban gaya.”\n\nProbably this much criticism is not justified. When did the makers pretend otherwise? But the well of jokes dries after a while and the same gags keep repeating. Had there not been Akhay Kumar, it would have become a really painful watch. He has barely managed to stop Housefull 4 from becoming another Tees Maar Khan.\n\n\nIt’s funny in parts but can’t hold attention for fifteen minutes straight at any juncture. There lies the problem. Kumar’s excellent comic timing isn’t enough to cover up other characters’ lack of substance.\n\nDespite all this, two brilliantly placed things in script cracked me up. The first is three pigeons named Neil, Nitin and Mukesh, and the second is this dialogue: “Agar main badshah hoon toh tu kya Honey Singh hai (If I am Badshah then who are you? Honey Singh?).”\n\nOh, I laughed so hard.\n\nNo, I am joking.\n\nRating: 1.5/5","label":0},{"review":"Amazing Movie #Mast hai. Must Watch for every one(Go and watch).\n This movie is a perfect mixture of *Comedy+Entertainment+Epic+Romance+Emotion*. it is not an epic action movie but it is a paisa vasool comedy and you will get impressed by its unexpected plot twists and a really amazing immersive Story!\nA complete comedy entertainment, full of laughs, dashing dialogue timing and surprise sequences makes this movie highly outstanding. A great story presentation along with amazing historical scenes ...MORE","label":0},{"review":"Amazing Movie #Mast hai. Must Watch for every one(Go and watch).\n This movie is a perfect mixture of *Comedy+Entertainment+Epic+Romance+Emotion*. it is not an epic action movie but it is a paisa vasool comedy and you will get impressed by its unexpected plot twists and a really amazing immersive Story!\nA complete comedy entertainment, full of laughs, dashing dialogue timing and surprise sequences makes this movie highly outstanding. A great story presentation along with amazing historical scenes visualization.\n\nFantastic comedy twists displayed on many occasions with stunning acting from all the cast. Akshay kumar define himself to next level, and Bobby Deol is always a splendid actor, he must act more in future movies, Ritesh has performed equally important. All 3 heroines are pretty beautiful and acted very nicely, these 3 heroines must be given more movies in similar big budget because they are solid performers of present time.","label":0},{"review":"It’s a full on entertainer for Diwali. It will make you laugh and keep you entertained from start till the credits start to roll.\nDon’t trust the verdict of firangi mindset critics or moviegoers. They will accept and enjoy Racheal having multiple love affairs in American TV show FRIENDS but when an actor like Akshay Kumar makes them laugh that literally looks funny then they blindly call it “AAAATHOOO”. \nTo those criticising the film I would ask “If you didn’t like Housefull 4 only for the lack  ...MORE","label":0},{"review":"It’s a full on entertainer for Diwali. It will make you laugh and keep you entertained from start till the credits start to roll.\nDon’t trust the verdict of firangi mindset critics or moviegoers. They will accept and enjoy Racheal having multiple love affairs in American TV show FRIENDS but when an actor like Akshay Kumar makes them laugh that literally looks funny then they blindly call it “AAAATHOOO”. \nTo those criticising the film I would ask “If you didn’t like Housefull 4 only for the lack of logic then why did you like Avengers Infinity War where a normal human Tony Stark goes and easily fights on some distant planet with a alien who coincidentally also speaks English”. It’s a typical mindset of these double standard people that if something is said in English or if something is done as the Americans and the Europeans do then it is classy, outstanding and mind blowing but if the same thing is said in Hindi or done as we Indians then it’s cheap, third class and pathetic. \nAs Indians it’s important for us to support our films regardless of whether it’s from which part of India otherwise the day is not far when we would have nothing but only Hollywood films to watch in theatres and on TV. I am not saying that Americans films should be removed from our theatres but it’s also important that our Indian films don’t lose their market just because of this typical firangi mindset of some Indians who by mistake were left in India after 1947.\nLastly not every mainstream actor has the guts to do comedy so perfectly as Akshay Kumar has done for the past 19-20 years. Most of the mainstream actors are either doing biopics or doing some other serious stuff but there are hardly few actors who are good at comedy and want this genre to thrive. It’s Akshay Kumar whose films like Phir Hera Pheri, Heyy Babyy, Bhool Bhulaiyaa, Welcome are still made into memes and not the films of Srk, Salman or Aamir.","label":0},{"review":"#Housefull4  - Comedy of errors and terrors 🤪\n\nForemost was the comedy on our part - we booked a show for Sunday 10:50. Reached the mall only to realise the movie was for 10:50 PM not AM 🙈🤣🤣\nMonday being a working day and my daughter’s Science Test, we knew the tickets would go waste. \n\nBut being the movie buff I am, I tried and succeeded in getting a friend to come along with me so that only 1 ticket went waste. \n\nNow on to the movie - as expected and as promised given the Housefull Franchi ...MORE","label":0},{"review":"#Housefull4  - Comedy of errors and terrors 🤪\n\nForemost was the comedy on our part - we booked a show for Sunday 10:50. Reached the mall only to realise the movie was for 10:50 PM not AM 🙈🤣🤣\nMonday being a working day and my daughter’s Science Test, we knew the tickets would go waste. \n\nBut being the movie buff I am, I tried and succeeded in getting a friend to come along with me so that only 1 ticket went waste. \n\nNow on to the movie - as expected and as promised given the Housefull Franchise, it’s fourth chapter is totally senseless, cheesy, slapstick and beyond ANY logic. \n\nHowever, we laughed our hearts out at the creatively nonsensical dialogues, drama, characterisation and songs. Sometimes in disgust and at times purely at the guts of the makers and actors of the movie... बहुत जिगरा चाहिऐ to get stellar performers like Nawazuddin Siddiqui and Rana Daggubati to do what they did 😂😂😂\n\nThe locations, sets, costumes and jewellery are exceptional!  Sajid Nadiadwala truly has faith in this franchise for making such a big budget film 😆\n\nIf you are questioning my choice of cinema, then I would like to clarify that my daughter is a huge Akshay Kumar, Housefull and Golmaal series fan. So we had booked the movie for her viewing pleasure 🤪\n\nAs for my friend and I, it was a well deserved break from the monotony and seriousness of life. There were many people like us at the theatre and some even crazier than us who couldn’t control their laughter in the lift on the way out. \n\nSo we all ended up laughing out loud at 2 am as we entered back into the real world 🤩\n\nP.S.: My family and friends who wait for my reviews before watching a movie - this one’s not for you 🤪 But if you really need a break, go watch it with friends or in a group and enjoy the silliness!!","label":0},{"review":"Movies from the Houseful franchise are expected to be Hilarious, Colourful, Multi-Star and with out much Logic.\n\nHouseful 4 fulfills all the above and it is definitely full of Entertainment. All the locations are fantastic, Akshay Kumar does a Wonderful job in both roles with his superb acting & wonderful comic timing. Ritesh Deshmukh & Bobby Deol have done justice to their characters. All the actresses are a Visual Treat. Even Chunkey Pandey, Johnny lever, Ranjeet and other supporting actors ar ...MORE","label":0},{"review":"Movies from the Houseful franchise are expected to be Hilarious, Colourful, Multi-Star and with out much Logic.\n\nHouseful 4 fulfills all the above and it is definitely full of Entertainment. All the locations are fantastic, Akshay Kumar does a Wonderful job in both roles with his superb acting & wonderful comic timing. Ritesh Deshmukh & Bobby Deol have done justice to their characters. All the actresses are a Visual Treat. Even Chunkey Pandey, Johnny lever, Ranjeet and other supporting actors are amazing.\n\nOverall it is a Very well made movie with core focus on Comedy which it successfully does. The entire concept of Reincarnation has been wonderfully crafted on screen with bits of comedy. Comic timing and the Dialogue delivery of all actors makes the audience burst in Laughter every few moments.\n\nThis is a Movie that can be seen with Friends, Family, Romantic Partner and anybody you are comfortable Laughing out Loud with....","label":0},{"review":"Amazing Movie #Mast hai. Must Watch for every one(Go and watch).\n This movie is a perfect mixture of *Comedy+Entertainment+Epic+Romance+Emotion*. it is not an epic action movie but it is a paisa vasool comedy and you will get impressed by its unexpected plot twists and a really amazing immersive Story!\n\nAkshay,Bobby, Ritesh, Nawazuddin, RanaDaggubali, JohhnyLever, Chunkey sir and Pooja, Kriti maam and others have used their best to bring out the true fun in the epic *Reincarnation* Flashback bas ...MORE","label":0},{"review":"Amazing Movie #Mast hai. Must Watch for every one(Go and watch).\n This movie is a perfect mixture of *Comedy+Entertainment+Epic+Romance+Emotion*. it is not an epic action movie but it is a paisa vasool comedy and you will get impressed by its unexpected plot twists and a really amazing immersive Story!\n\nAkshay,Bobby, Ritesh, Nawazuddin, RanaDaggubali, JohhnyLever, Chunkey sir and Pooja, Kriti maam and others have used their best to bring out the true fun in the epic *Reincarnation* Flashback based story...with hilarious scenes and songs.(Only a few unwanted words were used for fun, a bit disappointing here)\n\nMusic and background musics were really thrilling. Though the places were sometimes animated, Sajid Nadiadwala \nand crew did their best to bring the movie come alive with its own glory \nThanks #Housefull4 team. Keep it up. Wishing for more such time-pass comedy epics!\n9/10*Stars by me!","label":0},{"review":"HOUSEFUL 4. Rating 4.9/5\n\nA complete comedy entertainment, full of laughs, dashing dialogue timing and surprise sequences makes this movie highly outstanding. A great story presentation along with amazing historical scenes visualization.\n\nFantastic comedy twists displayed on many occassions with stunning acting from all the cast. Akshay kumar define himeself to next level, and Bobby Deol is always a splendid actor, he must act more in future movies, Reitesh has performed equally important. All 3 ...MORE","label":0},{"review":"HOUSEFUL 4. Rating 4.9/5\n\nA complete comedy entertainment, full of laughs, dashing dialogue timing and surprise sequences makes this movie highly outstanding. A great story presentation along with amazing historical scenes visualization.\n\nFantastic comedy twists displayed on many occassions with stunning acting from all the cast. Akshay kumar define himeself to next level, and Bobby Deol is always a splendid actor, he must act more in future movies, Reitesh has performed equally important. All 3 heroines are pretty beautiful and acted very nicely, these 3 heroines must be given more movies in similar big budget because they are solid performers of present time.\n\nFirts part is splendid and second part is again more splendid. \n\nMUST WATCH IN THEATER.","label":0},{"review":"In 1419, the love stories of three couples are left unfinished owing to a conspiracy. In 2019, reincarnated, they meet again and the romances are rekindled. But this time pairings are mixed up. Can what was done in 1419 be undone in 2019?\n\nIn its fourth edition the Housefull franchise ensures that it takes its brand of over the top and mindless humour forward. Actually, it's more like the reverse, since it rewinds back six hundred years to the 15th century.\n\nBut first, it's London of 2019, where ...MORE","label":0},{"review":"In 1419, the love stories of three couples are left unfinished owing to a conspiracy. In 2019, reincarnated, they meet again and the romances are rekindled. But this time pairings are mixed up. Can what was done in 1419 be undone in 2019?\n\nIn its fourth edition the Housefull franchise ensures that it takes its brand of over the top and mindless humour forward. Actually, it's more like the reverse, since it rewinds back six hundred years to the 15th century.\n\nBut first, it's London of 2019, where Harry (Akshay Kumar) is a hairdresser who alternately has bouts of memory loss and flashes from his past life. Max (Bobby Deol) and Roy (Riteish Deshmukh) are his brothers. Together they hatch a plan to marry Kriti, Neha and Pooja (Kriti Sanon, Kriti Kharbanda and Pooja Hegde respectively), the three daughters of a billionaire, Thakral (Ranjeet), to be able to pay off the loot money of a mafia don Michael that they have misplaced. When the marriage destination is inadvertently fixed as Sitamgarh in India, the couples head there and Harry meets his past life friend Aakhri Pasta (Chunky Pandey) and recalls everything from that time. The three pairs of lovers - Rajkumar Bala Dev Singh (Akshay Kumar) and Princess Madhu (Kriti Sanon), Bangdu Maharaj (Riteish Deshmukh) and Princess Mala (Pooja Hegde), Angrakshak Dharamputra (Bobby Deol, yes the pun is not lost here) and Princess Meena (Kriti Kharbanda) are killed, leaving their love stories unfinished when they get caught up in an evil design to eliminate them. Although, Bala himself is 'shaitaan ka sala' and has laid a trap to marry Mala, so that he can become the king of Sitamgarh.\n\nThe main hitch now is that, in 2019 the couples are mixed up, and Bala (Akshay Kumar) decides that the pairings must be set right so none of them end up with their sister or brother-in-law from their past life.\n\nSo with this central plot point in hand, Housefull4 takes off. Of course, this mission to set things 'right' leads to confusions galore and a deluge of characters, who spring in and out of the narrative and from their last life to present life. There is a sprinkling of mindless comic moments owing to the general silliness all around. And a dollop of low- brow, crass humor. A special low point is when Princess Meena pretends to be molested to convince Dharamputra to marry her. Add to that, there are portions that drag and jokes that feel dated.\n\nThe film's increasingly loud background score (especially in the second half) and the CGI in the period setting leave a lot to be desired. And a running joke on three pigeons named Neil, Nitin and Mukesh that doesn't actually fly.\n\nOf the actresses, it is Kriti Sanon who has the most lengthy role and she pulls it off well. Kriti Kharbanda and Pooja Hegde are reduced to being props, owing to their limited screen time. Interestingly, all three are uniformly dressed in the same colors, as if it were a deliberate attempt to not be able to tell them apart. Riteish Deshmukh gets the quirks of his characters well and does manage to pull in some laughs. Manoj Pahwa, Nawazuddin Siddiqui, Rana Daggubatti and Johnny Lever have their oddball parts to play in the film - though some seem just pointless. And yes, Archana Puran Singh pops up often in a photo.\n\nBut largely, it is Akshay Kumar who has the most fleshed out role and shoulders most of the film. And he definitely shines in most of them getting the comic timing right.\n\nNeedless to add, don't go looking for logic in Housefull4 (but still, how did the blood on Rana Daggubatti's blue jacket magically disappear in the last scene?). In the last 30 minutes, Kriti repeatedly asks, \"Yeh sab kya ho raha hain?\" A sentiment that could be echoed by the viewers.\n\nOverall, Housefull4 ends up as a complete mad caper. Which, if you're a fan of the Housefull brand of comedy, might appeal to you. But if you are not, then proceed with caution.\n\nThe Final Verdict: Not so full of comedy.","label":0},{"review":"Absolutely disappointed and disgruntled with Housefull 4. Don't know from where to start ,its almost like I wasted my money and need a refund.What was going through Akshay's mind when he signed this movie.Huge star cast ,big sets and locations,budget doesn't compensate for weak story and screenplay.Worst of all they made a spoof of one of the greatest Indian movies-bahubali the conclusion when Akshay Kumar aka rajkumar bala gets exiled from his kingdom and they tried to make the comic version of ...MORE","label":0},{"review":"Absolutely disappointed and disgruntled with Housefull 4. Don't know from where to start ,its almost like I wasted my money and need a refund.What was going through Akshay's mind when he signed this movie.Huge star cast ,big sets and locations,budget doesn't compensate for weak story and screenplay.Worst of all they made a spoof of one of the greatest Indian movies-bahubali the conclusion when Akshay Kumar aka rajkumar bala gets exiled from his kingdom and they tried to make the comic version of the jaykara song .Very cheap and pathetic. Atleast don't insult the film if you can't respect it and have capibility of making an epic like the one ss rajamouli made.Comedy is repetetive and jokes are blown out of proportion.Housefull veterans Akshay and Riteish Deshmukh fail to save this film as they try hard to make you laugh but fail nonetheless.Bala track is overly long and repetitive and bangru maharaj 's character which Riteish plays is overstretched and exaggeration of similar dialogues.Bobby(Body) deol acts a stuntman in the entire movie only present to flex his muscles and he is at the recieving of butt of jokes based on his previous movies like soldier.The girls Kriti Sanon, Pooja Hedge and Kriti Kharbanda waste their talent thoroughly and are only there to add the glamour quotient and spice up the songs.The much needed relief comes from scenes featuring veterans Ranjit and ace comedian Johnny Lever .Rana Daggubati who played the wicked baddie Bhallaldeva is an embarrassment only to fight and shout for the all the scenes featuring him.Another talent gone waste.It seems these days that every movie franchises like golmaal ,dhamaal and housefull are going on a landslide and unless they come up with some content ,producers and directors shouldn't make garbage movies just for increasing their already huge bank balance.Get nostalgic remembering the golden days of comedy movies like bhool bhulaiya,bhagam bhag, golmaal 1,dhammal 1,hera pheri,chup chup ke, welcome and the list goes on .It is almost like we won't get to get classics like these again as they are hiring overrated actors like Kartik Aryan in the bhool bhulaiya sequel.Akshay should have done it.He only can pull off something like that. It will be a flop.It is like a bygone era.Yes you don't need to put any logic and sense in movies like these but this is way beyond another level of stupidity and irrelevant comedy.My ratings 2/5 .I recommend you should instead watch old movies at  television instead of watching this one unless you really love the housefull series","label":0},{"review":"Houseful 4\nBeyond Mindless,Limitleslly Silly, Big Ticket Disaster 1.5 Star ⭐.5\nExcept for climax and a few countable laughs the rest of the film is full of creepy dialouges like Aaj Mera Fast Hai Isiliye Slow Maara , Mai Abla hu Tabla Nahi , Bhardo Meri maang Nahi Toh Cheer Dungi Teri Taang and a lot more,and the actors praying to 3 pigeons Hum Pur Hagoo and they are apparently named Neil Nitin Mukesh. The film is too loud and hardly funny, the first half is dosent even seem like a comedy film o ...MORE","label":0},{"review":"Houseful 4\nBeyond Mindless,Limitleslly Silly, Big Ticket Disaster 1.5 Star ⭐.5\nExcept for climax and a few countable laughs the rest of the film is full of creepy dialouges like Aaj Mera Fast Hai Isiliye Slow Maara , Mai Abla hu Tabla Nahi , Bhardo Meri maang Nahi Toh Cheer Dungi Teri Taang and a lot more,and the actors praying to 3 pigeons Hum Pur Hagoo and they are apparently named Neil Nitin Mukesh. The film is too loud and hardly funny, the first half is dosent even seem like a comedy film only the last 15 minutes has some laugh out moments because of Akshay Kumar. Overall its a big ticket disappointment, even if you go with Zero expectations the Zero wont be fulfilled.\n\nTHINGS TO LOOK OUT FOR \n>At very few points humour is on point those are a few fun moments specially the last few minutes of climax \n>Akshay Kumar is the only saving grace in the film who has got the comic time right \n>Bala Bala Song is a delight \n\nNEGATIVES \n>Creepiest and horrible Dialouges written all over the film making it even more horrible film\n>The first half is not at any point funny ,looked more like a cheap budget period film \n> Thin Line story and poor direction \n>Screenplay seems repetetive and boring \n>Overacting and loud acting by the complete cast making it unbearable at points \n>Bobby Deol and Ritesh Deshmukh hardly had any notable scenes it was all about Bala \n>Nawazudin siddques cameo was the worst cameo ever in the recent times in a film \n>The direction is too bad and seemed very silly at almost every point in the film \n>Too many unnecessary songs and senseless kawali added up also songs being edited from Bahubali \n\nFINAL VERDICT\n\nDisappointing Diwali Release , a film thats not worth watching in the cinemas , its a out and out disappointment . NO FUN NO HUMOUR IN THE HOUSE . A movie to skip","label":0},{"review":"This was an exceptionally funny movie. It was just what the trailer promised : hilarious and humorous. The slight strokes of the previous Housefull films like \"Mammamiya\" and \"Aehhhh\", made tge film even more interesting to watch. But this particular film is slightly different from the other Housefull films as the story is a bit unique and mysterious at the same time with all the \"Reincarnation Drama\".\nHarry (Akshay Kumar) has the best character and screen presence in the movie. Bala's entry wil ...MORE","label":0},{"review":"This was an exceptionally funny movie. It was just what the trailer promised : hilarious and humorous. The slight strokes of the previous Housefull films like \"Mammamiya\" and \"Aehhhh\", made tge film even more interesting to watch. But this particular film is slightly different from the other Housefull films as the story is a bit unique and mysterious at the same time with all the \"Reincarnation Drama\".\nHarry (Akshay Kumar) has the best character and screen presence in the movie. Bala's entry will leave the house uproarious. And the way he forgets something when he hears something loud and his eyes become all big and cute; I just loved it. And it was kind of funny that someone with a short term memory is the one who has flashbacks of what happened 600 years ago. It just makes you love the script writer. Roy's (Ritesh Deshmukh) character will also make you want double up. Max (Bobby Deol) is the Bahubali of the film and his name Dharam Putra 600 years ago will make you wonder about something 😉. The girls were also marvellous and I loved their roles in the film. The background tune of the film is also really really good. Sometimes the movie will give you Bahubali types feeling with R","label":0},{"review":"Housefull4 _ It's the family entertainer you should definitely watch once. The plot unfold as the, epic reincarnation drama. Harrry(AkshayKumar) works within London with his brother n friend. (Bobby and Ritesh). He sees visuals of his past life often. He has the habbit of forgetting things. All three boys pretend to love three girls of the wealthy businessman as they want to pay the loans of Michael :one Don. They plan for destination wedding within Sitamgarhh. When they reach there, the hotel's ...MORE","label":0},{"review":"Housefull4 _ It's the family entertainer you should definitely watch once. The plot unfold as the, epic reincarnation drama. Harrry(AkshayKumar) works within London with his brother n friend. (Bobby and Ritesh). He sees visuals of his past life often. He has the habbit of forgetting things. All three boys pretend to love three girls of the wealthy businessman as they want to pay the loans of Michael :one Don. They plan for destination wedding within Sitamgarhh. When they reach there, the hotel's workerboy Aakhiri Pasta recognises him as prince frm their past lives. He also recognises Ritesh as Dancer and Bobby as the bodyguard of the three princesses which are the same 3 girls these boys are about to marry. The twists cme as AkshayKumar when reminded by Pasta about his pastlife character as Baala the prince of Madhavgarh, tries to convince the girls and the other two boys about it and tries to sort out the confusion between interchanging of the grooms and bridegrooms of this life, he gets beaten up and being called mad. He also warns them of Gamaa who's after their life the pastlife and maybe dis too. The boys gradually remember everything about who they were and who were their love interests. They try to fix things within their lives. When the girls' brother Pappu who's Gamaa reborn comes to know his pastlife, he lashes out and comes fuming to beat these people. That time the girls too recall everything and they together try to face Gamaa. The mysteries of their pastlife unfolds as, they discover who was the real culprit to anger Gamaa and kill his brother. They manage to defeat him and then all get married to their respective loveinterests. The whole film's full of comic one-liners and AkshayKumar's entry and dialogues makes it lively. The way the character Balaa's potrayed, it's hilarious and Ritesh Deshmukh's  dance leaves you laughing. The besst moment for us was when Gamma alias Pappu was singing qawwali  of Badla Badla Badla. It makes one laugh to his besst. Though the movie has no fix storylinee, it doesn't boree any one and keeps you lively to watch it. The music album, it's , gud too specially bhutraaja and ek chumma, I loved it. Giving the movie 3 out of 5.","label":0},{"review":"Well well..I've watched all the films from the Housefull franchise and I'd say that this one (Housefull 4) is way better than the first and second and definitely less interesting than Housefull 3. What's missing here is ofcourse Abhishek Bachchan, who has been replaced by our Bobby Deol, who's the weakest link here..I loved him in his earlier movies though..Soldier, Barsaat etc!\n\nOtherwise, this film by Sajid Saamji is funny in parts. The cameo appearance by Nawazuddin Siddiqui is really helping ...MORE","label":0},{"review":"Well well..I've watched all the films from the Housefull franchise and I'd say that this one (Housefull 4) is way better than the first and second and definitely less interesting than Housefull 3. What's missing here is ofcourse Abhishek Bachchan, who has been replaced by our Bobby Deol, who's the weakest link here..I loved him in his earlier movies though..Soldier, Barsaat etc!\n\nOtherwise, this film by Sajid Saamji is funny in parts. The cameo appearance by Nawazuddin Siddiqui is really helping. The songs (especially \"Ek Chumma\") are actually entertaining more than the film itself!\n\nSince there's no depth in the storyline, you can only expect a little from the actors. Akshay, as usual, is funny and on the dot with his comic timing. Riteish is good too. While Chunky Pandey (hilarious) and Johnny Lever do their part well, the three girls look gorgeous (special mention about Pooja Hegde) and dance well!\n\nTo conclude, I'd recommend this for a time pass or one time watch during your weekend. Enjoy guys!","label":0},{"review":"tl;dr: Watch this movie only if you like the HouseFull brand of humour. You'll have a blast.\n\n\nThe film revolves around a bunch of people from 1419 and their reincarnations in 2019. And as the trailer tells you, the three main couples have been mismatched in their reincarnations. \"Iski biwi iski biwi nahi hai, woh teri biwi hai!\" (transl. \"His wife isn't his wife, she's your wife!\").\n\nIf you ask me, the mismatched pairings is maybe the least interesting thing in the movie. The most entertaining  ...MORE","label":0},{"review":"tl;dr: Watch this movie only if you like the HouseFull brand of humour. You'll have a blast.\n\n\nThe film revolves around a bunch of people from 1419 and their reincarnations in 2019. And as the trailer tells you, the three main couples have been mismatched in their reincarnations. \"Iski biwi iski biwi nahi hai, woh teri biwi hai!\" (transl. \"His wife isn't his wife, she's your wife!\").\n\nIf you ask me, the mismatched pairings is maybe the least interesting thing in the movie. The most entertaining thing in this movie is Akshay Kumar. He is on screen for maybe 90 percent of the time, and that's a good thing. Whether his 1419 Bala is hilariously scheming for the throne or his 2019 Harry is forgetting everything that just happened, I enjoyed every bit of it.\n\nRitiesh did his parts as good as it can get, but he didn't have many parts. I wish we got more of him, like the previous instalments. HouseFull is an Akshay-Riteish franchise and it feels like Riteish missed out a bit here. Speaking of missed-out regulars, Boman Irani's Batuk Patel was also dearly missed.\n\nBut Akshay compensates for almost everything. He does the usual tough bits such as comic timing and dialogue delivery with ease (expected from him at this point), but where he absolutely shines are his facial expressions throughout the movie. Whether it is his signature \"I don't know\", Bala's \"phish-phish\" or (my personal favourite) \"Bhoola bhoola bhoola bhoola re\", he rocks it.\n\nOther than Akshay, the movie relies on funny character and one-liners. The one-liners work most of the time, but some of them are terribly bad, even by my standards. It also relies on confusion caused by reincarnation and, at times, mocks itself for being a \"reincarnation comedy\".\n\nAs for the rest of the cast: Johnny Lever unbelievably fails in the first half, but then strikes back towards the end. Kriti S, Pooja and Kriti B do well in the limited roles they have. I wish the leading ladies got better parts instead, like in HouseFull 1 (and to some extent, HF2). Bobby Deol tries hard to not be a misfit, but it just doesn't work. Ranjeet does well. Chunky Pandey does well yet again as Aakhri Pasta. Rana Daggubati is a surprises with his comedy and he does extremely well. So does the dependable Sharad Kelkar. Nawazuddin enjoys his cameo and makes sure that you do too.\n\nFor reasons I can't understand, this movie has received polarising reviews from the audience and critics alike. I know that not everyone is going to like this brand of humour, but it's exactly what you expect from a HouseFull movie. Enjoy the laughter ride!","label":0},{"review":"Well, when I checked the reviews for movie, I felt have I done quick pre booking for second day of movie. I was never been so fast in catching up with new movies. Overall, if you have watched the housefull series earlier then it has to be a movie that doesnt needs a brain to watch...for 3 hrs you can give break to your brain n keep laughing on all notorious jokes. A perfect movie to watch with frnds n family where you will come out laughing on jokes that are just punched to keep your interest on ...MORE","label":0},{"review":"Well, when I checked the reviews for movie, I felt have I done quick pre booking for second day of movie. I was never been so fast in catching up with new movies. Overall, if you have watched the housefull series earlier then it has to be a movie that doesnt needs a brain to watch...for 3 hrs you can give break to your brain n keep laughing on all notorious jokes. A perfect movie to watch with frnds n family where you will come out laughing on jokes that are just punched to keep your interest on for three hrs. Overall the movie is around bala character and once u r back home u will try the famous step chorerographer has introduced. Its not a must watch if you trying to find out something great even after watching the series of housefull movies! I have rated it well, bse i felt it is the movie how it has to be. The Bala song itself speaks abt the funny ride you can experience if you plan to watch movie without reading much reviews on it.","label":0},{"review":"First there are funny films that leave an impression for a lifetime (e.g. Golmaal of Amol Palekar, Chupke Chupke of Amitabh & Dharmendra, Hera Pheri, Munnabhai MBBS) and then there are those casual weekend watch which makes you laugh your heart out at certain moments during the film but nothing you'll recommend to someone on Monday. Housefull 4 qualifies for the latter. One great thing about the movie is that it's NOT a vulgar comedy filled with hindi slangs (which many other directors bank on t ...MORE","label":0},{"review":"First there are funny films that leave an impression for a lifetime (e.g. Golmaal of Amol Palekar, Chupke Chupke of Amitabh & Dharmendra, Hera Pheri, Munnabhai MBBS) and then there are those casual weekend watch which makes you laugh your heart out at certain moments during the film but nothing you'll recommend to someone on Monday. Housefull 4 qualifies for the latter. One great thing about the movie is that it's NOT a vulgar comedy filled with hindi slangs (which many other directors bank on today to make people laugh). It's old school, clean and meant for a family watch & I really loved it from that stand point. Akshay Kumar is brilliant. Kriti Sanon is good too. Certain one liners are outright hilarious and will make you laugh. Problem is that the support casts (including stalwarts like Johnny Lever) are absolutely horrible. Chunky Pandey & Bobby Deol should stop acting. They are an eye soar. Johnny Lever's acting as a transgender is difficult to watch and in just how many more movies are they going to make Riteish Deshmukh behave in a feminine way. There's no originality left in that any longer. The music is terrible & the story is rubbish. However, the best part of the movie are the last 20 mins. So there's a bit to look forward to. Therefore, if you're not doing much this weekend, you might like to buy the tickets for this one or not. I'll leave that choice to you 😊","label":0},{"review":"So get this, you are on diwali vacation at home after slaving away and you are together with all your beloved. Your sisters are home, your brother who you haven't met for more than a year is also home. You enjoyed Diwali to the fullest and after that on a dull day (still few days left of your vacation) you decide for a movie. Let me assure you, on that day you are not looking for a mind=blown kind of movie which is a critic pleaser, edge of your seat suspense, thriller etc. You go to housefull 4 ...MORE","label":0},{"review":"So get this, you are on diwali vacation at home after slaving away and you are together with all your beloved. Your sisters are home, your brother who you haven't met for more than a year is also home. You enjoyed Diwali to the fullest and after that on a dull day (still few days left of your vacation) you decide for a movie. Let me assure you, on that day you are not looking for a mind=blown kind of movie which is a critic pleaser, edge of your seat suspense, thriller etc. You go to housefull 4 and laugh your a$$ off with absolute absurdity and non sense of the highest order. We wanted to enjoy and that's what we did. That's what the purpose of the movie was. \nYou will feel intellectually satisfied by bashing this movie right, left and center for all things \"wrong\", but let me tell you; I don't even remember when was the last time I had tears in my eyes due to laughing so hard, this movie will do that to you if you leave common sense at ticket counter.","label":0},{"review":"‘Houseful 4’ should be visited with very low expectations so that you don’t get numbed by the scale of nonsense that goes on for nearly 2 hours 25 minutes.  The relief is that we have seen worse stuff from Bollywood.. so this one does not seem to hit the nadir which some others in the past had.\nIf one is ok with slapstick, mindless comedy (that struggles to evoke scarce laughter), this one may not disappoint.  Still not sure if anyone can really stand the scatological jokes the film trundles in  ...MORE","label":0},{"review":"‘Houseful 4’ should be visited with very low expectations so that you don’t get numbed by the scale of nonsense that goes on for nearly 2 hours 25 minutes.  The relief is that we have seen worse stuff from Bollywood.. so this one does not seem to hit the nadir which some others in the past had.\nIf one is ok with slapstick, mindless comedy (that struggles to evoke scarce laughter), this one may not disappoint.  Still not sure if anyone can really stand the scatological jokes the film trundles in great detail!!\nAkshay Kumar tries well- he is the mainstay of the flick.  Ladies look sufficiently gorgeous - eye candy quotient is taken care of.\nEnter this House to see how talented actors can do the buffoonery too with equal elan! 2/5","label":0},{"review":"My rating \n\nStory: 0\nScreenplay: 0\nCGI: 3/5\nColour coordination: 4/5\nMovie overall : 2.5/5\n\nI don’t want to bore you guys with the in-depth detail of the movie. But somethings that are missing is : they probably tried to make a spoof of Bahubali also adding one song from Bahubali 2 “Jay jay kara” but the twisted version. It has scenes from movie “The Dictator” and most importantly the popular song Bala is a total copy of “Bala song by Tony Montana” \nMost of the palace scenes felt just copy paste ...MORE","label":0},{"review":"My rating \n\nStory: 0\nScreenplay: 0\nCGI: 3/5\nColour coordination: 4/5\nMovie overall : 2.5/5\n\nI don’t want to bore you guys with the in-depth detail of the movie. But somethings that are missing is : they probably tried to make a spoof of Bahubali also adding one song from Bahubali 2 “Jay jay kara” but the twisted version. It has scenes from movie “The Dictator” and most importantly the popular song Bala is a total copy of “Bala song by Tony Montana” \nMost of the palace scenes felt just copy paste from Bahubali movie. The flashback and rebirth is also from Maghadheera Telugu movie. The director is great fan of S S Rajamouli as he has copied 2 films in one and tried to make it funny. But they fell flat on their faces especially Sajid Khan who originally wrote the script and idea. \n\nSeems like after Bahubali went hit these guys decided to make anything rubbish and feed the people that looks like Bahubali. \n\nThe colour coordination and CGI is good but since originality was missing this movie did jot do well. \n\nLooking at the amount of films Akshay Kumar does its like movies are just money making and numbers for him. He needs to give time to the script rather than just saying yes to anything. \n\nSo I wanted to laugh and tried to laugh but no it did not last long.","label":0},{"review":"Movie review: #Housefull4\n\n*******SPOILERS ALERT WARNING: CERTAIN PLOT POINTS AND THEMES WILL BE DISCUSSED AHEAD. BE-WARNED***********\n\nThe Housefull franchise is not needed in this world, but since its out in the universe, lets review it accordingly. Before I analyze the movie, lets discuss its parameters first. For a Housefull movie, I can not review in the same essence of what I will review a FAN, Badhaai Ho or even Bajrangi Bhaijaan.\n\nFor a Housefull movie, I have to limit my parameter to a  ...MORE","label":0},{"review":"Movie review: #Housefull4\n\n*******SPOILERS ALERT WARNING: CERTAIN PLOT POINTS AND THEMES WILL BE DISCUSSED AHEAD. BE-WARNED***********\n\nThe Housefull franchise is not needed in this world, but since its out in the universe, lets review it accordingly. Before I analyze the movie, lets discuss its parameters first. For a Housefull movie, I can not review in the same essence of what I will review a FAN, Badhaai Ho or even Bajrangi Bhaijaan.\n\nFor a Housefull movie, I have to limit my parameter to a shelf that 'houses\" the race franchise, the Aneez Bazmee or a Farah Khan movie.\n\nIs the movie Gnostistic, homophobic, sexist, misogynistic and derogatory? Yes it is in every sense. Kirti Sanson goes to punch Sharad Kelkar in one scene, and Akshay pulls her aside and mutters \"yeh tumhara kaam nahi hai\". Johnny Lever is given the drag makeup and made to believe he is a reincarnation of his daughter. Ritiesh Deshmukh gives a character sketch and a painful potrayal of a \"nartaki\".\n\nThere are many why's in the movie: Why did Nawazuddin Siddiqui agree to do this horrible role? Why does the kabootar's have a better role than Bobby Deol? Why didn't the writer's write a joke in the script?\n\nEven Askhay Kumar decided he gave up on this movie, and for some apparent reason he was in his jogging outfit instead of his wedding sherwani in the climax sequence?\n\nSee what I think is that just because we have grown watching such senseless comedies (or bollywood's interpretation of 'comedy'), that its so inbred and ingrained in our brains, that we are compelled to laugh while watching the movie. This is because our brain tells us this is Bollywood version of what it thinks is funny, and thats why I should laugh here. This is why I don't blame the average movie goer not understanding my reviews. Its like explaining Section 377 to Ritiesh Deshmukh's character in this movie.\n\nThis movie was a stretch - I was already complaining by the interval. The songs are... interesting. Nothing that pops up. There's is nothing to write about the performances. Its there. As for Akshay Kumar, he did Mission Mangal, Kesari, Padman, and then he decided to do Housefull 4. Choices.\n\nSee I'm not stopping you not to see this movie. See it at your own will. But then do switch off your brain, and don't try to look for sense while watching it. You know the standard of Bollywood franchise's - don't go in the cinema expecting to watch \"The Gods Must be Crazy\" or \"Andaaz Apna Apna\" - it is what it is.\n\nThis is just another movie you'll forget about in 2 weeks, toh kyun itna dimaag lagane ka? Did you remember Welcome Back, Mubarrakah, or Singh is Bling? Nahi na - toh chill kar!\n\nBut I do want you to ask yourself did you laugh at the homophobic, sexist and antagonistic 'jokes' or did you cringe?\n\nRatings: 2 rupees ka pehla director tha, \"me-too\" didn't enjoy the jokes. 1 star.","label":0},{"review":"The film housefull 4 is a great comedy movie.\nThe story was nicely drawn from present to past and then again to present.\nAll the characters played their role at their best.\nCompared to other films of the housefull franchise this was better than the 3rd movie. It was more hilarious,humorous. \nAkshay kumar has done an unexceptionally excellent acting by including all his skills of creating a humour environment in the movie and same for other characters especially Chunkey Pandey, Jhonny Lever, Rite ...MORE","label":0},{"review":"The film housefull 4 is a great comedy movie.\nThe story was nicely drawn from present to past and then again to present.\nAll the characters played their role at their best.\nCompared to other films of the housefull franchise this was better than the 3rd movie. It was more hilarious,humorous. \nAkshay kumar has done an unexceptionally excellent acting by including all his skills of creating a humour environment in the movie and same for other characters especially Chunkey Pandey, Jhonny Lever, Ritesh Deshmukh, Kriti Sanon, Bobby Deol for sure.\nMy suggestion is to watch this movie as it is a family entertainer, and do watch this movie.\nThe 2nd part of the movie was better than the 2nd one. So u might find 1st part a bit boring.\nThank you.","label":0},{"review":"My Rating : 4/5\n                            ⭐⭐⭐⭐\n\nThis is Housefull 4. Four! There shouldn't have been even a single one, but there are four of these in the cinematic universe! Sigh!\n\nIt takes a special kind of talent to write such utter non-sense for a hundred and forty-five minutes. But Sajid Nadiadwala (producer and story), along with Sara Bodinar (story and screenplay), Tasha Bhambra, Sparsh Khetarpal and Sajid Khan (he's been credited for screenplay despite everything) have that in abundanc ...MORE","label":0},{"review":"My Rating : 4/5\n                            ⭐⭐⭐⭐\n\nThis is Housefull 4. Four! There shouldn't have been even a single one, but there are four of these in the cinematic universe! Sigh!\n\nIt takes a special kind of talent to write such utter non-sense for a hundred and forty-five minutes. But Sajid Nadiadwala (producer and story), along with Sara Bodinar (story and screenplay), Tasha Bhambra, Sparsh Khetarpal and Sajid Khan (he's been credited for screenplay despite everything) have that in abundance. In keeping with the theme of the first three installments - Housefull 1, 2 and 3, Akshay Kumar, Riteish Deshmukh, Bobby Deol, Kriti Sanon, Kriti Kharbanda and Pooja Hegde-starrer is just that. A hundred and forty-five minutes of non-sense.\n\nWe meet the boys in their present-day avatar in 2019. Akshay (Harry) is in love with Kriti Kharbanda (Neha), Riteish (Roy) is in love with Pooja Hegde (Pooja) and Bobby (Max) is in love with Kriti Sanon (Kriti). That these women are filthy rich, and marrying them would help the men pay off a hefty debt they owe Sharad Kelkar (Michael Bhai) is a mere coincidence. They meet their prospective father-in-law, Ranjeet (Thakral) and after much deliberation, convince him for the rishta.","label":0},{"review":"Bala...Bala....Shaitan ka salla.....Go for it this Diwali.....funny, loud comedy with high production standards....(07/10)\nThis is also a tribute, in way to two veteran actors. As many of the younger generation might not know, that Chunky Pandey and Johney Lever, were both in Tezzaab, 1988, and both are still there after 31 years - Indeed an inning well played. And still rocking....\n\nWell, for those who have been constantly giving negative reviews for this movie, continuously making that noise o ...MORE","label":0},{"review":"Bala...Bala....Shaitan ka salla.....Go for it this Diwali.....funny, loud comedy with high production standards....(07/10)\nThis is also a tribute, in way to two veteran actors. As many of the younger generation might not know, that Chunky Pandey and Johney Lever, were both in Tezzaab, 1988, and both are still there after 31 years - Indeed an inning well played. And still rocking....\n\nWell, for those who have been constantly giving negative reviews for this movie, continuously making that noise on social media with their negative reviews.... \n\n01\nRemember what Ms Balan said in 'Dirty picture'? A movie, is only for entertainment. People watch movies, for entertainment. And when it is Diwali, it is really immature to hope that people will waste their time thinking if the scenes or story is logical or not. People, want entertainment. And that, is the only thing that matters.\n\n02\nComedy, laugh, are of two types. Loud and fine. This is loud comedy. One has to understand that. You cannot expect wit in such genre. Making people laugh, for two+ hours, is a talent. It requires intelligence. Sajid Khan, Akshay, Bobby, Johny Lever, Ritesh, Kriti, Kirti, Pooja.....Well, have really worked hard. Sajid Khan is not stupid....so for those, who are criticizing this movie, please watch more movies...explore.\n\n03\nWatch Hudson Hawk, 1991. It was a similar movie. (In terms of stupidity, I mean it is equal. It had such funny sand stupid story and scenes.... )There are many others, but I am quoting this one just for example. Bruce Willis did this, when he was sitting on the top of the world. There, the same critics will appreciate it...but this one, they will not. Sad. If you like a fun, absurd movie of Hollywood, why not this? It is this cocoon type mentality of Indians, who cannot see any good in India....Well, contrary to whatever the critics think, this is one movie which will give you full paisa vasool entertainment for Diwali...\n\nDirectors and team, have worked hard to maintain high standards of production, and no where you will see a sign of low production values.....People realize this and appreciate. Sajid Nadiadwala and Director have matured over the time, worked hard, and have finally deliver a movie that everyone will like. A movie for mass....\n\nAkshay leads. And he does it well. His song, Bala...Bala.....has good music, tilting music and I would remember this for a long time. I guarantee, for next years, in all parties and DJ, this one will remain a favorite.\nBobby, Johny Lever, Ritesh, Kriti, Kirti, Pooja, Chunky....well the list is endless. All three girls, are caste appropriately, and they spread their share of glamour and navels. Johny Lever's daughter is surprise. Well at least for me. Full marks for both father daughter duo. Bobby as Dharamputra and Ritesh as Bangdu are also good. No complaints. Rana Daggubatti is funny and has a bright future in comedy. Loud, of course. Ranjeet, Parikshit Sahani register their presence.\n\nIn nutshell, people spending crores on movies, are not stupid. They are in fact wise. I recommend this movie, for loud comedy, high production values and a shaitan ka Salla....Go for it.","label":0},{"review":"The film housefull 4 is a great comedy movie.\nThe story was nicely drawn from present to past and then again to present.\nAll the characters played their role at their best.\nCompared to other films of the housefull franchise this was better than the 3rd movie. It was more hilarious,humorous. \nAkshay kumar has done an unexceptionally excellent acting by including all his skills of creating a humour environment in the movie and same for other characters especially Chunkey Pandey, Jhonny Lever, Rite ...MORE","label":0},{"review":"The film housefull 4 is a great comedy movie.\nThe story was nicely drawn from present to past and then again to present.\nAll the characters played their role at their best.\nCompared to other films of the housefull franchise this was better than the 3rd movie. It was more hilarious,humorous. \nAkshay kumar has done an unexceptionally excellent acting by including all his skills of creating a humour environment in the movie and same for other characters especially Chunkey Pandey, Jhonny Lever, Ritesh Deshmukh, Kriti Sanon, Bobby Deol for sure.\nMy suggestion is to watch this movie as it is a family entertainer, and do watch this movie.\nThe 2nd part of the movie was better than the 2nd one. So u might find 1st part a bit boring.\nThank you.\nFROM NAZIA ZADRAN","label":0},{"review":"One of the worst disastrous movie which I hv seen terrible acting, bad writing, no strory, and without a single comedy scene  which actually make u laugh. It looks like watching any B grade movie with A list actors. \nThis film will surely make u feel why r u here?🙄\nKriti sanon dilouge 'yeh ho kya raha hai?' (which is repeated many times in the movie)was heart touching😂🤣 because it was the feeling internally.😑\nEnding is good 😁 people ran towards to the door of the thetre as two hour torture  ...MORE","label":0},{"review":"One of the worst disastrous movie which I hv seen terrible acting, bad writing, no strory, and without a single comedy scene  which actually make u laugh. It looks like watching any B grade movie with A list actors. \nThis film will surely make u feel why r u here?🙄\nKriti sanon dilouge 'yeh ho kya raha hai?' (which is repeated many times in the movie)was heart touching😂🤣 because it was the feeling internally.😑\nEnding is good 😁 people ran towards to the door of the thetre as two hour torture came end. 😆\nRating 1 out of ten (only for the actors atleast they give their best)","label":0}]