[{"review":"Gem of a film. Comic scenes are well known but the heart warming romance between the lead pair is often overlooked.\nThe chemistry is just perfect the movie is a treat to watch.\nOne of the finest comedy movies in Hindi.\nClassic!!","label":0},{"review":"5/5 star.  Superb !! Outstanding one of my best-- have comedy, love, realistic, heartly. Just wow!! All actors role made film absolutely amazing! Great film.  Akshay khanna & Sunil Shetty & Arshad varsi are superb.","label":0},{"review":"Awesome movie. I like this comedy movie so much. Can't imagine that this old lady is the same actress who played role of Julie in the movie Julie in Hindi language which was released in 1975.I love you akshay khanna and kareena kapoor Khan","label":0},{"review":"A must watch movie with lots of laughter & entertainment. One of the finest Bollywood movies ever!!! All the comedy scenes were hilarious & all the actors performed very well. I rate it 5/5 stars.","label":0},{"review":"Films like these come out once in a lifetime. Comedy at its peak. Akshay Khanna and Paresh Rawal is a gem to watch them do some comedy. Perfect comic timing by both of them. 4.5 on 5 from me.","label":0},{"review":"I love this movie because of the multiple star cast. All actors gave very well performance specially Amrish puri Sir. He is all time one of my favourite actor. His voice is like lion's roar.","label":0},{"review":"The original is 1991 malayalam movie'Godfather'. Rest all language versions are remakes. However this is a faithful review and master craftsman priyadarsa has done a wonderful job.","label":0},{"review":"Nice comedy movie. This movie is a remake of Marathi movie called \"Ghayaal (1993)\" and also the movie from South called \"Godfather (1991)\".\n\nIn the Marathi version, Johnny Lever is playing the character of Arshad Warshi.","label":0},{"review":"Am big fan of akshay khanna nd i love dis movie i miss all in this movie characters freaking awsom movie priyadarshans movies always awsom fun musti comedy","label":0},{"review":"Still watching this in 2019. Unarguably the best classic comedy movies. Today's generation movies can't match the excellence like this movie did in terms of dialogues and acting","label":0},{"review":"I just love this movie. It came out when I was just 10 years old and I still love it as much as I loved it then.","label":0},{"review":"This is a must watch movie. The comedy is superb and my favourite characters were Arshad and Paresh Rawal.","label":0},{"review":"Best comedy movie. And the credit goes to Arshad warsi..hilarious comedy by him too good..","label":0},{"review":"Extremely funny movie.....like after watching it 10th time still want to watch again..... don't miss it..... watch it with family to have great fun.....","label":0},{"review":"Very good movie I must say and the comedy I had never bored to watch this movie again and again","label":0},{"review":"Its a remake of a malayalam filim... But they did  it like a fresh good movie in hindi version...","label":0},{"review":"Brilliant! Lots of laughter & Gags. Must watch!","label":0},{"review":"This is my one of the favoriute movie i miss all character in this movie also Aksay khanna nd Arsahd varsi","label":0},{"review":"good comedy movie paresh rawal and arshad warsi did comedy very well","label":0},{"review":"one of the best movies bollywood ever have 😍😍😍","label":0},{"review":"Its always a fun to watch this movie.","label":0},{"review":"Best movie yar good movie i luv ❤️ movie","label":0},{"review":"Fantastic, comedy movie and Happy Ending.","label":0},{"review":"Original malayalam version Godfather is awesome","label":0},{"review":"Really a great comedy, love it😍😍😍","label":0}]