[{"review":"This is the movie where I fell in love with Saif Ali Khan - the nuances, the comic timing, the urban vibes...it all exuded a natural kind of a hero that was a refreshingly good break from your angst-y and brooding lover that Bollywood is so adept at fleshing out. \n\nNot to undermine all the other aspects of the film: the score, the script, Kirron Kher, Rani Mukherjee and the cartoons...they all captured my attention and eventually (even after all these years) my heart. I can never stop replaying  ...MORE","label":0},{"review":"This is the movie where I fell in love with Saif Ali Khan - the nuances, the comic timing, the urban vibes...it all exuded a natural kind of a hero that was a refreshingly good break from your angst-y and brooding lover that Bollywood is so adept at fleshing out. \n\nNot to undermine all the other aspects of the film: the score, the script, Kirron Kher, Rani Mukherjee and the cartoons...they all captured my attention and eventually (even after all these years) my heart. I can never stop replaying this movie and finding something new about it to admire. Definitely underrated and a must-watch!","label":0},{"review":"Honestly there are so many memories attached to this film. I’ve watched it with friends and family growing up. Whenever life gets a little tough now and it’s hard to focus on the good I go back to this movie. It makes you believe and have faith that in all the good things life has to offer. Even a stone hearted critic (of love ) like me feels like wanting to believe in the fairy tale again. Funny, interesting, at times emotional and all in all a very well scripted movie. Worth the watch (or 100  ...MORE","label":0},{"review":"Honestly there are so many memories attached to this film. I’ve watched it with friends and family growing up. Whenever life gets a little tough now and it’s hard to focus on the good I go back to this movie. It makes you believe and have faith that in all the good things life has to offer. Even a stone hearted critic (of love ) like me feels like wanting to believe in the fairy tale again. Funny, interesting, at times emotional and all in all a very well scripted movie. Worth the watch (or 100 watches hehe)","label":0},{"review":"The best rom-com to date starring handsome Saif Ali khan and beautiful Rani Mukherjee. This movie shows you that not only the opposite sex attracts but also the opposite personality does attract. The film narrates Saif Ali Khan's role as a cartoonist and Rani's role as a fashion designer and how they both justify the character at it's best. This movie will take you single-handedly from Delhi to Amsterdam to New York to Mumbai to Paris. My personal favorite as it showcases the romance and comedy  ...MORE","label":0},{"review":"The best rom-com to date starring handsome Saif Ali khan and beautiful Rani Mukherjee. This movie shows you that not only the opposite sex attracts but also the opposite personality does attract. The film narrates Saif Ali Khan's role as a cartoonist and Rani's role as a fashion designer and how they both justify the character at it's best. This movie will take you single-handedly from Delhi to Amsterdam to New York to Mumbai to Paris. My personal favorite as it showcases the romance and comedy and their blending with each other. Must watch.","label":0},{"review":"It's an evergreen movie. I've watched it several times but I'm not at all bored. The songs are great. Performances of all actors are terrific. It's a beautiful representation that love at first sight is not always true. Even years after its release I find it refreshing. I strongly recommend fans of love stories to watch this movie","label":0},{"review":"This really very underrated film. Excellent Scrip, Very Good direction. One of best ever performance by Saif. Overall Hum Tum, It's a complete package 👍🏻","label":0},{"review":"The one of the best movie I've ever seen. I saw it at least for 50 times and I want to see that movie again. I'll never get bored.... that's for sure. It can't be expressed by words. I'm overwhelmed...","label":0},{"review":"Really..what a movie . I was child when this movie released that time I loved the cartoon character and music too......but now after many years when I watched this movie I really impressed with this movie...what a acting both by saif and Rani.. love you guys ...you both are great ..I almost watched your movie...but this movie I loved more......","label":0},{"review":"Must watch movie for those who love romantic movies...best performance of both leads easily in there career...some scenes are actually taken out from director KK personal life which are true...life is cinema,cinema is life","label":0},{"review":"Evergreen movie.Apart from the main characters Rishi Kapoor as a modern fun loving father and Kiron Maam's character as a Punjabi mother is so terrific & relatable.","label":0},{"review":"Best movie and what a great performance by Saif and Rani !!\n\nClose to my heart and will allways be \n\nYash Raj rocks !!","label":0},{"review":"One of the best movies of saif \nLiked it very much\nMany important things are related to this movie \nGreat to watch \nSongs are awesome","label":0},{"review":"Simple and happy go lucky kind of movie. It's songs, cartoon, Saif nd Rani acting loved it.","label":0},{"review":"Such an original concept! So beautifully made. Loved the characters, locations, the story,\nEverything .\nMasterpeice.","label":0},{"review":"Cute love story for those who believe  in love and who hopes to get back his/her  true love in their life!","label":0},{"review":"So nice story. I liked this movie tooooo much wanna watch it again..","label":0},{"review":"It reminds me of my first love. Love u shubha.","label":0},{"review":"I like this movie I have impressed to the of love that's all","label":0},{"review":"Its really a good movie so touched lots of love","label":0},{"review":"Very good film.Saif Ali khans acting is just fantastic","label":0},{"review":"a movie that one can't fed up ...everytime it is treat to watch...love it...","label":0},{"review":"Its gust osaum movie i gust love itthe music is too good","label":0},{"review":"Year, rememberance of friend &also married life, or again breakup to someone enter in my life .","label":0},{"review":"It's ever green movie🎬🎬 I love❤😘 it","label":0},{"review":"Nice mow one of my favorite","label":0},{"review":"I really love this film .....best in the genre !!","label":0}]