[{"review":"This is a musical romantic drama film, music is terrific & heart touching. The songs will haunt you for many days after watching .\nPerformance-wise Arjun Rampal has given his best & excelled in emotional scenes. Story, screenplay & direction is just average. But this is probably the best performance by Arjun Rampal as pure heart, simple, generous, unselfish guy ready to sacrifice his love.","label":0},{"review":"\" Humko Tumse Pyar Hai \" movie is heart touchable movie n its song ,story , emotions, dialogues everything is perfect. That movie seems like a real story of lovers. Awesome n fantastic 👌","label":0},{"review":"This movie is very heart touching its  given the very loving  emotions this is my favorite movie and I loved all songs and todays movies in I'm no interested","label":0},{"review":"This movie is so romantic and sensitive, I most like, all songs too touching my heart and lot up thank you for all actors.","label":0},{"review":"This story is very heart touching in the movie and more very romantic songs.......I love this movie and my favourite actor and actress I love you Arjun and Amisha.............","label":0},{"review":"This flim is very nice .love movie and Tumko chaha hai tumko chahuga  my favourite song i loved movie nice","label":0},{"review":"This movie is very very lovely,romantic & emotional. It's love story is just heart touchable.","label":0},{"review":"I am love this movie \nBast love film\nButifull film \nBast film \nI love this movie all crecter\nMene is movie ke 2 part ki sakriy likhi h","label":0},{"review":"Best story with best songs..... Love to watch if you are in LOVE...","label":0},{"review":"This movie was very nice that was song is so romantic and story such a true love....","label":0},{"review":"Best film hai and my favorite I really loved Arjun raampal and voice so gooooood","label":0},{"review":"this film is very nice....... and touch my heart....... and tere ishq me paagal ho gaaya song my favourate song in this film","label":0},{"review":"Awesome film of love and besttttttttttttttttt................ \nWho feels the feeling of movie if loves","label":0},{"review":"I am like it movie it movie story of tregidi and present it song is very good","label":0},{"review":"This is very heart touching movie on lovers i like this film","label":0},{"review":"This movie is heart touching movie i just love it bottom of my heart","label":0},{"review":"Very beautiful movie .I like this song ,dialogue ,emotions everything is perfect","label":0},{"review":"Hurt❤️ tuch muvie & songs\nArjun rampal is my best acter","label":0},{"review":"My all time favorite movie and\nSong \nAddicted to him","label":0},{"review":"I like this movie because it touches everyone mind and hearts","label":0},{"review":"Awesome love triangle movie...but but but... All is well that ends well😃","label":0},{"review":"i like this move song emotion  acting everything is perfect.mza aagya","label":0},{"review":"This movie all songs super and sweet\n\nAnd hit movie","label":0},{"review":"This movie is a very nice and I like very much","label":0},{"review":"Every songs is the heart touchable.and when i upset then i listen every songs.","label":0}]