[{"review":"One of my favourite movie of my favourite couple on-screen alia bhatt and Varun dhawan. Humpty Sharma ki dulhania is like a favourite flimy story where the lover in order to get married to his beloved convenience his father. The way of relating the emotions with the audience is so amazing. Love and relationships has got a cute turning like Humpty says to Kavya father that \"\"Bande perfect Nahi hote rhiste perfect hote hai\"\" the dialogue is very simple but it relates to the audience that one perso ...MORE","label":0},{"review":"One of my favourite movie of my favourite couple on-screen alia bhatt and Varun dhawan. Humpty Sharma ki dulhania is like a favourite flimy story where the lover in order to get married to his beloved convenience his father. The way of relating the emotions with the audience is so amazing. Love and relationships has got a cute turning like Humpty says to Kavya father that \"\"Bande perfect Nahi hote rhiste perfect hote hai\"\" the dialogue is very simple but it relates to the audience that one person may not be a perfect one you search for but at least will try will all his love to be in that zone. So I recognize that though this is a flimy story but here we have much more to be feel and enjoy so enjoy this movie several times watching and loving alia bhatt and Varun dhawan","label":0},{"review":"HUMPTY SHARMA KI DULHANIA\n(drama/romance)\nThis movie doesnt have anything new in store,just the same old love story.\nThe only thing i found nice was varun dhawans acting.\nWatch if you want to watch the same story enacted by a new set of actors.\nOverall below average.\nMy rating 2","label":0},{"review":"this type of films shows that we dont have quality directors in bollywood their only motto is to make money film is only byproduct u cant even say this is a old wine in a new bottle this is old wine in old bottle to be honest what bollywood lacks at the moment is quality directors n writter what the producers need to do is cut few crores from overrated actors n pass it on to the writers that will help in improving the pathetic screenplay which we r been feed since donkeys years this is a below a ...MORE","label":0},{"review":"this type of films shows that we dont have quality directors in bollywood their only motto is to make money film is only byproduct u cant even say this is a old wine in a new bottle this is old wine in old bottle to be honest what bollywood lacks at the moment is quality directors n writter what the producers need to do is cut few crores from overrated actors n pass it on to the writers that will help in improving the pathetic screenplay which we r been feed since donkeys years this is a below avg film i will go with 1.5 stars","label":0},{"review":"It is very good movie to watch.It is mixture of love,comedy,romance.Varun,Alia chemistry is fab.Every scene is unpredictable.what else to say watch and enjoy.All cast&crews acting is very strong in each scene.Hats of to varun for strong acting as a lover boy to alia.Don't miss to watch this movie.","label":0},{"review":"Varun is my favorite he is my first and last love and I also love varun and aliya s chemistry they looking outstanding with each other really very beautiful couple it the best Jodi of the world I think and this is also very entertaining I think everyone should watch this I love varun my hero","label":0},{"review":"This is a very heart touching movie for adults and teen angers.it Is very romantic varun is killing it in the movie and alia bhatt the same she is also doing her best.ALL VERY GUD AND BEAUTIFUL SONGS.Must watch the movie","label":0},{"review":"I like this movie. This is an amazing movie. Varun dhawan and Alia bhatt do fantastic acting. Shashank khaitan and karan johar make outstanding movie.","label":0},{"review":"Its beautiful, funny and romantic. A must for all romantics! The performances by Alia and Varun are great, they portray their characters with excellence.","label":0},{"review":"i love varun dhawan very very much .i am biggest fan of him .his acting is very very cool .He si my favourite actor. LOVE THIS MOVIE VERY MUCH","label":0},{"review":"A nice sweet and spicy film well told story which is depicts real life social hangover of middle class Indian society associated with relationship, marriage and social stigma about boy and girl differences.","label":0},{"review":"I love this movie.kisiko hasana bahot diffcult hai .varun i am wait your movies .this movie seen 8 times. Well done sir keep it up","label":0},{"review":"What a great movie , I want to suggest that in movies Varun dhawan and alia Bhatt pair is nice and keep it like that only","label":0},{"review":"One of the best I've ever watched 😍 perfect blend of comedy and romance 💯 Hats off to Varun Dhawan's acting 🙏","label":0},{"review":"I like alia bhatt and Varun Dhawan both \nAnd both are acting in this movie \nSo, I like this movie a lot \nAlia bhatt is my favourite actress and \nVarun Dhawan my favourite actor","label":0},{"review":"Varun and Alia both are my favorite. The story of the movie is full of romance, drama and comedy. \nFull Paisa Vasool movie 😘","label":0},{"review":"To find a perfect partner to have our life perfect and give decisions to our parents also to address them to whom we love","label":0},{"review":"I like alia bhatt and Varun Dhawan both And both are acting in this movie So, I like this movie a lot Alia bhatt is my favourite ...","label":0},{"review":"i hit alia bhatt and natasha is 100000 person beautiful then alia bhatt please varun marry with shraddha kapoor.","label":0},{"review":"I like both the couple too much \nNa i also be a great fan of varun dhawan nd cute alia bhatt.","label":0},{"review":"Varun &alia is best couple as I like and I want to see again in extra movie","label":0},{"review":"It's really a beautiful movie....I really love this movie.... It was great and a brilliant movie 🍿","label":0},{"review":"lovely film as directed by a huge talented director KARAN JOHAR always love his films\n\nAMAZING!!!!!!!!!!","label":0},{"review":"really nice funny  movie  \nvarun and alia both are amazing  \nthe songs are so goooooood","label":0},{"review":"I like this movie. Eeee movieile songs superb ane, nalla movie ane, Varun Dhawan and Alia butt  😍😍😍😍","label":0},{"review":"This movie is very nice alia bhatt and varun dhawan very smart and they are beautifull","label":0}]