[{"review":"Well crafted story. Rich lad choosing a poor girl as his bride. Cinderella meets her Prince charming. However the evil mother over here is the girl's former scheming murderous boyfriend. All misunderstandings cleared at the end. Lovers unite. Excellent movie. Shot in a Cruise Liner and exotic location. Must watch.","label":0},{"review":"Hello, I really enjoyed this film Humraaz. Very good performance from Akshaye Khanna, Bobby Deol, and Amisha Patel. Also, the music was just awesome. Songs like Sanam mere Humraaz, Pyar kar, and Dil me karliya are very melodious.","label":0},{"review":"Very very interesting romantic thriller😘. Gorgeous amisha Patel, superb acting by Bobby deol and Akshay Khanna.\nMust watch","label":0},{"review":"Excellent songs. Good storyline. Good acting by all 3 actors.","label":0},{"review":"Akshay Khanna is the real man in this film.Highly recommended for Akshay fan","label":0},{"review":"Super suspense, performance, songs, score every ingredient is huge in quantity as well as quality.","label":0},{"review":"great movie college time anjoy &  songs  so good by himesh","label":0},{"review":"outstanding movie and all 3 have done a marvellous job","label":0},{"review":"Very nice movie and I'm so proud of u","label":0},{"review":"Outstanding","label":0},{"review":"Wow bobby deol he is so handsome😚😍","label":0},{"review":"Excellent movie","label":0},{"review":"It's a fantastic  movie","label":0},{"review":"Bobby Deol was superb in this film.. !! (Y) (y)","label":0},{"review":"Mind blowing movie","label":0},{"review":"Awesome👏✊👍 song","label":0},{"review":"Very nice movie.","label":0},{"review":"GOOD.  Like.   It","label":0},{"review":"I like this song","label":0},{"review":"What about the old Humraaz movie starring Sunil Dutt and Rajkumar","label":0},{"review":"Nice movie...","label":0},{"review":"Pity on ameesha becaz.so nice actress but lost in haste","label":0},{"review":"That GYM scene should be BANN,\nIts Thrilest Ever","label":0},{"review":"Pay self may 2018 army no 14840021 W","label":0},{"review":"Itisveryexcellentmovie","label":0}]