[{"review":"Rubbish dosnt make any sense. Headache movie westing money time and mind. Actors acting were like jokers. Not satisfied . Saif Ali Khan belong from nawab family still he is doing these kinds of jokery movies.","label":0},{"review":"It was an amazing film \nThat make me feel happy \nThis was the best comedy movie I had ever seen","label":0},{"review":"It's a very disgusting, terrifying, sexually oppressed film. There is no sense in watching the film. None should watch this film; it's just a waste of time and money.","label":0},{"review":"The acting was the best I have ever seen, this deserved an oscar.","label":0},{"review":"this movie should become a torture technique. or a way to get the truth out of someone","label":0},{"review":"Superb story..... And more comedy..\nAnd I like this film","label":0},{"review":"Confusing but still good acting and very entertaining watched 23 times already.","label":0},{"review":"Nice \nGood\nAwesome \nGajab \nJhakas \nGreat \nBeautiful \nJai hind \nSuperhit \n😊 😊 😊","label":0},{"review":"If you watch this movie, you will live only for six months. It is that bad!","label":0},{"review":"Childish movie, senseless. Makes fun of mental conditions","label":0},{"review":"It's very comedy & funny movie and Happy Ending.","label":0},{"review":"ANYONE TRIED TO VERY GOOD BUT NOT SUCCESSFUL FEELING SAD \nBUT THE MOVIE WAS DISAPPOINTED 😖😖😖😖","label":0},{"review":"Indeed a masterpiece just behind The Shawshank Redemption.","label":0},{"review":"Very good movie my rating is 5/5","label":0},{"review":"NO COMEDY AT ALL WORST MOVIE I EVER SEEN","label":0},{"review":"I hate the Oscars for not giving this film any awards","label":0},{"review":"IBM very disappointed with Sajid after watching this movie","label":0},{"review":"One of the worst movie i have ever seen.","label":0},{"review":"Worst movie all over the world","label":0},{"review":"Flop movie. Only 1 song is good.","label":0},{"review":"dont see the movie a total torture","label":0},{"review":"Very comedian movie \nI like this movie","label":0},{"review":"Worst film ever","label":0},{"review":"Totally useless movie","label":0},{"review":"This movie is definition of trash.","label":0}]