[{"review":"Absolute 100% Comedy , nothing else. Watching it again on 23 oct 2019 On TV. Still Loving Every bit of it. \nAll the Characters Justifying there Roles. Especially Paresh Rawal. \n\nI'm Sure Everyone have Already Seen this movie but if You haven't , you are missing a great Comedy Deal. Just Go and watch this Comedy Masterpiece.","label":0},{"review":"One of the best comedy movie i ever watched. I never been bore even watch this movie again and again. Those who haven't watched this movie yet they should must watch this movie. You will be mad by laughing all day. One of my favorite movie. I wish movies like this could be made again in Bollywood.","label":0},{"review":"this is full of laughter & hidden love, love ❤️ it and priyadarshan what an amazing director 👌👏. One can also watch masterpiece of priyadarshan like \n- Herapheri \n- De Dana Dan\n- Bhool Bhulaiyaa\n- Dhol\n- Khatta Meetha\n- Garam Mashala\n- BhagamBhaag\n- Hulchal .... etc.. remaining search it gentleman..❤️","label":0},{"review":"This is one of the best comedy movies of all time.\nStill cracks me up any time i watch it.\nPure class.. Brilliant direction.. Amazing acting performances by everyone..","label":0},{"review":"This movie is baaap. This is my way of expressing my love for a movie😂. But I must say this movie is always fun to watch, no matter how many time you've already watched it.","label":0},{"review":"All the characters are just amazing...I can watch this movie anytime...best Dailogues....Amazing story and sense of humour... Akshay Khanna is an Amazing Actor...I wander why he did not get success","label":0},{"review":"Very nice movie and Priyadarshan sir a very talented director I want him to direct more and more movie.. a very logistic comic movie.. a must watch movie..a better word to say Priyadarshinic comedy which u can find in Priyadarshan sir's movie","label":0},{"review":"I never get bored watching this film.... It's just too funny, loads of laughter..... Must watch for those who haven't seen this movie.... I myself I had watch many times.... ❤️❤️❤️","label":0},{"review":"Best comedy film. Seen so many times. But never miss to it whenever get a chance to view it. Music is superb.","label":0},{"review":"The movie has good comic sense and good comedy punches . Actually its  very entertaining movie. Must watch, nice timepass!!!!","label":0},{"review":"Bollywood's gem. Epic movie by priyadarshan. They don't make such gem any more. Hail to the entire cast :) akshay Khanna and paresh rawal especially took it to new heights","label":0},{"review":"A must watch movie 🎥 Full of entertainment......v v logical ,funny ,amazing songs,nostalgic,creative,acting skills r up to the mark n ending is also v witty😍😍😍🤩🤩🤩🤩🤩🤩","label":0},{"review":"This is one of the finest comedy movies of Bollywood. Now a days comedy movies are not more comedy a comedy movie!!\n    #one has to laugh by force#","label":0},{"review":"Always made me laughed so hard when I watched it. Amazingly made.  Story is so well made. One of my favorite movie.","label":0},{"review":"This is the utter most comedy film 🎥 of India. Though a remake, treatment is fresh and very funny. Paresh Rawal is the real winner.","label":0},{"review":"Its 2019 and you can still watch this with your family.its a perfect blend of humor romance and suspense.","label":0},{"review":"It is among best comedy movies of all time .\n\nParesh Rawal and other actors have done well","label":0},{"review":"This is probably one of the most funny , entertaining comedy film in bollywood i have ever seen.....","label":0},{"review":"This is one of the best comedy movie. Priyadarshan is really the best comedy movie director...","label":0},{"review":"Very underrated comedy movie. You can die of laughter.","label":0},{"review":"The best hilarious movie I have loved after Andaz Apna Apna. Must watch this movie.","label":0},{"review":"Need laughter... Get watch this exceptionally well directed comedy","label":0},{"review":"I have seen this movie hundred times, still every time I laugh not bore.","label":0},{"review":"It is a nice movie with lots of comedy scenes","label":0},{"review":"Super comedy movie I'm really enjoy with family","label":0}]