[{"review":"This is , in fine, more of a mystery than a horror flick, though there are tropes referencing modern urban horror, which if you have been exposed to Korean cinema, can be employed to great results : not that this drama handles it poorly, but there are moments when the narrative seems forced by plot requirements, as against a cause and effect concatenation that propels the really, singular pieces of cinematic art. Still and all, this is a nice change of pace, with enough entertainment quotient to ...MORE","label":0},{"review":"This is , in fine, more of a mystery than a horror flick, though there are tropes referencing modern urban horror, which if you have been exposed to Korean cinema, can be employed to great results : not that this drama handles it poorly, but there are moments when the narrative seems forced by plot requirements, as against a cause and effect concatenation that propels the really, singular pieces of cinematic art. Still and all, this is a nice change of pace, with enough entertainment quotient to make it worth your while, has nice twist and clever misdirections. But for, some unreal and contrived instances, there is not much to find fault here — greatly commended.","label":0},{"review":"A real thriller that keeps you on the edge of your seat up until the very ending! The plot twists and turns keeping you engaged and guessing. The film was produced by Cleveland native Matt Waldeck, filmed in and around Cleveland. The cast lead by Helen Hunt give solid performances. A must see if you like mystery thrillers.","label":0},{"review":"This movie was so interesting! Lots of twist and turns with an ending that was not expected at all 10/10","label":0},{"review":"Loved the part when they played Fortnite and the kid got downed but he was revived!","label":0},{"review":"I loved it. Who doesn't love a good scare.","label":0},{"review":"WOW..\nMIND bending. Really good.","label":0},{"review":"Great story \nLovely acting \nPerfect Production","label":0},{"review":"lol i peed in my pants right now wacthing it","label":0},{"review":"Nice twist, did not expect that","label":0},{"review":"Very unpredictable and well made.","label":0},{"review":"i didnt see it","label":0},{"review":"One of best mystery movies of 2019. You cannot guess the end of the movie and has a new story. Strongly recommended.","label":0}]