[{"review":"Thankfully I watched, beyond all critics or else would have missed such great work!\n\nStory revolves around Sexual harrassment case filed against Rahul Verma (CEO) by Maya Luthra (BCD).while the case many a times Story goes into flashbacks where it seems Rahul and Maya shared a relationship other that boss-employee! Overall movie is a must watch. The main punch of the story is realistic circumstances, hesitation for the commitment, and fact that people are ready to cross all the lines to achieve  ...MORE","label":0},{"review":"Thankfully I watched, beyond all critics or else would have missed such great work!\n\nStory revolves around Sexual harrassment case filed against Rahul Verma (CEO) by Maya Luthra (BCD).while the case many a times Story goes into flashbacks where it seems Rahul and Maya shared a relationship other that boss-employee! Overall movie is a must watch. The main punch of the story is realistic circumstances, hesitation for the commitment, and fact that people are ready to cross all the lines to achieve a position and what all seems meaningful is chasing those positions!\nOverall it was a successful attempt to showcase the reality of Minimals life working in co-operate. Maya(Chitrangada)  looks stunning where Arjun as usual handsome hunk. Both of them have justified their character's the music album of movie is just fantastic lyrics so meaningful.","label":0},{"review":"Liked it.\nWe don't see many corporate themed movies in Bollywood. This breaks stereotypes in a lot of ways from a movie point of view, the story, plotline and presentation etc. it's all different and nothing like anything I have seen before. \nIt touches a lot of topics like sexual harassment(teaches you 2 cents about what qualifies as harassment post complicated past relationship too), discrimination towards women in workplace, ambitions, love, complications after a failed relationship in workpl ...MORE","label":0},{"review":"Liked it.\nWe don't see many corporate themed movies in Bollywood. This breaks stereotypes in a lot of ways from a movie point of view, the story, plotline and presentation etc. it's all different and nothing like anything I have seen before. \nIt touches a lot of topics like sexual harassment(teaches you 2 cents about what qualifies as harassment post complicated past relationship too), discrimination towards women in workplace, ambitions, love, complications after a failed relationship in workplace, ego clashes between 2 people of equal professional stature etc. \nIt's complicated to say the least and that's what makes it so real.\nThe content is still fresh, I haven't seen anything like it in the past 5 years post this movie's release. \nIt has a tinge of suspense too, kept me at the edge of my seat till the end to see who wins the case for sexual harassment.\nIt's definitely a one time watch.","label":0},{"review":"After a long time, Rampul did a great job and truely justice with the role. This flim shown a hardcore truth of corporate policy's. With the unique and genuine topic have shown in the film. \n\nDon't judge the book by it's cover and this flim is good example of it..","label":0},{"review":"One of the underrated gems.\n\nTruth is the last thing that people want to know. What people want is just a story with masala.\n\n\nThis movie is about a sexual harassment case in which love wins.\n\nThe ugly truth about the trial of such cases.","label":0},{"review":"Starts off well n then loses the plot.  Its pretty average stuff.. Rampal is good.  That's bout it. The climax and the  ten min leading to it really pulls down the plot. \n\nVery disappointing film. Just not sure what the director wanted to say. \n\nRating: 2/5","label":0},{"review":"Great movie....fantastic direction and storytelling. All actors have done complete justice to their characters specially the lead actors. The story is gripping and music is good too....Liked it a lot ...","label":0},{"review":"This movie is highly  underrated because  it doesn't  have a star cast. But it has a unique  story and good performance  by the cast .","label":0},{"review":"After a long time, After Salesman of the year 2009 movie, i have watched it 2 times and i really like it, Rampal acted very well in this movie. \n\nI think Bollywood industry make more movie like that.","label":0},{"review":"I luved the movie... the climax was yet confusing... it shud be shown in part 2\n. Arjun chitrangada... superb job","label":0},{"review":"One of the best performances of Arjun Rampals and of course it was a great story..","label":0},{"review":"Good to watch but end should be something different to make it more clear and interesting. ****","label":0},{"review":"One of the best bollywood movies I have ever watched.","label":0},{"review":"One of the best underrated Indian film, fresh story plot. 👍","label":0},{"review":"Inkaar. Watching at on CINEPLEX HD.  Good movie. They have acted well.","label":0},{"review":"Fine performance of the lead actors. Excellent songs.","label":0},{"review":"Fantastic worth watching many times over","label":0},{"review":"Love dis movie,,, outstanding performance by Arjun R.","label":0},{"review":"a moive to watch , Rampal's acting is worth the film","label":0},{"review":"A very bad film .. Just waste of time","label":0},{"review":"Most Intelligent Movie Ever! ....","label":0},{"review":"M so happy","label":0},{"review":"unique story","label":0},{"review":"Good 😊 movie 🎥","label":0},{"review":"It is well nerrated, acted and directed  movie.","label":0},{"review":"Most under rated movie ....... cant stop watching it again n again !!","label":0}]