[{"review":"Well, Armaan Kohli is love. I loved his acting and why this movie didn't win an oscar is still a mystery. The best ensemble cast in the history of cinema. I am eagerly waiting for the sequel. I will show this movie to my kids, so that they learn to appreciate quality films at a young age. But then again,it has some objectionable love scenes which I would not want my kids to see at a very young age. So, I will wait till they're 15 and then we watch movie and have the TALK!","label":0},{"review":"Wow! every 90s kid knows JAANI DUSHMAN....it truly has a ANOKHI kahani. Its a legendary movie, an epic. This is one movie that has the 3 most important ingredients to make a hit movie, \n1.Entertainment 2. Entertainment 3.Entertainment.\n The genre of this movie, hmmm...it would be tough to categorize under 1 category  as once it released I am sure it turned out to be a HORROR movie for its producers, unintended COMIC movie for its audiences and truly an ACTION movie for the director as I am sure  ...MORE","label":0},{"review":"Wow! every 90s kid knows JAANI DUSHMAN....it truly has a ANOKHI kahani. Its a legendary movie, an epic. This is one movie that has the 3 most important ingredients to make a hit movie, \n1.Entertainment 2. Entertainment 3.Entertainment.\n The genre of this movie, hmmm...it would be tough to categorize under 1 category  as once it released I am sure it turned out to be a HORROR movie for its producers, unintended COMIC movie for its audiences and truly an ACTION movie for the director as I am sure the producers must have wanted to kill him for this disaster and finally a MYSTERY movie as it always raises this question that what made all these actors sign this movie !!!\n \nspecial applaud to the guy who did the special effects ....master piece man !","label":0},{"review":"This is the best movie to ever grace humankind. \nThe special effects rival Avengers: Endgame (for it's time). \nThe plot is like a crossover between Baahubali and Inception, incorporating both ancient and modern, scientific and supernatural plot elements.\nIt's a star-studded cast, as evident by its poster, and so the acting is incredible, especially, surprisingly, by Sonu Nigam. Who even know he could act as well as he could sing?","label":0},{"review":"It's a cult classic movie, this movie is so bad that's it's really good, \nKapil nag is more powerful than terminator and neo Anderson, he could easily defeat thanos. \nSonu nigam is the god of acting , Raj babbar, s multi religious locket  is love. \nAaja aaja is the best is song in the history of Bollywood","label":0},{"review":"i really loved this movie then n even now. i will defend it till my death. all d actors performed really well. the action was brilliant. d only thing i did nt like was aditya pancholi playing a college student, then why left raj babbar.","label":0},{"review":"Its one of the worst movies with one of the worst actors in the lead - Armaan Kohli (who looks like local gangster and rapist). It was a pain in the head. Anyone who is stoned can watch this movie.\n\nTanisha haven't done it for long time. Hence was attracted to Armaan. Flop x Flop = Hit , but didn't worked like all of his movies in real life","label":0},{"review":"Mind blowing movie that goes beyond the idea of reality or cinema. The critics of this movie fail to understand how revolutionary this movie was. The special effects, 4D Chess inspired plot and magnificent performances, particularly Sonu Nigam, make this a must watch.","label":0},{"review":"One of the best movie ever. I love it. But so confused why it's flop on box-office. It's has great action, Story, Music. Can't understand how it can flop on box-office.","label":0},{"review":"No.1 film I like it this movie so much and this movie Armaan Kohli was Very Intelligent and he hides in the wall. And he runs very good fast in the Sea water Armaan kohli is my favourite Actor.","label":0},{"review":"Me and my brother watched this on repeat for 14 times when it released on digital print. Why this movie never graced oscars is an indication of how rigged the awards are. Its 2019 and I can still watch this movie every weekend.","label":0},{"review":"I think so many incidences in this movie seem meaningless and funny. But it is fun to watch it every time. Don't think so much and just enjoy!","label":0},{"review":"Nice and underrated movie. \nIndian people will say it bad but behind the closed doors they love these movies.","label":0},{"review":"dis movie wz gewd \narmaan kohli puts liyonardo die kaphriko to sharum\nthe ghraphyks is 10 times bretter den kirrish 3\nsends bobs and vagene pls","label":0},{"review":"If this movie with the same plot would have been made in the Hollywood then priyanka would have loved it, shame on you. I don't know why peoples dislikes indian cinemas . but if the same story plot is fimed in Hollywood peoples appreciate that.","label":0},{"review":"This movie is awesome.story line is different and unprecedented from what was common in that time.its a must watch","label":0},{"review":"I really shocked when saw last comments on this movie which guys are post. This movie such a kind of joke. Do kaudi ki aukat nhi h.","label":0},{"review":"Nice movie , it's Good , I Don't  Konw why people don't like the movie. , In movie all things comedy , action , drama","label":0},{"review":"Wow such amazing stunts I don’t know what people find wrong in this movie","label":0},{"review":"i hate this movie. this MOVIE DON'T any work .jaani dushman is a bad movie.right now.","label":0},{"review":"I somewhere got the taste of terminator 2...Its a great movie though..","label":0},{"review":"Priyanka adhikary has gone mad .actors are very good in the movie like Akshay,Sunil Suny etc..","label":0},{"review":"Very Good Movie For Action and Entertainment Thanks For All Stars","label":0},{"review":"Omg. Even copying demands brain. Wth akshay doing in this film.","label":0},{"review":"Simply outstanding story ever made by Bollywood cinema","label":0},{"review":"Don't watch this movie.\nWatch Kanan & Biswa's Pretentious Movie Reviews instead.","label":0}]