[{"review":"Its one of the best movies to hav come out from bollywood n my most favourite till date ... amazing n excellent performance by salman khan which we dont often see.... its salmans best performance after tere naam...he has outstanding  screen presence in the movie ......akshay kumar has also played his part well.. music is awesome one cant believe that its an anu malik album....lots of similarities one can see with the legend ar rahman ....but anu malik has won the audiences with the songs..specia ...MORE","label":0},{"review":"Its one of the best movies to hav come out from bollywood n my most favourite till date ... amazing n excellent performance by salman khan which we dont often see.... its salmans best performance after tere naam...he has outstanding  screen presence in the movie ......akshay kumar has also played his part well.. music is awesome one cant believe that its an anu malik album....lots of similarities one can see with the legend ar rahman ....but anu malik has won the audiences with the songs..specially ajnabi shehar n humko maaloom n sau dard these three r the best in the albums....great direction by first timer shirish kunder ....n sajid nadiadwala is the best producer one can have ....its a big budget film from #NGE films.....a great musical treat for a family...*****star .","label":0},{"review":"I really love the movie, that remember  me those memories when l had seen sit together with my loveable SONIA. We had really got emotional when we had seen last part of the movie.\nOutstanding performance  by salman bhai and akshey bhai with emotional  touch in the movie so far, that entertaind the fans wolrdwide. I hope Sonia also remember me whenever she see that movie. i miss you dear. You're still my \nJaan-e- mann even after years and probably forever.\nI would like to say thanks for whole tea ...MORE","label":0},{"review":"I really love the movie, that remember  me those memories when l had seen sit together with my loveable SONIA. We had really got emotional when we had seen last part of the movie.\nOutstanding performance  by salman bhai and akshey bhai with emotional  touch in the movie so far, that entertaind the fans wolrdwide. I hope Sonia also remember me whenever she see that movie. i miss you dear. You're still my \nJaan-e- mann even after years and probably forever.\nI would like to say thanks for whole team of Jaan e mann that making a \nRemembrable story as well as music.","label":0},{"review":"Wow.................One of the most underrated movie of bollywood. \nOne of the best music album in  bollywood.\nAll 3 leads(Salman Khan Akshay Kumar And The most beautifull actress Preity Zinta)Have given the best performances. \nComedy level at its best\nNote: I haven't seen the last 50 minutes of this movie yet.","label":0},{"review":"Unique commercial movie with good story telling, entertainment and decent acting as well.\nChemistry between main leads are to be enjoyed. \nMusic is unbeatable. \nWish this movie a modern day release. \nImpact would be quite diffrent.","label":0},{"review":"A wonderful  and unique storytelling. The whole story unfolds as a comic strip portraying ups and down of a love story. No other Bollywood movie never adopted such storytelling.","label":0},{"review":"What a lovely movie 😘 start with a light comedy nd ends with a lot of emotions 💕Superb story👌👌 which keeps u busy all the time🙌soft Romance,light comedy,bunch of emotions, feelings.AMAZING👏👏👏👏","label":0},{"review":"Watch this movie recently on Voot (app) its my 2nd favorite indian musical drama film after jagga jasoos. Other Dance with songs in bollywood movie just sucks.","label":0},{"review":"The centre idea of the movie is awesome..\nAwesome story,songs ,acting and everything \nLoved it too much ..\nEspecially the songs..","label":0},{"review":"One of the good love story i have come across great performance by the actors.. and big salute to Anu Malik.. great songs","label":0},{"review":"Best movie till i have seen it first.\nBest acting of salman akshay.\nIt make me cry every time. . .","label":0},{"review":"Fab. Movie the story lines, songs, acting everything was perfect...Salman, Preity , Akshay do justice with their roles...Preity Zinta looking soo gorgeous 😍😍","label":0},{"review":"Movie is superb and unique feeling and all songs are heart touching no words to say about movie","label":0},{"review":"Excellent movie containing an emotional touch.....remembers me about sm1 special...fantastic music and playback..heart touching","label":0},{"review":"I love this movie....i can watch it n numbers of times wid same curiosity","label":0},{"review":"This movie is best forever  for me and also this is my first movie in theater","label":0},{"review":"This is fantastic movies \nI have no words to describe this movies \nLove this movie","label":0},{"review":"Akshay Kumar has just nailed it with his unique laughter ..too good film","label":0},{"review":"Excellent performance of Salman. I cried a lot seeing the film","label":0},{"review":"I really love this movie i watched movie in theater atlist 5 time.","label":0},{"review":"Amazing movie ... \nLot of love for Akshay and Salman❤️","label":0},{"review":"Most lovable romantic movie with wonderful playback songs.","label":0},{"review":"In the list of Must watch movie in Theatre which i missed...","label":0},{"review":"I luv this movie.... Specially the characters","label":0},{"review":"Love that story and comedy","label":0},{"review":"Lovely movie... one of my all-time favorites 🥰","label":0}]