[{"review":"Finally three conditions 1 horse riding 2 beating any one 3 going jail  fulfilled for eligibility of manhood of Rathod culture .Fantastic story line , well narration, beautiful soundtrack,  special musics, superb acting by all.Blowed my mind deeply.Fun-romance -tragedy enthrilled me. Nice entertaining movie by pr AAMIRKHAN SAAB and newcomer Abbas debutant. Rehman composed amazingly,  specially pappu can't ,kahin toh, kabhie kabhie . New talented lmran got chance by maamu jaan , impressed well  a ...MORE","label":0},{"review":"Finally three conditions 1 horse riding 2 beating any one 3 going jail  fulfilled for eligibility of manhood of Rathod culture .Fantastic story line , well narration, beautiful soundtrack,  special musics, superb acting by all.Blowed my mind deeply.Fun-romance -tragedy enthrilled me. Nice entertaining movie by pr AAMIRKHAN SAAB and newcomer Abbas debutant. Rehman composed amazingly,  specially pappu can't ,kahin toh, kabhie kabhie . New talented lmran got chance by maamu jaan , impressed well  as expected. \n   It's an iconic film  for new age groups.college  masti portraying  reminds past.Good instance of friendships. New couple Imran- Genelia  are good looking. Imran simple look -handsome- sweet talk .Genelia bubbly-cutelook-beauty eyes -smile-glittering teeth;they made for each other in it. The important person's real values determines only during the absence of  him/ her. Love is very natural like autoflowed fountains. It never flows by other's directions but only soul of person rules over.Friendship is not equal to love, those are totally different things. Look-talk-touch-hugg-kiss-rub may be the part of friendships  .None can determine but only the involved individual  (pairs) can suggest Is it love or friendship!!! Love is very pure, auto creates from inner heart and soul to opposite sex in case of heterosexual. Normal law of nature of all creatures of earth. \n\n   Herein,  In the beginning Aditi-joy were friend each other. Then gradually through unconscious to subconscious mind - they made a journey on the Love highway .still they were not convincing themselves as they were just beginners.slow and steady  they realized each other What feelings  r taking place air in the absence of someone; something disturbance  sure means it is the real symptom of Love my friends.. \n   Another point  ,choosing a perfect partner is very easy. First of all,  you suggest ownself, ask to self  what's ur real quality?  Instead of getting married to a wrong  person, it is too better to be single.Anyway  sushant is arrogant, selfish, narrow outlook,no sense of humour, temper.In his heart no space for friends have.so, that's why Aditi had to break up. One sided love  is nothing; Joy disappointed with Meghna .so unnatural relation is alws boaring discomfort, should be broken.Attraction towards each other  and then taste each other nature, finally True love exists... I 'll be thankfull for director Abbas tyrewala  ,  who did good job on screen with an unique movie JAANE TU... JAANE TU YAA JAANENA \" l watched  7 times only till today,  hope in next to... special role of Naseeruddin saab cooperated by mansoor saab (aamir's cousin)  . AAMIR SIR WON THE  HEART OF HIS CHACHA JAAN HAVING CHANCED HIS GRAND SON IMRAN AS DEBUTANT REMINDING MANSOOR'S QSQT .\n   Meanwhile my dearfriends watch it with full of enthusiasm curiosity  & take charm of sweetness. Let's enjoy. Have a good luck. 🖒🖒🖒💜🖎","label":0},{"review":"Milestone movie. One of my all time fav bollywood movie..Perfect character development, superb screenplay, exceptional acting and beautiful music which stand out even after 10yrs. Must watch..!!!\nIt's a shame that this movie is not mentioned among the greats of this genre coz I genuinely believe this is equal to the likes of DDLJ or Kuch Kuch hota hai..\nLove the way they have taken up a routine looking concept  and elevated to the next level. I can't remember a time where I enjoyed a love story  ...MORE","label":0},{"review":"Milestone movie. One of my all time fav bollywood movie..Perfect character development, superb screenplay, exceptional acting and beautiful music which stand out even after 10yrs. Must watch..!!!\nIt's a shame that this movie is not mentioned among the greats of this genre coz I genuinely believe this is equal to the likes of DDLJ or Kuch Kuch hota hai..\nLove the way they have taken up a routine looking concept  and elevated to the next level. I can't remember a time where I enjoyed a love story as much in the past decade since this one.\nIt fills your heart with unmatched joy and all credit goes to director for such a nice narration. Loved it..!!!","label":0},{"review":"Here is a review of the movie Jaane Tu... Ya Jaane Na (2008)\n\n                                                  'The exact amount of sweetness present'\n\nRatings: 4.5/5\n\nStory: Two best friends, Jai(Imran Khan) and Aditi(Genelia D'Souza) refuses what everybody think about them that they are more than just friends and that indeed try to find each other a perfect mate.\n\nWhat's Good: That the movie changes it's phase so believably. How it starts from a death and ends with reunion. The movie is unapp ...MORE","label":0},{"review":"Here is a review of the movie Jaane Tu... Ya Jaane Na (2008)\n\n                                                  'The exact amount of sweetness present'\n\nRatings: 4.5/5\n\nStory: Two best friends, Jai(Imran Khan) and Aditi(Genelia D'Souza) refuses what everybody think about them that they are more than just friends and that indeed try to find each other a perfect mate.\n\nWhat's Good: That the movie changes it's phase so believably. How it starts from a death and ends with reunion. The movie is unappreciable with words. Its just fun, romantic, it even made me let live a little nostalgia. Its just the best.\n\nWhat's Bad: Nothing's perfect. Not even this. But it is negligible. It is that it is so much silly sometimes(Which even makes you laugh more)\n\nLoo Break: None.\n\nReview: The movie's just sweet, simple and romantic, funny and dramatic. And with all these, the movie handles it just fine. \n\nSuggestion: Download it as you will need it to watch it again and again.\n\nTo Watch or Not To Watch: Watch it. I bet you'll love it.\n\n                                                                                                                                                A HASAN'S REVIEW","label":0},{"review":"A perfect story telling. Had everything i was looking for in a Rom-Com, and something i related to heavily. Being someone who also fell in love with his girl best friend. I remember i had gone to watch this movie 3 times in the hall. Had a blast. Mind blowing. *Paisa Vasool. Amazing music. And superb acting and directing. Loved the Background Score too!","label":0},{"review":"I don't like luv stories, but this film has become one of my favourite films ever. Really it has a very gud meaning and is a very thoughtful film. I hope the cast & crew would also hv enjoyed very much while shooting the film, and hope they wud recall the moments of this film every time the name comes. I really am crazy about this film, its a very nice movie. Thnx for making it!!!","label":0},{"review":"Wow great I have watched this film more than 10 times still going on..Brilliant casting hatsoff to A R Rahman for the music...This movies were we interest to watch again and again","label":0},{"review":"A classic tale of two bestfriends realizing that they can not live without each other. The  songs and its lyrics just add another level of beauty to the film. 4.5/5","label":0},{"review":"Awesome movie.....loved it,it also relates to me...awesome story...loved the end♥️🔥🔥watching the movie for the first tymm after 10 years of its release...one of my fav♥️must watch especially for teenagers....music is also great♥️","label":0},{"review":"This came out to be such a beautiful movie. All the cast membera are just perfect. So happy to have watched it!!","label":0},{"review":"My favorite  movie.  Even it's songs r good especially that \" kahi toh hogi woh\" n the last scene Wer Imran sings for genelia","label":0},{"review":"This movie was way ahead of its time. Friendship and love is portrayed very beautifully!! One of the greatest movies in this genre!!","label":0},{"review":"This romcom has its strength in its actors. You will forgot the plot but the friendship,the music & acts remain in your mind and will bring a smile on your face. Surely a must watch.","label":0},{"review":"Awesome movie. Storyline direction is amazing.  Airport climax scene was fabulous. Actors acting is too good . Comedy and romantic movie.  Nice movie. 😀😀👏👏","label":0},{"review":"I have many memories attached to this movie.❤️❤️\nLike some pain some happyness and I love the songs of this movie cause it's remind me my childhood","label":0},{"review":"Wow great movie ,loved it really.\nGreat acting by genelia & imran. One of the best love story...","label":0},{"review":"Basically I'm not a romantic film lover but after Watching this movie I feel so good. Soundtrack is too much good specially \"Kahin to\" song.","label":0},{"review":"This movie is what you called is made of a beautiful dream... One of the best youth and love story of all time","label":0},{"review":"It is an awesome movie .\nIt is a type of movie which could help you to remove your tension.\nPerfect acting,comedy ,music etc.....","label":0},{"review":"It's really an amazing movie. Loved acting of all the actors. Light -hearted and fantastic movie.","label":0},{"review":"Great coming of age college movie. Good cast and storyline. One of my favourites.","label":0},{"review":"I've always loved rom-coms with a hint of drama! this movie was all of that and so much more!!!!!!!!!!! FAVOURITE.","label":0},{"review":"This movie is better than most of Johar's love triangles​.it has all the elements of a good film","label":0},{"review":"Yes even I too loved it. And I love Genelia. \nShe is super cute😍","label":0},{"review":"It's lovely, if you like rom-com, you're gonna love it.\nAnd music is awesome .","label":0},{"review":"I love this movie  it's was amazing  Soo sweet love story and  grate comedy and it's songs was awesome  it's my favorite movie","label":0}]