[{"review":"I don't know but most scenes of this movie personally relates to my love story like 2002 and 2012. My memory still has stucked in 2002 when it was 2012, and i left her because of some accidents then i searched back her consistently for 10 yrs . Finally there comes a day I found her back in my life after a very long gap of 10yrs, all my dreams started coming true, I started flying in the sky but suddenly I was put back to the earth realizing my life is still same, she is still not completely mine ...MORE","label":0},{"review":"I don't know but most scenes of this movie personally relates to my love story like 2002 and 2012. My memory still has stucked in 2002 when it was 2012, and i left her because of some accidents then i searched back her consistently for 10 yrs . Finally there comes a day I found her back in my life after a very long gap of 10yrs, all my dreams started coming true, I started flying in the sky but suddenly I was put back to the earth realizing my life is still same, she is still not completely mine. Some other movies of Shahrukh like Darr again partially relates to my life.\nAny way this is one of the blockbuster movie of the shahrukh and superb  performance by both stars.Everyone must watch this movie at least once to know the real definition of love.","label":0},{"review":"A timeless saga, with explosive performances (literally bhai.. lol), the poetry is sublime and I like to think of it as the icing on the cake. It's my favourite film all three leading thespians. The music elegantly poised reminiscent of yesteryear whilst maintaining a modern vibe. 3 hours isn't enough  please make a part 2. I have no idea what it would be about!! One can always have dreams, Hope's and aspirations.. Thanks for the ups and downs guys..","label":0},{"review":"What did i just watch !? The romantic saga of lifetime starring SRK, Katrina kaif and Anushka Sharma. The lyrics of Gulzar sir, the music compostion by A.R. Rahman and the fine direction of late Yashraj Chopra ; when this trio working on a project you can not deny the possible outcome. This triangle lovestory is not an usual love story. This film will make you fall in love in *love*again. Every single dialogue will touch your heart. The best thing is there is no single intimacy scene in this mov ...MORE","label":0},{"review":"What did i just watch !? The romantic saga of lifetime starring SRK, Katrina kaif and Anushka Sharma. The lyrics of Gulzar sir, the music compostion by A.R. Rahman and the fine direction of late Yashraj Chopra ; when this trio working on a project you can not deny the possible outcome. This triangle lovestory is not an usual love story. This film will make you fall in love in *love*again. Every single dialogue will touch your heart. The best thing is there is no single intimacy scene in this movie beacuse who needs it when SRK can just do with his eyes. The whole story is based on 'BELIEF'. Belief in yourself, belief in your partner, and belief in your GOD. Your belief  can either make you or break you. If you have not watched this film yet my only advice will be just download amazon prime video and watch.","label":0},{"review":"12-year-old me at the time found this film to be ok.\nWhen I reached SRK’s character and Katrina’s ”lip lock” before Saans intro I was completely disappointed with how little acting was put in the cup tossing before diving into the kiss. It high key took away from the scene. However, I truly believe Katrina Kaif looked unbelievably breathtaking in JTHJ. Let's give credit to those behind her wardrobe, hair( electric leaf blower) &’makeup. Most importantly, her parents for producing such talent.","label":0},{"review":"I love this movie it is so full of yummy treats SRK as always phenomenal never fails to deliver a stunning performance. Katrina Kaif delivered a nice performance. But it was Anuska Sharma that stole the show she was awesome. Yash Choprah has done it once again delivered a masterpiece.","label":0},{"review":"I love every Yash Chopra movies. They always exists in my memory. It was very very very nice movie since it was the last movie of Yash Chopra sir.  My dream was to meet them but unfortunately it didn't came true which will always hurting me.  I love Shahrukh khan as he is my childhood actor.  I love Yash Raj films. I wanted to become an actor in my life but didn't work due to my age. But I will always love Yash Chopra sir and their movies.","label":0},{"review":"Definitely one of the best movies, or rather love story I've ever watched.... The emotions, the passion, the hatred(in the film not for the film😋), the love.... Enough to make somebody believe in love... Specially the scene where all out of the blue Meera( Katrina Kaif) tells Samar(SRK) that she loves her... Uff.... Just stole my heart away.... Felt like falling in love again.....","label":0},{"review":"Another masterpiece..... for Bollywood. A man's loneliness and emotions well caught on camera...and our srk enhancing the quality of the film.\nA great contribution to world film industry from our side..\nProud to see that film...","label":0},{"review":"I dont know what happens to me when I watched this movie everytime I feel something magical ✨✨ in this movie that music of rahman lyrics of gulzaar and directions of yash chopra and of course my fvrt srk and katrina magical couple just this is my fvrt movie of all time. I want srk and katrina to do another movie like this.💜❤💜❤💖💓💜❤💜❤💜❤💓","label":0},{"review":"Materpiece of Yash Chopra Ji 3 Legend Come Together Yashji Gulzaar and AR Rahman for Hevenly Musical Passionate Movie Addicted to Poem Jab Tak Hai Jaan by Aaditya Chopra and State of Art Locations and Acting of Shahrukh Khan Sir Its a Poetry on a Celluloid A Classic","label":0},{"review":"Amazing film! Combination of Romance, emotions & some comedy! The king of Romance is Shah rukh Khan. His performance is great & Anushaka Sharma also perform her role very good!!! Must watch this film of Srk!!!,","label":0},{"review":"i at first watched this movie when i was 12 but didn't understood much at that time but now again after 4 years i watched it and really found it very *** sorry can not express in words what i am feeling but just emotional. SRK i am your big fan and will remember you always","label":0},{"review":"I love the Andes Music like the Motorcycle Diaries .the. Chanrango Zampoña Bombo Quena what a mix of cultures love it great movie .Culturaly we do love like that white people don't.I thought the leads were Peruvian you have no idea .Very a like cultures","label":0},{"review":"Wonderful film. Love SRK.He's amazing as usual. Anushka Sharma has done a fabulous job.It's worth a watch for Anushka this time.","label":0},{"review":"Best movie! SRK! no words can describe your talent. This Movie has a MAGIC. Everytime I watch it seems new to me!\nSRK has delivered master piece!","label":0},{"review":"I love every movies which is specially directed by Yashji and acted by SRK.... It was the last movie of Yashji with King Khan...... I think it was a good film..... And the story is so much twisted and interesting......","label":0},{"review":"This movie is very dear to my heart. Words just can’t describe my love for this movie. Love and respect Yash Chopra Sir 🙏🏻","label":0},{"review":"Yash chopra makes every film as jab tak hai jaan I have watched it and I assure you guys you can take your girlfriends to watch this film randomly my personal opinion it \nIs very very good romantic film","label":0},{"review":"I have never watched such an amazing film. It is one of my favourite films and \nI  thank Cash Chopra and all the characters in this films.","label":0},{"review":"I don't know Hindi. But still I watched with English subtitles.\nI have watched several times, everytime I notice a new thing in the movie.\nAlso the scripts are great!\nHats off Yash Chopra.","label":0},{"review":"I'm a big fan of Shah Rukh n I don't miss any of his film. I die to watch his every film as many times it could be possible .I just want to say that I love you Shah Rukh 😘😘😘😘😘😘","label":0},{"review":"For this movie, I am always pretty emotional. After some time I watches this movie again n again.\n2nd look at the combination\nYash Chopra, Gulzar, A.R. Rahman, & Shahrukh Khan, full masterpiece.","label":0},{"review":"It is one of my favourite movie feel like watching it again and again . Srk Anushka and Katrina have done a great job","label":0},{"review":"The movie \"jab tak hai jaan\" is so best movie.\nI watch this movie 10times.\nI like this movie . then this movie songs are good but, the song \"jia jiare jiare jia...\" is my favourite song.thanks","label":0},{"review":"The movie has been my favourite since its releas,i just love its story,charecters,acting,songs everything!\nJust love the movie","label":0}]