[{"review":"A movie about a magical vessel which in Hindu mythology known as Akshayapatra. In this flick, two con women finds this magical vessel which on putting anything in it never finishes but gets entangled with series of problems as many goons are behind the sane vessel.\n\nThe plot does have quite an option to create lot of comic sequences but Jyothika and Revathy headlined this movie is boring to say the least. Both the actresses have essayed their role of con women to the T but the screenplay where i ...MORE","label":0},{"review":"A movie about a magical vessel which in Hindu mythology known as Akshayapatra. In this flick, two con women finds this magical vessel which on putting anything in it never finishes but gets entangled with series of problems as many goons are behind the sane vessel.\n\nThe plot does have quite an option to create lot of comic sequences but Jyothika and Revathy headlined this movie is boring to say the least. Both the actresses have essayed their role of con women to the T but the screenplay where it had faultered. Revathy is back again as Masha which she has acted in many other movies too. \n\nThis so called comedy movie doesn't make you chuckle rather put you in slumber. The producer of the movie is Suriya and it looks like he got this script and he very conveniently may be because of tight schedule passed on to his wife. I don't have problem with female stars getting centre stage but when they themselves starts acting like as if they have masculine power to hit 50 goons at a time looks to far fetched and not digestible. \n\nJyothika is trying hard to make her solid come back but sadly this again fall prey to poor screenplay, unnecessary songs, comedy which you can just look at the screen with blank face etc. In short, it is not the Jackpot you want to earn and may be your search must continue. #pranureviews","label":0},{"review":"Mindless slapstick movie with too many unnecessary and irritating Jothika stunts, in fact this film seems to have been made to showcase Jothika's stunts!  Nothing against her personally, I enjoyed Ratchasi where her stunts were thankfully limited and that movie had an endearing and excellent plot.\n\nJackpot's opening period scene held a lot of promise, alas it all fizzled out too soon with an uninteresting plot, lacklustre acting and as mentioned before, far too much action and stunts.  \n\nThe bes ...MORE","label":0},{"review":"Mindless slapstick movie with too many unnecessary and irritating Jothika stunts, in fact this film seems to have been made to showcase Jothika's stunts!  Nothing against her personally, I enjoyed Ratchasi where her stunts were thankfully limited and that movie had an endearing and excellent plot.\n\nJackpot's opening period scene held a lot of promise, alas it all fizzled out too soon with an uninteresting plot, lacklustre acting and as mentioned before, far too much action and stunts.  \n\nThe best actor in the movie was Pinky the Kangayam Bull !!!!","label":0},{"review":"First 10 Minutes was interesting and rest movie is worse except Yogibabu, Rajendran and Anandaraj. When ever villans and Jyotika met then a lengthy fight scenes comes which will make you to get irritation. I watched it in Telugu. The director has taken good point. But did nothing with that point. Background score resembles Maari movie exactly.. Unwanted songs and fights in between. Instead of that they should have concentrated on story.","label":0},{"review":"A likeable cast, brisk narration and a fantasy tinged plot makes up for lack of cohesiveness and logic. Of particular note are the way scattered characters and threads are tied up and especially yogi babu who is deprecated a lot and yet ends up making the most impact.\nYou might enjoy the ride while it lasts, but feel that the time spent on this as a waste later on.","label":0},{"review":"Watch out for some truly hilarious scenes. Anand raj's brilliant performance in a double role. The film has no plot but just random comedy scenes which works as a time pass.....yogi babu body shaming gets bit too much and neverending","label":0},{"review":"i personally feel both the women must have maintained some professionalism in acting. I lost my opinion on both of them. I was so happy on jothika because of her acting in ratchasi. now I'm totally heartbroken after seeing this movie. the artists must remember that the public will take the good and bad given by the artist based on the way they do it.","label":0},{"review":"Pure entertaining and full action drama comedy movie with no big logic but fun. You can go along with your family and have fun. Each n every character did justice. Just loved the movie till the end. Pure fun 👌👍","label":0},{"review":"Absolutely family entertaining movie.. Great fun to watch so many popular characters on screen.. Fun filled comedy time spent watching this movie!!! Joe seen as action shero! Mass stunt scenes by Joe! Must watch guys..! 4.5/5","label":0},{"review":"One of the best women centric action comedy drama to watch with your family members and friends. Jothika in fire.. Revathy Maam did a wonderful job. Kudos to Director Kalyan..","label":0},{"review":"First half:\nThe movie is an undramatic sketch, that makes no impact. Good cinematography, but terrible editing combined with an uninteresting plot making it a standout failure. The two lead roles do try to make up with a few interesting if not completely relevant scenes, with some mild humor and comic. The story in itself is vaguely divided,  and hence is ineffective.","label":0},{"review":"Very good movie after so long time nice entertainment which I felt and laughed n theatre. cinema s for relaxation not for a message r thought I enjoyed so much.  Hats off","label":0},{"review":"Good movie to watch,, u will laugh in the 1st half and forget all u r tension.. 2nd also is good. Anandraj especially has done a good job.","label":0},{"review":"This is a real fantasy movie. You should enjoy the movie and forget about it as soon as you come out of the theatre. I am a crazy fan of Jyothika and I dont miss any of her movie.","label":0},{"review":"After seeing Jyotika in very good movies, I wonder of late, what happened to her choice of roles. This role is definitely not meant for Revathi too. Total waste of time.","label":0},{"review":"Expected a lot of comedy but just an average.Few scenes were good and there were many unneeded scenes, most of the scenes could be cut from the movie.There is nothing to watch for 2 and half hrs.\n\nBottom line = If you need to watch then watch it @ your own risk!!!","label":0},{"review":"This movie wasn't a great one but it is watchable for one time and doesn't have a strong storyline but kids will love this movie for sure as it is filled with comedy","label":0},{"review":"So entertaining and well scripted . Must watch movie to relieve our stress. We really enjoyed the movie.","label":0},{"review":"Yeah perfect cinematography, would love to see more animation, the drama was authentic still need to improve, being a director by professional, I would suggest    3.5/ 5.0 .","label":0},{"review":"Excellent movie, I loved it lot.. each & each scene was brilliant & entertaining..enjoy with your family, jothika & revathi nice pair & Yogi Babu..too the whole team..","label":0},{"review":"One of wrost movie ever seen, bad acting, jothika irritating and that old lady too. Simply l have wasted money, villans acting is good but Joo soooooooooo.","label":0},{"review":"Starts watching movie with out reading reviews..Total paisa vasool\nReal masala movie..\nEnjoy don't expect to much..have fun","label":0},{"review":"Bad movie.. Over acting by Jothika. Luckily I din't go to watch this in the theater. Watched it on Amazon prime.","label":0},{"review":"This movie is really terrible. Such a good plot spoiled by nonsense comedy and bad scripting. One of the worst Tamil movie in the recent times","label":0},{"review":"AnandRaj and Yogi Babu comedy carried the film and without them the movie would have been an utter flop. Jo overacting can be avoided","label":0},{"review":"Full and full entertaining..\nEach and every scene makes you laugh.. u can watch whole movie with out boring.","label":0}]