[{"review":"Movie is very amazing i saw ds movie after 10 years 1st time. Heart touching story. Every person needs to watch this . Neil nitin mukesh emotion just fab. There is no words. Bt sadly movie is nt gng so far and its collection bt Neil Nitin acts very well. Keep it bro nd i must want to see you soon on Bywood again.","label":0},{"review":"Its a very great movie and its a must watch movie for all of us. Feeling very sad to read about its box office collection. And the acting of Niel Nitin Mukesh is heart touching. While watching this movie many times a thought is coming that it can happen with anyone. In that situation what we will do.","label":0},{"review":"Awesome movie...superb acting by niel. I dont why indian audience rejects such kind of master piece creation.\nA must watch movie. And last but not least. Monoj sir you are great actor as always.","label":0},{"review":"Excellent thought provocating movie, justice delayed is justice denied.... JUDICIARY MUST DEMONSTRATE ITS PRESENCE TIMELY considering so many in jails waiting for Delivery of Verdict... Acting by Neil Nitin Mukesh & by Manoj Bajpai is very Good....","label":0},{"review":"It was a very emotional Movie And we can know from the film what is the situation of the Jails in our country.And Neil Nitin Mukesh did amazing acting he is a great actor","label":0},{"review":"Very heart touching film. People may know how criminals created in Jail. In India all get justice but after several years, in between accused becomes criminal.","label":0},{"review":"this is one of the best movie with a message in Indian cinema. acting by all the actors are fabulous. this is must see movie.","label":0},{"review":"10 out of 10 . The Harsh Reality of our judicial system and 100% authentic story on the situation's behind the bar. This system is very disappointed ☹️.","label":0},{"review":"Emotions and sentiments at its very best in a bollywood movie. One of the \"MUST SEE\" movie for everyone , for at least one time...!!!!   👍👍👍","label":0},{"review":"It's an amazing must watch movie.touched my soul .great movie and great acting by Neil nitin Mukesh.","label":0},{"review":"fantastic acting of Neil Nitin Mukesh. The audience gets involved in his role. The last court scene when acquitted really made me emotional.","label":0},{"review":"I think it can teach you a lots of things and the special one is the taste of freedom,the joy of being free!!!!","label":0},{"review":"Great movie that desires\nFor every case we have to post a well experienced lawyer","label":0},{"review":"Beautiful movie with a noble message. The quintessential Madhur Bhandarkar stamp makes it breath.","label":0},{"review":"The movie is just simply driven by the emotions carried by the protagonist and Manoj Bajpayee Sir .. superb movie by Madhur Bhandarkar.","label":0},{"review":"Awesome movie brilliant work done by Neil Nitin Mukesh and Manoj Vajpyee","label":0},{"review":"Nice topic taken from society and good social message for each and every individual...","label":0},{"review":"Best movie.great story amomg Manoj Bajpai and Neil .","label":0},{"review":"Every nice song and movie I love this movie","label":0},{"review":"This movie is beautiful and heart touching.","label":0},{"review":"Awesome movie touch my heart","label":0},{"review":"I think if am the hero of this movie these movie goes so far better","label":0},{"review":"A very well made film..must watch","label":0},{"review":"Very nice movie, vindicating....\"Cinema is the mirror of the society.\"","label":0},{"review":"awesome movie","label":0}]