[{"review":"One of the Best tooooo good really stupendous movie, no matter how many times it has been telecasted on TV but its HARD to miss watching it really tooo good... Javed, Gulshanji as well as all played well and ANIMATION WOW no comparison.","label":0},{"review":"I loved this movie a lot..!!.. This was best amongst all the other movies of olden times💯😘 cheers for this film ✌❤","label":0},{"review":"Watched this when I was in Class 3. I still remember the Gumsum Gumsum Hai Kyun Aajkal song. Hahaha. Good old childhood movie.","label":0},{"review":"Its a beautiful movie. Technologically it may not be very awesome, but a superb portrayal.","label":0},{"review":"Nice movie and editing is amazing if we think of it made in early 2000s.","label":0},{"review":"Its a good integration of guliver travel and bakasur in 2000s era with good editing and lovely story.","label":0},{"review":"I loved this movie no matter how many times i watched it😍😍","label":0},{"review":"This film is like Gulliver's traveller . But I like this Movie very much","label":0},{"review":"One of the Best Childhood movie of every children from 2000s","label":0},{"review":"This movie like a Hollywood movie.\nAnimation character visual effects all are awesome.....","label":0},{"review":"I read this chapter  in my English book about Gulliver's  travels.  Our mam said about Jajantarm mamantaram","label":0},{"review":"We had gone to theatre to see this movie.  Single screen theatre. Balcony ticket :D","label":0},{"review":"I just love the acting of Javed sir","label":0},{"review":"Entertaining","label":0},{"review":"It is a awesome movie","label":0},{"review":"I missed my childhood with this movie 😘","label":0},{"review":"Similar as of Gulliver travells nice movie..","label":0},{"review":"Great movie","label":0},{"review":"I love this movie","label":0},{"review":"My childhood favourite movie","label":0},{"review":"This is good film","label":0},{"review":"Nice movie for children","label":0},{"review":"Love this movie","label":0},{"review":"Loved it too much","label":0},{"review":"I loved this movie 😍","label":0}]