[{"review":"My Review (22th Movies Review):\n\nVerdict - Average\nStoryline - The main plot for this movie is quiet complicating in the beginning because it tells you the history of wars in Hindustan and it does not always make it easier to understand these facts, this also include panipat, however in Hindustan, there is new king who is child, however he refused to chop someone head, who is against the king because he want to take over this country, however when he was an child, he always listen to other peopl ...MORE","label":0},{"review":"My Review (22th Movies Review):\n\nVerdict - Average\nStoryline - The main plot for this movie is quiet complicating in the beginning because it tells you the history of wars in Hindustan and it does not always make it easier to understand these facts, this also include panipat, however in Hindustan, there is new king who is child, however he refused to chop someone head, who is against the king because he want to take over this country, however when he was an child, he always listen to other people commands of what to do in order to be an real Mughal in Hindustan, however this movie also tells you that another place in Hindustan, there is young girl living there, they also have an king in this place, but she also has an cousin who lives there where he maybe the future king in this place, but when they grown up which is played by aishwarya rai and sonu sood, as sonu sood has been told from this place that he won't be future king whereas he left this place in order to do something which is quiet confusing of what he does, however fo aishwarya rai, she treat him as a brother and he is the one who told her about fighting skills using swords, however soon harithik roshan asked all other lands that he is the main leader and others should follow his rules, but some lands has refused his demand, but we are not sure of what they are doing, because it is confusing, however soon where aishwarya rai live, her father asked harithik roshan who is the Mughal or king for marriage for both pairs, so that they stop the war, but they agreed in term of condition because harithik is muslim and she is hindu whereas she want to still follow her religious, soon she moved to his house and then, when you watch this movie, you will see lots of situation for this movie like harithik roshan need to be an real Mughal and protect the land because there is thief in the land, also he avoided the tax pays of which they need to pay for primilage, also he did not got closer to aishwariya rai even-tough they are married, but other land still tried to complain about their marriage because they are different religious, however there is one land, as harithik roshan brother in land is against him because he want to take over delhi, or maybe whole of the land in Hindustan, but he asked sonu sood for help if I say in this way, however this movie also had more problems because harithik roshan also had problem with this family like brother who is against him, also oneday the family of Mughal find out that aishwariya rai had took poison with her when she got married and an letter that she want to marry another person in her family and brother ask before she actually got married to harithik roshan, this is how it lead to breakup between both pairs, however soon, he got her back because he find out that she changed her mind after she written the letter, however soon, the conflict of this war got worser because other land are against him, but before an big war happen, both pairs had made love for each other and they are in true love for each, soon harithik roshan got shot, this happens the day, he made the land proud of this Mughal because he got rid of tax and people who are against him want him death and they want to take over, but they are bad people, but harithik roshan survived and soon his group foughted against his army, but sonu sood got killed before this happens, however this fought was different because who wins between harithik roshan and the villain will take over the throne instead of whole group fighting, but harithik roshan wins and at the end, he is back as an Mughal with this wife and tells everyone to treat equally if I say in this way.\nSongs - The Songs were not great, but they are okay for this moive.\nChemistry/Performance - The chemistry between both pairs are amazing and both of them did good for this movie, but others were okay for this movie.\nType of Movie - Historical, less action and bit of romance.","label":0},{"review":"I strongly recommend this movie. It is 3 hours plus long but very worth while. I was never a fan of caption made movies and I did need to watch it a couple of times to get the gist of the story written in history or not it is certainly a beautiful love story. I was never interested in Bollywood movies I am so happy that I did watch it in its entirety. Huge thumbs up for Hrithik Roshan who played his part well, it was almost like the part was made for him. He played it with such passion and oh... ...MORE","label":0},{"review":"I strongly recommend this movie. It is 3 hours plus long but very worth while. I was never a fan of caption made movies and I did need to watch it a couple of times to get the gist of the story written in history or not it is certainly a beautiful love story. I was never interested in Bollywood movies I am so happy that I did watch it in its entirety. Huge thumbs up for Hrithik Roshan who played his part well, it was almost like the part was made for him. He played it with such passion and oh.... that voice with so much strength and command in some parts. What a passionate, caring, understanding and kind man Akbar must have been. Aishwarya Rai Bachchan also played her part well, such innocence. This movie gave me an insight in to Indian history, religion, customs, and tradition. It made me learn more about Islam and the Muslim faith so beautiful. I live in a beautiful little country call New Zealand. Thank goodness for Netflix I was able to watch Jodha Akbar and Bahubali another excellent movie.","label":0},{"review":"Woooo! One of my fav movie of all time. Can't take my eyes off from hrithik roshan playing Akbar , what a voice modulation done by him , body language and his killer looks are the USP of the movie . Aish splended me in the role of jodha bai , she looked beautiful with hrithik roshan in every frame. The scene in which akbar encounters with jodha face to face for the first time has just stole my heart. Also all the romantic scenes are damn good especially the #sword fight 😶scene btw jodha and akb ...MORE","label":0},{"review":"Woooo! One of my fav movie of all time. Can't take my eyes off from hrithik roshan playing Akbar , what a voice modulation done by him , body language and his killer looks are the USP of the movie . Aish splended me in the role of jodha bai , she looked beautiful with hrithik roshan in every frame. The scene in which akbar encounters with jodha face to face for the first time has just stole my heart. Also all the romantic scenes are damn good especially the #sword fight 😶scene btw jodha and akbar was reaaaaally ausumn . The movie is worth seeing. The sizzling chemistry shared by hrithik and aish is truly mesmerizing. In all # hrithik's looks and heart stolen performance is damn great .strongly recommended.","label":0},{"review":"This is the most beautiful movie I have ever seen in my life! It is so heartwarming and brings tears to one's eyes. The chemistry between Aishwarya and Hrithik too, is of utmost beauty. The sincerity and innocence in the love that Akbar and Jodha  have for each other has been depicted so wonderfully. Every Indian must for sure, watch this movie.","label":0},{"review":"This movie is really good. It can be seen with family. It tells about how can a true love can break all the barriers of fight, hate, religion misunderstanding, etc. There is no reason of killing someone from whom you have win. After watching  this you will feel charm and relaxed. I will recommend everyone to please do see this film . And the songs are asome.","label":0},{"review":"A nice movie seen by me today. Really after watching the great performance by ritik roshan ,now I have become his fan,what a sizzling performance👏. well dont get nervous by seeing the length of the movie(3:30), believe me u will never get tired.jodha akbar is an epic love story and if you are a romantic genre person thwn this movie is for you .❤❤❤❤❤","label":0},{"review":"All love stories are not meant to be broken. The movie takes us to a soujorn where there were so many political reasons to disobey your heart but mutual respect care and the way to woo a fearless and warrior Rajput princess (jodha) describes the love story between the two.There heart, pure soul and within their consiuness it's a legendary love story that remains in the heart of the viewers forever. They surmount all the political obsession and barriers and futile rituals which were like an obsta ...MORE","label":0},{"review":"All love stories are not meant to be broken. The movie takes us to a soujorn where there were so many political reasons to disobey your heart but mutual respect care and the way to woo a fearless and warrior Rajput princess (jodha) describes the love story between the two.There heart, pure soul and within their consiuness it's a legendary love story that remains in the heart of the viewers forever. They surmount all the political obsession and barriers and futile rituals which were like an obstacle between them. 👏👏👏👏","label":0},{"review":"This movie is really good. It is seen with the family. It can tell about how true love can break all obstacles of war, hatred, misunderstanding of religion, etc. There is no reason to kill someone whom you have won. After watching this you will feel charming and comfortable. I would recommend this to everyone, please see this film. And the songs are infinite.","label":0},{"review":"Jodhaa akbar is one of my most favourite movie . Storyline and dorection was too good. Hrithiks acting was supreb when he was playing the roel of akbar it was truely amazing. And aishwarias rais acting was awesome too. Songs coreography were too good. I have seen this movie 100 times.","label":0},{"review":"It was an epic romantic historic movie. My personal favourite filim jodha akbar. The chemistry between aiswarya rai and hrithik roshan is awesome. Its work very well.... I saw this movie more than 20 times...","label":0},{"review":"Excellent screenplay, beautifully describes the love between Jodha and Akbar. Heart melting BGM by ARR adds another dimension. I am watching it in 2019 still I fall in love with the movie. It is one of the cult movie. Spell bounded...","label":0},{"review":"After watching this movie I salute to Bollywood. I sure this 3 and half hour movie never bore me at any moment.This movie is fabulous and Hrithik and Aishwarya look like real jodha Akbar and absolutely all character acting was absolutely fantastic.Great movie \nIf you didn't watch you really Miss a great historical movie","label":0},{"review":"I am travelling to Rajasthan and adore Bollywood movies, I wanted to see this movie because of where it was filmed.  And of course the very handsome Hritik Roshan :)  I enjoyed the movie, the colours, the story and the history..    loved it","label":0},{"review":"One of my all time favourite movies.  Strongly recommend watching it.  The chemistry between the two lead actors is amazing.  So yourself a favour, watch this movie!!!!","label":0},{"review":"Great movie what a acts played by hritik roshan as ashwaria rai i mean that is awsome but this movie become more good if we add some more life of akbar and the song is awesome","label":0},{"review":"The musical works are very good. The story revolves around \"Jodha\" and her interactions with Akbar. This is not a work on the life of Akbar who was one of the greatest emperors of India.\n\nHence, his life and characteristics are halfly portrayed.","label":0},{"review":"Great movie,great acting by all the actors.This the true love not those of Heer-Ranjha or that of Romeo- Juliet.Great movie just couldn't move my eyes even once from the movie.Just love Hritik Roshan and Aishwarya Rai","label":0},{"review":"This is one of my favorite movie and awesome to see this film. The song kwaja mere kwaja is a better song to have a better mind. I also hear this song at all time that feels disturb from others.","label":0},{"review":"This movie will always have my heart. Movies will come and movies will go but Jodhaa Akbar will never bore you even if you watch it 10000 times. A must watch for everyone.","label":0},{"review":"I loved this movie even thou is 3 hours but the beauty, the nature, the colors, the romance is worthy to watch it. You don’t care about the time. Strongly recommended","label":0},{"review":"This movie is love. No matter how much I do watch it I never falling for Akbar and of course the mesmerizing beauty Jodhaa Bai","label":0},{"review":"i luv dis movie hrithik & aish too gud pair . akbar and jodha really superb romance bw them was also nice 100% i like dis movie","label":0},{"review":"Brilliant art by the director and a perfect star cast. For 3 hours make you feel you are in the Akbar Era.. kudoos to this movie.","label":0},{"review":"This is The Best Historical Movie of Indian Cinema. Legendary performance by Mr Hrithik Roshan and Director Mr Gowariker's Finest work.","label":0},{"review":"An Outstanding Epic movie! Best historical movie of the Indian cinema🎬..& legendary performance of Hrithik Roshan and Aishwarya Rai📽️","label":0}]