[{"review":"Exceptional thriller.. I had watched this when it released but re watching it even today and still it holds its own. If it had A cast then would have been an easy 1000 CR at blockbuster. So many layered story..Simple robbery gone wrong and how things go for a toss.\nLoved it.. It has a few flaws but still it is a must watch and nice climax as well..Absolute ride of a movie.","label":0},{"review":"It's one of the best thriller movies made in lndia. What a film, what a direction, simply wow. It is directed in a unique way and the performances are top notch. After watching this movie l stopped watching any of regular Bollywood masala films. And l was drawn to more of these types of dark films internationally, such was impact of this film, truly amazing.","label":0},{"review":"Oldschool type but very classy and pretty much thriller based movie. Not a single booring minute. Full of suspense. Acting ability could have been better. Must watch movie who likes suspense with a mix of thriller touch. Thanq for such a great movie once again Bollywood.","label":0},{"review":"Everything about this movie is so much more that you want to go on and on...\nOne of the best thriller movie made in India with throbbing music and taut direction by Shriram Raghavan.. stellar star cast and anti hero debut by Neil Nitin Mukesh makes this a must watch for a true movie connoisseur.","label":0},{"review":"Just now saw the movie on Star Gold Select and what a film,right from the beginning till end.Every second ,every frame awesome.Excellant direction,acting, editing and screen play-Hats off to Sriram Raghavan for this spell binding spectate.He very rightly and truthfully acknowledged James Hadely Chase\n and Vijay Anand.","label":0},{"review":"Very fantastic movie one of my best movie I watched in my Life all characters are acted natural no overacting very great Raghavan sir please keep it on by making these types of film","label":0},{"review":"It's a great thriller and the suspense kepps you gripped throughout.. However I wasnot satisfied witht the ending.. great built up to the climax.. just to fall short in the last minute.... still a must watch... you'll probably enjoy this...","label":0},{"review":"the suspense & thrill of this movie is retained till the end of the movie, one after another twists makes the best movie in this genre. truely the story i loved it","label":0},{"review":"Ah ! This movie, it reminds me of the good old days . . . . . . It was a time when movies with plot that was astray when accorded with mainstream had just begun gaining ground.","label":0},{"review":"Great thriller , gripping storyline , brilliant direction n superb acting!  Incredible!  The very best in the genre !","label":0},{"review":"Wonderful masterpiece movie which was full of suspense!!! One of the best thriller film ever made in bollywood.","label":0},{"review":"this is one of the most underrated hindi film.. wht a suspense,the plot is simple awsome..  the whole cast did an outstanding job..","label":0},{"review":"Good movie....if it released recently it would have been a big hit with online publicity. Like u tube and public reviews.","label":0},{"review":"Brilliant  Attempt of Filmaking.. A Classy work...\nGripping Screenplay.Powerful visuals. \n\nRating :- 4.8/5.","label":0},{"review":"A world class thriller movie. Equipped story with so much unpredictable layers. \nNice cinema","label":0},{"review":"Gripping and suspenseful the film takes you through a ride of thrill and amazing plot twists.","label":0},{"review":"I had no idea about the movie in terms of story but after watching it i just felt that why didn't i see this movie before brilliant execution of the story and the twists keeps you on the edge","label":0},{"review":"It is one of the best thriller....great potrayal of James Hadley work..big fan of his writing.","label":0},{"review":"this is awesome movie must watch. remember \"dont forget the beginning & dont reveal the end\"","label":0},{"review":"This is must watch 🎥 every one watch this movie thrilled suspense","label":0},{"review":"One of the best movie and outstanding climax...Loved this type of movie👌👌👌🙌💕😘","label":0},{"review":"If you are looking for grestest thriller. This is the movie. Johnygaddar. No. 1 place. 2. Andhadhun.","label":0},{"review":"This film is a total surprise package. \nStylish, gives a satisfying watch","label":0},{"review":"It's just like a Chase novel. It will keep you hooked till the end. And the end will shock you.","label":0},{"review":"One of the worst movie. I have ever experienced","label":0}]