[{"review":"Can't stop myself from talking about this one......#no_spoilers\n\nDark as hell, Joker takes u through the disturbing journey of Arthur Fleck, from being a clown & a wanna be stand- up comedian (with only one joke in his hand.....his life) to become THE \"JOKER\"......this journey never looked unreal though, unlike that of a hulk or a spider man....as this journey was quite human, logical and beautifully graphed and captured(of course) !!!\n\nHeath Ledger from the 'Dark Knight' was my personal favouri ...MORE","label":0},{"review":"Can't stop myself from talking about this one......#no_spoilers\n\nDark as hell, Joker takes u through the disturbing journey of Arthur Fleck, from being a clown & a wanna be stand- up comedian (with only one joke in his hand.....his life) to become THE \"JOKER\"......this journey never looked unreal though, unlike that of a hulk or a spider man....as this journey was quite human, logical and beautifully graphed and captured(of course) !!!\n\nHeath Ledger from the 'Dark Knight' was my personal favourite joker till date & Joaquin Phoenix took the legacy of Heath to another level altogether.....that laugh, that dance, that sprint, that walk....uff....can't get over that !!!\n\nTalking about the other aspects of the movie....the background music was the soul of the movie, if not the psyche and the madness of joker itself,,,,,the cinematography, the supporting cast, the direction...everything thing was right on money , the movie very smartly dealt with the then situation of America (the Gotham city),,,,,the unemployment, the raising power in the hands of the rich....all it took was a stand and a voice (be it good or bad) against the established power to become the 'HERO'...which further became the reason of the rise in murders & crime in the city !!!\n\nIn his small appearance, the legend Robert De Niro was exceptionally awesome, something that u would expect from him everytime u see him on the screen.....that small conversation at the end btwn joker and De Niro was cinematic beauty and looked damn organic....an absolute treat to watch !!!\n\nDon't know about the oscars, but it was once in the lifetime performance by Joaquin Phoenix....and would remain in my heart for years & in my brain for days to come,,,may be.....The best portrayal of a psycho character that i have seen...was that of Christian Bale in 'American Psycho'.....Phoenix was right up there too if not above, not only the craziness, disturbance and madness but also the physical transformation was quite commendable.\n\n!! IF HEATH HAS GIVEN HIS LIFE FOR THE JOKER THEN I WOULD SAY PHOENIX HAS GIVEN A LIFE TO THE JOKER !!\n\nMy one of the favourite lines from the movie was...joker saying to himself,,,\"I used to think that my life is a TRAGEDY but now i realise that it is nothing but COMEDY\"....so, u can imagine how disturbing a movie could be with it's theme being 'TRAGEDY=COMEDY'...but it was not that disturbing for me as i am used to of or aware of the ongoing social-political structure of our country !!!\n\nIt has got those 'Dark Knight' (arguably one of the finest superhero movie ever made) vibes...i had an emotional ride, watching small Bruce Wane (Nolan's batman) meeting Joker, getting to know the pre batman story of the Gotham city and the back story or the building-up of the 'Joker the villain' of dark night.....IT WAS QUITE NOSTALGIC FOR ME IN THAT WAY !!!\n\nIf i would have maximum of 5 stars to give to this movie, i would have simply divided it by zero (0).....i write about movies all the time but this one has that 'something' that forced me to type and share my views with u guys instead of writing it in my diary.....on that note i would like to finish this review with one line....\"THIS IS THE BEST MOVIE IN LAST SEVERAL YEARS THAT I SAW....& U CAN'T CAN'T CAN'T MISS IT\" !!!\n\n#JOKER_2019❤❤\n\n'ALL IT TAKES IS ONE BAD DAY'-JOKER😉😛😂","label":0},{"review":"Had to watch this movie a second time before I wanted to put up a review. And as I thought, I enjoyed the movie a second time more than the first. We all know this, but it’s a very artistic film, and such a fresh take on the iconic clown prince of crime that we all know and love. This movie is probably the most realistic comic book film I have seen to this day, which was an instant plus point in my eyes. First off, hats off to Joaquin Phoenix to portraying this complex character very well, it’s  ...MORE","label":0},{"review":"Had to watch this movie a second time before I wanted to put up a review. And as I thought, I enjoyed the movie a second time more than the first. We all know this, but it’s a very artistic film, and such a fresh take on the iconic clown prince of crime that we all know and love. This movie is probably the most realistic comic book film I have seen to this day, which was an instant plus point in my eyes. First off, hats off to Joaquin Phoenix to portraying this complex character very well, it’s great to see how much of depth he took the character to, and not to forget, he nails the iconic Joker laugh so well, which plays a major role to the character. It’s not easy deciding if he or Heath Ledger was a better Joker, because both versions are entirely different with completely different back stories. And that brings me to my next point, the direction that Todd Phillips took this character to, in terms of character origin, even though it may not be comic accurate, it was executed very well. It first appeared to be a big risk that was being taken but it turned out to be a success, it is great to see something entirely different, while managing to maintain the basic foundation of Joker’s character. The cinematography is another reason that makes this film worth watching, watching this movie a second time amazed me to see the countless number of unique and artistic shots that this film consists of, whether you are a DC fan, or a comic book fan in general, or even part of the audience who has never even heard of Joker, you will enjoy the film because of it’s unique cinematography alone, believe it or not, I actually took screenshots of many shots from the film for absolutely no reason, but was a lot of fun. The score is another strong element to the film, the score adds a depth of intensity to every scene of the film and sends chills down your spine, and that is what we need to expect from a movie based on one of the most dangerous villains ever. The plot is very captivating, powerful , mature and thought provoking, that leave audiences in the edge of their seat. One thing that amazes me to this day is how the movie added a touch of the real world and proves such a man can indeed be created by society. I do not love drama movies to such an extent, but definitely do not dislike them, and indeed this film, in my opinion is a MASTERPIECE. Give this movie a watch. Worth your time and I hope this review is helpful.","label":0},{"review":"Hands down one of the most compellingly beautiful & most intricately crafted movies!! They  say the Phoenix rises from its own ashes--Joaquin does just that --what a flight he takes!! He evokes pathos in the most terrifying way! It is a spellbinding performance that will  remain etched in gold in movie history. The joker laugh, his walk, his dance, his antics, & then his eyes--all make you wonder why an incredible actor like him keeps such low profile. He lets his work speaks & how!! \"\nDon't com ...MORE","label":0},{"review":"Hands down one of the most compellingly beautiful & most intricately crafted movies!! They  say the Phoenix rises from its own ashes--Joaquin does just that --what a flight he takes!! He evokes pathos in the most terrifying way! It is a spellbinding performance that will  remain etched in gold in movie history. The joker laugh, his walk, his dance, his antics, & then his eyes--all make you wonder why an incredible actor like him keeps such low profile. He lets his work speaks & how!! \"\nDon't compare this with Heath ledger-he played the Joker\";Joaquin is Arthur Fleck and his subsequent metamorphosis into the Joker! Both supremely captivating acts!\nFor those self appointed critics who call it depressing & condemn the violence--there is more happening in real world countries. There is nothing  in this movie that has not been already shown on the big screen before-calling it disturbing and encouraging crime is such a biased take or are you so weak that a movie like this makes you take up crime?? what a \"Joke\"!!. So many movies  in the past showing violence,gore, child abuse, sex ,etc have already won critics approval ! No critic is talking about  why Arty was like that & what provoked him to become the numero uno villain in comic world. The child abuse, being played by his mother, beaten by the boys in the alley, the men on the metro ruthlessly bashing him, his co worker making him the fall guy, getting fired & of course being mocked so heartlessly by the \"suave\" Murray!! If these critics go through similar situation in life--will they still remain the same people ...will they not snap?What makes them think they are good enough to judge a person who had mental illness and was pushed to dark side by ill treatment at every step of his downtrodden life??\nThat said..Now does Joaquin deserves Oscar?--of course he does-unless the Academy awards authorities are still childish enough to hold a grudge against Phoenix for having called against them in the past! They already snubbed this great actor thrice--Gladiator? Walk the Line? The Master? Grow up jury!\nAll I can say is please don't read any reviews by  these paid critics-go, watch and decide for yourself. This is master acting -fit enough to be used as a reference in acting schools. But  then again you need to have a little knowledge about Batman ,Gotham city & Arkham to get into it right away! Being a clown is not easy..it is infact a cruel facade & this was shown in the movie -the endless tribulations & humiliations Arty goes through just to keep a job he truly loves before his descent into darkness.\n An Enthrallingly haunting film with stunning cinematography & an \"All Stars\" performance from the spectacular Mr. Phoenix who really rises above all!!\nDC..please give us another enigmatic movie on the Riddler...Mr.E.Nygma himself !","label":0},{"review":"Taste is an interesting thing and, as lead protagonist – clown character Arthur Fleck, played by Joaquin Phoenix, attests to in the latest Todd Phillips feature film effort: “comedy is subjective”.\n\nI had read many mixed reviews about the movie – the UK lefty newspaper, The Guardian, kind of slated it; it was reported in another article that large numbers of cinemagoers, in Huntington beach, California USA had left the cinema moaning about excessive violence; it was said in another article to be ...MORE","label":0},{"review":"Taste is an interesting thing and, as lead protagonist – clown character Arthur Fleck, played by Joaquin Phoenix, attests to in the latest Todd Phillips feature film effort: “comedy is subjective”.\n\nI had read many mixed reviews about the movie – the UK lefty newspaper, The Guardian, kind of slated it; it was reported in another article that large numbers of cinemagoers, in Huntington beach, California USA had left the cinema moaning about excessive violence; it was said in another article to be the most disappointing movie of the year.\n\nFirst-up, this is a film – an artistic effort and it is not to be judged on any other basis. If it moves you – as a cinemagoer – then director Todd Phillips has succeeded in his job.\n\nI had also watched various film-interpretation debates on YouTube about which part(s) of the movie existed only in the lead character’s unhinged mind, or whether any of it ever really happened at all. Did it really matter in terms of content I asked myself – was it even necessary to dissect the film to such a degree?\n\nSo, like eating at a new restaurant, or reading a new book, or meeting a new person for the very first time, I simply ignored all the hype and let the story unfold – and in the most literal way.\n\nArthur Fleck is a failed clown and wannabe stand-up comedian who lives with his mother in a ratty apartment in downtown Gotham City (a fictitious DC Comics city based in the state of New Jersey, USA).  Essentially all clown Arthur Fleck wants – is to be famous, and he will do anything to achieve his aim.  Whether or not any of the action plays out in the real world, or in his mind as a psychiatric patient, is irrelevant for what the film speaks to in my mind – which are the themes of: mental illness, unchecked ambition, celebrity culture and self-delusion. \n\nThese are important subjects which I feel ought to be discussed and addressed in modern society in the era of social media.\n\nArthur’s world is a very gritty and cruel one, one where working on the streets of Gotham City as a clown where during his job, trying to draw customers to a retail store, he gets beaten up by horrible teenagers in an alleyway and, where most tragically, he finds out his mother is not his biological mother, and in reality he was not conceived on the right side of the sheets during an illicit tryst between his apparent real mother and super powerful Gotham City resident Thomas Wayne character, and that all he really is, is a dirt poor abused orphan.\n\nThat is quite a realisation for any person, and especially for mentally disturbed and failed clown Arthur Fleck, which events become the final crystallising moments in Arthur’s homicidal serial killing revenge spree.\n\nWhat the film also spoke to, is the world of comedy and mass entertainment, which is the biggest farce of all. That making fun of sad people is unfair; yet at the same time, it makes for the very best comedy of self-deprecation when the comic does it himself, and that tragedy and comedy straddle the very same line.\n\nI enjoyed the thread that connected the DC Comics Batman Bruce Wayne’s story and Arthur Fleck’s Joker character, whose genesis in the movie came into being right after he assassinated the famous TV comedy talk-show host character Murray Franklin, played by Robert de Niro, whom Arthur Fleck had idolised.\n\nThere are some black comedy genius moments – Arthur’s gun falling out of his clown outfit at a children’s hospital gig, and also where his colleague, dwarf clown Gary, is simply too short to reach the apartment’s front door’s safety chain to escape with his life intact, right after Arthur has brutally murdered other clown colleague, Randall.   \n\nMy final analysis is – go see the movie, think for yourself, and don’t believe the hype. The violence is not unnecessary, and it has that “1,000 Ways to Die” feel to it, where social Darwinism says: “those who deserve to die, die”.","label":0},{"review":"Joker - 4/5\nGround breaking performance by Jaoquin best direction by Todd with best Casting, Editing, Cinematography, Shady Dark Ugly Retro settings, and Music needs a thumbs up - Music added the scariness for the Subject, hats off Hildur 🙏🏻🙏🏻\nI didn’t imagine to get such a Violent Deep scary movie from a director who directed all funny movies like The Hangover series..!! \n\nComing to Arthur Fleck ( Joker) \nAn insecured, unsuccessful, filthy-living, hallucinating, struggling, Stand Up comedia ...MORE","label":0},{"review":"Joker - 4/5\nGround breaking performance by Jaoquin best direction by Todd with best Casting, Editing, Cinematography, Shady Dark Ugly Retro settings, and Music needs a thumbs up - Music added the scariness for the Subject, hats off Hildur 🙏🏻🙏🏻\nI didn’t imagine to get such a Violent Deep scary movie from a director who directed all funny movies like The Hangover series..!! \n\nComing to Arthur Fleck ( Joker) \nAn insecured, unsuccessful, filthy-living, hallucinating, struggling, Stand Up comedian who has a history of mental illness because of his horrible childhood because of his mother who is also an ex patient with mental illness is manipulated and harassed by his society around, chooses to express his anger towards bad people through killings under the mask of Joker he created for survival..!! \n\nHis expression of intolerance starts with killings of 3 men in a subway teasing a girl in a metro then his collegue who guides him in wrong way to take away his job,  then his colleague, his mom, then kills his favourite host of a Famous reality show who uses people like him and Mean while his expression of suppression gives him craze in old suppressed society which makes Joker feels Proud about him and ends up killing Thomas Wayne, the mayor of  Gotham and finally lands him in a Phsyciatric ward. \n\nI am still Wondering :\n\n1. This Joker is not as smart violent bad and scary like the one Mr. Nolan created and this Joker has nothing to do with the Dark Knight.\n2. Wonder why director used DC characters for his story 🤷🏻‍♀️🤷🏻‍♀️\n3. This is any other typical Psycho thriller and Killer movie and looked director used it just to give extra limelight for his movie. \n4. Go with Zero expectations about Nolan’s Joker, this guy is not 1/10th of the smartness, Swag, Confidence, being Bad, strength of the Nolan’s Joker. \n\nGo for Jaoquin’s acting who lost 20kgs for this psychic role, For the music ( God bless me ) I felt some bad anthem whispering in my ears and kept my eyes wide open , and Amazing dark tone retro Art direction and Cinematography especially Close Ups created the fear. \n\n#SakhiRavoorDiaries","label":0},{"review":"Put on a happy face cause the clown is here... and he is here to stay. \n\nWithin the grimy, rainy streets of Gotham City that shines its night lights upon bags of filth covered from ghostly white steams. A nearby taxi, riding through faceless crowds shouldered by the horror-filled echoes rousing within the walls of Arkham, they roam. Souls who are neither alive nor dead, they roam. They roam these streets seeking the identity that would mold and carve them out of the walls of a society that sees  ...MORE","label":0},{"review":"Put on a happy face cause the clown is here... and he is here to stay. \n\nWithin the grimy, rainy streets of Gotham City that shines its night lights upon bags of filth covered from ghostly white steams. A nearby taxi, riding through faceless crowds shouldered by the horror-filled echoes rousing within the walls of Arkham, they roam. Souls who are neither alive nor dead, they roam. They roam these streets seeking the identity that would mold and carve them out of the walls of a society that sees copies instead of individuals. That sees consumers, helpless rats that need a cure. \n\nWritten by Todd Phillips & Scott Silver, Directed by Todd Phillips, JOKER tells the story of one of those roaming souls. Featuring a career-best performance by Joaquin Phoenix, Arthur Fleck finds himself in the bottom of the barrel of Gotham’s underbelly. Arthur who has gone through parental, economical, psychological trauma, is simply a man who wants to smile. A haunted soul that would later become The Joker, unraveling his philosophy throughout the streets of Gotham, spreading chaos and destruction extracted from a generation of oppressed individuals. And this time, there is no costume donning hero to save the city.\n\nPhillips with the aid of his production design team and his cinematographer builds a living, breathing Gotham that reaks misery through its sewers and fumes, allowing Phoenix to fully let go of himself as he evolves into the clown prince of crime. The score by Hildur Guðnadóttir is heavily inspired by Hans Zimmer’s masterful Joker theme from The Dark Knight and though it can be a bit overpowering at times, the score capitulated the grandeur majesty that Phoenix brought as Joker. \n\nThe genre of comic book movies evolves one more time. If Raimi’s hopeful, colorful and vibrant Spider-Man 2 showed the genre’ power to incapsulate heroism within its canvas, and if Nolan’s The Dark Knight Trilogy showed that the genre was ready to tackle themes that rose beyond the flashy battles and caped thrills, if Snyder’s Watchmen showed the deconstruction of the indecency and the real humanity of a costumed hero surrounded by a cynical world, if Mangold’s Logan deconstructed a nearly two-decade-old icon to deliver an emotional gut-punch, If Sony’s Spider-Verse showed how a radical change of its medium can evolve the genre, then Todd Phillips’s JOKER, is another piece of proof that the genre is at its most interesting when it embraces its versatile canvas to tell a personal story.","label":0},{"review":"It was an excellent movie but there are multiple factors to consider:\n\n(MIGHT INCLUDE SPOILERS!) \n\n•This movie is extremely dark and horrifying but in a way where you still want to watch it till the end whether it's violent or horror or whatever the acting is so phenomenal to the point where your eyes are literally stuck to the screen you just can't stop watching it. \n\n•This movie was amazing but it couldn't ever be the way it is now without the way it was presented the way it was presented real ...MORE","label":0},{"review":"It was an excellent movie but there are multiple factors to consider:\n\n(MIGHT INCLUDE SPOILERS!) \n\n•This movie is extremely dark and horrifying but in a way where you still want to watch it till the end whether it's violent or horror or whatever the acting is so phenomenal to the point where your eyes are literally stuck to the screen you just can't stop watching it. \n\n•This movie was amazing but it couldn't ever be the way it is now without the way it was presented the way it was presented really does put an impact on the way this movie turned out. Somehow the directors and producers and writers and even actors found a way to really touch the audiences and explain what the word \"psychotic\" really means! They presented it in a way where you felt sympathy for the Joker but at the same time you thought that he was INSANE for what he was doing! \n\n•Another thing is that this movie is dark to the point where Arthur Fleck (the Joker) enjoyed killing because it was his way to show that people couldn't step all over him and that he would snap back! Another example of how dark it is, is shown by the line \"I thought my life was a tragedy now I realise its a f***ing comedy\" imagine how dark it is to showcase that TRAGEDY=COMEDY so I wouldn't recommend this movie for someone who's really sensitive and can't handle a lot of violence and torcher you could say because Arthur Fleck (the Joker) was going though basically mental torcher. \n\n•Maybe adding the line of ONE BAD DAY would've been good because the whole movies point is that one bad day is all it takes to drive a normal person completely insane and the Joker's proof of that. \n\n•The phenomenal performance by Joaquin Phoenix literally made people scared looking at him because his performance made some people think that he was actually like this in real life and to do such a performance is really legendary because I don't see a lot of actors doing that nowadays. \n\n•Yes while this isn't the story we have all heard ever since we were little kids about the acid and all that this movie was still phenomenal in its own way because honestly it showcased the modern world how people bully others driving them insane and then question why they act that way and personally I liked this storyline better then the acid one (my opinion though everyone has there own opinion) \n\n•This movie made the Joker relatable and I know that sounds truly terrifying but in a sick odd twisted manner it isn't like the movies where heroes save the day it really made (at least it made me) understand why the Joker is who he is and why he acts the way that he does and the fact that this happens to real people is terrifying. It also shows that not every villain is responsible for the way they are because sometimes its the society that drives them psycho \n\nAll points considered I would say this is a must watch movie and I definitely recommend it","label":0},{"review":"JOKAR \n\nThe movie, earned $500+ million till now. \nThis is another typical Psycho thriller and Killer movie.\n\nGreat  Cinematography, Shady Dark Ugly Retro settings, and music was good for normal person. I didn’t think to get such a Violent Deep scary movie from a director who directed all funny movies like The Hangover series..!! Secondly the name of Movie was quite oppotise to story. \n\nNo doubt, ground breaking performance by Jaoquin. The person who lost his  20kg wight for pscyhc role.  \n\nStor ...MORE","label":0},{"review":"JOKAR \n\nThe movie, earned $500+ million till now. \nThis is another typical Psycho thriller and Killer movie.\n\nGreat  Cinematography, Shady Dark Ugly Retro settings, and music was good for normal person. I didn’t think to get such a Violent Deep scary movie from a director who directed all funny movies like The Hangover series..!! Secondly the name of Movie was quite oppotise to story. \n\nNo doubt, ground breaking performance by Jaoquin. The person who lost his  20kg wight for pscyhc role.  \n\nStory of  Arthur Fleck ( Joker) \n\nA person who has history of multiple psychic disorders because of his horrible childhood, his mother also faced some mental issues. Arthur chooses to express his anger by killing the bad people, who didn't understood his mental condition, disporportional laugh according to situations.\n\nHis expression of intolerance starts with killings of 3 men in a subway teasing a girl in a metro then his collegue who guides him in wrong way to take away his job,  then his colleague, his mom, then kills his favourite host of a famous reality show who uses people like him and mean while his expression of suppression gives him craze in old suppressed society which makes Joker feels Proud about him and ends up killing Thomas Wayne, the mayor of  Gotham and finally lands him in a Psychiatric ward. \n\n#PersonalOpinion: I think, there are two ways to express extreme level of  depression, one is by killing yourself ( Sucide), other is by killing those, who are reason of your depression. People reach at this Extreme level, when we ignore them, we don't listen what they exactly want to say, what they want us to understand, we simply assume more, reach at conculsions. If our so called civilized society will continue, this behaviour with one another, it will lead to a dark, disorganized and full of people with paradoxical laughter only. \n\nRajwanti Kumari.","label":0},{"review":"An insightful, almost painfully honest look into the issues society faces with addressing mental illness in an adequate fashion. Also a believable, canon-worthy take on the potential origins of The Joker as a character. \n\nWhile many have claimed that such a film may ignite waves of violence and the like, I do believe that this should also serve as an eye opener, an epiphany for how severely we fail those who do have such conditions. \n\nJoaquin is mesmerising and puts in a quality of performance w ...MORE","label":0},{"review":"An insightful, almost painfully honest look into the issues society faces with addressing mental illness in an adequate fashion. Also a believable, canon-worthy take on the potential origins of The Joker as a character. \n\nWhile many have claimed that such a film may ignite waves of violence and the like, I do believe that this should also serve as an eye opener, an epiphany for how severely we fail those who do have such conditions. \n\nJoaquin is mesmerising and puts in a quality of performance which, in my own opinion, rightfully deserves a mantle alongside the iconic and revered Joker performances of the past. His iteration and portrayal is Oscar-worthy. The imagery he puts forward for the audience is astounding, terrifying and blatantly moving. \n\nAs many others have said, the score is impeccable and adds to the experience, never allowing long moments of respite from the palpable tension and decension into total anarchy and madness. The direction and cinematography come together to provide powerful visuals throughout. Ultimately, this is a complete package which ranks very highly on my list of comic book movies, potentially right at the very top. \n\nIn all, a must see for fans of the DC Comics. A must see for those who enjoy thrillers, drama and who appreciate provocative social commentary. While it treads the line between accepting consequence and condoning violence, and does subvert those lines occasionally, our real response should be to how much more society needs to do to fully help those who suffer from mental health issues; and why we continue to act as if society is unable to provide assistance and guidance to those who truly need it. \n\n[Spoiler]\nThe scene when Arthur is rescued from the police vehicle and is finally given the limelight, finally taken seriously, and finally given attention for an accomplishment -despite it being a heinous and tragic accomplishment- serves as a relatable, terrifying metaphor for how often we overlook depression and mental health issues. How people who battle with these issues are only ever taken seriously and given the attention they so strongly require when they lash out, commit a horrible crime, or are no longer with us. It was in this moment when Joaquin dips his fingertips in blood and pulls back the grin, this time not in the mirror but in front of actual fans applauding him, that I truly felt how perfectly he nails this iteration and role. Joaquin is awe-inducing. On par with Heath and Jack, though I do believe the three cannot simply be compared head-to-head for a myriad of reasons and how their portrayals differ.","label":0},{"review":"I think something I always enjoy in serious movies is when it shows brutal honesty (which this movie did show) because for Arthur AKA The Joker even though it seems harsh and cruel the world might not have anything nice to say about you and also chooses to abuse and mistreat you, even if you are a nice guy struggling to remain sane amidst your mental and psychological demons that you try your utmost to suppress but the world seems hell-bent on you giving in and succumbing to those demons. \n\nThey ...MORE","label":0},{"review":"I think something I always enjoy in serious movies is when it shows brutal honesty (which this movie did show) because for Arthur AKA The Joker even though it seems harsh and cruel the world might not have anything nice to say about you and also chooses to abuse and mistreat you, even if you are a nice guy struggling to remain sane amidst your mental and psychological demons that you try your utmost to suppress but the world seems hell-bent on you giving in and succumbing to those demons. \n\nThey might rue the day they chose to kick a man when he's down and may have thought \"he's probably just a loser outcast anyway\" \n\nThis world may force you to choose an identity a sort of Yin and Yang if you will\nYou either choose to shoulder the burden and accept the way things are, always suppressing the Injustice and the cruelty of the world, or you give in to that dark side and always live completely unhinged, never bridling any of your desires no matter how frivolous or despicable they turn out to be.\n\nPossibly the quote \"You either die a hero or you live long enough to see yourself become the villain\" could very well be the underlying idea of this movie.\n\nOne thing I'll say is you never seem to know what the Joker is thinking at least in my opinion I guess you could say his Insanity is uniquely his own and he's the only one who can truly understand it.\n\nInterestingly this movie may leave you feeling somewhat sympathetic for him at least I felt that way. The thing that seems stuck in my head and I can't stop thinking about it is, society may in fact breed the Psychopathic Killers when it tries to claim that it's striving for a utopic vision. \n\nI feel quite stumped, it's hard to put a label on the Joker is he a psychopath or a sociopath maybe someone far more knowledgeable on those two things could figure it out LOL.\n\nIn the end I'd recommend it, I'd say it's a surreal, visceral, experience and for that much I think it's worth watching.","label":0},{"review":"The standalone comic book film did a great job telling a story of a man turning into the clown prince of crime. With no limitations given, Todd Phillips and crew crafted a new fresh origin story compared to what we have seen in the comics. Every characters in the film serves a purpose to Arthur Fleck's (played by incredible actor, Joaquin Phoenix) character development throughout the entire duration of the film. In addition, Gotham itself is a character due to its distinctive characteristics and ...MORE","label":0},{"review":"The standalone comic book film did a great job telling a story of a man turning into the clown prince of crime. With no limitations given, Todd Phillips and crew crafted a new fresh origin story compared to what we have seen in the comics. Every characters in the film serves a purpose to Arthur Fleck's (played by incredible actor, Joaquin Phoenix) character development throughout the entire duration of the film. In addition, Gotham itself is a character due to its distinctive characteristics and how it affects the protagonist along with other characters too. Cinematography is excellent and performance by co stars are well done and as for Joaquin Phoenix, his performance here is beautiful, eerie and haunting. The score for the film is very impactful in two ways: the music enhance the effectiveness of a scene and secondly, (to my knowledge) certain scenes is influenced by the composer Hildur Guonadottir as some songs are already made before filming. I thoroughly and genuinely more than enjoyed the film as a whole. I personally watched it twice in theaters and i absolutely can not wait to torrent this masterpiece! i encourage ya'll to watch this in theaters, have fun.\n\n:-)","label":0},{"review":"You will come out from theater flabbergasted and speechless. Oscars 2020 all booked for Mr Joker...!!  (9.5/10)\n\nI went to see first day, last show. 1040. In my country India, there is not much market for such movies. But to my astonishment, the hall was full. Jam packed. An Entire generation in Urban India is out there who can understand and appreciate such movies. This is an extremely significant social change in country. Makes me proud. \n\nSlow, simple yet dark. As it starts with its slow pace ...MORE","label":0},{"review":"You will come out from theater flabbergasted and speechless. Oscars 2020 all booked for Mr Joker...!!  (9.5/10)\n\nI went to see first day, last show. 1040. In my country India, there is not much market for such movies. But to my astonishment, the hall was full. Jam packed. An Entire generation in Urban India is out there who can understand and appreciate such movies. This is an extremely significant social change in country. Makes me proud. \n\nSlow, simple yet dark. As it starts with its slow pace, you will wonder what to expect....and soon, you will notice two amazing things about the movie - 01. Of course Mr Phoenix. ( Who else..??) 02. The background score. Brilliance of performance from Phoenix will take you to a roller coaster ride and leave you stunned.... wanting more.....Same goes for an equally amazing, powerful and original score by Hildur Guðnadóttir. Your soul will dance through your ears during the bathroom dance after subway killings....mark my words.....a background score without match....!!\n\nSuch perfect pieces, don't unfold to you. In fact, they don't unfold to everyone. You have to live that childhood, reading Batman comics and books. Every single comment written on some page of a forgotten comic about Joker will account. Different versions of comics have portrayed joker in their own manner, and we have many versions of Joker. The general version, well, as per me, is that Joker is someone, who can take hard beating/s. Like a punching bag he takes the beatings, and he is not the one who is strong physically. And second, he is expert in playing with your minds. Speaking one sentence, at a perfect time that would take over you. ( if you work in an office, big office, you probably know someone like him....they will say something, just to ruin your day, to bring you down, or, simply to make you fight your colleagues /wife. )\nThe movie, so amazingly tells the story of how Joker became what he is....from where he got his manipulative characteristics and how he sustains beatings... ( Remember in Dark Knight, when Bat smashes him in police station, what he replies..?? see that scene again....) it was not an ordinary talent to deliver a Joker on screen that has all Joker characteristics. Todd Phillips, well, is definitely out of hangover mood...! Hats off...!!\n\nEqual is background score. Using just a violin, Hildur has created a score, that acts like a catalyst to every aspect of movie. A simple piece on a violin, played in Dolby Digital 7.1 is more than enough.  I remember last time I came across such powerful background score was in The Untouchables...!!\n\nJoaquin Phoenix, well, is at his best. You wanted more of  Heath Ledger, and here is everything you ever wanted. Though the comparison between both the performance is not that proper at this moment, I just want to state that after ten years, there is a joker, who is everything you have ever seen in a movie or read in a comic book...!\n\n2020 Oscars are all booked....!! Best movie, Best Director, Best Actor and Best Background Score.","label":0},{"review":"When you read Alan Moore' classic 'Killing Joke' you not only marvel at what Moore did in the iconic comic book with Joker but how he also set forward a new Gotham unlike the one in previous Batman Issues.\n\nJoker with Joaquin Phoenix is like a homage to Moore's brilliance in every sense of word. I have been reading comic books for over two decades now and though i am more biased towards Marvel to an extent i started out with DC comic though and so when i came out of the theatre after watching th ...MORE","label":0},{"review":"When you read Alan Moore' classic 'Killing Joke' you not only marvel at what Moore did in the iconic comic book with Joker but how he also set forward a new Gotham unlike the one in previous Batman Issues.\n\nJoker with Joaquin Phoenix is like a homage to Moore's brilliance in every sense of word. I have been reading comic books for over two decades now and though i am more biased towards Marvel to an extent i started out with DC comic though and so when i came out of the theatre after watching the sadistic madman play with vibrant colors in his own mind, i remembered my stack of Batman comics that i have had over the 20 plus years and said to myself 'We finally have a Joker to take DC forward' . Hold on people ... i didn't say it has eclipsed Ledger but it surely has done the origins story right. And in some subtle ways it did feel at time superior yo Ledger. The reviews about it being more like an indie movie doesn't bother me as i don't expect gory action in an origin story of a character as sadistic , rugged and at the same time delicate as Joker. \n\nPhoenix can just buy himself a long vacation after this truly enthralling yet creepy performance. Many seem to forget that you need a plan to make something right and Phoenix might be DCEU's answer to the start of a good , solid plan. Phoenix's protrayal of Joker is free, blatant and at times almost too real. He makes the character seem as if you will be the next to be at the recieving end of his sadistic wrath. But he also makes you feel for him as well which in itself is some feat.\n\nIf you are a comic book fan you will love how the story is told in true attributes to its comic book counterpart. Out of the many origins story that the Joker had Moore's Killing Joke was the best and the movie came close to it..very close. Many might argue as to the fact that Killing Joke had very little in terms of his origins story but thats where the movie goes a step ahead albeit failing in comparision to the fun and adventurous charm the comic book had. Yet it does hold its own though and the last 20 minutes of the movie leaves you with endless possibilities and clues. A Death in the family scenario (of course Phoenix will come back as Joker in the Batman movie no matter how much Todd denies) or maybe an Injustice League. But for all i care, we finally got something to start with in DCEU unlike its shaky timeline previously.\n\n\nAgain if you are a comic book fan watch it, if    you are a Batman fan definitely watch this movie , if you are a Joker fan scoot over now and stop reading the review. \n\nHappy Watching !","label":0},{"review":"Note - The movie is strictly for 18+. \n\nGenerally I don't write about movies but this one made me do it.\n\nYou know how you generally ignore  DC Movies (most of you),\n\"Arey, I only watch Marvel\", \"I don't like DC\", \"I don't watch Hollywood\" & blah blah....\nWell you should watch Joker - A jaw dropping, astonishing, mind blowing movie.... And a movie that will certainly force you to think about such conditions.\n\nThis might be the most darkest, horrifying DC movie ever. There are some scenes where y ...MORE","label":0},{"review":"Note - The movie is strictly for 18+. \n\nGenerally I don't write about movies but this one made me do it.\n\nYou know how you generally ignore  DC Movies (most of you),\n\"Arey, I only watch Marvel\", \"I don't like DC\", \"I don't watch Hollywood\" & blah blah....\nWell you should watch Joker - A jaw dropping, astonishing, mind blowing movie.... And a movie that will certainly force you to think about such conditions.\n\nThis might be the most darkest, horrifying DC movie ever. There are some scenes where you might just close your eyes. \n\nYou know the Joker as the Joker you saw, watched & enjoyed in Batman: The Dark Knight and many other movies, But believe me you don't know this one! \nIt's just great to see DC getting such movies. \n\nWhat to Expect from DC?\n\nEverything.... Nothing you ever imagined that DC would do, everything is there in this psychological thriller movie.\n\n\nWhat to see in Joker?\n\nOf course, You need to see Joaquin Phoenix playing Joker but what other things you might just love and are just perfectly sequenced & there's no part where you think that's been put to fill up the movie basically there's no fillers in it. \n\n1. Amazing amazing amazing acting - \nThe way this Phoenix played it is awesome. Dialogue Delivery is perfect & the most important that got my eyes glued to the screen was his body language if you want me to rate it it would be 11/10. \n\nThe way Phoenix played The Iconic Joker is better than Heath Ledeger's.  If Heath Ledger's Joker was 9.9 then Phoenix's Joker is 9.99/10. I really didn't expect that DC would find A more Perfect Joker...\nBut now it seems that WE have the best Joker in DC universe & that is Joaquin Phoenix.\n\n\n2.  Movie Direction - \nWhen did you see Todd Phillips directing movie like this, certainly it's not like his Famous 'Hangover Series' . \nHe is at his best here. Damn!! The movie is soo fine every scene, everything is just amazing.\n\n\n3. Music -\nTo a very big extent Music do play a crucial role in Movies.\nThe way Joker slips into his character is amazing and it would not be possible to enjoy this transiton without the background score. A big shout-out Hildur Guðnadóttir for her amazing background score, it just gives you goosebumps.\n\n\n4. Cinematography - \nAmazingly done by Lawrence Sher. The way he caught Joker is amazing. From the Dance to the Hospital everything is perfectly captured. \n\n\nI think everyone out there especially the Psychology Students should watch this movie, The state of how Arthur became The Joker is very well depicted. \n\nBut at the end it leaves y'all with a thought a serious thought..\n\"Thank God, Gotham is not REAL\".","label":0},{"review":"Looking at Todd Phillips resumé you could be forgiven in thinking he might have not been the man for the job. You however would be dead wrong.\n\nJoker is a masterpiece of contemporary filmaking. A bleak, depressing picture about the origins of one the greatest villians ever conceived, it grounds the origin story in a thrilling look at the disenfranchised, the dispossessed and the mentally ill.\n\nWith nods to Scorsese's earlier works such as Taxi Driver and The King of Comedy, Joker strays from the ...MORE","label":0},{"review":"Looking at Todd Phillips resumé you could be forgiven in thinking he might have not been the man for the job. You however would be dead wrong.\n\nJoker is a masterpiece of contemporary filmaking. A bleak, depressing picture about the origins of one the greatest villians ever conceived, it grounds the origin story in a thrilling look at the disenfranchised, the dispossessed and the mentally ill.\n\nWith nods to Scorsese's earlier works such as Taxi Driver and The King of Comedy, Joker strays from the usual fair of vibrant, explosive comic book films and  opts for a gritty re-imagining of the titular villian.\n\nThe story follows Arthur Fleck, a mentally ill budding comedian who struggles to find his place in a world slowly going mad. Arthur's story is a bit of a whirlewind showing his battle with love, identity and society. This movie asks some hard questions about our world and Arthur gradually finds answers through a string of corpses and hysterical laughter.\n\nThis movie is beautifully shot, with a subtle but atmospheric score and while it looks as if it may fall into a pretentious arthouse flick at times, its framing and setting helps ground it in reality.\n\nAs you can probably imagine, Joaquin Phoenix carries the movie with an incredible stroke of class and and absorption, not once throughout the film did I feel the need to compare him to Jack Nicholson's or Heath Ledgers incredible performances. This is his own and you are caught in his world hook, line and sinker.\n\nOverall this movie gets a 4.5/5.","label":0},{"review":"Joker, directed by Todd Phillips is one of the most anticipated movies of this year. Joaquin Phoenix plays Arthur aka Joker ; I will talk about it later. There is Robert De Niro as Murray Franklin and \nZazie Beetz as Sophie Dumond to support Mr Phoenix in this stupendous visual treat which is weaved patiently, creatively and even romantically and it comes out as a fine work of art. I said romantically because creating a deadly evil villain and make you feel for him, sympathize for him and even m ...MORE","label":0},{"review":"Joker, directed by Todd Phillips is one of the most anticipated movies of this year. Joaquin Phoenix plays Arthur aka Joker ; I will talk about it later. There is Robert De Niro as Murray Franklin and \nZazie Beetz as Sophie Dumond to support Mr Phoenix in this stupendous visual treat which is weaved patiently, creatively and even romantically and it comes out as a fine work of art. I said romantically because creating a deadly evil villain and make you feel for him, sympathize for him and even make you love him is definitely not easy... And if you wanna know how it is done....watch Joker. Hats off to Todd who is brilliantly playing the director here. The movie begins with this incredible scene of Arthur painting his face, a clown. Gotham is in hell of a situation, riots everywhere, sanity workers on strike and its garbage in every corner and you are introduced to one of the greatest villains in the movies...Joker.\n\nJoaquin is profoundly magical in every frame of this movie... His performance is going to haunt you for days. There are scenes that I wouldn't forget for a while. Look at the way he runs, laughs, cries , even when he stares...the light in his eyes acts to its best ability to make you read what's in his head. Phoenix breathes life into this character and watching him suffering will give you an ache somewhere deep inside. I have too many favourite scenes in the movie. One of them is when Arthur confronts Mr Wayne in a theater toilet, other one is when Arthur appears on the TV talk show and the one filled my heart in is the scene where Joker draws a smile on his face with blood. I can go on talking about Joaquin's performance... Its mesmerizing and it's undoubtedly one of the greatest performances I have ever witnessed. \n\nThe music is aching and it connects you directly to Arthur's head...Robert De Niro charms the character he plays and every other actor in the movie has done an incredible job. But Phoenix stands out like the sun and he shines throughout the movie. You even get to see Batman, though he is a child , I could hear the entire cinema cheered on that scene. This movie is Phoenix's movie... My heart has already given him an oscar and a long standing ovation for living Joker and for making me fall in love with the character he played. Don't miss it. I'm going with 4 stars. ⭐⭐⭐⭐","label":0},{"review":"The finest film based on a villain , Joaquin Phoenix is incredible as Arthur Fleck / Joker.\n\nThis film is a love letter to the clown prince of crime as this shows a mans decent into psychosis and violence due to the abuse and torment he has suffered.\n\nThe acting is as good as you'll ever see on a cinema projector by one Joaquin Phoenix , his portrayal of a man that wants nothing more than to make the world smile only to be beaten down , abused , tormented is heartbreaking yet compelling to watch ...MORE","label":0},{"review":"The finest film based on a villain , Joaquin Phoenix is incredible as Arthur Fleck / Joker.\n\nThis film is a love letter to the clown prince of crime as this shows a mans decent into psychosis and violence due to the abuse and torment he has suffered.\n\nThe acting is as good as you'll ever see on a cinema projector by one Joaquin Phoenix , his portrayal of a man that wants nothing more than to make the world smile only to be beaten down , abused , tormented is heartbreaking yet compelling to watch , you will not be able to take your eyes off Phoenix until the end credits , the pathos , the sinister undercurrent of the foreshadowing of what is to come is like a psychological roller coaster you'll want to ride again and again , it's just stunning to behold.    \n\nThe build to the final chaotic climax is expertly executed by all involved in the film.\n\nThe cinematography is beautiful and the soundtrack that is beautifully composed by Hildur Guonadottir is haunting and tragic as it echos the psyche of a good natured but psychologically damaged man as he descends into criminality , murder , chaos and finally insanity.\n\nThis film is required viewing for not just film buffs , but as a cautionary tale as to what happens when you push someone into the abyss for them to never return.\n\n10 out of 10 \n\n5 stars \n\nA modern day masterpiece of cinema.      \n\nWatch it now !!!!.","label":0},{"review":"Outstanding piece of art.\n\n*spoilers*\n\nWhen watching this movie PLEASE understand that it's not a \"true\" Joker that relates to the comics, but an out-of-the box way to portrait it. There's the age diference between Arthur and Bruce, there's no acid bath among other things. \"Plot holes\" is a stupid statement as this movie answers a lot about this unortodox origin.\n\nOne thing that I missed from this movie is that Joker didn't say one of his staple quotes:\n\"All it takes is one bad day to reduce the ...MORE","label":0},{"review":"Outstanding piece of art.\n\n*spoilers*\n\nWhen watching this movie PLEASE understand that it's not a \"true\" Joker that relates to the comics, but an out-of-the box way to portrait it. There's the age diference between Arthur and Bruce, there's no acid bath among other things. \"Plot holes\" is a stupid statement as this movie answers a lot about this unortodox origin.\n\nOne thing that I missed from this movie is that Joker didn't say one of his staple quotes:\n\"All it takes is one bad day to reduce the sanest man to lunacy, this is how far the world is from where i am, ONE. BAD. DAY\"\nIt would fit perfectly somehwere in the end, maybe when he's with Murray, or somewhere else. But it's a small CON around big PROS.\n\nTHAT'S WHAT THIS MOVIE IS ABOUT. How a sequence of bad events (to put it lightly) can make an already unstable person to full blown psychosis.\n\nTo put it as a \"incel motivation to start a killing spree\" or \"a white guy angry with the world\" is to view a masterpiece like this one in a simplistic way. Those type of critics just shows how overpaid mainstream opinion makers are, with their butt hurt feelings because this movie is far away from some utopia or fails to deliver a message, whatever it means. It not only delivers, it makes you want to clap after it's finish.\n\nIf you are familiar with the DC Universe, think about this Joker origin as a character of Earth-1283 where the story is diferent than Earth-1 (the original story), so you are not to attached to the details, just on the character development and the events that occur. Maybe that's something that the overpaid critics lack to understand.\n\nThe movie showing the link between Bruce and Arthur is outstanding, making us understand (in this outside the box narrative) how Joker becomes so obsessed not only with Batman but also Bruce. Even that is covered, which was a great surprise, a well written surprise.\n\nA must watch, an instant classic. The staircase scene where he comes as the Joker before arriving to the talk show, or when he lits a cigarrete after leaving the subway are scenes that will live through generations.\n\nLast thing, can't compare to Heath Ledger, as Joaquin's Joker is an origin while Ledger is already the fully develop Clown Prince of Crime. I don't expect Phoenix to receive an Oscar for this great performance (movie doesn't follow Hollywoods checklist), but i hope that he at least gets nominated, even though he probably doesn't care.\n\nThe hype was high, but i'm glad it delivered. A shame that it looks like an one-off, but ok, leave while on the top.","label":0},{"review":"Written & Directed by todd phillips, Joker tells the story of  one of those roaming souls. With a outstanding performance by joaquin phoenix as joker. Arthur Fleck finds himself at the bottom of the barrel of Gotham’s underbelly. Arthur who has gone through so much trauma in his life time  , is simply a man who wants to put on a happy face . A haunted soul that would later become the king of crime himself The Joker. Joker is a insightful, almost painfully honest look into the issues society face ...MORE","label":0},{"review":"Written & Directed by todd phillips, Joker tells the story of  one of those roaming souls. With a outstanding performance by joaquin phoenix as joker. Arthur Fleck finds himself at the bottom of the barrel of Gotham’s underbelly. Arthur who has gone through so much trauma in his life time  , is simply a man who wants to put on a happy face . A haunted soul that would later become the king of crime himself The Joker. Joker is a insightful, almost painfully honest look into the issues society faces with addressing mental illness in an adequate fashion. Also a believable, take on the potential origins of The Joker and his descent into madness. This might be the darkest most, horrifying DC movie ever. There are some scenes where you might just close your eyes or just leave. Most of you know  i generally ignore DC Movies I only watch Marvel but this movie i had to see. you should watch this movie its A jaw dropping, astonishing, mind blowing movie a movie that will certainly force you to think about such conditions.you’ve watched & enjoyed joker in Batman: The Dark Knight and many other movies in the past  But believe me you don't know this one! It's just great to see DC starting to make good films and stop trying to catch up with marvel & the MCU. To a large extent Music does play a crucial role in Movies  A big shout-out to Hildur Guðnadóttir for her amazing background score, it just gives you goosebumps. I think everyone out there especially joker fans should see this movie..  But at the end it leaves y'all with a thought a serious thought.. Thank God, Gotham is not REAL.","label":0},{"review":"I have rated 9/10, and it's closer to 10 indeed. It is a kind of masterpiece of patterns rising evil to what only a few good man can escape. Without knowing the roots of all of what we call evilness, we don't know and appreciate what the good means, like without dark we will not appreciate light or absence of it. In my opinion \"Joker\" aims to unhide, unfortunately the true nature of human being. Since when you see in human entire history beside great things, we see a lot of evilness and world ma ...MORE","label":0},{"review":"I have rated 9/10, and it's closer to 10 indeed. It is a kind of masterpiece of patterns rising evil to what only a few good man can escape. Without knowing the roots of all of what we call evilness, we don't know and appreciate what the good means, like without dark we will not appreciate light or absence of it. In my opinion \"Joker\" aims to unhide, unfortunately the true nature of human being. Since when you see in human entire history beside great things, we see a lot of evilness and world massive killings. This way, a simple logical question can be made like: how can we be called humans the same ones who makes truly good things, and those who makes enormous bad things. \n\nSo the \"Joker\" does fill that up as how can evil rise so quickly without a doubt even in most democratic societies, which has to rise awareness. \n\nThere were many part of the screenplay that I liked too. Ending was a masterpiece with establishing an evil figure admiration and on other hand beginning of forming of coming Batman who faces as a child loses two parents in front of his eyes...\n\nActing was brilliant. I foresee a new Oscar winning of Joaquin Phoenix acting in a kind of Daniel Day-Lewis patterns of inspiration and interpretation.  \n\n#bfm @bfmigjeni","label":0},{"review":"I have seen so much hype, both good and bad, about the new #Joker film and I just want to say a few things about it.\n\n1. The movie is far from the most violent film I've ever seen (Rambo Last Blood was straight up murder porn for the final 20 minutes) and the media is going out of it's way to sell the idea that seeing it in a theater full of people will somehow put lives at risk. We live in a country where going to get groceries or going to an ELEMENTARY school might be the last thing you ever d ...MORE","label":0},{"review":"I have seen so much hype, both good and bad, about the new #Joker film and I just want to say a few things about it.\n\n1. The movie is far from the most violent film I've ever seen (Rambo Last Blood was straight up murder porn for the final 20 minutes) and the media is going out of it's way to sell the idea that seeing it in a theater full of people will somehow put lives at risk. We live in a country where going to get groceries or going to an ELEMENTARY school might be the last thing you ever do. It's irresponsible to keep pushing this narrative and just plain wrong.\n\n2. People are saying that Joker makes you feel for the villian in the movie thus causing you to root for the murdering clown. Without spoiling it, YES you can't help but be sympathetic towards Arthur and the horrible events that took place early on in his life BUT you definitely shouldn't be rooting for him once a specific line is crossed. If you do find yourself rooting for him after said line crossing, it may be time to talk to someone about what's going on in your life. Seriously.\n\nWith that out of the way, I've spent the past 36 hours thinking about this film. \n\nIt's shot beautifully, the score is haunting and incredibly effective and Joaquin Phoenix delivers an absolutely powerful performance as the incredibly damaged Arthur Fleck.\n\nWhat needs to be in the conversation surrounding this film is mental health services, class disparity and above all else APATHY and the effects it has on our society as a whole.\n\nThe movie holds up a mirror to society and it seems quite a few people aren't liking what they see. I have a suggestion for all of the people prejudging the film or just saying that it glorifies violence, go out and try to EMPATHIZE with your fellow man. See what you can do to lift up those that are destitute and powerless. Try to provide some positive reinforcement and above all else just SEE people because more than anything people just need to be seen (and heard).\n\nIn short, I loved this film and I was seriously uncomfortable for the majority of it as I think you are supposed to be. That's how I know Todd Philips and company knocked this out of the park. I can't help but think it will earn Joaquin Phoenix an Oscar nomination. He is now tied with Heath Ledger in regards to the best portrayal of the Joker on screen.\n\nI could go on and on in finer detail about this film but I'll leave you all with this brilliant idea, BE YOUR OWN CRITIC and take a moment to look into the mirror 😉","label":0},{"review":"Joker made me laugh , cry , and made me feel scared . This movie isn't your run of the mill superhero flick this is a gritty  homage to that of films made by the great Martin Scorsese . Some scenes will have you in shock and awe without breaking away from what Arthur sees and feels as he lives in an 80's era Gotham living with his mom and a mental disorder (Pseudobulbar affect if I'm not mistaken ) , the film also adds the unreliable narrator aspect ( where the camera can show you something that ...MORE","label":0},{"review":"Joker made me laugh , cry , and made me feel scared . This movie isn't your run of the mill superhero flick this is a gritty  homage to that of films made by the great Martin Scorsese . Some scenes will have you in shock and awe without breaking away from what Arthur sees and feels as he lives in an 80's era Gotham living with his mom and a mental disorder (Pseudobulbar affect if I'm not mistaken ) , the film also adds the unreliable narrator aspect ( where the camera can show you something that either isn't real or isn't happening) , besides that the acting is phenomenal , Joaquin Phoenix really brings his A game , showing Arthur fleck as a loving , kind individual that just wants to make you laugh but is beaten down by an ever changing society that both beat him down and in the end breaks him . this movie also adds the idea of the \"one bad day\" theme from the killing joke comic where in the comic joker says and i quote '' all it takes is one bad day to bring the sanest man to lunacy \" and it takes that idea and brings it to the forefront . in conclusion I think joker was beyond amazing , between the acting , music score and set pieces it was a wild (and scary) ride . Symbolism also sneaks into the movie with slight things you wouldn't notice upon first watching . This movie leaves you confused on what was real and what wasn't . In the end between you and your spouse , friend , or family member will have reasons on what was real and what wasn't  and that's what made the movie even better for me , how it left me talking days after and like dark knight and iron man before this i believe that joker will change the superhero movie genre forever... send in the clowns 10/10 would see again 🤡🔫🔪⚖💊","label":0},{"review":"Psychologic – intense – dark\nTodd Philips and Joaquin Phoenix have really made an extraordinary masterpiece. The acting and the actual scene shots where so artistic and well delivered. Not only did Joaquin depict a joker we have all been craving for, but Todd allowed us to see it in an unimaginable way. Throughout watching the movie, I found myself at the edge of the seat on numerous occasions, unable to stop myself from sympathising with ‘Arthur’. Arthur a deadly villain deserving to be locked  ...MORE","label":0},{"review":"Psychologic – intense – dark\nTodd Philips and Joaquin Phoenix have really made an extraordinary masterpiece. The acting and the actual scene shots where so artistic and well delivered. Not only did Joaquin depict a joker we have all been craving for, but Todd allowed us to see it in an unimaginable way. Throughout watching the movie, I found myself at the edge of the seat on numerous occasions, unable to stop myself from sympathising with ‘Arthur’. Arthur a deadly villain deserving to be locked away in Arkham Asylum for the rest of his life, yet nothing can stop us from thinking about his detrimental childhood, the lies he’s been told early on his life. Thus, was born the ‘joker’ from shear loneliness and self-deprivation a fundamental consequence caused by his mentally insane mother.  \nThere were many intense scenes which were so realistic it shook me to the core, I found myself gasping in shock whilst watching the movie. The way Joaquin laughed, smiled, cried and even those intense glare he gave spoke so much emotion. It was truly magnificent seeing an actor showing the characters emotion through their eyes.\nThe character study is so prominent, the repetition of the music when the joker is at his best allows us to really connect the dots, it really shows us the birth of the villain. The birth we’ve all been waiting for. The final couple of scenes was superb, the way they ended it off was remarkable and well-rounded it links to so many starting point of different batman shows/movies.\nI really recommend watching this if you have a natural craving for a slow burners, which shows the psychological making of an insane villain.","label":0},{"review":"JOKER in IMAX 2D *** warning after effects can influence anyone to think and act in a violently Psychotic manner no better played and mastered  by none other than Joaquin Phoenix. This flick will go down in Hollywood as the bloodiest Pool of Bloody Grim Horrific Thrillers more than Pulp Fiction or Any Martin Scorsese Thriller. \n\nJust google Domino's Pizza selling ADs on the JOKER movie success .Such is negative publicity so viral in modern times. \n\nThe Music score sure to induce anxiety and fear ...MORE","label":0},{"review":"JOKER in IMAX 2D *** warning after effects can influence anyone to think and act in a violently Psychotic manner no better played and mastered  by none other than Joaquin Phoenix. This flick will go down in Hollywood as the bloodiest Pool of Bloody Grim Horrific Thrillers more than Pulp Fiction or Any Martin Scorsese Thriller. \n\nJust google Domino's Pizza selling ADs on the JOKER movie success .Such is negative publicity so viral in modern times. \n\nThe Music score sure to induce anxiety and fear excels even that of Hans Zimmerman, grand,philharmonic and opera level. \n\nJoaquins act far exceeds expectations and resembles Anthony Hopkins Infamous Doctor Lecter, Hannibal, Silence of the lambs and Red Dragon. \n\nThat choking Laughter will confuse you and me to the depths of the pain of the mentally unstable Arthur Fleck diagnosed with a condition of uncontrollable Laughter \" psychotic Delusion and NPD -Narcisstic Personality Disorder \"  induced by Pain from childhood. He laughs and Dances in a dramatic theatrical  way to his stardom seeking his spotlight as the \"King Joker \" among the Many  mass mentally unstable comedians in a socially unrest Gotham City, who have failed to make many audiences laugh, finally took to violence and grimace ,wearing the Mask and Paint. Can make you vulnerable and Sick for few hours post the movie that's how strong the plotline is .Sure to grab the  Oscar's Joaquin Phoenix for Grammy ,Golden Globe and many more awards for his masterful act.\nToddPhillips to join the Hall of Fame Directors Hollywood Walk of fame","label":0},{"review":"#DCnerd #Rant #Spoilerfree \nAnother year, another Brilliant movie from DC.\nI can't believe while typing this, but thank you Indian Censor Board for not editing this movie and letting the viewers see the directors vision.Todd Phillips what an absolute surprise, when I heard Joker was a part of DC black and Todd is directing I didn't think he'd make it, but man has he managed to surprise me. Joker in every essence is a masterpiece. Like every scene is a part of a jigsaw puzzle and all the pieces f ...MORE","label":0},{"review":"#DCnerd #Rant #Spoilerfree \nAnother year, another Brilliant movie from DC.\nI can't believe while typing this, but thank you Indian Censor Board for not editing this movie and letting the viewers see the directors vision.Todd Phillips what an absolute surprise, when I heard Joker was a part of DC black and Todd is directing I didn't think he'd make it, but man has he managed to surprise me. Joker in every essence is a masterpiece. Like every scene is a part of a jigsaw puzzle and all the pieces fall right into place, Todd has made sure you see it happening. To talk about Joaquin Phoenix as a comic book fan I think the biggest compliment I can give him is that he's finally a joker worthy enough to be compared to the great Mark Hamill, his laugh Haunts you, he manages to express his laughs in all situations and you feel it. I'd be lying if I said it didn't give me chills. The last time something like this happened was when I saw Batman, Mask of Phantasm. Joaquin's acting is top notch and this is the first movie I've seen of his, and I'm gonna zip through his other movies soon. The point of this movie is that it is gripping and it manages to hold its viewers, let it be through Todd's vision, Joaquin's acting or the music. It has all the right elements mixed precisely, and it makes you one with the character, I for once couldn't stop myself from dancing in my seat because the music is great and Joaquin is magnetic. If you love dark humour you will love this movie, if you don't like Joker states \"you wouldn't get it\". Comic book fans would know Joker does not have an origin story and they could have done anything with the storyline. They could have picked anything as a story, but they picked magnificence. As a comic book fan I had huge expectations and Honestly it has exceeded my expectations. My rant won't make any sense because this work of art cannot be described in words. You will have to go experience it, live it, feel the emotions and for once just once become one with a character. I've seen it twice already, but the experience is so good, I am gonna feed on it some more.","label":0}]