[{"review":"Nice film . Actually we want to spread awareness among ppl about safety of elephants . As recently most of the news coming about jumbo (elephant ) . I like animals and i don't want to see that they will be extinct in our near future . \n\nJay hind","label":0},{"review":"An inspiring movie for our kids from Akshay Kumar. I was very impressed at the first release of film. Now on releasing lion king. Memories of jumbo alived.","label":0},{"review":"This is very very good and i liked it because of ashkay kumar, he is a great actor and i think he deserves more than five stars, bollywood is very good and it is a great place to go, this movie is great for kids under the age of 0.2 years old.","label":0},{"review":"Best cinematic animated movie made by Bollywood..... It has become a cult childhood movie... Treat to watch it over 100 times... Loved the voice of akki","label":0},{"review":"This film is very interesting and fun because Akshay Kumar is king of actor alse good acting in dimple Kapadia ,Lara Dutta and also Raj pal Yadav ji.","label":0},{"review":"Elephants have great significance in Buddhism. Elephant is the national animal of Thailand.\nSo attractive scenario.\nSave environment. Save elephants.","label":0},{"review":"One of the best animated movies of bollywood! Brings back a lot of memories of childhood!","label":0},{"review":"Best animation movie. Awesome. It's my favorite","label":0},{"review":"I like jumbo 2 more than the first. The babies are so cute","label":0},{"review":"Really this movie is awesome.All cast appear as a great victory.","label":0},{"review":"Awesome!! The characters looks really cute","label":0},{"review":"This movie is the best time past one luv u uv","label":0},{"review":"A great film. Heart touching","label":0},{"review":"this movie cover is the funniest thing ive seen...legit deserves this rating","label":0},{"review":"Super b elephant🐘 jumbo \nMovie in brave elephant like scene.","label":0},{"review":"i like this movie because this is interesting jumbo story","label":0},{"review":"This is a great amazing and a adventurous movie","label":0},{"review":"This movi is the bestest movi in my eyes.","label":0},{"review":"this movie is amazing kids animation film","label":0},{"review":"THIS IS BEST MOVIE BUT JUMBO 3 AAB KAB BANEGA","label":0},{"review":"AMAZING MOVIE","label":0},{"review":"Nice Movie I Enjoyed It..","label":0},{"review":"Very fantastic movie","label":0},{"review":"Nice very good","label":0},{"review":"Very emotional and beutyfull movie.","label":0}]