[{"review":"This is my favourite movi an vivek oberoi and John Ibrahim acting as so powerful and per shot so relaxed....and injoy jungle tiger and most important save the tigers ajay devgan dialogue so slowly and look so   horror you know I am so excited any time see the movi hotel's and gest house so filing powerful I really injoy the movi","label":0},{"review":"Do watch this movie guys. The mixture of horror jungle and wild life is awesome in this movie. First half is a bit monotonous but second half compensate it with good thriller.Acting is good enough and overall it has a really different flavor","label":0},{"review":"One of best movie i have ever soon. What ever critics say does not matter for me. Best horror movie based on Wild life, Till the date...","label":0},{"review":"My favourite movie of all time, whatever the critics say about poor ratings of this film, its my favourite.. Awesome wildlife and the best part is the 3 tiger scene in the movie.....","label":0},{"review":"Greenish beautiful cinematography, Ajay Devgan performed really well Good support by John and ofcourse tigers 3,5/5 a different film well ahead of its time","label":0},{"review":"Shreeya Jain loves this film!!!!!!!!!! This was her childhood, no kidding! Pls watch, it’ll make Shreeya very happy! \n:D","label":0},{"review":"It's a superb movie. Ajay devgan acting was outstanding.","label":0},{"review":"I liked this movie . Ajay Devgan is super .","label":0},{"review":"The great movie of the great jungal  u no kigdom of god","label":0},{"review":"Awsome horror movie i think release part 2","label":0},{"review":"We need such nail bitting, good script films in bollywood.","label":0},{"review":"This is very nice movie and my favorite movie","label":0},{"review":"My favorite movie I love kaal","label":0},{"review":"Good and nice protection forest movie","label":0},{"review":"Outstanding","label":0},{"review":"Thrill & love to watch every time","label":0},{"review":"Amazing film one of my favorites❤😍","label":0},{"review":"I'm the biggest fan of John it's nice movie","label":0},{"review":"The film is very best performance","label":0},{"review":"My all time favorite movie 👌","label":0},{"review":"Good movie","label":0},{"review":"Kall Ajay role play best","label":0},{"review":"Good attitude all","label":0},{"review":"Absolute favourite!","label":0},{"review":"My favorite movie","label":0}]