[{"review":"Though Kaante is inspired by Reservoir Dogs  it is definitely better than the original.Kudos to director Sanjay Gupta for thinking out of the box and bringing novelty to Hindi Cinema.Even after 15 years of its release, it is still today's film. On the acting front, Amitabh Bachchan is brilliant as Major who has a value system even in the evil crime world.Sanjay Dutt is rock solid as the tapori,bad mouthed, trigger happy, non english speaking criminal Ajju. Suniel Shetty as Marc Issak is the surp ...MORE","label":0},{"review":"Though Kaante is inspired by Reservoir Dogs  it is definitely better than the original.Kudos to director Sanjay Gupta for thinking out of the box and bringing novelty to Hindi Cinema.Even after 15 years of its release, it is still today's film. On the acting front, Amitabh Bachchan is brilliant as Major who has a value system even in the evil crime world.Sanjay Dutt is rock solid as the tapori,bad mouthed, trigger happy, non english speaking criminal Ajju. Suniel Shetty as Marc Issak is the surprise package in the film.With a new biker look, he is sincere & earnest in his performance. He matches the high standards of Bachchan & Dutt at every stage.Mallaika Arora Khan and Suniel Shetty make a good pair who unfortunately cannot live happily everafter.Mallaika not only raises the tempetature with her moves but also is natural in the two scenes she has to act. Mahesh Manjrekar is superb as the hakla gangster with a bad past.He is a joy to watch.Lucky Ali makes a memorable debut as an actor playing the titlular role.Kumar Gaurav is watchable playing the simpleton amongst the criminals. Music,dialogues and cinematography of the film are its USP. They play a pivotal role in making this flick a CULT CLASSIC.  Rama Re,Chodna Chodna Chodna Re & Maut are still popular.\"Hindustani jaisa bhi ho, usse do cheeze pasand nahin :Ek hai Cricket main HAAR, doosra apne desh pe VAAR\" still resounds in my ears till date!","label":0},{"review":"Don't go on IMDb ratings this movie is upto the expectations I had from it before watching. What more can we say even Tarantino said that it is the best adaptation of Reservoir Dogs. Their are moments when the movie comes really near to the original, but it has it's own Swag.","label":0},{"review":"Awesome movie.. It’s one of my all time favourite Sanjay Dutt flick... Sanjay Dutt & Mahesh Manjrekar gave some of the best performances of their career... I love the interrogation scene, where police asks about a stolen truck....","label":0},{"review":"I watched this movie in the morning.. It's an awesome movie.. watching this movie.. I thought that this is today's movie.. and I heard about this movie that this is the remake of some kind of hollywood movie but I can say that It's definitely better than that movie..","label":0},{"review":"Fabulous movie...\nOutstanding performance by all actors\nSpecialy Sanju baba.mahesh sir and sunil And kumar gaurav sir","label":0},{"review":"Dark plot with bright cast, the film is based on the background of both the worlds of cops and robbers. Heist doesn't get better but has to bring back their lives in the process.","label":0},{"review":"Technically the most advanced movie ever mad in India. Superb dialogues and action.Amazing starcast, great acting.","label":0},{"review":"Superb movie with strong star cast dialogues and music score....it will remember for long time","label":0},{"review":"It is just amazing.\nThe action the thrill the co-operation. \nA-MA-ZING.","label":0},{"review":"Not even a remote comparison to Reservoir Dogs. Acting ok, the bank robbery scene was a joke. I watched it because it was so bad.","label":0},{"review":"ITS REALLY SUPERB,OUTSTANDING MOVIE FULL OF SUSPENSE,ACTION,SONGS.I LOVE IT👍🎸❤💓💛💜.","label":0},{"review":"I loved this movie. Watched it at 2AM. Music were awesome.","label":0},{"review":"I think campair of  Hollywood movie..\nGreat performance all actor s ..\nSpecially Sanju baba!","label":0},{"review":"I was a kid when I saw this, still watch it till today. This show is good","label":0},{"review":"completely western style movie but very nice and smart presentation I love this movie","label":0},{"review":"great movie all starcast is perfect and every song is meaningful","label":0},{"review":"Simply beauty.. This movie deserve 8.3/10 rating instead of Reservoir Dogs","label":0},{"review":"5 mins of silence for those who think it is better den reservoir dogs","label":0},{"review":"Great acting.\nStory is not at all good.","label":0},{"review":"Cult classic. Just watch it. You'll be amazed.","label":0},{"review":"Super flop direction....... Seems like duplicate peace of usual suspect and reservoir dogs.","label":0},{"review":"Sanjay dutt rocks....what a great display of sheer maschoism......","label":0},{"review":"Bollywood has turned into porn world now we don't have these types of movies now﻿.","label":0},{"review":"Whenever you go to check the best of sanju baba then it is always be there","label":0},{"review":"Best movie","label":0}]