[{"review":"This is the best movie...i ever seen in my life......I really love this film....n specially my favourite hero is shahrukh khan sir......I really love u SRK.......wants to meet SRK....once in my life......n K3G is my bestest n most favourite picture......love u all actors in this film...a...lot..n missing this movies now a day's...n whenever I see this film I can't control my emotions...eyes really always filled with tears while seeing this movie.....n I learnt so much nice things from this movie ...MORE","label":0},{"review":"This is the best movie...i ever seen in my life......I really love this film....n specially my favourite hero is shahrukh khan sir......I really love u SRK.......wants to meet SRK....once in my life......n K3G is my bestest n most favourite picture......love u all actors in this film...a...lot..n missing this movies now a day's...n whenever I see this film I can't control my emotions...eyes really always filled with tears while seeing this movie.....n I learnt so much nice things from this movie.....\n       Every scene in this film.....Is really amazing......n acting of all actors.is great.....amitabh bachhan sir....jaya bacchhan mam....shahrukh khan sir...kajol mam...hrithik roshan sir.....kareena kappor man......really I love this all actors.....\n      N my favourite hero is one n only one....SHAHRUKH KHAN......it is real that.....SRK is my role model of my life ...love u...missing K3G....a lot....\n    SRK's all movies are great n fantastic.....lovely....n best....!!!","label":0},{"review":"I have seen best movie of Karan Johar still far . Rest of his movies are nonsense . Really this movie was really good. Social message is there . You should always your parents and you should respect them. Don't respect them that they are providing you luxury benefits because they are earning money for your happiness so that you don't have too suffer from proverty . You don't have to do hardwork like them. Actors acting were  very good. Songs were very good specially that one bol choriyan bol Kan ...MORE","label":0},{"review":"I have seen best movie of Karan Johar still far . Rest of his movies are nonsense . Really this movie was really good. Social message is there . You should always your parents and you should respect them. Don't respect them that they are providing you luxury benefits because they are earning money for your happiness so that you don't have too suffer from proverty . You don't have to do hardwork like them. Actors acting were  very good. Songs were very good specially that one bol choriyan bol Kangna . Its18 years old movie. Still I don't get bored while watching at this movie .","label":0},{"review":"Their are some movies, which how many times u ever watch, never get old. Always give u the good vibes. And to say, this film surely does top the list. Hands down to this one. Always touches ur heart whenever you have a watch. I guess there's no other film better than this one which teaches u about the value of Family....","label":0},{"review":"Really good movie. And as we all know king of romance srk is here. So romance will easily happen. This is a good movie but the film was quite long 2 hours 45 min approximately. All the songs are really very good. And the dance in kehdo na u r my soniya was just seperb which was presented by hrithik and kareena","label":0},{"review":"Really awsm. I I watched this movie so many times and by watching this movie I also enjoyed a lot. Really fantastic movie . This movie makes me so much laugh. I really appreciate Kajol and karenna performance in this movie. Both haddone amazing acting in this movie.And the songs of this movie is really awsm. Truly speaking this movie is really a hrt touching as well as a memorable movie for me.","label":0},{"review":"Currently still watching this in 2019, this shows how AMAZING THIS MOVIE IS. Everyone is GREAT, the songs are LIT and I am gonna say this movie is the last real Bollywood Movie. Right now all the movies only are hits because of the exposure and nudity.\n\nALL SRK FANS MUST WATCH THISSSSSSSSS","label":0},{"review":"Superb film. I loved it. Sharukhan  plays his character lovely. Kajol is very nice in humour sense. Especially hrithik and kareena is very charming and so good looking. They played their role very well. Hrithik roshan dance is as usually good. Sentiment, comedy is mind blowing.","label":0},{"review":"Kabhi Khushi Kabhi Gham is one of the most accomplishments of Karan Johar . He deftly handles all the comic scenes in general and emotional scenes in particular. The Scene where Shahrukh took the decision to marry Kajol, first encounter between Shahrukh and Hrithik is astounding. The epitome of emotion is displ in last conclusive climax which is heart -moving. Amitabh Sir sparkles in the scene . All the casts delivered their respective parts well. Again towering performance of Amitabh Sir and Hr ...MORE","label":0},{"review":"Kabhi Khushi Kabhi Gham is one of the most accomplishments of Karan Johar . He deftly handles all the comic scenes in general and emotional scenes in particular. The Scene where Shahrukh took the decision to marry Kajol, first encounter between Shahrukh and Hrithik is astounding. The epitome of emotion is displ in last conclusive climax which is heart -moving. Amitabh Sir sparkles in the scene . All the casts delivered their respective parts well. Again towering performance of Amitabh Sir and Hrithik .","label":0},{"review":"Really missing this kind of movies now. Strengh of family bonding especially mother and son...  great story and direction...  Mr. KJ,,,  please do these kind movies....  I like all the performances especially Kajol's....  She is truly versatile.. Mad and crazy Anjali ... One of best till to date .... Good film","label":0},{"review":"This film had it all big director, production house and an ensemble star cast. From legends like Amitabh and Jaya Buchchan, to Mega stars like Shahrukh Khan, Hritik Roshan, Kajol, Kareena Kapoor, and Rani Mukherjee it just too good. And all the hype surrounding it. Plus the music was another great factor. Title track, Bole chudiyan and Suraj Hua. Thanks.","label":0},{"review":"A family movie like this was never made and can never be made! Every scene in which SRK is featured is worth to shed a tear drop! Class and splendid performances by all the actors. The confrontation between SRK-Amitabh in the end is the best scene ever and even now when I watch that scene,  I cannot control my emotions!","label":0},{"review":"This movie spoilt me gave me wrong picture of London😂. I went for holiday there booked an apartment at Mayfair (paid a heavy duty price) thinking about k3g. But..... What a shocker I got 😱 .the apartment was Lil bigger than servants quarter of bungalows here. And voila what expensive place it is. I loved London but not the price which came along with it. I am saying cos I went to London cos of k3g.","label":0},{"review":"what an extravagant piece of garbage... people arriving home in helicopters, living in royal palaces.. I was so turned off by phony dialogs and pretentious acting, that couldn't tolerate for longer than 10 mins.. I think, certain people should stop making movies, or at least learn the difference between showman-ship and show-off ship..","label":0},{"review":"I love this movie sm omgomgomgomgomoomgomgomgomgogm like bruh best movie of my life hands down. I was like a week old when it came out and I was crying bruh. Not because I was a week old, but because it was like a v nice film. 10/10 would watch 10 times again. SRK never fails he never fails bless his soul","label":0},{"review":"The film is really amazing.. Moreover SRK and Amitabh Bachchan sir, even everyone was amazing and took it to another level. The emotions were so real and Aryan Khan aka junior Rahul was supper.. Love it since childhood.❤","label":0},{"review":"After seeing the video Bole Churiyan, I had to see the movie.  I finally found the movie and watched it without English subtitles.  That was no problem.  I still enjoyed it so much!  It was great to see the 3 superstars together in one film.","label":0},{"review":"10/10 would recommend the most hindi movie ever made so dramatic every indian person has watched this. You sould too not even indian I'm tamil that's how good this movie is. Watched it so many times as a kid and now.","label":0},{"review":"The deleted funny scenes from the movie would have made it more interesting. \n\nThey could've dropped those extra sob, sob, sob 😭 by Hrithik, Sharukh which looked completely forced upon & some utterly useless songs like deewana hai dekho.\n \nI get bored, even to this day I take loo breaks during these scenes.","label":0},{"review":"I watched it more than 8 times and i love the pairing of hritik- kareena and sahukh- kajol. really it is a legendary movie of karan johar and a best movie to watch with your parents","label":0},{"review":"I watched this movie a lot of times, literally, I loved this one......what a movie, Full of humor,  sentiment drama, which makes u  fall into love with this one....mother's sentiment will definitely make u  cry. If u are still didn't watch the movie, I will suggest this movie to watch in free time because of its such a length.","label":0},{"review":"The bestest movie I've seen.. Full of emotions... Bonds n laughter... Great movie I must say.... Lovely bondings between husband n wife, lovers n two brothers n mother n sons... 👌👌😍😍💞💞💗💗","label":0},{"review":"Well, the film is okay. The concept and storyline is good.\nHowever, at many instances, the clouds of a disease called overacting get casted all over and that to me is quite unnecessary.\n\nA 3/5 film","label":0},{"review":"Excellent performence of sharukh khan sir and hrithik roshan sir, best acting of amitabh bachan sir,kajal mam.,ms. kareena kapoor ji,jayabachan mam,best direction of karanjohar sir,amazing music, romantic,emotional and touching movie.","label":0},{"review":"it was such a great movie to watch. it was a very fun film. why isn't this film on netflix anymore? I miss seeing those dharma productions movies on netflix.","label":0},{"review":"Nice movie and expression emotional \nPower by technically best wishes \nKaran kapoor and best movie and method\nSo proudly songs and dancing best \nDifferent things some reason why is there\nShahrukh sir hrithik sir so wonderful \nRocks movie style good luck for movie","label":0}]