[{"review":"Karan, the Stanley Kubrick of Rajouri Garden, the master. He brought to our hungry eyes and ears his magnum opus. Just like Leonardo painting the Monnalisa of Bollywood, but with Monnalisa gone to the restroom and Leonardo being the ninja turtle. This movie is absolutely gorgeous, with its sense of humor, through the jokes of a very horny, but not really horny Shava Shava man, with the many clever comments of Dev (remember his football story? me neither) thanks to his high IQ of 20 laks. A littl ...MORE","label":0},{"review":"Karan, the Stanley Kubrick of Rajouri Garden, the master. He brought to our hungry eyes and ears his magnum opus. Just like Leonardo painting the Monnalisa of Bollywood, but with Monnalisa gone to the restroom and Leonardo being the ninja turtle. This movie is absolutely gorgeous, with its sense of humor, through the jokes of a very horny, but not really horny Shava Shava man, with the many clever comments of Dev (remember his football story? me neither) thanks to his high IQ of 20 laks. A little bit of spiciness is added in the scene where Maya is wearing the sexy outfit (the Shava Shava dance is more sexy than that) and is carrying a whip. But of course, to make things sexier she is also blindfolded. This means that the poor Reishi, who just wants to have normal sex with his wife, will have to see her blindfolded, whipping around the house and, eventually, hitting him in the forehead. Good thing she later falls in love with Developer, so he can whip his nose off. The characters meet by accident 87 times in the same location, cause let's be honest, New York is not that big, it's easy to bump into the same 5 retards every hour. Space and time of course do not operate the same in indian movies, as Einstein explained in his theory of bollywoodian motion. So Maya can teleport easily from the weeding venue to rhe central station of New York in 10 minutes. But wait, this is a  criticism to the master, not good, Karan can only make goodness and he decided to bless us mortals with his art. Thank you Karaln,namaste","label":0},{"review":"Very good movie. Shahrukh and Rani have nailed it when it comes to performance. Songs are very enjoyable. Coming to main story, it may be received differently by different type of audience. But in my opinion Karan has depicted the things married people go through in a unhappy relation is most precise way. We see Maya and Dev both trying to work out their respective marriage but only to fail in the end. Small small emotions of jealousy, adrenaline rush when you see your girl held by others, etc a ...MORE","label":0},{"review":"Very good movie. Shahrukh and Rani have nailed it when it comes to performance. Songs are very enjoyable. Coming to main story, it may be received differently by different type of audience. But in my opinion Karan has depicted the things married people go through in a unhappy relation is most precise way. We see Maya and Dev both trying to work out their respective marriage but only to fail in the end. Small small emotions of jealousy, adrenaline rush when you see your girl held by others, etc are shown excellently.\n\nIn the end, both don't reveal to each other that they had separated from their partners since three years which was not realistic. I mean the wait time could have been reduced to 6 months or so to make sense.\n\nApart from that , movie is a must watch.","label":0},{"review":"This movie was very hard for me to watch but I was hoping for a good ending. I saw the damage of my uncle's infidelity and what it did to my aunt & cousins that none of them believe in marriage. Never was this deception done out of \"true love\". Only pain & suffering results from this for many people. In this movie, the little boy wasn't even really treated well by the dad until he was broken hearted. So what happens when Dev and Maya's marriage has a crisis? Move to the next \"true love\"? Plus th ...MORE","label":0},{"review":"This movie was very hard for me to watch but I was hoping for a good ending. I saw the damage of my uncle's infidelity and what it did to my aunt & cousins that none of them believe in marriage. Never was this deception done out of \"true love\". Only pain & suffering results from this for many people. In this movie, the little boy wasn't even really treated well by the dad until he was broken hearted. So what happens when Dev and Maya's marriage has a crisis? Move to the next \"true love\"? Plus the the old man \"dude\" was so perverted just because his wife died?! Not something I would recommend to anyone who wants to watch a good love story. Btw, great acting, just didn't make me want Dev and Maya together at the end.","label":0},{"review":"This movie was way ahead of its time. Initially, I didn't understand the concept of this movie. But now the movie does make sense to me. You may not be married to your soulmate.   Your marriage may not be a happy one. That doesn't mean you should be stuck within it and let yourself suffer. Everyone has a right towards their own share of happiness. Its never too late to start afresh. \nKaran Johar has sensitively potrayed the message underlying beneath the film. Excellent chemistry between Rani an ...MORE","label":0},{"review":"This movie was way ahead of its time. Initially, I didn't understand the concept of this movie. But now the movie does make sense to me. You may not be married to your soulmate.   Your marriage may not be a happy one. That doesn't mean you should be stuck within it and let yourself suffer. Everyone has a right towards their own share of happiness. Its never too late to start afresh. \nKaran Johar has sensitively potrayed the message underlying beneath the film. Excellent chemistry between Rani and Srk. Amazing cast. A big thumbs up!","label":0},{"review":"An interesting concept,  ahead of its time. However the songs,  costumes and poor and predictable attempt at throwing comedy into this already confusing mix,  just made it harder to watch.  The ending was disappointing.  I struggle to support a movie which romanticizes the art of betrayal and infidelity.  What was the director thinking when making this movie? Some people will watch anything as long as the cast is strong and songs are catchy","label":0},{"review":"A beautiful movie and required a very mature audience to understand it.\n\nThe first half is a joy ride, you will never laugh so much in a Karan Johar film ever. The second half is intense and gripping.\n\nEmotional roller coaster ride and man the best....I repeat the best cinematography ever in India.\n\nThe colour combination is mind blowing, must watch especially for Tumhi Dekho Na.","label":0},{"review":"I cannot believe it got such a low rating.  It was an excellent film.  It is a film that leaves you thinking and one great for discussion afterwards.  We talk about these issues posed in this film often.  Maybe the topics hit too close to home for some people or they did not like seeing SRK in a role like that but I loved it.","label":0},{"review":"KANK is an unmatched story and film. It always surprises me and my wife why Karan has stopped making movies as this and k2H2. He is a human who rarely births. Believe me, given chances at least fifty% of married couples opts their new lives to live the way they want, after the point when social conditioning starts melting. Love you Karan.","label":0},{"review":"bakes movie! this is the movie made by handicapped person with his feelings… how you can show if there is no problem with life legal partner and they are going into another relation,  cheating  husband or wife.. just because you need new body to enjoy… if you are married and there is nothing wrong with the relation then you can not spend time with somebody else and can not love anybody… these are the movies which are giving wrong message to audience … director should be banned ..","label":0},{"review":"Best Movie , It's generally Made for the People Who loved someone in their life but never Got their Love ,The movie is Quite Emotional And Heart touching ❤️ SRK the best Actor no doubt The Background sound is Superb , All the Supporting Actors we're perfect , KJO Has done his Job Brilliantly","label":0},{"review":"A movie way ahead of its time.Nice story essayed so beautifully by its lead actors.A dreamy Tumhi dekho na and a heart touching Kabhi alvida na kehna.I feel some people were left uncomfortable with the story or rather they preferred to judge and not understand the emotions the way it was, that sometimes love and some marriages can happen or be like that, it's not about who's nice and right and who's not. Admit it or not, such feelings and stories do happen in reality even if they are not spoken  ...MORE","label":0},{"review":"A movie way ahead of its time.Nice story essayed so beautifully by its lead actors.A dreamy Tumhi dekho na and a heart touching Kabhi alvida na kehna.I feel some people were left uncomfortable with the story or rather they preferred to judge and not understand the emotions the way it was, that sometimes love and some marriages can happen or be like that, it's not about who's nice and right and who's not. Admit it or not, such feelings and stories do happen in reality even if they are not spoken about or met with the same end.","label":0},{"review":"I think it is a practical movie about love and life.our life is short to do everything right and love only happen once and it doesn't matter you are married or not. so if you fall in love you should accept it if you know love you can understand the movie and meaning of it.that real world is not a fairytel like other movie show.","label":0},{"review":"Kabhi Alvida Na kehna was the biggest bollywood blockbuster outside INDIA surpassing another SRK starrer Kabhi Khushi kabhie ghum !! The movie plot and story was definitely ahead of its time atleast for INDIAN audiences !! When I watched this movie in my childhood (14 years) I did not understand but now I loved every scene of this cult movie !!","label":0},{"review":"The porosity, Gravity, eccentricity and exuberance of flick was way much ahead of it's time. I see some people criticising the plot, specially the end but I must tell you, things and judgements don't always go as planned. Try to find yourself in the given 4 protagonists of the movie and it will churn out it's essence to you. What has happened to Karan Johar now, I reckon! SOTY?? Smh!!","label":0},{"review":"I was in College that point of time. Didn't find it good that time since the story was absurd according to me. Now after 12 yrs, after seeing the world, having learnt to be practical in life, realised that this movie was very much practical. Need maturity to understand that the plot shown in the movie is possible with any human being.","label":0},{"review":"Its superb amazing AND the chemistry between SRK & Rani was amazingly bonded with emotions and love! Bottled up feelings between two families and its very hard to watch the emotionally bonded couple.It was a great twist of unexpected ending! Well done Karan Johar!","label":0},{"review":"O my God! This is the best love-traingled movie ever!! The director has directed the movie very thoughtfuly and the actors has acted very good and the music is composed very tatefuly, particularly the title track is my favorite! The movie has a sweet end which makes the watcher after watching the movie feel light-hearted.","label":0},{"review":"What a beautiful movie.Wow. Just wow. I have no words.No. Words.\nMujhe kabhi alvida naa kehna hai. Don't watch if you don't like tears cause hai rabbah is this a tear jerker.\nRaani does a great job acting! But Sharukh, wow.\nStanding ovation!!!!\ngo bollywood!!","label":0},{"review":"Initially, I didn't like this movie but now when i see this movie, I can understand the emotions and feelings hidden in individuals. Too good movie to be released during that year. Audience didn't receive it properly but I think all of us should come out of this social stereo type thinking of \"AAadarsh family and Bahu\" and start seeing things more practically.","label":0},{"review":"When I saw this movie during college time I felt how can wife cheat husband & move on to another person.i hate this movie.bt when I got married I feel like the role of Rani Mukherjee in this film..bt I can't do nothing because I love my husband even though he don't love me that much.Thank you sooo much...sir..The persons who faced that similar situation only understand emotions and feeling..others will think it's a cheating movie like I thought before.","label":0},{"review":"Suceess of true marriage is lot of adjustment and commitment toward partner...helping and understanding each other in hard times..Indian culture and ideology of marriage is great..\nBut this movie is giving wrong message to society..specially to youth..","label":0},{"review":"Yea...a very way ahead of its time movie...i too couldnt get it when i saw it but as years pass by...you can clearly see what johar was trying to say...why do we act in our marriages??why hypocrisy when transperency is needed the utmost and above all...when you are in no way attached to each other in any way...and making a big fuss of every little things that passes you by...whats the point in staying together???is it called a marriage???in what world and what language???we need social reforms i ...MORE","label":0},{"review":"Yea...a very way ahead of its time movie...i too couldnt get it when i saw it but as years pass by...you can clearly see what johar was trying to say...why do we act in our marriages??why hypocrisy when transperency is needed the utmost and above all...when you are in no way attached to each other in any way...and making a big fuss of every little things that passes you by...whats the point in staying together???is it called a marriage???in what world and what language???we need social reforms in our days too...thanx laran johar for the film...absolute truth!!","label":0},{"review":"This was the best indian romantic movie I've ever watched\nIt wasn't a cliche\nThe movie broke lot's of taboos\nStoryline was amazing\nPerformances was brilliant\nIt couldn't be better\nLoved it!","label":0},{"review":"One of the underrated movies, gives the unlearned lessons of the relationships. Amazing performance by all the actors. Give it a watch patiently if you haven't.","label":0},{"review":"Worst movie I have never seen in my life. Storyline presentation direction was horribel. Actors acting were rubbish. Accept shri amitabh bachchans acting was good. Only songs were good. 😤😤😤","label":0}]