[{"review":"You would definitely watch something which you can root on for ages. Well, there are many movies, and Kahaani is on the top-notch.\nThe reason is- no, not because I am a Calcuttan and this movie is all about it. It is about definitely true emotions. With this movie, my respect for Sujoy Ghosh sir has increased. I am a mythology person, and the way he re-tells amazing Hindu chronicles in these times is what I like about him. Two examples- Ahalya and Kahaani. \nIf you are Bengali Hindu living in Kol ...MORE","label":0},{"review":"You would definitely watch something which you can root on for ages. Well, there are many movies, and Kahaani is on the top-notch.\nThe reason is- no, not because I am a Calcuttan and this movie is all about it. It is about definitely true emotions. With this movie, my respect for Sujoy Ghosh sir has increased. I am a mythology person, and the way he re-tells amazing Hindu chronicles in these times is what I like about him. Two examples- Ahalya and Kahaani. \nIf you are Bengali Hindu living in Kolkata, there's no way you don't know about Asuradalani Mahishasur Mardini Maa Durga. She killed demons for the sake of humanity's protection. The protagonist Vidya 'Bidda' Bagchi is Durga. \nThis movie is 5/5.","label":0},{"review":"A true story knitted well  and executed splendidly. The protagonist and the antagonist both make their presence felt especially the negative character . Indraniel Sengupta as the rogue black ops agent of IB shines in his role.  Supporting casts  support the film throughout. Watch it for a reasonable engaging story . Some of the scenes are worth engaging. The climax is not predictable that is why I loved the scene in which the antagonist is subdued underhand . Kudos to Sujit Ghosh.","label":0},{"review":"Though she is not her own daughter , still saves her without giving up thinking nothing related to her , vidya puts her self in mini's shoe , understand the oppression she is going through\n\nVerily Allah has created something most beautiful if I had to say is women ,  as a mother , sister , wife and daughter , in my view a women is more capable than men in regards with raising their children , for this they sacrifice up to extent that men cannot even think about it .\n\nSeriously , this movie has v ...MORE","label":0},{"review":"Though she is not her own daughter , still saves her without giving up thinking nothing related to her , vidya puts her self in mini's shoe , understand the oppression she is going through\n\nVerily Allah has created something most beautiful if I had to say is women ,  as a mother , sister , wife and daughter , in my view a women is more capable than men in regards with raising their children , for this they sacrifice up to extent that men cannot even think about it .\n\nSeriously , this movie has very good to me, a raise hands up to heavens and supplication to Allah , that Vidya be healthy , successful in both worlds.","label":0},{"review":"Amazing movie . Storyline direction was superb. actors acting were awesome. Specially  Nawazuddin siddiques acting was superb after playing the role of police officer in kahani. And here he has played the role of langro . Too good. storyline presentation was superb . Actors acting were too good. Thrilling story was there in this movie. Keep it up Sujoy sir. Carry on with your film making.","label":0},{"review":"One of the best movies based in Kolkata, although almost all Kolkata based movies are great. This one stands out 🙌 Sujoy Da has created magic onscreen, Bidya madam is that magic, Rana Da and Mr. Khan are superb as usual. A great watch and full paisa vasool ❤️","label":0},{"review":"It's a great, brilliant movie with amazing direction and mind blowing acting. The movie was well written and presented in a beautiful manner. In the last whatever we expect considering it to be a bollywood movie  everything seems to be untrue. Great acting by Vidya Balan. Loved the movie...","label":0},{"review":"Amazing movie.. I mean I  can't describe..I loved the movie 100%..not even a single second of the movie I felt unnecessary..everything was so well directed..n I felt satisfied after watching it..n now I love Vidya balan and Parambrata chatterjee..such a mind blowing movie.. I wish every movie was like this..I just loved it and I recommend it to everyone..❤❤❤❤","label":0},{"review":"A brilliantly mounted thriller marred by an insipid, ridiculous climax. What a letdown. But I'll still give it a thumbs up for its sweeping imagery of Calcutta city, for diving into its streets, alleys and unmistable characters and maintaining the grip of a thriller, throbbing with suspense.","label":0},{"review":"Held my attention from start to finish. A must see. This movie infact spurred interest in me to see Kahaani 2. A great thriller with an unexpected ending. Vidya Balan and Nawazuddin Shaikh are amazing.","label":0},{"review":"I saw this movie in Kolkata PVR, just after landing ! It’s one of the best suspense movie with a class performance by every participant. Can be seen any time and admired !","label":0},{"review":"One of the best masterpieces of Bollywood thrillers, Kahaani takes us to a new world, surrounded by interwoven conspiracies. Worth mentioning the acting skills and the shooting style. One of the best portrayals by Sujoy Ghosh.","label":0},{"review":"The ending was pretty good. A pregnant woman left alone with the killer... had me wondering how Bollywood could even come up with a plot like that till i saw “Taking Lives” a 2004 crime/action hollywood movie starring Angelina Jolie. Its like Bollywood has to take something from somewhere to go a lil far!!!","label":0},{"review":"It's a masterpiece and a must watch. One of the best bollywood thrillers I have ever seen. A plot full of surprises and excellent acting.","label":0},{"review":"It's really awesome mistress Bollywood movie..I watched it lots of time ..Vidya/bidya really a great actress also the navaj sidhagi...I'm big fan both of you ..her acting outstanding..Vidya is always best ..when I waching   this move ..I want whatch it repeatedly..","label":0},{"review":"Amazing & Powerful no matter how many times you Rewatch this Masterpiece from Hindi Film Industry. Superb Script & Gorgeous Acting by the Lead Actor Vidya Balan! 5/5","label":0},{"review":"This is want we want to need from Bollywood movies,the best ever thriller movie I have ever seen.\nThe acting of vidya,nawaz, and others they are really mind blowing.an complete all 5/5 star movie for me....","label":0},{"review":"The direction and the cast need to be applauded, they have done a tremendous job in keeping the movie as simple as possible, story is very strong, and true Bengal culture has been presented","label":0},{"review":"A mind blowing Story with beautifully played by all actors majorly by :\n1. Vidhya balan \n2. parambrata\n3. Nawazuddin\n\ngreat movie and must watch. Should be rated above 9.","label":0},{"review":"The movie was awesome and story is really mysterious .I love this movie.My interest was increasing when movie is goes on.Acting is  superb of vidya balan and all the actors .The ending is surprised me so much.","label":0},{"review":"Great film . Enjoyed the thrill and suspense. Looking forward to seeing more bollywood films made in this genre.","label":0},{"review":"A story is mind boggling with such great acting by Vidhya (Bidhya 😂). Thank you for such kind of Bollywood movie which is nowadays tough to find.","label":0},{"review":"This was one of the best movies I had ever seen....the climax had left me spellbound😮 Vidya Balan has proved her versatility and Rana is just amazing😎😎😎😎","label":0},{"review":"Oh my word.What a great film.Hats off to all behind this cinema.Must watch .Even better than any of the hollywood thriller movies.","label":0},{"review":"When you are watching the movie, you will have this thriller feeling inside your chest which keeps you at the edge of your seat, a must watch, well done to the whole cast👏","label":0},{"review":"Kahani is a Intense thriller with lots of surprises hidden beneath the ground, Vidya Balan is Gracefull and Amazing in the flix, Gosh just rocked the screenplay and presentation!!!!!","label":0}]