[{"review":"Amazing movie ..\nWorthy to watch more than 1 time. Rajkumar Rao, Sushant Singh Rajput, Amit Sadh ,all 3 were fabulous.Great acting by all 3 and Manav Kaul too gave great performance.\nCinematography was good .\nMusic album is just too good .Amit Trivedi does hi job in the best way he can.\nAbhishek Kapoor's direction is very well seen in the movie. Very gripping story and screenplay .I will give it 3.5 out 5.Just watch it.","label":0},{"review":"Wow, what a nice film based on Gujarats earthquake on 2001 and Godhra Kands riots in 2002 which is based on these three friends life.The director has very nicely arranged the story of these friends and the story is full of wow...\nspecially an intresting character and a movie is also based on cricket Ali hashmi..\nThe film also goes on cricket story it is also nice for people who are cricket lovers like me...😅😅😅...\nThe film is very good and all the actors have acted so nicely according to story ...MORE","label":0},{"review":"Wow, what a nice film based on Gujarats earthquake on 2001 and Godhra Kands riots in 2002 which is based on these three friends life.The director has very nicely arranged the story of these friends and the story is full of wow...\nspecially an intresting character and a movie is also based on cricket Ali hashmi..\nThe film also goes on cricket story it is also nice for people who are cricket lovers like me...😅😅😅...\nThe film is very good and all the actors have acted so nicely according to story.\nSushant singh Rajput,Amit Sadh and Rajkumar Rao has acted so nicely in the film..\nIt is a 100 out of 100 film for me....\nALSO Films songs are so nice andsuits the story...anyone who  watch the movie gains so intrest about it on watching the movie by sounds and acting by all actors...\nMustt watch film it is 5/5 rating by all audience...","label":0},{"review":"Guyz...I know dat this film has already got many positive reviews......but let me keep it clear .....\n...if u watched d film,before reading the book(THE THREE MISTAKES OF MY LIFE) written by CHETAN BAGAT..the film was wonderful..,superb n extraordinary. ...\nBut if u read the book first n then watch the movie.... it'll make u dissatisfied...n somewhere disappointed tooo...while casting the film...they have eliminated some parts of the scripts.....they casted the film in pure gujarati way...in fil ...MORE","label":0},{"review":"Guyz...I know dat this film has already got many positive reviews......but let me keep it clear .....\n...if u watched d film,before reading the book(THE THREE MISTAKES OF MY LIFE) written by CHETAN BAGAT..the film was wonderful..,superb n extraordinary. ...\nBut if u read the book first n then watch the movie.... it'll make u dissatisfied...n somewhere disappointed tooo...while casting the film...they have eliminated some parts of the scripts.....they casted the film in pure gujarati way...in film the shop name was Sabarmati cricket shop...but in book it was (team india cricket shop)...which was more connected n close to the hearts of the readers n cricket fans.... similarly some tiny tiny pleasures are missed out in the film....otherwise the film is extraordinary....hope u understand the difference","label":0},{"review":"The movie walks us through childhood friendship, it's evolution into adulthood, varying ambitions, complicated relationships and a perspective on humanity, violence, hatred and redemption. Superb direction, colossal cinematography, and flawless performances by the entire cast especially the leads with starstriking, towering performances from the newcomer Sushant Singh Rajput and the infallible Rajkummar Rao. The movie leaves you full of love, tears, anguish and makes you root for it in every way ...MORE","label":0},{"review":"The movie walks us through childhood friendship, it's evolution into adulthood, varying ambitions, complicated relationships and a perspective on humanity, violence, hatred and redemption. Superb direction, colossal cinematography, and flawless performances by the entire cast especially the leads with starstriking, towering performances from the newcomer Sushant Singh Rajput and the infallible Rajkummar Rao. The movie leaves you full of love, tears, anguish and makes you root for it in every way. A winner through and through!","label":0},{"review":"This is one movie where the director has poured his talent and love! Based on what true friendship, sportsmanship, equality this one has covered the right means of loving your nation . Nothing will be attained by hatred! Beautiful movie!","label":0},{"review":"Ohh my god! A total brilliance, this movie had such emotional scenes ,i am literally crying .What a fantastic movie this was ,it showed reality,humanity,friendships and more things ,words cant describe this movie ,the last flim which made me cry alot was Rang de basanti,this movie also have high standards, Everything was perfect about the movie whether its the story ,songs, background music literally everything, All the actors did their job perfectly My ratings for the movie is   10 OUT OF 10","label":0},{"review":"After 3idiots this was one of the movie which blowed up my mind, with deep friendship and life reality. Amazing movie must watch. Actors are totally awesome.  Great direction, cinematography, story,  music....\nMy rating 5/5....😍","label":0},{"review":"Fantastic movie. Storyline direction is fabulous. Actors acting superb. Motivitional movie. Songs real good. Nice movie it's far better then 3 idiots. Good job by the entire team of Kai Po Che!.  I have seen these movie.1234.","label":0},{"review":"Really appreciate this movie cause the story line is so fantastic that a person can't take there eyes off from the screen even for 1 sec ...the story play is really greatly done by all the actors .......Heartmelting, true friendship, and many more morale are reflected through this movie like about our society, attitude towards other religion....Kodoss to this movie","label":0},{"review":"Just watched the movie . Exceptionally mind blowing ... One of the fantastic movie I have ever saw. Great plot , great message, great acting, great actros ...lot more to say but rightnow I am speechless. Highly recommended. #kaipoche","label":0},{"review":"If I was asked to make a movie on Chetan Bhagat's novel- it would be this one.It has everything-Romance,Dreams,Passion,Politics & a Disaster.\nAll the main characters including Amit Trivedi with his melodies do justice to their roles.A must watch for cinema lovers.","label":0},{"review":"Please guys do watch this movie. \nThis Spectacular drama film contains everything. Love, friendship, mistakes, sucess. I can't describe it in words. \nBest movie I've ever seen till now.","label":0},{"review":"Superb movie.\nAll actor has acted very good.\nThis movie show the deep friendship between three and also show the Gujrat 2001 earthquake and godhra kand riots in this film by director. Must watch","label":0},{"review":"Wonderful movie which showcases the value of friendship . I like ishaan a lot bcz he is not ambitious , religious and very humane and also I like omi who had very good heart but his path changed due to bitto.","label":0},{"review":"One of the best movies of Bollywood. It shows friendship of three person who have different perspective towards life. Beautifully directed by Abhishekh kapoor.A Heart touching story....","label":0},{"review":"My favourite movie ...I was there at shooting time...Everything about this movie is just awesome...A must watch movie...All the songs are very heart touching and Supreme.\n\nBrothers For life ! Gattu you rocked !","label":0},{"review":"suprb movie awsome casting 3 friends dream and the journey through their life which they faces all circumstances etc which was fanstactically captures i liked the movie so much and everyones reviews will not be the same","label":0},{"review":"sushant singh rajput's best performance ....rajkumar rao is good like  always....the movie story is just mind blowing...and every person in this movie is good..songs are brilliant...in last seen i almost crying.....overall this movie is my one of the best bollywood movie i ever seen....","label":0},{"review":"Want to recommend it to every indian out there reading this a fabulous movie and everyone's acting was just superb I hope all three come together in another movie 😍😍","label":0},{"review":"Friends are that siblings which were chosen by us.....friendship never ends no matter what circumstances  come as hurdle .....thats the story ..so heart touching  ,screen play was amazing. .....anytime  watch ....according to me","label":0},{"review":"Most practical genuine nd touching story.till dated I had not seen d movie but now after watching it I cn say d best one.sushant is best.","label":0},{"review":"It is best of bollywood... I found very interesting in it... Being gujrati i felt very proud. Once must watch film.","label":0},{"review":"Great movie....I have read the book which was just a time pass read But the movie is far better than the book.the emotions and the thoughts are beautifully conveyed without words.","label":0},{"review":"LAST HEART BROKEN SEAN MAKES THIS MOVIE AN EMOTIONAL TURNOVER. INCREDIBLE STORY INCREDIBLE MOVIE.\nWATCH IT MORE THEN 1 TIME PLEASE","label":0},{"review":"A nice movie, worth watching every minute of it. It leaves you with emotions and yearning for such a friendship.","label":0}]