[{"review":"SRK plays 'Aman' (no Rahul or Raj) this time. It revolves around a woman's insecurities & how an angel \"Aman\" enters her life to bring beautiful changes leaving lasting memories in her life. Preity pulls off the role of Naina Catherine Kapoor Patel very well. Saif plays a happy go lucky guy who realises value of his beloved friend Naina only after she falls for Aman. What thrills the audience is the unconventional ending. The songs are amazing; all of them being superhit. The dialogues are unfor ...MORE","label":0},{"review":"SRK plays 'Aman' (no Rahul or Raj) this time. It revolves around a woman's insecurities & how an angel \"Aman\" enters her life to bring beautiful changes leaving lasting memories in her life. Preity pulls off the role of Naina Catherine Kapoor Patel very well. Saif plays a happy go lucky guy who realises value of his beloved friend Naina only after she falls for Aman. What thrills the audience is the unconventional ending. The songs are amazing; all of them being superhit. The dialogues are unforgettable to every SRK fan. One of his best performances. \n\nOverall: This classic love story is the favourite of every 20s something person. A must watch! 👌👍","label":0},{"review":"Kal Ho Naa Ho is a romantic-drama in its truest sense.This film will take you to a rollercoaster ride of heartfelt emotions like- laughter, crying and drama. All the characters specially the trio (Aman,Naina and Rohit) and Jennifer will leave an impact on you. The album is one of the greatest to come out of Indian Cinema. It's the album and the background score that adds up to the emotions in literally every scene. You'll just love the songs and the score. The story by Karan Johar is a creative  ...MORE","label":0},{"review":"Kal Ho Naa Ho is a romantic-drama in its truest sense.This film will take you to a rollercoaster ride of heartfelt emotions like- laughter, crying and drama. All the characters specially the trio (Aman,Naina and Rohit) and Jennifer will leave an impact on you. The album is one of the greatest to come out of Indian Cinema. It's the album and the background score that adds up to the emotions in literally every scene. You'll just love the songs and the score. The story by Karan Johar is a creative genius 👏. All-in-all this film will make you cry even if you're the most rigid person. Great film. 4/5","label":0},{"review":"Before you all watch this movie, bring a bunch of tears for this movie is going to make you cry from the bottom of your hearts. It was the best Bollywood movie ever. It has so much value to it. Shahrukh Khan sir's acting has put me to tears. Sometimes when you put your mind to it you can do very well in acting. Preity Zinta's acting is flawless!!!!!!! She really proved in this movie she can act. Said Ali Khan's acting was also good. Really loved all the songs. If you are a person who likes Bolly ...MORE","label":0},{"review":"Before you all watch this movie, bring a bunch of tears for this movie is going to make you cry from the bottom of your hearts. It was the best Bollywood movie ever. It has so much value to it. Shahrukh Khan sir's acting has put me to tears. Sometimes when you put your mind to it you can do very well in acting. Preity Zinta's acting is flawless!!!!!!! She really proved in this movie she can act. Said Ali Khan's acting was also good. Really loved all the songs. If you are a person who likes Bollywood Movies you should give this a try. Anyway Happy Bollywood Movie Day to you all Have Fun and be safe.🤗","label":0},{"review":"The most amazing movie ever made in history, I personally love this one with all my heart, great acting by all the actors including Shah Rukh Khan, Priety Zinta, Saif Ali Khan, Jaya Bacchanan, Reema Lagoo, Sonali Bendre, Delnaz Paul. Great storyline with tearjerking plot twists and light hearted comedy and hit songs. A must watch for everyone.","label":0},{"review":"A Bollywood film so superbly made that it has won all the hearts of 2 generations . A film to cherish in the history of Bollywood for years to come. \nRight from the production, casting, storyline and direction of photography, everything was just so perfect and absolutely made with 100% efforts from the YashRaj Films. \nCheers to one iconic movie of lifetime.","label":0},{"review":"I choose Bollywood movies from the ratings and also if I love the beautiful YouTube music and scenes. \nI don’t usually watch the trailers or actually read the reviews. \nI have watched about 6 Bollywood movies now with excellent ratings. \nI finished this movie before bedtime. I couldn’t stop crying!  Such sacrificial love was portrayed. \nThe subplots were all carefully developed and tied up nicely. \nWonderful movie but I wouldn’t finish it before going to sleep!!!!","label":0},{"review":"Best emotional love movie ❤️❤️❤️. Sharukh Khan and pretty Zinta acting was marvellous. Saif Ali Khan acting also very good in supporting role. Congrats to the director who made this wonderful love film and bgm is also fantastic with good emotional feelings. I totally loved this film.😍😍😍","label":0},{"review":"This was the only film where I never cried so much in my life after watching a film. \nKal Ho Naa Ho is a must-watch. It's a very nice and heartfelt film with the equal amount of comedy, drama, emotion, and romance. The acting is spectacular from everyone. I will remember this film for life.","label":0},{"review":"The movie that comes in a decade or century .. \nRemember get ready with tissues before u watch this movie because this movie will take u to tears.... Must watch movie .....  \nGreat morals great movie....\nThis movie is something that will give us many lessons of how to live life ..\nAnd how to enjoy life ...\nThis movie might change u the way of looking towards life....\nMust watch srk film all time best acting of srk ....\nU will definitely fall in love with this movie .\n.......","label":0},{"review":"The best ever bollywood movie made which will literally make you cry..Best acting and casts ..Superb storyline ....Heart touching music.....A must watch movie for everyone .....Better than every movie which are getting released in this generation where people like everything is action and science fiction.....A big thumbs up for the entire crew ....And also congrats for completing 15 successful years...","label":0},{"review":"NYC MOVY MST WTCH BY EVRY 1. expecially if you are in love and want some solutions pls watch it. it tchs us to be gud human beings. awesome songs. i crei too many times. sometimes need a hanky to clean tears","label":0},{"review":"The most most amazing movie ever seen.. the pain of Aman (shahrukh) can be felt. He did marvellous job ... This deserves the best film award.. I m fan of shahrukh after dis .. I was continuously crying during the movie .. I have ever cried for a movie but it was different","label":0},{"review":"I liked this movie . Actors acting were too good specially mr satish shah , and shri dara singh jis . Songs were too good specially pretty woman and wedding song . I have seen this movie 246 times. Kanta bains comedy scene was superb .","label":0},{"review":"I have watched the whole movie nearly 50 time\nTill today it just give me a fresh story with a beautiful feeling in all romance and sadness all through. Fantastic in all time. I just wanna give a big salute to karan and the entire crew😘😘😘✌✌","label":0},{"review":"I think Karan Johar is one of the best Story Writer in Indian cinema. This movie is proof of  Priety's best acting. Saif's expressions really steal the scenes in movie. Karan johar should make such a Brilliant multistarrer movie with a strong story again!!!","label":0},{"review":"One of the best movie as I  ever seen by SRK . Story song and acting of  stars really excellent .I loved this film very much. Thanks director for making such a great film.","label":0},{"review":"One of the best 3 movies ever in Bollywood.Everytime I watch or hear its nice songs,I travel back in time to my good old school days and all used to be happy or content. \n\nThese days the mention of the title song at some moments gives me nostalgic  goosebumps and .....","label":0},{"review":"I didn't have enough tissue for this movie and my eyes were puffy from all the crying I did. Great movie! Great script/story about love. Wonderful acting from all the cast involved! Made me laugh too on a few parts! Bravo! 👏👏👏","label":0},{"review":"This is SRK's best movie in my opinion. This movie brought me to tears because of how SRK put out his emotions in the movie. Also, this movie would get a very good rating from me. From a rating of 1 to 10, I would give it a 10. Best movie yet SRK.","label":0},{"review":"This is the best love story movie I have seen in  Bollywood. This movie shows how a person can make other people happy by spreading love. Acting ,music and direction are amazing.","label":0},{"review":"Very nice and touching movie . Every time I see this movie I  get so emotional . Though I have seen this  movie so many time, still I feel this is something new . The characters the story is so heart touching . This movie will always be near to my heart","label":0},{"review":"its been 15yrs and still this movie amazes me. the acting, the shooting scenes, the songs, the choreography are so nostalgic and mesmerizing till date. this is an evergreen movie, and it will always be in a special place in my heart forever.","label":0},{"review":"The film is shot in foreign land with shahrukh khan and preiti zinta as the main lead in the movie. \n\nIn the movie , srk have fun with kids and neighbourhood. The film has a preiti zinta as neighbour of srk and wears big glasses. The film also boast of saif Ali khan acting. \n\nBut , preiti and Sonali bendre steals the show.","label":0},{"review":"It is a fantastic movie. Perfect story , piturization and casting. Filled with lots of emotions . Makes me emotional everytime I watch.\nHASO JIO MUSKURAO , KYA BATA KAL HO NA HO !","label":0},{"review":"This picture was my favorite and I never seen this type of story {I have watched 100 time's and every time I get emotional till the end}\nLove sacrifice sadness.\n\n\nBut most importantly (good human being)\nWhich type of person you're.\n😇😇","label":0}]