[{"review":"Kalyug, directed by the eminent Shyam Benegal, was produced by Shashi Kapoor. \n\nIt remains one of the most complex and modern takes on the epic Mahabharat. It’s the tale of viscious competition between two business families who are actually related to each other. The warring cousins would go to any length to win the battle of business. There are no good or bad here, everyone are grey in this plot. Caught in between them is a hapless orphan Karan (subtly donned by Shashi Kapoor) who works for one ...MORE","label":0},{"review":"Kalyug, directed by the eminent Shyam Benegal, was produced by Shashi Kapoor. \n\nIt remains one of the most complex and modern takes on the epic Mahabharat. It’s the tale of viscious competition between two business families who are actually related to each other. The warring cousins would go to any length to win the battle of business. There are no good or bad here, everyone are grey in this plot. Caught in between them is a hapless orphan Karan (subtly donned by Shashi Kapoor) who works for one group while his step-brothers are on the opposite side.\n\nIt had a fanstastic star cast who fitted the bill to the T - Shashi Kapoor, Rekha, Raj Babbar, Supriya Pathak, Anant Nag, Kulbhushan Kharbanda, Sushma Seth, Victor Bannerjee, Reema Lagoo, and A.K. Hangal. \n\nA compelling watch.","label":0},{"review":"Perhaps the best of Shashi Kapoor. What a plot and at the same time casting ? Never felt watching a movie. A fantastic scipt and superb acting. Very contemporary. Great job by Shyam Benegal.","label":0},{"review":"AADAT by my favourite singer ATIF ASLAM was awsome. ATIF ASLAM IS A LEGEND IN THE WORLD . HE IS THE BEST SINGER IN TH WORLD. LOVE YOU ATIF SIR","label":0},{"review":"Long time ago when I was young man , being fan of Shahi Kapoor , I remember ,,, it was about a family ,, drama ,,, where innocent Ness is not counted ,,,, and well made film ,,, Shahi Kapoor played heroes role","label":0},{"review":"I just love this movie...its something different from those usual love stories....its has depicted something different.....a issue important to be raised....everything was perfect....i really suggest this movie❤️","label":0},{"review":"all characters are outstanding \nTruely marvellous movie \nKalyug give lessons to fight against the girls molestation, porn hub, trading of girls","label":0},{"review":"The plot is confusing. Who was annie? Who's hema and who's Jessica?it's written that simi Roy's daughter used to have sex with her girlfriend Jessica??","label":0},{"review":"Songs r awesome.. Heroine is just too good looking she must be very much popular","label":0},{"review":"It's a Nice movie if any one doesn't see just see and then review the movie","label":0},{"review":"Very nice movie\nAnd very nice songs\nI love this😊😍","label":0},{"review":"Nice movie and revealed the darkest underdog issue of recent India HUMAN TRAFFICKING","label":0},{"review":"My fav song Aadat sung by my fav singer Atif aslam","label":0},{"review":"This is a nice movie and very nice songs👍👍😃😃😃❤❤❤","label":0},{"review":"Wrong picture shown as thumbnail for the movie","label":0},{"review":"Kalyug movie is best sad love story hrt toching","label":0},{"review":"best film  of world","label":0},{"review":"This movie also had a good message","label":0},{"review":"Best movie kalyug","label":0},{"review":"That was very nice movie","label":0},{"review":"Very nice movie","label":0},{"review":"Nice song.nice movie.","label":0},{"review":"Love story moves","label":0},{"review":"Bad movie please don't Watch","label":0},{"review":"luv u Emraan😍😍","label":0},{"review":"Very good movie ..","label":0}]