[{"review":"My rating -- 5 Stars!! If you want WHY?\nHere's the answer.\nOkay, so recently done watching this movie and God I have dosen of things to say about it!\nFirst of all, surely after this movie, I can guarantee I am now Farhan's biggggest fan...!! Seriously he portrayed this challenging role with so much perfection that we can't remain satisfied without praising his versatility! And yeah, also, Ram kapoor, Deepika Padukone, and other supporting caste had done their role well too!\nNext comes the story, ...MORE","label":0},{"review":"My rating -- 5 Stars!! If you want WHY?\nHere's the answer.\nOkay, so recently done watching this movie and God I have dosen of things to say about it!\nFirst of all, surely after this movie, I can guarantee I am now Farhan's biggggest fan...!! Seriously he portrayed this challenging role with so much perfection that we can't remain satisfied without praising his versatility! And yeah, also, Ram kapoor, Deepika Padukone, and other supporting caste had done their role well too!\nNext comes the story, which is yet another very strong point of this amazing psychological thriller, which will  deliver definitely a new kind of experience to the audience, and which keep them engaged throughout the whole running minutes, as it touches almost all the genres, especially that 'thrill' and 'suspense'\nWell, maybe it is because there isn't much time had gone for me watching this film, but really I for myself hadn't found anyrlthing wrong or illogical or boring in the film!\nAnd last but not least, I also want to praise the director and his direction as he has also done a pretty believable job, he surely knows how to maintain the suspense and the thrill at the same time!!\nSo yeah, if you want a new experience, a great psychological thriller, this is a must watch. Go ahead!!","label":0},{"review":"One of those rare impactful Bollywood movies, Karthik calling karthik is bound to leave you enamoured with the inexplicable functionalities of human mind. Schizophrenia is real and deserves attention with utmost care. Great work by the team to shed light on this otherwise less talked about or hardly known or even acknowledged mental disorder. Hope to see more movies on such topics to help create public awareness and sensitisation.","label":0},{"review":"An incredible movie to watch.... If you are a lover of psychological thriller movies, then go for it.... You will surely enjoy it.... I think this movie is underrated, it should have a rating of at least 8/10 in imdb or even according to me....  The starcasts have given brilliant performances...  So finally i would like to conclude this by saying it is an outstanding movie by vijay lalwani.....","label":0},{"review":"I liked the movie very much, just speechless. \n\nSchizophrenia or any other psychological disorders should be cured in childhood by parents. But ironically some of them don't give attention and ignore (don't believe them) about the abnormality in child, and therefore sometimes children hide their serious problems from their parents because they have experienced that parents won't believe them.\nAnd that's why a small problem create much serious illness and often provoke to terminate the life in yo ...MORE","label":0},{"review":"I liked the movie very much, just speechless. \n\nSchizophrenia or any other psychological disorders should be cured in childhood by parents. But ironically some of them don't give attention and ignore (don't believe them) about the abnormality in child, and therefore sometimes children hide their serious problems from their parents because they have experienced that parents won't believe them.\nAnd that's why a small problem create much serious illness and often provoke to terminate the life in youth. I have only one request to all parents that - Please believe in your child, just dont ignore them.","label":0},{"review":"Metal disorder sometimes not diagnosed correctly. Sometimes Its a a different belief system of a victim patients. He might think of possibility of world operating away from convention methods of matteristic world concern selfish motive where I is first than We. Modern diagnosis and psychology needs to be revised and it must consider the idea of Buddhism, Thinkers OSHO and Frijof Capra. We need to think of world operating in peace, love and Harmony by implementing the truth and real value of huma ...MORE","label":0},{"review":"Metal disorder sometimes not diagnosed correctly. Sometimes Its a a different belief system of a victim patients. He might think of possibility of world operating away from convention methods of matteristic world concern selfish motive where I is first than We. Modern diagnosis and psychology needs to be revised and it must consider the idea of Buddhism, Thinkers OSHO and Frijof Capra. We need to think of world operating in peace, love and Harmony by implementing the truth and real value of humanity in all religions.","label":0},{"review":"One of the best Bollywood.(without a doubt) \n Farhan simply nailed as Karthik's! \nUnbelievable subject, \nbacked up by edge of the seat suspense. Fabulous direction! \nA big thumbs up. Don't miss it. \n\nI was surprised to know that it didn't work out at box office, may be too hot to handle for kind hearted folks!\n\n#Breathtaking","label":0},{"review":"this movie was surely very ahead of its time. such an amazing concept and story line. also the acting performances by farhan akhtar and deepika padukone, two of my favourites, were truly exceptional. great medium of expressing awareness for such disorders and the patients suferring from this.","label":0},{"review":"Great movie very sad that it had not done good at box office in 2010 but great content at that time really and still in 2019 the film stable with its novalty ....indian audience and box-office\nReally disappointing with good film and contents ...a still remember the stupid blockbuster Dabangg in that year of 2010 ... really sad people of India need to think now.... hopefully now things are getting change but loss of lots good film that could be achieving all over.\n\n\nGreat film kartik calling kart ...MORE","label":0},{"review":"Great movie very sad that it had not done good at box office in 2010 but great content at that time really and still in 2019 the film stable with its novalty ....indian audience and box-office\nReally disappointing with good film and contents ...a still remember the stupid blockbuster Dabangg in that year of 2010 ... really sad people of India need to think now.... hopefully now things are getting change but loss of lots good film that could be achieving all over.\n\n\nGreat film kartik calling kartik...","label":0},{"review":"just Wow \ni have no idea that this movie going that far , i'm thriller movie lover that's why i decided to watch this movie , in the first half movie seemed normal and an average thriller movie, but in second half it totally awesome . and climax of this movie is out of the world .\ni must say it will shock you and afterthat you will think what you could be . if you are a psychological thriller movie lover then man this is definitely for you .","label":0},{"review":"This is my all time favorite movie. \nYes Farhan is super in making you feel they way he wants your brain to feel him.\nAll actors have done a great job.\nKodos to writer, Director, music director.","label":0},{"review":"What a mind blowing movie! I wonder sometimes why the audience don't go for these kind of movies? If they admire these kind of scripts I am sure Bollywood has enough potential to make films like that of Hollywood.\nHope for Sequel to this Karthik Recalling Karthik... ☺️","label":0},{"review":"It's a brave attempt!\nAfter seeing it you'll realise that 2010 was a very early stage of release of  such a movie as seen by the perspective of the bollywood movies.\nAn awesome creation! And Farhan Akhtar as always has nailed it once again.","label":0},{"review":"I was speechless after watching this movie. This movie clearly show the mentality and understanding of Indian audience due to which this movie get flopped on the box office. It is the best bollywood thriller movie till now.","label":0},{"review":"Never thought that bollywood can make these type of masterpiece. It actually shows the condition and situation of a mentally sick person. And yes confidence is our best strength","label":0},{"review":"Great movie, a rare Psycology thriller bollywood movie. I believe the most important key of a thriller movie is that, it keeps you immerse in \nthe movie but also clearing  the climax so that all the hard work and paitence  pays off .This movie does that with flying colors..","label":0},{"review":"SPEECHLESS\nSPEECHLESS\nSPEECHLESS\nSPEECHLESS\nSPEECHLESS\nSPEECHLESS\n\n\nWHAT A MIND BLOWING MOVIE\n\n10 OUT OF 10\n\nAGAIN SPEECHLESS\n\nI HAVE LOT OF WORDS\n\nWONDERFUL\n\nOUTSTANDING\n\nAMAZING\n\nNICE LOVESTORY\n\nNICE SUSPENSE\n\nEXCELLENT\n\nBEAUTIFUL\n\nNO WORD\n\n10/10\n\nMUST WATCH PLZ\n\nDONT KNOW WHY THEY ARE NOT EARN MORE \n\nBUT ONE UNIQUE AMAZING INCREDIBLE MOVIE\n\nTHANKS","label":0},{"review":"Way ahead of it's time. When it was released I was in school. Few days ago watched this and what a masterpiece! Just cannot ignore the finest performence of Farhan Akhtar.","label":0},{"review":"Soooooooo.good actually i read it but awesome with the climax as he is the one who is calling \nI want every one to see this movie\nMore than that,\nDeepika padikone,my all time favourite actress","label":0},{"review":"Great film. Everyone's acting was on par. Farhan's character is very intriguing and fascinating as well. I must say that he has nailed this one.","label":0},{"review":"Good Movie. Everybody acted very well in the movie. The story in the movie was new and good. The movie was so interesting and thrilling. The movie lagged a lot due to some unwanted scenes in 1sr half. The 2nd half in the movie was so interesting and thrilling. The movie has some interesting twists and turns. Songs were not so good in the movie and they were not needed in the movie. BGM was good in the movie. Good Movie.","label":0},{"review":"Outstanding movie...role of Farhan Akhtar is amazing...no words for it....super super amazing....5 starts...once you start watching u could leave in between...each and every scene binds you more and more... impressed....","label":0},{"review":"My God I was speechless I mean it was mind blowing movie you have to watch it brilliant acting by Farhan Akhtar one of the best movies of Bollywood","label":0},{"review":"A must watch. Will always keeps you in the guessing mode as to why its happening.And the damn climax,man.. A thumbs up to the crew..","label":0},{"review":"I have watched a movie Fight Club 1998, its all about subconscious. I really believe after watching this movie, d'ont underestimate the power of subconscious :P","label":0},{"review":"Such an awesome movie to watch.After 10 years i can say, still its ahead of its time.Kudos to the director and also actors of this movie.","label":0}]