[{"review":"This is a Great police movie which I watched in recent times infact the best.Police like karthi exist but very rare.All police should take karthi character as an inspiration.What a film?simply superb.I was deeply involved and screamed thrice seeing the villain.Great direction..This is a must watch film....No words..karthi is simply superb.","label":0},{"review":"Great story... Great characters and what an execution..  Where there is bad, there is good too.... Akki was just awesome... with that funny and fearless character... Amit ji with that angry man look.... He was wonderful... And the villain Ajay.. No words.... Should be on everyone's bucket list....","label":0},{"review":"Wonderful Movie Amitabh Bachchan's roll so much I did respect too so much ...great movie great star cast Ajay Devgan's best and dengerious Negative Roll ..Akhsay Kumar's secrifice for duty in love...that's amizing ....best. background music. like this movie Chandangadh , Best song like Chandangadh,  must must must watch.....","label":0},{"review":"The full credit goes to akshay kumar because in this movie he delivered 2 characters , in the first halfr a rack less officer with comic stuff and the 2nd half a tough responsible cop and perform fantastic action with best dialogues","label":0},{"review":"Amitabh was amazing but it is Ajay devgan who owns the movie.We are so blessed to have an actor like Ajay devgan! His scenes were electrifying ! I want him again in such a role!","label":0},{"review":"One of the best interesting n curious movie ever i watched.. n more than that i was literally get shocked to knw this mv is a based on real incident in TN. Overall the movie never make u bored rather force to watch often...","label":0},{"review":"Very rare (in south cinema) that somebody narrates a story in realistic way and yet thrill audience with jaw dropping action sequences\nHatsoff to director, Karthi and more than anybody else THE real police men behind this story.","label":0},{"review":"Rare movie, natural movie, extraordinary karthi action,the great director. I hope this movie will get so many awards. All the best entire cinema  crew.","label":0},{"review":"An intense story with first class acting from the entire star cast, particularly Ajay Devgn as the menacing Angre. One of his bests in his career","label":0},{"review":"Good movie. I like the music that is played in the beginning and at the end. It takes to me in all together different world","label":0},{"review":"Althugh this movie plot similar to 3 10 to Yuma, this movie is spectacular. A must watch thriller movie \nin bollywood with strong cast.","label":0},{"review":"Amazing movie, one of the best movie I've watched till now. Karthi and Rakul played a great roles.","label":0},{"review":"The best movie i have seen.  A must watch for everyone  Sr.bacchan and ajay truly superb.  👍👍👍","label":0},{"review":"Today is my and Akshay birthday 9 September.\n\nAkshay as a street smart officer did a wonderful acting infact in the first scene the way he fooled the rich guy in the name of black money and drugs when there was a danger of getting caught with his wife.","label":0},{"review":"Its a nice movie and i want to see at-least one police like karthik in all police stations..... and its a good real story  analysis.....","label":0},{"review":"Amazed to see AmitJi in the khakee avtar. Great Actor Sir. You are a one man show. Hats off!!!","label":0},{"review":"Watching it after 14 years. Great Suspense!! Great acting by all the superstars!!! One must watch it","label":0},{"review":"Great movie star cast.. worth watching twice...Amitabh B aced his role as well as Akshay K... Aishwarya... beautiful...as always","label":0},{"review":"AWESOME PERFORMANCE AND TRUE NARRATION WITH REALISTIC SUSPENCE AND DRAMA.\nWE SALUTE YOU Mr JANGID TRUE POLICE IN ACTION","label":0},{"review":"Excellent movie . Brilliant act of Ajay devgn for first time horrer thril type of negative role.","label":0},{"review":"Good movie & almost everybody's performance is worth watching. Aishwarya Rai looks so glamorous in this movie.","label":0},{"review":"Movie based on real story of highway decoits. Excellent screenplay, bgm and definitely a worth watch movie","label":0},{"review":"Awesome movie. Amitabh sir and ajay akshay sir also done very well work","label":0},{"review":"this movie is not bore and super trilling movie any body don't miss this movie is (SV CINEMAX THEATRE ATP)","label":0},{"review":"Excellent screenplay with superb BGM. Mind-blowing performance by Karthi.","label":0}]