[{"review":"Dont believe the critics.Priyadarshan is a master at it again and its a master piece movie.The comedy dialogues and sequences are awesome,  and AK's simpleton character , no other actor in Bollywood could have played it. Really long, one take shots. Its mad comedy. \nRemarkable movie. I see it at least once in 6 months on YouTube to have a good laugh. People will not value such movies now. But will really miss such movies in later years.\n10/10","label":0},{"review":"Wat a awsme movie yrr ..!! Really hats off to Priyadarshan sir...a great legend of movie maker..!! But I m shocked..that IMDb rates 5.8/10 only...!! A great movie with a great content..and mind-blowing comedy..!! \nEager to watch everytime on star gold..wen it is telecast .!!","label":0},{"review":"The movie is really worth of watching but i don't know why critics has given less stars to this movie. The story is based on true facts of politics,the comedy is up to mark, acting is also awesome. Superb movie superb fun.","label":0},{"review":"So so so much underrated. The movie is a complete package of Fun and Political image. If you can get what this movie is actually want to convey, then this is one of the great movie.","label":0},{"review":"I LOVED THIS MOVIE. TRUST ME, I DON'T WATCH BOLLYWOOD MOVIES TO OFTEN AND I DON'T LIKE KOST OF THEM BUT HIS ONE WAS.... AMAZING. I CAN'T BELIEVE THE CRITICS, I LOVED THIS FILM. IT HAD ALL ACTION, ROMANCE, DRAMA.","label":0},{"review":"Ausum comedy drama movie .apt dialogues true comedy and ausum acting very close to reality stands on it name overall 4/5 must watch for good movie lovers. No regrets good story","label":0},{"review":"Simply a brilliant movie from Priyadarshan.\nThe movie was very funny and also had a good story everyone can watch these movie 2 to 4 times in a row","label":0},{"review":"Awwwwwwwsome movie .. Must watch \n. A perfect blend of comedy and emotions .... Can't believe tht  serious issue like corruption can be portrayed in this manner","label":0},{"review":"Movie story is really nice. Don't believe this critics. They doesn't do justice with story. And also acting of akshay sir,Rajpal sir, Jhonny sir is very nice. Their comic timing is nice.","label":0},{"review":"Although this movie could not make good on the box office, yet this is my most favorite movie. The acting of Akshay kumar is superlative ! Unmatched.","label":0},{"review":"Awesome Comedy dramatic movie.. Akshay kumar's role very nice.. I enjoy.. Very much.. & All character's role very funny.. 9/10","label":0},{"review":"It's a emotional category movie. You can watch this with your family and it's song(sajde kiye hai laakhon) touches heart like 90's meaning full music","label":0},{"review":"I think critics give their  reviews without watching this movie and missguided the viewers.its a very good movie.i have seen this movie many times.","label":0},{"review":"It is a malayalam movie velanalakaludenadue which was a hit made by priyadarshan i love all his movies I will give theories 10out of10","label":0},{"review":"Good comedy movie....\nBut don't no why people and critics not like\nOne of best bollywood comedy movie\n10 on 10","label":0},{"review":"A must watch movie dont judge it by critic review this movie address issues which is over looked by our society these issues are the roots of chaos in our society.there is quote which can summarize  the essence of movie which is Quote from Honoré de Balzac : “Laws are spider webs through which the big flies pass and the little ones get  caught\"","label":0},{"review":"Storyline very good.akshay Kumar role as Sachin tichkule,a contractor was fantastic.johny lever comedy is excellent.do watch this movie","label":0},{"review":"This is the most underrated movie i have ever seen. Don't believe in ratings, critic's review, just have a go.","label":0},{"review":"One of the best comedy movies. Don't listening to critics just watch it once and you'll be willing to watch it again and again..","label":0},{"review":"Very nice movie in the movie rajpal yadhav and jony lever played best role comedy is awesome","label":0},{"review":"One of the best Akshay kumar starrer comedy .Any one jisne nahi dekhi it's request plz watch it once","label":0},{"review":"Based on Reality That The Bridges And\nFlyovers Are Constructed With The Help\nOf B-Grade Quality Material And These are Collapsed In Real Life Also","label":0},{"review":"Very good comedy movie and it will make your day. I loved it.","label":0},{"review":"Awesome movie , a must watch.\nStory, dialogues, comedy everything is nice.","label":0},{"review":"Comedy at its best. Loved it. hats off to Priyadarshan and team again.","label":0}]