[{"review":"Don't wnna go into  technical excellence, cinematic nuances  or any other  matter... The noblest part of d film lies in the wake of the movie,when the director n the producer as   well, pay their tribute to the forgotten souls  by showing their individual photographs one after another... PRANAM to all of them n respect 4 Mr. Gowarikar for putting enough honesty n sincerity while making such a film that deals wd d most sensitive part of our history","label":0},{"review":"This is a great movie. It shows that there was not a single revolutionary and martyr in British INDIA just like bhagat singh like . There was a lot of revolutionaries that fought for INDIA. Movie is based on the mission leaded by Surya Sen in Chittagong (Bengal). Mustwatch movie for you if you like Patriotic movies.","label":0},{"review":"I think this is a tribute to our real Sahid.it always bow downs my head with respect.they are our real heroes and heroines who brought the our dream,freedom in our INDIA.\n\nJAI HIND.VANDE MATARAM.","label":0},{"review":"Amazing movie. Storyline direction was very good. Actors acting were superb. Nice movie.","label":0},{"review":"Surat Sen one of my favourite revolutionaries.  And this film is 😀 just awesome !","label":0},{"review":"This was not a film ,it was a great tribute to our great great heroes.salute to this heroes like surya sen ..........","label":0},{"review":"It was a good movie and I still recommend to my students.","label":0},{"review":"Good movie..But lacks powerful impact ..As lead actor abhishek isn't a powerful performer ..","label":0},{"review":"excellent movie. A must watch for all.","label":0},{"review":"Brilliant cinematography of 1930 chittagong armoury raid.","label":0},{"review":"this movies very nice and story good","label":0},{"review":"Movie was great...But need some acting framework more","label":0},{"review":"The movie was nt so good it's a bad movie","label":0},{"review":"Very nice movie","label":0},{"review":"This is...this is the movie based on Chittagong revolution... History remains.","label":0},{"review":"It is supposed to be shown to Kanhaiya of JNU","label":0},{"review":"Yu re verry nice movi","label":0},{"review":"World no 1 worst movie","label":0}]