[{"review":"According to me this flim as i have seen it more than 10 times is a supernatural , frictional movie but enjoy it  .acting was nice by all people who acted best acting was Akshay Kumar,s .enjoy this movie songs are exhauting lovely thirrler songs sung by all singers in this movie so hope you enjoy Khiladi 786 is a comedy ,drama flim  .watch all of you and enjoy it .","label":0},{"review":"Akshay sir and Asin mam Himesh Reshammiya good movie and \nMy favourite movie is Akshay sir Asin \nBollywood  boss bhidu jor jatka nice work intelligence rocking the best regards\nLol movie","label":0},{"review":"danish danish \ni love you \nossam songs akshay sir ji\nmast mast movement\n\nupdat: jus watched movue\n\nnot gud, i mad mistak\nnot ossum, aksay sir ji needs to go back to skool\ndoes not understand physics\nhoribel movue\nto confusion\naksay sir ji is a failur\n\ni have one kwestin: does spider have pusmpus\n\nlike subskrib leav coment","label":0},{"review":"I love akshay sir because his acting and his smile I much liked and his entirment also very good and very funny I am huge fan of akshay sir","label":0},{"review":"Himesh reshamiya ji is great music director of Indian music industry and then music this movie then movie standing up new level .","label":0},{"review":"khiladi 786 is a very best movie and good think and i am proud of movie","label":0},{"review":"Don't think much about good ot bad. Just enjoy without applying mind.","label":0},{"review":"I love this movie and I have watched this movie 50times because of mu favorite Akshay Kumar","label":0},{"review":"The best Action-Comedy&Romantic movie i have ever seen\nLove ❤️❤️this movie \nMy favorite","label":0},{"review":"Akshay sir is the best actor and I am big fan of you.","label":0},{"review":"I like it because Akshay Kumar is the real super Star of the INDIAN cinema.","label":0},{"review":"Akshay Kumar sir movie is best my fevret song hukaa bar","label":0},{"review":"This is good movie  my favourite hero aksay sir but not good a villen","label":0},{"review":"Lovely movie all nice seen with songs","label":0},{"review":"SUPER HIT MOVIE MY FAVORITE SONG BALMA","label":0},{"review":"I like is Akshay Kumar All move must and good  luck","label":0},{"review":"I am very happy with see this movie","label":0},{"review":"My All Time Favourite Movie Khiladi 786","label":0},{"review":"All movies of Akshay sir is awesome","label":0},{"review":"I love all comedy of Akshay 😘😘 love you","label":0},{"review":"So beautiful movies amazing Mazar a gaya","label":0},{"review":"Good movie my favorite actor akashy kumar","label":0},{"review":"Not a good movie at all....\nVery bad performance by akshay kumar","label":0},{"review":"Good morning friend\nI am Sriram Kumar and Surya Raj and Sriram K","label":0},{"review":"Nice super comedy movie","label":0}]