[{"review":"KHOOBSURAT was Fawad Khan's debut in Bollywood and I think that he was pretty good in expressing his character by nailing the uptight royal who finds himself surrendering to a Mills and Boon styled romance. Khoobsurat is a fun to watch movie, for both Sonam and Fawad are amazing actors! The emotions were expressed at its best level by all the people in the film. Personally, I love this film!","label":0},{"review":"It's a must watch film for every person, it's appropriate for every age group.....story line and direction is fantastic. The royal life and the palaces are cherry on the top. Last but not least the actors did an excellent job. Sonam and fawad khan rocked it. I am totally in love with this movie. This is the only movie I watched for three times in a single day..","label":0},{"review":"The best movie I have seen. I love sonam's character. She's honest, lively, crazy doesn't give a damn to society's thoughts about her, true to herself. But that doesn't make her childish, she knows where to be mature. The best character I have ever seen in a movie. Sonam and Fawad's acting.....and the scene in sonam's room after they kissed radiates utmost genuine reality.... That's how people in this world are!!!!","label":0},{"review":"Beautiful movie, carefully crafted all sentiments by depicting the perfect amalgamation of Royal Urbanisation All the characters are framed very well. . They come to life only coz of the best set of actors and Team was in sentiments are expressed with utter care.. Can be watched over and over again... Its music''s great..","label":0},{"review":"I have this movie in my favorites list. Amazingly entertaining. Laugh out loud movie. Fawad Khan is an excellent actor. Sonam is hilarious, fun to watch. But her mother made me snort laugh.  The casting was superb. Best film I've seen yet.","label":0},{"review":"I love this movie because of sonam kapoor and her acting, and being a doctor in the movie and motivating the patient.The story line goes this way, sonam is very close with her mum and finally reaches in palace for work, and she enjoys being there and helping the patient Its an awesome movie with a good humour......its unique beacuse of the romance scenes in it... all acted very well.I overall rate this movie 4.8/5","label":0},{"review":"Its a nice and funny film. Sonam kapoor was amazing in the film. Fawad khan was super awesome in his debut. I would give this film four stars out of five.😂😀😁","label":0},{"review":"Comment on this movie in one word is just 'Khoobsurat'..\nFawad Khan is fabulous in his debut film in Bollywood and others  are also fit in their character.. A must watching film for refreshing the mood.","label":0},{"review":"A must watch millsnboons type romance...all actors in their elements. Really a feel good movie and good entertainment. And manju is just adorable😊","label":0},{"review":"I keep watching this movie, each time enjoying it more and more. I plan to watch it forever. Thank you;  makers of the movie and all the actors specially Fawad and Sonam. Please act together again.\nShauna","label":0},{"review":"It's a good movie.... must watch.... the script does justice to the characters...the feeling of being helpless when Milli is not able get over  Vikram is quite real... otherwise there is also entertainment and the film is filled with humour","label":0},{"review":"Its amazing great actors , awesome direction , hit songs i watched it 3 times and still watch at home ,its a must watch movie.","label":0},{"review":"The movie was totally my type. It had sweet romance, handsome actors and typical heroic saving from kidnappers. must watch movie for rom com genre lover.","label":0},{"review":"Awsome muvie...fawad was luking damn hot...fawad n sonam both were more dan outstanding...a must watch muvie...can't put my eyes down from fawad khan...","label":0},{"review":"Its an awesome movie with a good humour......its unique beacuse of the romance scene in it... all acted very wellll😍😍😘😘","label":0},{"review":"I like this movie because of the acting of sonam what a better acting of her and her character in this movie and hero was also so best","label":0},{"review":"It is a very beautiful movie..... Specially fawad khan!!OMG!! He is extremely Handsome!!!!! I like him very much!!!💓💓💓","label":0},{"review":"Amazing film... I love it.. Superb acting of fawad and sonam","label":0},{"review":"I absolutely loved it.  Fawad Khan nailed it and was for Sonam...omg. shes the absolute best.","label":0},{"review":"I love this movie! It is amazing! I rewatch this movie ALL THE TIME!!!!!!!! Definitely recommend!!!!!!!!!","label":0},{"review":"Amazing movie.. Comedy plus drama.. A must watch and makes u feel refreshed..","label":0},{"review":"GREAT MOVIE. ONE OF THE BEST MOVIE I WATCHED IN LONG TIME.","label":0},{"review":"I like this movie very much. Very entertaining. Hero heroine.. waooo, superb.","label":0},{"review":"Average movie...Weak story, direction ..fawad is emotion less bad actor..Sonam gave quite nice performance but she lacks acting ..She need to work on  it ..","label":0},{"review":"This movie stole my heart and MANJU U WERE JUST AWESOME I LOVED THE LAST PART!!!😙😗😚","label":0}]