[{"review":"A good for nothing bollywood hungama reviews this movie as 2 out of 5. This itself shows how critics in India suck big time ! This is Dibakar Banerjees best flick till date. It is so simple yet so excellent. Story screenplay direction songs Background scores all excellent. 4.5 out of 5 since charis character could have been a better choice nonetheless he did an okay job","label":0},{"review":"13 years since it's release and it is still one of my favourite bollywood movie. There is something about it; it may be a brilliant cast ensemble, a funny script, a unique concept, significant character developments or all of them! It's uniqueness is quite evident from it's name itself. If you haven't seen this movie yet and you are a foreigner or a 10 year old, that's acceptable but if you are none of these two, you gotta watch it! It a bloody perfect movie!","label":0},{"review":"Amazing and fantastic movie . It's true that now a days people want to become rich in any how.  In these movie they have given message that middel class families fell jealous that rich people wearing expensive clothes , buying expensive gadgets , riding in expensive Cars, throwing parties in a five star hotels, or buying expensive jeweleries which middel class people can't effort because they are salaried persons. They always think about that . That's why they can't leave in peace. Competition a ...MORE","label":0},{"review":"Amazing and fantastic movie . It's true that now a days people want to become rich in any how.  In these movie they have given message that middel class families fell jealous that rich people wearing expensive clothes , buying expensive gadgets , riding in expensive Cars, throwing parties in a five star hotels, or buying expensive jeweleries which middel class people can't effort because they are salaried persons. They always think about that . That's why they can't leave in peace. Competition always make them stress. Nice movie.","label":0},{"review":"Very well scripted movie. The movie will make you aware about how a Common man actually gets bullied by the mafia industrialist and property broker for his own piece of land how his whole family took their land back from them. \nA great movie you'll be definitely enjoying this. Well acted and well directed movie. \nDeserves 3.5/5stars.","label":0},{"review":"This movie one of my best movie  - great acting by all....this is one of the movie where you can watch with family and relatives, elders and youngsters.  i give 5 out 5","label":0},{"review":"Very nice movie with excellent role play from all actors. One of the few movies that can be watched with the entire family 😊","label":0},{"review":"A must watch before making any property investments. :-) Absolutely loved it. Its like watching theatre in a movie.","label":0},{"review":"Very good movie.\nI give him 5 out 5 stars.\nMuch better then other highly budget films.","label":0},{"review":"Wonderful movie with a great plot ,a comman man Khosla get cheated of his plot and his sons take revenge by retrieving the plot from him","label":0},{"review":"A very very strong massage given to a common man.A mast watch movie.I enjoy this movie every day.","label":0},{"review":"Yes I recommended this filim to see as this is the story of a comman man who purchased a plot for his family but land mofia  capcherd the plot.","label":0},{"review":"Don't miss it..... lovely film...anupam sir ... Pathak sir....boman sir...rajendra sir... mind blowing performances ..worth watching","label":0},{"review":"Amazing movie amazing cast amazing acting \nAnytym better than that useless Salman and shahrukh movies","label":0},{"review":"Always loved watching it! Awesome Acting.","label":0},{"review":"One of my fav movie already saw 100 times n still watching in 2019 with same craze","label":0},{"review":"I won't call it a comedy movie ,but dramatic.I agree with bollywood hungama which has given it 2out of 5.one time watch is ok.","label":0},{"review":"Superb, middle class drama n story line, n marvellous acting n roleplay by all","label":0},{"review":"Remarkable movie...a must see Bollywood movie with pure talented actors","label":0},{"review":"oneof my most favorite movies.like to see many more times","label":0},{"review":"It's one of the best films","label":0},{"review":"Wonderful moive . Must watch","label":0},{"review":"Amazing and fantastic movie","label":0},{"review":"Best movie of all time.","label":0},{"review":"Brilliant movie","label":0},{"review":"Highly recommended","label":0}]