[{"review":"The only reason why i like this movie because i watched this with love of my life.. though she could not be part of my life.. but this day Feb 22nd and this movie always makes me remind of her..\n\nLove you! and i really pity with what you chose and end up with..","label":0},{"review":"I watched this film only for the very handsome and charming Fardeen Khan. Miss him. Why did he stop acting in films!\nKareena's overacting was absolutely ridiculous. The story sucked. Khushi gets upset for such a silly reason, just didn't make sense. Not a single good song!","label":0},{"review":"Brilliant happy movie, over-acted Indian style it is what Kareena Kapoor is best at. Recommended to put a smile on your face","label":0},{"review":"The movie was somewhat good. Only Vivek comedy scenes were good in the movie. Songs and BGM in the movie was also not good. The movie has usual story with no twists and turns.","label":0},{"review":"Funny,romantic and brilliant screenplay.This movie is a must watch if you don't understand why fans go gaga for Powerstar PawanKalyan.","label":0},{"review":"love this movie so much... i very much recommend it to watch ... still watching this film and loving the songs and BGM...","label":0},{"review":"watch with Mom  i am very small related for my life past time spand memories evergreen","label":0},{"review":"It is the movie which has been gave a good position for pawan kalyan in 2001 it is the biggest hit in his movies","label":0},{"review":"I like this movie power star super duper performance..in this  filim Tamil Kante biggest hit record","label":0},{"review":"Awesome ...  Gr8 songs..  but irritated with jyothika  acting  in regards to fighting","label":0},{"review":"Vijay's one of the best movie..its make a great Change in Vijay's filim carrier...","label":0},{"review":"super movie cute acting by vijay and jyothika,songs and bgm are good.","label":0},{"review":"Block blaster movie good love story Pawan Kalyan action super","label":0},{"review":"though its the remake of tamil movie pawan kalyan recreated history with his charisma","label":0},{"review":"I am NIKHIL YADAV i love this movie","label":0},{"review":"It was a block buster movie in pagan Kalyan S career by this film he can get more popularity","label":0},{"review":"I though it is a good movie. But I dislike it . It is very silly movie.    ...........","label":0},{"review":"Woo !!! Its very good!!!I known 1more khushi","label":0},{"review":"This is not intresting. I just wasted my time watching it.","label":0},{"review":"I watched it only for my sweetheart, darling actress kareena Kapoor","label":0},{"review":"It is very good movie","label":0},{"review":"Great\nThanks","label":0},{"review":"Supper supper","label":0},{"review":"Supper songs","label":0},{"review":"My favourite movie of PSPK","label":0}]