[{"review":"Overall, I liked this movie but also understand why some people thought it was laughably bad. \n\nI laughed, too, a couple of times during the first 1/3 of the film, it's so overwrought. The director and cinematographer try too hard to make it visually interesting -- the editing is frenetic and not in a good way. I also can't stand when characters narrate obvious things aloud to the audience, things they would clearly only think to themselves if they were literary characters and not cinematic char ...MORE","label":0},{"review":"Overall, I liked this movie but also understand why some people thought it was laughably bad. \n\nI laughed, too, a couple of times during the first 1/3 of the film, it's so overwrought. The director and cinematographer try too hard to make it visually interesting -- the editing is frenetic and not in a good way. I also can't stand when characters narrate obvious things aloud to the audience, things they would clearly only think to themselves if they were literary characters and not cinematic characters; for example, yelling into your steering wheel, \"No, that's the wrong minivan!\" \n\nMaybe this is a pet peeve of mine because I write, but if you absolutely need dialogue like this, why not just introduce it via voiceover as thoughts? I get film is a visual medium, but if that's the argument, why not take the superfluous dialogue out altogether and let the actress's face carry the emotion? Halle Berry is a strong enough actress to have accomplished such a feat.\n\nIn fact, as the story progressed, I felt more and more for her character, which I'm chalking up to her talents, not the script. I'm not a parent and don't have or even want kids, but still managed to appreciate her performance and the ferocious dedication she embodied. Mothers are no joke, man (fathers too, of course, but this is a story about an average single mom).\n\nHaving been raised by a single mother myself, I've seen firsthand the strength they can tap into, the decisions and actions they're capable of committing to in order to protect their children, and I saw my mom in this character. Actually, I'm willing to bet that's why I'm so forgiving of this movie because, in truth, it is not well made or particularly well written (the premise is simple but fine; however, we don't even get the kidnappers' motivation until the last 20 minutes). \n\nNevertheless, it's got a bit of power behind it. I see what they were going for and, because I'm a Halle Berry fan, found enough of their good intentions to get behind them in the end (though the end has some holes and things thrown in -- and then neglected even -- as well). \n\nPresentation? 3/10. Heart? 6/10\n\nI do think good mothers and people who have good mothers will like this movie.","label":0},{"review":"A fantastic movie.. Not sure why it's rated 5.9 on imdb. \nBrilliant performance in each n every scene by Halle. Very natural n thorough acting by her. \nThe direction was gripping and no nonsense. The story was simple but great execution, not many directors could it pull it up like this.\nThere were many intelligent shots where it appeared that some common sense bits were not captured but after the scene you realize that it was actually captured in a subtle way, hence common sense n a natural exec ...MORE","label":0},{"review":"A fantastic movie.. Not sure why it's rated 5.9 on imdb. \nBrilliant performance in each n every scene by Halle. Very natural n thorough acting by her. \nThe direction was gripping and no nonsense. The story was simple but great execution, not many directors could it pull it up like this.\nThere were many intelligent shots where it appeared that some common sense bits were not captured but after the scene you realize that it was actually captured in a subtle way, hence common sense n a natural execution.\nI would give it 8.5/10","label":0},{"review":"Why bad ratings? This was not a horrible movie by any means. I think people are reading WAY too much into this movie. Some of the reviews I've read are written by incredibly picky individuals who probably don't get impressed by much at all.\n\nAnyways, I loved it. This movie kept my attention until the very end. I was literally biting my fingernails. \n\nThis mother NEVER gave up. The ending was not predictable as usual in these type of movies, the parents don't get to follow the kidnapper...or even ...MORE","label":0},{"review":"Why bad ratings? This was not a horrible movie by any means. I think people are reading WAY too much into this movie. Some of the reviews I've read are written by incredibly picky individuals who probably don't get impressed by much at all.\n\nAnyways, I loved it. This movie kept my attention until the very end. I was literally biting my fingernails. \n\nThis mother NEVER gave up. The ending was not predictable as usual in these type of movies, the parents don't get to follow the kidnapper...or even stay on him... This was from the parent's point of view and not the child. Loved it. \n\n\nUsually, the kidnapper is long gone. This was a different type of kidnap movie and I enjoyed it very much. However, I wish the father would have been included and that the ending wasn't so quick to be done. \n\nI wish the director/writer would have shown the two girls being reunited with their parents and whether or not Franky's mom won custody of her son over her ex-husband. That would have made a great ending!  I'd rate this a 8/10.","label":0},{"review":"This movie is good if you're going to watch it. I don't understand why or what factors people use to give reviews and judge movies nowadays.\nIn my opinion, it was thrilling, very suspenseful and I think Halle Berry did a fine job of helping the audience understand the emotions of a mother that just lost her child and how far this mother's willing to go.\n\nSure, there might be little things that are questionable but it's the same as any other movie with scenes that could have gone one way but went ...MORE","label":0},{"review":"This movie is good if you're going to watch it. I don't understand why or what factors people use to give reviews and judge movies nowadays.\nIn my opinion, it was thrilling, very suspenseful and I think Halle Berry did a fine job of helping the audience understand the emotions of a mother that just lost her child and how far this mother's willing to go.\n\nSure, there might be little things that are questionable but it's the same as any other movie with scenes that could have gone one way but went another.","label":0},{"review":"\"Kidnap\" delivers more laughter than thrills.\n\nThe unintentional comedy mostly comes from the terrible camera work and that horrible rap song at the end. I couldn't believe what I was hearing.\n\nBut I'm glad an Oscar winner like Halle Berry is in \"Kingsman: The Golden Circle\" next. I mean, it's not going to save her whole career, but at least it's an actual movie and no \"Kidnap\" or \"Catwomen\". It's been awhile since she's been in anything that's worth calling \"good\".","label":0},{"review":"Worst movie I've ever watched. Let me elaborate: Half of the movie is a badly shot car hunt. You don't understand what the motifs behind the kidnap is. Then it's also super unrealistic the womans car gets hit about 500 times and it's still going but no that's not the best part, best part is the women survives 5 car crashes, a woman trying to choke her, a man with a gun (she does not have any weapons). So don't waste your time btw couldn't finish it it was so bad and people writing good reviews a ...MORE","label":0},{"review":"Worst movie I've ever watched. Let me elaborate: Half of the movie is a badly shot car hunt. You don't understand what the motifs behind the kidnap is. Then it's also super unrealistic the womans car gets hit about 500 times and it's still going but no that's not the best part, best part is the women survives 5 car crashes, a woman trying to choke her, a man with a gun (she does not have any weapons). So don't waste your time btw couldn't finish it it was so bad and people writing good reviews are probably trolling cuz I can't believe somebody would actually like it.","label":0},{"review":"As a mom I was yelling at my tv so men....dont want it with people like me haha. It was great but there's the \"Are you kidding me!\" \"What are you doing!\" \"Speed uppp!\" Moments. \n\nVery heart warming movie my two year old baby girl is sleeping with me tonight for sure. \nId give it a 8/10\nI don't usually like movies I'm not a sit still and watch something all the way thru type.","label":0},{"review":"I absolutely love this movie. Its shows that a mothers love has no boundaries and she is willing to do whatever it takes to get her child back. its gripping and keeps me on the edge of my seat. Ms. Berry did an amazing job.","label":0},{"review":"Still not sure if I liked it or not.  It was griping but I got really irritated with Halle Berry.  She was continually screaming.  I'd be shouting and saying a few choice words.  I aIso found the start a bit drawn out and really has anyone seen a waitress come off shift looking neat and tidy and spritely, then climb into a brand new SUV? Yes it does explain that she is going through a divorce but that is also a bit irrelevant to the movie and the plot","label":0},{"review":"The film was fine for what it was.  Same as quite a few other films.  \nThe music at the end made me burst out laughing it was so bad.  I think the song is called Relentless.  The film's pretty relentless itself.  There's no rest from the minute the kid gets... napped.\nKeeps you watching though, partly just to see if you can glimpse around Halle Berry's make-up.  She looks about 20 years younger than she is...","label":0},{"review":"I think Kidnap is a very good movie. Intense throughout. Movies put me to sleep. I don't like going out to the movie theater because it is just an expensive nap for me. This movie kept my attention all the way through. Just wow!!","label":0},{"review":"What I see from this movie is a persistent mother with strong will to save her own child. Resilience is the key factor that the movie tells. What this mother did is quite natural as a mother in general. If you hear about a story a few months ago about a mother from British Columbia of Canada saved her son bravely from the bloody mouth of two cougars one afternoon from her own backyard, you will not be surprised by the mother’s action anymore. I love this movie.","label":0},{"review":"I can't take this movie. All I kept thinking what if it were my son? What would I do and how would I feel? I wanted to ring that white woman's neck who took the boy to begin with until she was lifeless and wanted to hold the man driving the car under water until he became lifeless.\nThen she just had to run out of gas while in pursuit. And then she wastes time explaining to people about why she wants them to call the police.","label":0},{"review":"O.M.G i loved this movie and im not even a movie person. \nI cried you guys 😭,but then there were moments i felt like she (halle berry) could have done more like running that lady over after pushing her out of the car 🤷🏾‍♀️.\nGreat job 👏🏾👏🏾","label":0},{"review":"I feel like this is such a underrated movie and you don't know if you'll like till you watch it but I thinks it's a great movie and it's a pretty simple story but when you watch it you just want to find out what's next and what will happen. It has some plot twists and it's a good exciting movie but NOT BAD at all !!","label":0},{"review":"I personally wouldn't have left my son where he was sitting. He would have come with me to take the call. But then there wouldn't have been a movie.🤔 I like Halle Berry, but there were too many ridiculous moments and dialogue. For instance, who would actually say, \"You kidnapped the wrong kid\"? Is there a right kid to kidnap?😖 And causing accidents and innocent people to die, to save your son, isn't right either. Thumbs down for me...\n🎬🖥","label":0},{"review":"This has got to be one of the worst, poorly written movies I've ever seen in my life. Ridiculous plot, script and everything else. I don't even understand the premise of this. I now understand why it was in the $5.99 bin at Walmart. I should have left it there. Boring, dry, senseless etc. I could elaborate more but why bother. It's already wasted over an hour of my life that I can't get back.","label":0},{"review":"First 10 minutes sucks. I didn't even finish it. I felt its a waste of time. It should have been a Horror movie. How can you be scared to hit the kidnapper of your child standing in front of your car. Helle is acting like an ameture. Over doing everything.  For me..iys the most boring movie and it gets 0 rating from me.","label":0},{"review":"I thought this movie was awful.  It was so frustrating. Who leaves their son alone in a crowded park, drops their phone doesn't run the guy over when she has the chance doesn't trade money for her son just throws the wallet at him...she did get smarter as the movie went on but her inability to communicate to people that her son had been kidnapped was frustrating.\n\nI like Halle Berry but this wasn't her best in my opinion.","label":0},{"review":"At first I thought this was going to be typical then BOOM!!!\n\nIt is riveting!!! When she said 100K I immediately thought of the father MUST have set this up and I was pissed just at the prospect...the revenge was VERY  SATISFYING. I.LOVED. EVERY. DELICIOUS. NANOSECOND.","label":0},{"review":"Watched it 3 times and everytime I feel the rush suspense intensity of trying to get to her child and with this kidnapping such a reality in today's life, it shows that you need to be wake up and take note of everything around you. Movie was BRILLIANT and awereness that this can happen to anyone.","label":0},{"review":"Some cliched kidnap plot but exciting enough.Halle Berry did her own stunts,though implausible many times like pushing the killer lady off her car while driving ,running on low fuel for miles together etc.On the whole very enjoyable as the theme is simple ,car chasing plus manslaughters.Halleberry as the  mother, she was exceedingly emotional for her son’s rescue.","label":0},{"review":"I'm almost an hour into this film and giving up.\n\nThe beginning was promising.\nThe first half hour or so kept me on tenterhooks, but after that the film became more and more unbelievable, (incredible beyond the point of acceptability ) and has now progressed to the point of being  totally and utterly ludicrous. \n\nSorry I spent as much time on this rubbish as I did.","label":0},{"review":"We really enjoyed this. Didn’t have good ratings and not really a Halle Berry fan but thoroughly enjoyed this right to the end. Edge of seat stuff and loved her never giving up!! Great stuff!","label":0},{"review":"I'm not a big a fan of watching movies or reading books, but whenever i do either of those I enjoy everyone. When I was watching this movie with my family I was on the edge of my chair 99% of the time. This movie had an outstanding performance and was fantastic! ~~~ November 2019","label":0}]