[{"review":"On a lazy sunday afternoon switched on Amazon prime and decided to watch Ranveer Singh's KILL/DILL. Honestly the movie is good. I was put off by the IMdb ratings but this movie was really good. It had laughs, good bonding between Ali and ranveer. Good chemistry between ranveer and parineeti. Songs were terrible. Govinda doesn't suit the villainous part. The ending was very good, not the usual Bollywood ones which one would expect. Worth one-time watch.","label":0},{"review":"Boaring movie. Dosnt make any sense. Westage of money time and mind. Actors acting were horribel. Only songs were good. Storyline presentation direction was very bad. I didn't like it much. I don't no why audience are giving thums up to this movie. Maybe Govinda was there that's why everybody is saying good. When they bring camios in this kinds of stupidity movies . Audience get surprised.","label":0},{"review":"Once I had a choice between Kill/dil and The Mummy's rebirth. So I watched ratings \n\nKill/dil : 4.3\nThe Mummy's rebirth : 5\n\n  I decided to watch Mummy rebirth , it was a disgusting movie ever. But when I got chance to watch kill/dil I was amazed. It is  a good  one.","label":0},{"review":"This movie is a complete disaster. No use of good actors like Ali zafar and Govinda. I hate everything about this movie. How it started and ended like a disaster. If you watch this movie, your dil(heart) will be killed completely. I suggest not to watch this 2 hours of nonsense.","label":0},{"review":"Nice movie, Awesome songs.\nGreat music by S-E-L.\nLoved the Title song.","label":0},{"review":"Stylish Ali Zafar with cool title song Kill Dil its suits Ali Zafar.","label":0},{"review":"I really really liked this movie. And, I watch it repeatedly.","label":0},{"review":"It's amazing movie for me.","label":0},{"review":"Vary good movie","label":0},{"review":"Good movie","label":0},{"review":"Very very nice movie","label":0},{"review":"LOVE YOU PARINEETI","label":0},{"review":"A boring movie","label":0},{"review":"Good👍 one","label":0},{"review":"Action with guns","label":0},{"review":"Overacting ranbeer","label":0},{"review":"Only for Govinda is watchble.....and the climax.....","label":0}]