[{"review":"Loved this movie. It's my favorite. Shahid and Vidya's jodi was the cutest ever! A good family film. Shahid is my crush and I also love Vidya. I just loved the way Shahid hugged Vidya near the end. This movie was a gem. I wish they had done more movies together","label":0},{"review":"Watching this movie 11 years later from its release year of 2008. The movie story, concept and the luck factor they have focused on it's amazing and totally ahead of it's time! :-) Shahid, Om Puri, Vidya & specially Juhi Chawla (ultra Charming Beauty) have done a brilliant job !! :-)","label":0},{"review":"The love story of Raj Malhotra and Priya with a message. worth watching.  Creative story writing, Superb acting by the cast. Even after 11 years of release the story looks like a new release and takes away all stress, tension, and anxiety. Thanks for the time","label":0},{"review":"I love this movie this is one of my favourite movie I liked the way they dance of shahid and Vidya in bakhuda song in this movie and it's my favourite song bakhuda too......,","label":0},{"review":"I love this movie .a good family watch.all the songs including bakhuda don't just go off your lips","label":0},{"review":"One of my all time favourite movies for Shahid Kapoor,Vishal Malhothra and Pritam's music 😍","label":0},{"review":"This is a nice film. Very very special to me. Bakhuda tum hi ho..","label":0},{"review":"Awesome. This is very amazing.","label":0},{"review":"nyc ksmat connection is a gud site for knowing in present and future","label":0},{"review":"all's songs favorite\nmostly bakhuda tumhi ho💞.","label":0},{"review":"Such a nice movie. Must watch.","label":0},{"review":"Nice movie all song","label":0},{"review":"Love you vidya Balan","label":0},{"review":"brilliant movie","label":0},{"review":"Nice story","label":0},{"review":"lovely movie 😘","label":0},{"review":"Kismat konnection.. i like movie💓","label":0},{"review":"Nostalgically","label":0},{"review":"How can we contact with kismat connection","label":0}]