[{"review":"An extremely good movie. Does not haveych inconsistency although the plot is quite complex. Acting by all esp the so beautiful isha is too much. Wonder why it did not get much commercial success.  The outlook of the movie is very modern. Hard to believe this was shot in 2002 03 timeframe an released in early 2004.\nI fond a lot of horror movies created later  have copied motifs and themes from this movie full of originality.","label":0},{"review":"Ahh. The old ekta kapur movie.\n\n1>Inconsistent plot\n2>raaz pichle janam ka reference\n3>the signature move of ekta kapur. Faltu k effect which has no necessities\n4>bad cast I mean sohail khan who hires sohail khan.. could have taken anyone but they decided sohail khan\n5>songs were good but still not necessary\n\nConclusion:- Ekta Kapur cant make good movies and this is a proof of it. Thats why it got so average score in box office","label":0},{"review":"I would just like to appreciate the effort Ekta Kapoor has put to entertain the world by making this movie.\nEkta Kapoor's works like Kasawti Zindagi ki was at one time a big hit and our whole family used to get together at night to watch the show and we made sure we never missed a single episode. Thank you for making us smile.","label":0},{"review":"Awesome movie. Because of the story i m very emotiony hurted because shanti as disha not get her true love😭😭😭😭😭😭 and the song suna suna is mindblowing . I cant expresss my fellings for this movie gjb,awesome,outstanding,exellent,very good,good . Watch at least once this... Movie in your life plsssss","label":0},{"review":"Awesome story..\nThrilling concept, good background music & all the technicians did a great job...\nBest horror movie 🎬 at that time ⌚ ...","label":0},{"review":"Very awesome movie according to me & the soul kept dead body of his love Aman too best & from 20 years that is very heart touching & love is too pure from both side from the soul & from Anita mam's side also & suspens r too good very beautiful & horrible wait","label":0},{"review":"I love this movie from my heart and i love the song bepanah pyar hai aaja. Its suspence movie everyone should watch atleast once you really love this movie.","label":0},{"review":"Good horror  movie shot in Mussoorie and FRI campus Dehradun  i remember as a kid i used to watch and enjoy this movie a lot good entertaining and horror movie Akshay is a cool guy in movie","label":0},{"review":"Its amongst one of the most underrated Bollywood horror movies. It's a must watch atleast once , according to me.","label":0},{"review":"It is the bestest of the best. \nMy brain almost died soon after I saw this. \nHighly recommend.","label":0},{"review":"This is one of the best horror\n movies. Don't go by the ratings. U will love it.","label":0},{"review":"Not Watched  this movie . But, story tell its good horror & suspense  movie . If time being i will watch this movie .","label":0},{"review":"Really superp movie don't go by rating plz, watch it you'll gona love it  its horror , love story  awesome","label":0},{"review":"Ok movie but only one problem Anita as shanti .. she is not looking good at all","label":0},{"review":"Awesome movie I watched this movie at least 100 times brilliant story and acting by sohail khan","label":0},{"review":"The decade 1995 to 2005 had really some awesome and amazing movies 🎥!!! 😎","label":0},{"review":"One of the best love story of bollywood...superb movie...everyone must watch it once","label":0},{"review":"Very nice movie according to me , my family members and my friends","label":0},{"review":"This movie is Not good .but song I love this ...... Amazing fantastic","label":0},{"review":"Very nice movie and the suna suna song is epic","label":0},{"review":"So so.so.so so so so beautiful movie always \nNice love story","label":0},{"review":"Very chilly at times.Good story line.1 time watch movie.","label":0},{"review":"Good horror movie with little suspense and romance.","label":0},{"review":"It's story is very nice I like it","label":0},{"review":"Awesome  movie and good  story","label":0}]