[{"review":"A good reality check. There are no princesses out there in the real world and if there indeed is one, a prince charming is not what she is looking for. Infact, the number of options before today's princesses is so great, a prince is something they can do away with.","label":0},{"review":"A lovely message given by this movie...\nWe should always remember ,love is only a part of our life.phle pyar karne ke kabil bno ,tab pyar kro","label":0},{"review":"This movie inspires all true man falls in love so much losses at last the girl gets ..in life , love always no nessary .this is very good movie watchable all times 😀😀","label":0},{"review":"This movie was very heart touching \nEvery boy remember not love first.first is career then love😪😎😎 this movie were example to true love and career\n'‹''Love is part of lIfe.","label":0},{"review":"I love this movie. My favorite movie. This movie in every Sean's i very like it I love this movie","label":0},{"review":"Good for the children and the people who fall in love...it is the movie which has inspired people about the real result of love...","label":0},{"review":"The biggest blunder was it's lead = Aftab !!\nIf it could have an intense actor, then it would have been a blockbuster!!!","label":0},{"review":"This film was very good its give a nice massage to all young student","label":0},{"review":"It's a good movie I don't know why IMDb give 3.8 rating","label":0},{"review":"mujhe is movie se bhoat inspiration or motivation mila h i love this movie","label":0},{"review":"When will be release part 2 of \"Kya Yahi pyar hai\" as I want to watch sequel for this movie","label":0},{"review":"yh movie me dil ko छू liya h this is fantastic movie","label":0},{"review":"Zhakaasss...........\nA normal love story movie is twist and tales.. 18/06 /19","label":0},{"review":"Assuming badly it's going to happen to me soon. Baba don't wanna...","label":0},{"review":"this movies is a great for student","label":0},{"review":"good movie my childhood memories remind","label":0},{"review":"I love movies \nLove is War in...","label":0},{"review":"Very good very nice movie","label":0},{"review":"Love is life .Gabbar singh","label":0},{"review":"It's v v v good movie","label":0},{"review":"Very nice love stories","label":0},{"review":"Hello is loves songs","label":0},{"review":"Nice fantastic","label":0},{"review":"Nice movie","label":0},{"review":"Nice movie","label":0}]