[{"review":"It is the best and most realistic depiction of falling in love... it's dealt in a very intriguing manner... Especially love the last scene where Ranveer confesses his love and the expressions of both of them were awesome...Even SOTY the kiss of Alia and Sid was really realistic....both Karan Johar and Adtiya Chopra are my all time favourites","label":0},{"review":"I really like this movie not because of ranveer Singh because Anushka shrama done a great job  whenever its come on TV so I never missed it my whole family likes  this movie everybody who is in movie  done a great job so that's why I  want to watch this movie","label":0},{"review":"This movie is a one time watch. Great acting by all but the ending is predictable and though the story is something new because it is copy of much greater movie John Tucker Must Die which has much greater ending. You can watch it but don't expect anything.","label":0},{"review":"This is good movie i only like in this movie ranveer singh i love rikki bahl character otherwise i hate ranveer . Pari did best acting in this movie.","label":0},{"review":"I am a american and loved this entire movie you sould toats watch it with captions ammericans","label":0},{"review":"I love his all movie specially lootera i love ranveer a lot he is a superstar in young generation","label":0},{"review":"My best cinema ever. I have never seen such cinema like it. Please watch it..","label":0},{"review":"I love this movies ranveer singh very good acting","label":0},{"review":"It's a Lovely movie.\nAlways ranveer 👌👌👌","label":0},{"review":"Intense suspense and fun about the con","label":0},{"review":"John Tucker must die! Is a much much more better movie than this. Just watch the original English movie.","label":0},{"review":"Superb film...huge fan of ranveer...i love this film specially...","label":0},{"review":"I love the movie especially ranveers acting","label":0},{"review":"It is a very energetic movie","label":0},{"review":"C z azzz z z rezzzzzz try t રદયયજયથયથયછ xdz dad cx see x","label":0},{"review":"I love this movie","label":0},{"review":"Very good acting","label":0},{"review":"LOVE YOU PARINEETI","label":0},{"review":"Ranveer Singh is overrated and DISASTER!!!","label":0},{"review":"Just timepaas","label":0},{"review":"nice movie","label":0},{"review":"Too good movie","label":0},{"review":"Bewilderment has left me flamboyantly flabbergasted! Absolutely swashbuckling!!","label":0},{"review":"Because of ranveer singh and anushka sharma","label":0},{"review":"It is all time Blockbuster due to ranveer,s acting","label":0}]