[{"review":"This movie is AMAZING!!!!!!!!🤗🤗🤗🤗🤩😘😍 Oh man what can I say I was mesmorized with Aamir Khan's acting. He is so engrossed into Bhuvan, and he has depicted the character so nicely!!!!!! Hats off to you Aamir Khan for such an acting. He has really proved that he can play any role of any kind. Grace Singh, for a debut it's hard to protrey the role of a 1893 villager. But she has done it with all her heart and soul, she nailed it. I love Rachel Shelly, because she's done great supporting actre ...MORE","label":0},{"review":"This movie is AMAZING!!!!!!!!🤗🤗🤗🤗🤩😘😍 Oh man what can I say I was mesmorized with Aamir Khan's acting. He is so engrossed into Bhuvan, and he has depicted the character so nicely!!!!!! Hats off to you Aamir Khan for such an acting. He has really proved that he can play any role of any kind. Grace Singh, for a debut it's hard to protrey the role of a 1893 villager. But she has done it with all her heart and soul, she nailed it. I love Rachel Shelly, because she's done great supporting actress role, and last but never the least Paul Blackthorne your acting was phenomenal. You it's not very easy yeh to assan nei hai to act as a villian. But he also nailed it. Laggan is a story of a young 1893 villager who brings freedom for India by playing cricket. I absolutely loved watching this movie. By now it's has totally been one of the best Bollywood Movies which I have ever seen. Anyway Happy Bollywood Movie Day to you all and be safe🤗","label":0},{"review":"This movie was more like watching a prolonged , semi - boring cricket match in a stadium , rather than a film in a theatre .\n\nThe novelty of this period film wore off halfway through the movie & the only recurring thought was ' how much longer is this tedious film ? '\n\nThere are several famous films which run into the 3 - 4 hour categories & are engaging in every frame , right till the end . Sadly , Lagaan isn't one of those ...\n\nWas relieved when it go over . Took off from the theatre at top sp ...MORE","label":0},{"review":"This movie was more like watching a prolonged , semi - boring cricket match in a stadium , rather than a film in a theatre .\n\nThe novelty of this period film wore off halfway through the movie & the only recurring thought was ' how much longer is this tedious film ? '\n\nThere are several famous films which run into the 3 - 4 hour categories & are engaging in every frame , right till the end . Sadly , Lagaan isn't one of those ...\n\nWas relieved when it go over . Took off from the theatre at top speed & haven't cared to revisit this mind - numbingly long film in 17 years .\n\nThough a different genre , Nagesh Kukunoor's ' Iqbal ' ( 2005 ) is a much better ' Indian cricket ' film . Low budget , yet high in content .\n\n( Aamir Khan could've done without embellishing his character Bhuvan - an illiterate indian villager , with an aristocratic white lady , Ms. Russell , being silently in love with him - if I remember correctly , the film was ridiculous enough to absurdly imply that she was so in love with him that she remained unmarried till she died - such are the preposterous fantasies & daydreams of desi boys ... Lol . Khan seems to have a pattern - he had a white fan in 'Rang de basanti ' as well ... )","label":0},{"review":"One of a mesmerizing clip was, when a British went for hunting, bhuvan alias Aamir Khan pelts stone just before shooting from them, so that deer run away from upcoming threat. That was one of the heart touching scene.  Overall movie was quite at it's best, giving inspirations to all sections of society to overcome hurdles by beating them with hard labour.\nIf u work honest and hard, god will also help you","label":0},{"review":"A fantastic film although it is 3+ hours long it seems to fly by.\nThe characters are somewhat Fellinni like in nature but the story is certainly not Fellinni like.  The imagery is so well defining of a period in British vs Indian history it immerses you into that time and feels like you are a part of it.\nEach character is well defined to the point of authenticity they feel like neighbors you knew in a past life.\nLAGAAN is a must see film.","label":0},{"review":"The soundtrack paints emotions extremely well, whether it's joy or suspense. The acting is also top notch, the actors put a lot of emotion and passion into their roles. The characters are also likeable, and they are fleshed out. \n\n                                    - 9/10, Must watch","label":0},{"review":"One of my favourite move of all time. Actors acting were truly amazing. Speciallys when that man was rotating that ball was amazing and conception was very good. Songs were real good . Storyline direction was awesome. The topic of this movie was that when British was ruling in India they used to treat us very badly . Nice movie.","label":0},{"review":"This Movie is one of the Best Bollywood Movies. Such an inspiring and motivational one. The Actors are all legend. Hats Off to every single person involved in this Movie, On Screen and Off Screen for their dedication and hard work. One of the Best Movies Ever.","label":0},{"review":"Lagaan is a kind of movie which broke all stereotypes in main stream Indian movies.it has given the freedom to Indian directors to think big and make movies that are not just an entertaining piece but life time memories. The scale of movie is huge & the acting impeccable. Can't remember another main stream Bollywood movie which was so well accepted by every Indian.","label":0},{"review":"Thank u a lot from the core of my heart to all those person in the making this graet movie ever I seen.this shows that how much problems they faced during British rule.and how a challenge forced britishers to leave the village .really thank u.a true inspiring movie.lovely.","label":0},{"review":"A full entertaining historical ..This movie best depicts the life of Indian farmer before independence ,their hardworking and honesty nature who had to pay lagaan(taxes).\n \nAlso,it tells origin of CRICKET in India where they play only  \nGILLI- DANDA .\n( A must watch for audience who wanna know Real India)","label":0},{"review":"Lagaan will continue to be one of the finest movies ever made in India .This movie broke many stereotypes.This movie is perfect in all aspects be it script, acting, music, cinematography, screenplay, acting .As a person who likes to watch content driven cinema, this movie was a whiff of fresh air .This is a story of david and Goliath .it inspires a lot.","label":0},{"review":"One of the best movie I have ever watched, if you see the movie 100 times you never bored, I must salute to all cast n crew member for making a such a wonderful movie, now a days we are missing to see that kind of movies","label":0},{"review":"Music played a major role in this epic movie.\nA.R.Rahman ruled the film by his soulful music.\nAamir Khan's acting & Gracy Singh's performance were too good.\nA must watchable movie.","label":0},{"review":"I still remember the day when I went to the theatre to buy tickets the movie hell housefull for one week later I got a ticket one week after it still gives goosebumps when I see it on television my father has worked in this movie as an office boy he handled the schedule of the movie and he was for all six months and also he's name is Gokulesh Bhatt which comes at the end of the movie as an office boy as Gokul as his Nick name","label":0},{"review":"This is very good movie because we can learn from this movie that If we oath to do something by heart then that will be automatically be done by us and we should  not give up before trying.","label":0},{"review":"This movie is a Good movie which can be seen by children and tell them about our country's greatness and learn about unity and how Britishers has ruled upon us 😏","label":0},{"review":"One of the best movie of Bollywood. You can easily list this movie into glorious movies that India made in last 100 years.","label":0},{"review":"this kind of movies are worth watching full of entertainment full of love full of inspiration ...  i was a kid when it was released otherwise i would have danced in the cinema hall","label":0},{"review":"Awesome!!... storytelling at its best..Amir is just fantastic!! Bollywood should make more epic films like Lagaan!!","label":0},{"review":"Saw earlier and saw today on DVD  ,it was best movie nail biting till end ,all songs are great and a through out entertaining  .....nice","label":0},{"review":"My favorite movie of all time. amazing mesmerising songs, awesome cinematography of that time.. certainly felt like a oscar nominated movie!! <3","label":0},{"review":"One of the best movie I have ever watched, if you see the movie 100 times you never bored, I must salute to all cast n ..","label":0},{"review":"Lagaan is my favourite movie.\nI love it .\nAll cast and crews are outstanding 👍","label":0},{"review":"The movie that really made indian movies to evolve as faster to make a make in the global platform. .a classic creation","label":0},{"review":"a perfect patriotism instilling movie. Worth watching.\nIt will surely help people to filter their thoughts about religiosity, regionality and humanity.","label":0}]