[{"review":"I love this movie, the vibe it delivers from start to end is just breathtaking. The mesmerizing scenes from the state of Jammu and Kashmir are beautiful to watch on the big screen.\n\nThe patriotic feeling that it develops in each of the viewer is brilliant. The whole team behind the camera has done a commendable job but this does not mean the one in front were any less, Hrithik Roshan and P. Zinta delivered a convincing performance.\n\nThis movie was a great watch and even after years it still is e ...MORE","label":0},{"review":"I love this movie, the vibe it delivers from start to end is just breathtaking. The mesmerizing scenes from the state of Jammu and Kashmir are beautiful to watch on the big screen.\n\nThe patriotic feeling that it develops in each of the viewer is brilliant. The whole team behind the camera has done a commendable job but this does not mean the one in front were any less, Hrithik Roshan and P. Zinta delivered a convincing performance.\n\nThis movie was a great watch and even after years it still is even today.","label":0},{"review":"Actors acting were too good . I have seen this movie 234 times . Songs were too good. Social message they given in this movie you should good work for your own country and you youngsters have fixed a goal about your career . That what you want do in your life what you want become. Doctor engineer lawyer pilot scientists chef etc . Your parents will pay money for your education and they will supply cash to you that is absuutely fine . But in their absence you have to manage your own daily bread f ...MORE","label":0},{"review":"Actors acting were too good . I have seen this movie 234 times . Songs were too good. Social message they given in this movie you should good work for your own country and you youngsters have fixed a goal about your career . That what you want do in your life what you want become. Doctor engineer lawyer pilot scientists chef etc . Your parents will pay money for your education and they will supply cash to you that is absuutely fine . But in their absence you have to manage your own daily bread for yourself it's reality. When Boman Irani was scolding Hrithik Roshan that you have taken my permission for applying in ima indian military academywhen Boman Irani was telling to Hrithik Roshan that Ian there for earning money . But it's not correct way to treat your children lke that .","label":0},{"review":"Watched this movie so many times yet \neverytime I love it more and more.Seriously can't praise this movie enough, it is one of the most under appreciated films in the history of indian cinema. Everything about this movie is bang on perfect. From the story, the mesmerising background score, the performances of the actors, everything is just so perfect and inspiring about this movie. Farhan Akhtar has truly given us gem in Lakshya.","label":0},{"review":"One of the best movie in my favorite line. The storyline described perfectly a life of misguided  teenager who eventually become a war hero. There are we have a many others heros who has named a Indian soldiers that saves  our country.  I always salute  our brave soldiers they deserved a respect. We should be thankful to their kindness.","label":0},{"review":"Its not at par with URI, but surely it none the less. Lakshya takes you to the world of indian army. It is a journey of a aimless man to a hero of army. Mr. Roshan as played his role magnificently and its more of a war film then romantic. Also its not like every thing in war is focused on karan (roshan) the team work and different characters are given importance . Today's young generation  should surely watch this film to find their lakshya of life. I give this film 4/5 . Jai hind, jai bharat","label":0},{"review":"Hrithik Roshan has been always doing unique roles to prove his versatility. He is amazing dancer and now I after watching Lakshya, I would say, he is a talented actor as well. The movie have no flaws and truly inspiring. Director Farhan Akhtar have made everything possible to involve the audience. A must watch movie!","label":0},{"review":"It's a classic from Mr.Farhaan Akhtar. Best (and only sensible) movie on indian army ever made by indian till date.\nMr. Farhaan's direction his vision is really good. Time duration is quite long. but Akhtar takes care of it with his fast story telling.   Cenematography is outstanding. performances are good.Mr.Roshan does a good job  good supported by zinta ,Boman Irani.","label":0},{"review":"One of the most favourite and patriotic motivational movie in my movie list.. \nThis movie gives a inspiration and energy to youth(aimless) to found and focus on Lakshay of their life. \nOne more thing that makes it special which is Soldier's life.. Jo adhiktar youngster ka dream bhi hota h..","label":0},{"review":"An inspiring movie. Best ever performance by Hrithik Roshan. One of the best movies on Indian army. An outstanding coming of age take film. Hrithik Roshan, Amithab Bachan and other actors gave their best in army uniforms.Battle scene was epic. Songs were nice.","label":0},{"review":"This is a movie of a common boy who doesn’t have the realisation of his true potential which is true for many a youths..once realised, he turns out to be the best. The movie showcases the real life of an army officer and is filled with emotions, circumstances, challenging situations and the ways to overcome.\nA fantastic movie and a must see particularly for college students.","label":0},{"review":"An exceptional movie...realistic in picturising the actual chain of events in kargil war... rock climbing scene is a classic...n \"I miss u\" scene between Hrithik n priety just incomparable... FARHAN AKHTAR hats off to u...great piece of work....u r right in assessing \" only need to change wrt this movie is the audience\"...","label":0},{"review":"It is brilliant movie. Probably the best war movie Bollywood has contributed to the industry. Direction and Storytelling is flawless and scriptwriting is much more professional than many others. Military terms/lingos are used really well. All in all a great movie.","label":0},{"review":"Awesome movie, I still stream it for some sequences. Great acting and superb direction, would feel exactly being in a Field area in the army. Has similar coming of Age to an old Hindi movie with Air force background called \"Vijayeta\" but definitely a different story line.","label":0},{"review":"Whenever I saw this movie I feel proud, it's one of the amazing movie write by Javed Akhtar Sahab, lot of emotional moments & energetic words used in this picture it's fantastic and superb.\nThen how he come back to the academy then how he transform himself a soldier and how he developed his skills & mentality to combat on border to secure the area of our, hats off to our soldiers.","label":0},{"review":"One of the most authentic films made on the Indian army. A journey of an aimless lethargic boy who is in search of the aim of his life and ultimately becomes a dedicated soldier.\nBest performance of Hrithik till date....\nA cult classic❤","label":0},{"review":"It's one of the best Inspirational movie ever created in Indian Cinema! Kudos to the Director(Farhan) and his crew. Awesome work Hrithik as usual. He always deliver 100% of his work.","label":0},{"review":"This movie always mesmerises me. The cinematography is awesome. Acting is very good, it never felt as if they were acting, it was natural,good action and keeping you excited is the storyline. Five star from my side.","label":0},{"review":"It's blows your mind. It's an incomparable piece of cinematic work, when it comes to war films made in Bollywood. None of the scenes are overdone, neither the war scenes, nor the human equations. It all cooks slowly, and it tastes sinfully good.","label":0},{"review":"One of the best Bollywood movies in the last 20 years. Arguably Hrithik's best performance and Farhan Akhtar's best movie! The soundtrack is simply amazing with the Title track being the best of the lot.","label":0},{"review":"It is the Best movie in bollywood so far. Don't  know why such type of movies are not being made.Have seen it more than fifty times and still loving it.","label":0},{"review":"classic hit.....best movie ever made on indian army by bollywood and will inspire the youth to join indian army for years to come. MUSIC is hit .. hrithik is at its best and the script all perfect in this hit.","label":0},{"review":"Amazing and a very inspiring movie.. Good direction and very impactful songs..\nI hope bollywood gives us more of such movies based on our real heroes.. The soldiers.","label":0},{"review":"A true classic.A portrayal of determination & love.It takes us to a journey of self discovery.\nEvery song of this movie carry an emotion within itself.\nThe seperation scenes of this movie are so strong that they will shake you up emotionally.","label":0},{"review":"It's one of my favourite movie although it always motivated me whenever I was in need , a must watch movies  for every defence aspirant as well as for the youths of our country","label":0},{"review":"Ever want to feel motivated and make your vision crystal clear towards your goal then watch this movie. This is a masterpiece of Indian Cinema. Well done Farhan Akhtar.","label":0}]