[{"review":"Lakshmi movie Review: AL Vijay if he makes a hit or a flop I watch all his movies for the reason he has so much of love and passion in film making and he is one who brings emotion on screen so well. He has used \"DANCE\" as the main flavour to deliver in Lakshmi and who else other than Prabhu Deva can deliver the best that's the ground rule set in this film. Let's not go in deep whether it has good story and screenplay. Its a kids dance movie and when it comes to kids director AL Vijay is master p ...MORE","label":0},{"review":"Lakshmi movie Review: AL Vijay if he makes a hit or a flop I watch all his movies for the reason he has so much of love and passion in film making and he is one who brings emotion on screen so well. He has used \"DANCE\" as the main flavour to deliver in Lakshmi and who else other than Prabhu Deva can deliver the best that's the ground rule set in this film. Let's not go in deep whether it has good story and screenplay. Its a kids dance movie and when it comes to kids director AL Vijay is master piece in this subject. Ditya a school kid has DNA as dance and her mother hates dance and how did ditya succeed in dance is what the plot of story. All kids who performed in this movie is lovely. Go and enjoy for kids and if you are a big fan of dance. Prabhu Deva dance for 10 minutes in the movie is a highlight. Sofia as a dance coach has done well. As usual natural role artist Aishwarya Rajesh has performed so well as ditya mother. On the whole once again Vijay has done a great work. Do watch in theatre and enjoy. My rating is 3 out of 5.","label":0},{"review":"I watched this film in telugu version #LAKSHMI...I went to this film with very low expectations. But, it creates more interesting from starting of the film. #DITHYA loved your performance and Kids did a good job. especially JeetDas(Arjun dance master's son) and fat boy(I think bharat but, don't know his original name) given their 100% performance...\n\nThere is a 5 minutes scene before the training song in second half when prabhu deva garu trained kids is brilliant. especially there is a heart bro ...MORE","label":0},{"review":"I watched this film in telugu version #LAKSHMI...I went to this film with very low expectations. But, it creates more interesting from starting of the film. #DITHYA loved your performance and Kids did a good job. especially JeetDas(Arjun dance master's son) and fat boy(I think bharat but, don't know his original name) given their 100% performance...\n\nThere is a 5 minutes scene before the training song in second half when prabhu deva garu trained kids is brilliant. especially there is a heart broken scenes in second half and pre climax. really touching and emotional. \n\nEven climax dance is not upto mark, director taken it in to new level. people clapped and cried at that time\n\nmy rating is 5/5\n\n\n\n#DITYA #2_BOYS #PRABHU_DEVA #YUSUF","label":0},{"review":"Watched the movie.. My opinion is that, for all the people who love dancing, for the parents who encourage  their kids dancing skills to grow it is a good movie. But for a general audience this movie will give a feel, kind of watching the reality dancing show which we use to see in the Television on a bigger screen. All the drama factors which we see in the movie are already staged in the reality dancing shows in almost all regional channels in our country. (Spoiler alert : Deaf kid dancing with ...MORE","label":0},{"review":"Watched the movie.. My opinion is that, for all the people who love dancing, for the parents who encourage  their kids dancing skills to grow it is a good movie. But for a general audience this movie will give a feel, kind of watching the reality dancing show which we use to see in the Television on a bigger screen. All the drama factors which we see in the movie are already staged in the reality dancing shows in almost all regional channels in our country. (Spoiler alert : Deaf kid dancing with the mentor on the stage and people getting sympathy over that kid, dancing with bleeding on the stage etc etc..)  Of course all the child artists in this movie are the ones who already reached fame through the reality dance shows in India.\n\nIf you are a person who is already tired of watching the reality dance shows in the Tv better skip this movie..!\n\nIf you have some passion towards dance and want to enjoy purely the dancing factor irrespective of cinematic experience go for it.!","label":0},{"review":"Such a great and wonderful film to watch and enjoy. Astonished by the young talents rocking the stage. Proud of you guys. We Indians are proud of you all. If there will be a 2nd part it would have been thrilling and more exciting. Can't have words to explain. 😘😊👌👏🤝","label":0},{"review":"I expected more in this movie as a dance lover, also got it. I watched this movie with family, mom came with us after a year of gap to theater. She also appreciated about the movie. Vijay's movie making, PD's stylish walk, dance, Ditya, Jeet Das and his friends are rocked .... Overall: Must Watch film as my point of view. :)","label":0},{"review":"I watched this movie in Tamil actually I don't know that much Tamil but I love dance and I love Prabhu Deva sir so I watched it all with my family . This is not just a movie This is mind-blowing extraordinary amazing fabulous.....\nNo words to say it's a must watch movie from the legend.","label":0},{"review":"Super duper movie in her life by prabhudava sir & vijaya sir \nNow ditya are very very beutiful & she dance has most beuty\nShe is future star \nLittel master of the dance 💃💃👯\nUr hair style is very beuty \nPlzz help me ur hair style it's me \nUr parents are most proud of ur performance after watching movie \nSpeech are very nice\nFinally i am big fan of u\nI love ❤😘so much","label":0},{"review":"Lakshmi it was awesome . After watching the songs of this film,I decided to learn dance . basically I am a fat boy but I have to learn dance . Thank you for AL Vijay to make the film.This film has to run over 100 days in theatres .God bless all","label":0},{"review":"I lovuuu dityaa .This film is amazing . I love this film very much. I am so thankful for all the one who took a part in making this inspiring film. I had seen this film many times in malayalam version.I loves dance very much after seeing this film. I lovuu ditya , Prabhu Deva and all.\nThankuu","label":0},{"review":"I saw this movie in mumbai.I am a maharashtrian but I enjoyed this movie . Language was not at all a barrier.I enjoyed Dittyas dance.Children's dances were superb.Prabhudeva was too good.Most imp.thing i enjoyed was the last scene of Prabhu deva and \nSalman yusuf and dance of Dittya.A must watch movie with family.","label":0},{"review":"Yeah...It is really nice but a predictable story. as a Maharashtrian Ditya has done her best and all others including Jeet das was really spectacular and Akshit really rocked.. aala aala was a soothing song and morrakka was an energetic song ..paparapappa was really musical ...praniti hats off..Nilladey was an inspirational song and dreamy little chellamma was cute Aishwarya Rajesh ma'am was very well as a mother anyway nice work AL Vijay sir .Last but not at all the least DANCE was really rocki ...MORE","label":0},{"review":"Yeah...It is really nice but a predictable story. as a Maharashtrian Ditya has done her best and all others including Jeet das was really spectacular and Akshit really rocked.. aala aala was a soothing song and morrakka was an energetic song ..paparapappa was really musical ...praniti hats off..Nilladey was an inspirational song and dreamy little chellamma was cute Aishwarya Rajesh ma'am was very well as a mother anyway nice work AL Vijay sir .Last but not at all the least DANCE was really rocking...Dance is my passion..","label":0},{"review":"Lakshmi Telugu movie 2018\nWriten  story by A L Vijay is nise\nChallenge part is good in the movie \nDance move ments are fantastic \nWell made movie \nPrabhudeva dance steps are nise\nYouth has to learn dance steps \nFrom Prabhudeva. \nHe is fantastic dance choreograper in the film industry  hats up to you.","label":0},{"review":"This is an very inspiring story for all,not only for dancers .The acting and dancing of the children is very excellent \nTotally it is A FANTASTIC MOVIE\nPRABHU SIR & VIJAY SIR thank you for giving EMOTIONAL, INSPIRATIONAL&WONDERFUL MESSAGE TO THE PUBLIC\nCONGRATS FOR ALL YOUR TEAM VIJAY, PRABHU DEVA SIR, DITYA & FOR ALL MEMBERS","label":0},{"review":"Excellent movie, really I feel the passion of human being, myself, son, daughter, wife aggressive to see this movie again and again. Best wishes to Director for Heartfull success of this movie and my ever loving fan of my Indian Michael Jackson Prabhu Deva sir and all kids on this movie.","label":0},{"review":"Hi,lakshmi movie was extradionary,heart breaking..!! I would lik 2 appreciate 2 all lakshmi team members i was mostly waiting for the movie 2 release.. To see Ditya Bhande on screen wit Prabhu Deva sir!!!!😍 I am a big fan of Prabhu Deva sir an ofcourse Ditya Bhande is ma fav😍😘 Ditya Bhande al the best for yur future😇 #DITYA BHANDE forever","label":0},{"review":"The main highlight of movie was Prabhu Deva and the child. The every step of dance by all is perfect. The story was heart touching and the ending was fantastic with emotions, dance steps. The theme of the movie is expressional. Every one can see the without boring. It is a perfect story of dance.....","label":0},{"review":"Ditya as Lakshmi is brilliant. The dance overwhelms the narrative and rightly so. Prabhudeva and Aishwarya Rajesh are understated and deliver solid performances. Inspirational 👍👍. Will watch again.","label":0},{"review":"One movie the entire family can enjoy together. Especially the family who loves dance. No vulgar scenes, no double meaning dialogues, no dishum dishum. Good casting and best acting by all. Paisa  Vasool movie.","label":0},{"review":"i went in with the moive like real life . superb moive i was waiting for moive when i saw the song moraakaa what Moive i loved it very muvh hats off to vijay director. my favourite  director is vijay.","label":0},{"review":"I liked this movie very much n the last ending scene was amazing prabhu deva did fantastic peromance ditya did a great dance n this movie moves u up n your body will shake automatically in the last n comedy was awesome n prabhu devas biggest super dance hit film","label":0},{"review":"It was a fantastic movie . Dances were so ....amazing . Lakshmis performance was super duper .The  two other boys Arjun and Arunal was just super amazing . Thod Diya phod Diya sabhko peeche   chod diya","label":0},{"review":"I was waiting for the movie for about 2 weeks.And it was a nice movie and didn't give me a disappointing feel.Ditya Bhande 's dance moves were awesome.Overall it is a good movie by director Vijay and team including Prabhu Deva,Ditya Banda,Aishwarya Rajesh and Kovai Sarala.It is a must watch movie...","label":0},{"review":"Such a wonderful movie. All kids are dancing very well. My favourite is aala aala song. Saidhavi and g.v.prakash sing very sweet. Lakshmi and arjun dance superb.","label":0},{"review":"OMG, this movie was amazing!!!!  I loved the movie not just for the songs but the last part made me cry!!! It had so many emotions to it. I dance also so I actually relate to the movie so much!!!!","label":0},{"review":"Excellent movie.The little girl was very amazing and her moves were excellent.Good movies like this should be encouraged.The finale dance was incredible.hats off to prabhu deva and team for such a choreography.","label":0}]