[{"review":"A beautiful movie loosely based on a true story with an exceptional original score and outstanding performances and very strong direction.\n\nThis Italian masterpiece directly takes you to WW2 Italy, showing glimpses of the constant torture faced by the Italian Jews  by the anti-semitic Axis powers.\nThe acting by the lead Roberto Benigni was absolutely phenomenal that it'd be a crime to call it \"acting\", who bagged a well deserved oscar for the same.\n\nThe movie sends a powerful message of Love and ...MORE","label":0},{"review":"A beautiful movie loosely based on a true story with an exceptional original score and outstanding performances and very strong direction.\n\nThis Italian masterpiece directly takes you to WW2 Italy, showing glimpses of the constant torture faced by the Italian Jews  by the anti-semitic Axis powers.\nThe acting by the lead Roberto Benigni was absolutely phenomenal that it'd be a crime to call it \"acting\", who bagged a well deserved oscar for the same.\n\nThe movie sends a powerful message of Love and Hope and brings humor even in the toughest of times.\nRoberto Benigni 's intelligent yet funnily goofy character always stays positive and does anything he can do to woo his wife and keep his son happy at all times with his witty actions.\nThere are times in the movie where it seems all hopes are lost, yet the protagonist keeps on going, being able to find even the littlest of positivity and spreads it onto the people he loves. Even when he knew he is sad, he never let his wife and son lose hope and always puts them first before himself.","label":0},{"review":"This film is, without a doubt, a masterpiece.\nThe first half is a sweet romance story filled with laughs and warmth about a charming, gentle, yet humorous Italian-Jewish waiter who eventually wins the heart of the girl of his dreams. The second half is a heartfelt story of a father protecting his young son's innocence in spite of everything horrible going on within the setting of a concentration camp.\nA number of people complain that this is too happy for a holocaust film. I know very well that  ...MORE","label":0},{"review":"This film is, without a doubt, a masterpiece.\nThe first half is a sweet romance story filled with laughs and warmth about a charming, gentle, yet humorous Italian-Jewish waiter who eventually wins the heart of the girl of his dreams. The second half is a heartfelt story of a father protecting his young son's innocence in spite of everything horrible going on within the setting of a concentration camp.\nA number of people complain that this is too happy for a holocaust film. I know very well that a concentration camp was no amusement park and that the film didn't mask what the Jews suffered before and during their imprisonment (within a PG-13 rating, not as severe as Schindler's List), but the fact that a father decides to protect his child's innocence from the horrors of a camp by pretending it's all one big game, from playing hide and seek to \"making fun of\" whatever rumors the son heard about what happens in the camp, is truly sad in itself. \nEach of the two stories in this film was heartfelt and well written. It's a film that warms your heart and then breaks it. A film that makes you laugh and then makes you cry. A film that wraps every emotion into one beautiful story. \nRoberto Benigni really outdid himself. I can't say it's the greatest film ever made, but I have a feeling that if anyone tried to make an English adaptation of this, it could never compare to the original.","label":0},{"review":"This is an underrated movie. Sure, I think it had some minor flaws, how it went a bit too fast.\nBut it's definitely underrated and needs more recognition. The beginning is like a dream, so beautiful, so lovely, really expressing the \"Life is Beautiful\". And it also will make you laugh a bit. And Guido is just such a positive soul (throughout the whole movie).\nAnd then as the movie progresses, things get progressively darker.\n[SPOILERS] And even when you reach the part where they're in the concen ...MORE","label":0},{"review":"This is an underrated movie. Sure, I think it had some minor flaws, how it went a bit too fast.\nBut it's definitely underrated and needs more recognition. The beginning is like a dream, so beautiful, so lovely, really expressing the \"Life is Beautiful\". And it also will make you laugh a bit. And Guido is just such a positive soul (throughout the whole movie).\nAnd then as the movie progresses, things get progressively darker.\n[SPOILERS] And even when you reach the part where they're in the concentration camps, more specifically in the barracks, you still laugh at the scene where Guido says he understands German and pretends to \"translate\" by saying some funny stuff and making up a funny story so his son Giosué doesn't get afraid or sad.\nAnd then you start thinking about it.\nAnd then you cry because it's actually really sad.\nAnd then you cry when you reach the end of the movie.\nIn conclusion, I really think more people should watch Life is Beautiful. It's actually sort of a gem, a gem you want to keep for yourself, but at the same time, show it to others so they can appreciate it for it is a masterpiece.\n4.4 out of 5. For it's minor flaws.","label":0},{"review":"just a Good one, not a Great one !!\n\nThis movie definitely has its moments but overall it is not more than a small charming melodrama which is worth watching but nothing too special.\n\nYou can see why it was a success, but it wasn't that good...\n\nI had heard so much about this movie for so many years until I finally watched it. The first act is very different than the second, which is, in my opinion, superior by far. The first act contains too much unnecessary comedy and is not taken seriously. A ...MORE","label":0},{"review":"just a Good one, not a Great one !!\n\nThis movie definitely has its moments but overall it is not more than a small charming melodrama which is worth watching but nothing too special.\n\nYou can see why it was a success, but it wasn't that good...\n\nI had heard so much about this movie for so many years until I finally watched it. The first act is very different than the second, which is, in my opinion, superior by far. The first act contains too much unnecessary comedy and is not taken seriously. At all. But then there's the wonderful second act. It shows us the love between a father and son and how far a man is willing to go to achieve the happiness of his son. The second act is taken a lot more seriously and I consider it to be excellent. That being said I do think this movie is very uneven, and therefore overrated. But because of the great second part of the film, I would recommend Life is Beautiful.\n\nIt surely would have been better to work on that superficial \"la dolce vita\" atmosphere. The Academy Award is justified but only because of the lack of competition.\n\n\n6/10","label":0},{"review":"Life is beautiful is the best movie i have ever seen.This is not just an ordinary drama.This movie makes you laugh from the beginning and makes you cry at the end.I don't no Itialian but I understand the whole movie only because of emotion.The acting of Roberto is mind blowing.This movie is the celebration of life.And we can find happiness even in the darkest of time,this movie proves that.I cried so hard on the last scene when Guido did a play-dance for his son to keep up the act that it was st ...MORE","label":0},{"review":"Life is beautiful is the best movie i have ever seen.This is not just an ordinary drama.This movie makes you laugh from the beginning and makes you cry at the end.I don't no Itialian but I understand the whole movie only because of emotion.The acting of Roberto is mind blowing.This movie is the celebration of life.And we can find happiness even in the darkest of time,this movie proves that.I cried so hard on the last scene when Guido did a play-dance for his son to keep up the act that it was still all a game.The heart touching thing is it shows us a best father's responsibility.I closely read the holocaust realities.It’s pain.Finally,I can say emotions doesn’t need language this movie is the best example for that.But in the end Life is always beautiful.❤","label":0},{"review":"@ Teju✍: What should I say on this?\nIt's like a dream.\nIt never seems to be real story.\nBut the pop was just an amazing person who converts critical situations in easy one and in easy way.\n But the death of his pop was very touchable and shocking.\nHow was he face his son while going to die.That seen makes my eyes wet.\n\nAnd finally what I understood is that, learn to findout the happiness in any worse situation.","label":0},{"review":"Birthdays are meant to be full of laughter and cheer. When the guest of honor opens his or her birthday card from you, you’ll know why they can’t stop smiling. Pick out one of these funny happy birthday quotes or mix and match them with your own words to craft the perfect cheers to another year older.","label":0},{"review":"Really Heart touching movie, script, story and some positive message to Viewers\n1. Teach us how to re-act on bad situation by presentation positive side, they way Father teach son of every hurdle, during train start, in camp, every time he never feel his son that he is in tension\n\n2. Life is beautiful","label":0},{"review":"Emotions doesn't need language, this movie is the best example for that. I don't no Italian but I understand the whole movie only because of emotion. It made me laugh, it made me cry..............this movie is the celebration of life. And we can find  happiness even in the darkest of times, this movie proves that. I hope all the persons who lost there lives in the genocide of the Jews will at least find peace in their death.","label":0},{"review":"Very nice movie. Very proud of you director paaji! Keep up the good work mera beta, A+++. vvv osm sir ji!! I want my son to grow up to be like you, I love you and this picture very much. Thank you for your time. Hope to see you soon.","label":0},{"review":"This is not just an ordinary comedy drama. This movie makes you laugh from the beginning and makes you cry at the end . The acting of Roberto  is mind blowing. Overall it's one of the most touching filmss that I have seen . The movie display love and the crualty of the holocaust.","label":0},{"review":"Between the movie title and the seemingly cheerful game-playing spirit of the father, it seemed like a cute movie, through the whole movie, almost to the end. Then the dad was killed, unbeknownst to the son, who cheerfully rode out of the concentration camp with the winning allies. End of movie. It was a totally unexpected ending, with the father not cheerfully exiting with his son, but dying, and it ripped me emotionally--I cried deeply. (Not something I usually do)","label":0},{"review":"A movie with powerful depiction of emotions of love, a father feels for his child. The father did everything for saving his beloved child.The acting was as powerful as was the plot. Roberto benigni was immaculate throughout the movie. To cut a long story short, the movie is a must watch.","label":0},{"review":"This film is incredible and breathtaking and even gutrenching at times. The film teaches you to be optimistic even in the most devastating situations .This undoubtedly is one of the finest films ever made on life and history. This is a must watch","label":0},{"review":"Everyone wants personal success and to learn the keys to success. Everyone wants to have a happy, healthy life, do meaningful work, enjoy a career, and achieve financial independence. Everyone wants to make a difference in the world, to be significant, to have a positive impact on those around him or her. Everyone wants to do something wonderful with his or her life.","label":0},{"review":"I thought it was great overall. I loved the action parts because it was much more interesting to watch then the beginning. I felt like the beginning was a bit boring and it was grabbing the viewers attention away from the film. I feel like the movie was a bit too long to get to the main plot. But overall, it was good and I liked it.","label":0},{"review":"Best movie ever.. brilliant performances and awesome script. This movie makes me cry . I have close relatives who are holocaust survivors. Its pain ..anytime I hear their stories. But in the end \nLife is always beautiful :)","label":0},{"review":"I closely read the Holocaust realities. The film Life is Beautiful adds to my jnowledge Bank. \nBut I have always windered how the Six milon hapless jews can be annihilated in a civilized society in 20th century. Deep introspections are needed.\nNirupam Haldar","label":0},{"review":"With the astonishing rise in anti-semitism in our time—the 21st century—this movie is especially gripping and instructive, even though Benigni’s character is a masterful clown.  Mass murder of millions of Jews during World War II was no laughing matter, nor have the killings of Jews at prayer in synagogues been in our day.","label":0},{"review":"The Italian classic.\n\nRoberto Benigni is flawless with his humour. The way he keeps his son away from the war world is something which might melt your heart.\n\nThe film will make you laugh and will also make your cry. \nYou need more reasons to watch it yet?","label":0},{"review":"I love love this movie. I seen this movie 10 years ago ...amd not one day goes by that i dont think of this familia and what they're saying had to go through just to be happy and live their life \n. A d so so sad at the end what this father did for his child.","label":0},{"review":"1st half of quite booring but later this movie recovered the best scenes. Beautifully crafted by the lead actor. He has done great work. Last scene was very emotional. 7.5 out of 10.","label":0},{"review":"Its a movie that's gonna hunt every movie buffs really great..and hetvi shah don't show your stupidity in each and every comment it's not only a good movie it's really above that it showed a different atmosphere of holocaust and you mean it won all these awards because of lakh of competition why you make nonsense facts on each and every good films you only have the right to express what you felt about one movie not to make fake facts.and the critics gave good score and regarded as one of the bes ...MORE","label":0},{"review":"Its a movie that's gonna hunt every movie buffs really great..and hetvi shah don't show your stupidity in each and every comment it's not only a good movie it's really above that it showed a different atmosphere of holocaust and you mean it won all these awards because of lakh of competition why you make nonsense facts on each and every good films you only have the right to express what you felt about one movie not to make fake facts.and the critics gave good score and regarded as one of the best Italian movies yeah all this because of lack of competition isn't it. Don't try to be oversmart.","label":0},{"review":"I thought this movie was honestly a 10/10. Some people think its childish or that it is making fun of the holocaust.I would have to disagree.I do understand why they would think this because of the humor but ,it did help me and my class realize that humor is sometimes needed in life. This movie took me through a trail of emotion. A 10/10 for me","label":0},{"review":"It's such a beautiful movie. When we argue with our sons and daughters, we don't appreciate the little things we have. I cried so hard on the last scene when Guido did a play-dance for his son to keep up the act that it was still all a game. I was ugly-crying a lot...","label":0}]