[{"review":"I m not a fan of Bolly movies. But loved this one so much..💖 Indeed the film is a lively portrait of the lives of the middle-class people of an Indian metro city. Metro dwellers will find many similarities with their 'own kahanis'. The sound tracks r heart touching too. A big 👍","label":0},{"review":"I like it, the film makes for interesting viewing. I saw it again last week after many years, and still found it watchable & engaging. The format of the film is somewhat like city life in reality - many lives intersect with each other, there is much drama just under the surface, and we carry on keeping a cool exterior...","label":0},{"review":"The film, Life in a Metro, tries to protect the sanctity of long standing relationship, called marriage. However, relationships like any other thing changes over time. \n\nBy bringing Sikha and Ranjeet together again, this film confoms to regressive outlook. From that point of view, I still find, Kavi Alvida Na Kehna is more modern and realistic in its approach.","label":0},{"review":"One of the finest pieces of Cinema , Bollywood has to offer. The story and the heartwarming songs haunt you! Fantastic writing and screenplay..","label":0},{"review":"Life in a metro such a great movie all time in bollywood movie list. Great performance given by irfan khan, Dharmendra etc.\nAll time my fvrt list.","label":0},{"review":"See i am a fan of Bollywood movies crafted by it's art of originality .This movie is one of them showing our relation with people and city with a good mixture of songs!","label":0},{"review":"I loved this movie... Damm good screen play... With interesting alternative characters.... Three cheers for the entire team..","label":0},{"review":"It's a fine film, with the worst musical score woven throughout the narration of the story. Whoever made the decision to include that music should immediately and permanently locked in a vault.","label":0},{"review":"A beautiful narration of nine lives in a metro. Beautiful songs and amazing screenplay!","label":0},{"review":"Wel made movie depiction of various aspects of urban man-woman relationship. Well written, wel acted, wel direted n off course wel edited movie I ever seen.","label":0},{"review":"best crafted movie story life is a metro sing them singers   #KK#ZubeenGarg#ArijitSingh#SheryaGoshal  best concept on this movie","label":0},{"review":"Irfan was best in the movie. And movie is brilliant. I m still watching it in 2018","label":0},{"review":"I really like the movie because  the songs was good and everyone do there best in the film☺☺","label":0},{"review":"A very good concept, a very good story but failed in portrayal\nFelt incomplete and the climax ruined the mood of the film with it's cliche bollywood unrealistic scenes\nGood job with the music","label":0},{"review":"Excellent piece of work by everyone ... Especially director Anurag Basu <3","label":0},{"review":"Utter and complete rip off of The Apartment 1960..Our celebrated movies and their directors are just expert con artists","label":0},{"review":"Loved movie. Nice performances by all","label":0},{"review":"A part of it plagiarised from \"The Apartment\".. bt overall a good film..","label":0},{"review":"ONE OF THE BEST MOVIES I HAVE SEEN IN MY LIFE.","label":0},{"review":"Great heart touching songs and superb acting by all","label":0},{"review":"It was amazing movie and I reely reely loved it","label":0},{"review":"In which bus go to from lord more to chinar park big bazar then I go from chinar park big bazar to pnb bus stop salt lake","label":0},{"review":"Awesomeeee movie!!\nGreat plot\nGreat actors\nGreat music\nLoved it. <3","label":0},{"review":"This is a piece of art showing the life of people living in a city.better film than the khan type movies","label":0},{"review":"story is different and really good...","label":0}]