[{"review":"There's a saying that \"SOLDIERS never die\"\nIts very true because they leave a legacy behind them\n.\n.\nThis is not just a movie but a real inspiration that still rules a million of hearts in India as well as the whole world\n.\n.\nits a long movie so many may get bored by the running time but believe me when you see it you will wish to see it again again and those scenes and dialouges will keep coming in your mind even after several days and you will feel so proud of our soldiers that you may even cr ...MORE","label":0},{"review":"There's a saying that \"SOLDIERS never die\"\nIts very true because they leave a legacy behind them\n.\n.\nThis is not just a movie but a real inspiration that still rules a million of hearts in India as well as the whole world\n.\n.\nits a long movie so many may get bored by the running time but believe me when you see it you will wish to see it again again and those scenes and dialouges will keep coming in your mind even after several days and you will feel so proud of our soldiers that you may even cry and salute them secretly\n.\n.\na big salute to all those \"real\" heroes still standing on the borders protecting us and proud of their families too🇮🇳","label":0},{"review":"This is not just a movie, but the lives of those who sacrificed themselves wd a big smile for our future..and see wt future we r paying to these martyrs...\nI just can stop imagining wt the families loved ones have gone through and still going through...\nIrreparable  loss to d families...and I just imagine how hard strong minded these brave heroes were... \nAnd all our force personnel are..\nA big salute to all","label":0},{"review":"A very emotional and heart touching film for me. Every time I watch it, Every time my eyes are filled with tears. Good Direction by JP Dutta. Good acting by all the actors. It was an honest tribute to all our soldiers.","label":0},{"review":"A very beautifully pictured documentary by j. P dutta i must say and suggest to. All the Indians to watch this movie and realise that how our army soldiers fought for our better tommorow... Even there is a line in the movie which was actually said by capt. Vijayant thapar that if you get a chance come here and see  where the indian army fought for your better tommorow..... ❤️❤️..","label":0},{"review":"This movie \"LOC KARGIL -before we forget\" is a 2004 big-budget Bollywood release produced by Mr.Bharat Shah & directed by Shri Jyoti Prakash Dutta. It's a real-life , documentary account of the 1999 Kargil war fought between India and Pakistan. This movie LOC is not just an educative, informative and entertaining movie but it's also an experience of going back in time and relieving the iconic moments of the 1999 KARGIL war in the midst of the Indian army soldiers. This movie was shot on the very ...MORE","label":0},{"review":"This movie \"LOC KARGIL -before we forget\" is a 2004 big-budget Bollywood release produced by Mr.Bharat Shah & directed by Shri Jyoti Prakash Dutta. It's a real-life , documentary account of the 1999 Kargil war fought between India and Pakistan. This movie LOC is not just an educative, informative and entertaining movie but it's also an experience of going back in time and relieving the iconic moments of the 1999 KARGIL war in the midst of the Indian army soldiers. This movie was shot on the very same 20,000 feet high Kargil peaks where the armies of India and Pakistan fought at the world's highest battlefields- Kargil, Ladakh AND Siachen Glacier.","label":0},{"review":"Jp dutta loc kargil gave goosebumps to me. sad seeing deaths of our soldiers ..this movie is a master piece  .... understood more than 4 hours movie but great worth of watching it . This movie inspired me for nda exam also ...if u watched this movie u willl no this dialogue  (yeh dil mangee more)cheer up for jp dutta please make some more movie","label":0},{"review":"Country love energetic movie which prove Indians bravery. It's also prove that army life is not so easy to live in which u have loss of many loves and friendship. Best movie with outstanding actor's role.","label":0},{"review":"Real life war situations are well depicted in the movie. Movies has well shown that josh alone does not work when you can't see the enemy but enemy not only see you but he can select which part of the body targeted too. I heard that 99 soldiers got the hit in eye during Kargil war.","label":0},{"review":"Really boring and pakau movie... God damn the unnecessary stretched love stories of soldiers and mention of life tragedy of soldiers at every 2 minutes.......and sad music and song every 5 mins...this is movie that would require audience to be tied in movie Hall's lest they run away with boredom...... Avoid this at all cost. Rather watch Border another better Indian war movie.","label":0},{"review":"It is best movie and it's my favourite movie which I have seen more than 50 times but it's too long and emotional. We should salute our real heroes instead of Spiderman or Hulk. Thank you J . P Dutta","label":0},{"review":"In this film🎥🎬👀 have big star which acting is awesome. \nThis film explain how the army protect our country carefully. This film is inspiration of my life.","label":0},{"review":"It is a good film when I ever feel dispersed I used to watch this bcz it shows how our army have to suffer the tough condition.\nAt last it gives me goosebumps...","label":0},{"review":"Such a wonderful documentary made on  kargil war of 1999..\nI watched dz more Dan 21 times..\nI salute Indian Army and their sacrifices..\nI am proud to be an Indian..\nI love my country..","label":0},{"review":"I want to say JP Dutta saheb is the best film director of Indian cinema.... He makes some film about our pride soldier biography such as Border, loc kargil and PALTAN also","label":0},{"review":"It's best movie and I will suggest you to watch our army's bravery. Most people say that it was the starting of bad luck of JP Dutta but no it was the success of JP Dutta.","label":0},{"review":"A fabulous war film directed by JP Dutta sir. Actors portrayed well as armymen. Ajay Devgan was exceptionally outstanding when he portrayed Captain Manoj Kumar Pandey a PVC posthomous, charismatic armyman, and greatest war.","label":0},{"review":"It is at the top of my favorite movies...... Such a fantastic and patriotic movie..... 👍👌\nBut today no one make such type of movie so I'm waiting for such a movie come on the floor","label":0},{"review":"This movie is a very intellectual and informative. It is good influence on indians who think low of their country. I would suggest it all indians..🇮🇳","label":0},{"review":"A very emotional and heart touching picture. This picture really touches our hearts and give us a real feelings to salute our brave soldiers","label":0},{"review":"I wish in the next birth I would also do something  for my INDIA \nI LOVE MY COUNTRY \nAND I AM PROUD TO BE AN INDIAN","label":0},{"review":"Kargil war is best film in the world that is inspiration for us .Our army is best in the world also saw in this film.jai hind jai bharat","label":0},{"review":"Great movie depicting the courage and valor showed by indian army,our army...\nSalute to all brave soldiers.","label":0},{"review":"I.like is movie because it tell how the Indian army plan the attack on.pakistan and in war how mush life are lost So be with Indian army Jai Hind","label":0},{"review":"Movie is challenge to other people country big hero  and more sweet song  and dance great anjoy movie","label":0},{"review":"Heart touching movie, coz of theirs sacrifice we are living peacefull ..\nSince beginning to end my eyes filled with tears...","label":0}]