[{"review":"Very touching movie..I don't understand how this movie turned to be a flop. Should have ideally been a blockbuster.\nHow will you feel if your life's work for which you have dreamed since you know the world and have worked passionately towards it everyday and have sacrificed every pleasure in your life to get it but just as your in touching distance from your dream it gets stolen away that too by your close friend in front of your eyes and you can't do anything ? Won't you feel suffocated ? Cheat ...MORE","label":0},{"review":"Very touching movie..I don't understand how this movie turned to be a flop. Should have ideally been a blockbuster.\nHow will you feel if your life's work for which you have dreamed since you know the world and have worked passionately towards it everyday and have sacrificed every pleasure in your life to get it but just as your in touching distance from your dream it gets stolen away that too by your close friend in front of your eyes and you can't do anything ? Won't you feel suffocated ? Cheated ? Unfair world ?\nThis movie follows this plot. Ajay Devgan has given a master class performance. Salman is good too but Ajay is well beyond anyone else. This will always be one of my fav movies, no matter the critics or others say.\nMust watch if you love a well developed story arch characters with a great emotional value.","label":0},{"review":"the worst thing about this movie is.... no one remembers it now. even i didn`t  like the climax, but the overall film was excellent. one of the last Ajay Devgan and Salman Khan film from after this movie, both started appearing in a solo lead.","label":0},{"review":"very appreciable movie and obviously because of salman khan this movie got more power.This movie will definitely grab your interest throughout it.Amazing storyline with good a good screenplay","label":0},{"review":"BEST OF THE MOVIES... HEART TUCHING STORY... AMAZING CAST...  BOTH AJAY AND BIG BRO BHAIJAAN DID WELL","label":0},{"review":"Awesome movie and Zubeen Garg Song Shoola shoola it a very   amaizing song soulful voice. Superb👌👌👌","label":0},{"review":"Each and every song of this movie gave me goosebumps.. Movie is too awesome...❣️❣️❣️","label":0},{"review":"Mu favorite movie.... I love every seen....of this movie","label":0},{"review":"Must watch movie ( the thing in which i am good and only we get fame is very wrong state of mind) lovely movie","label":0},{"review":"Worth watching I love the inspiration of the characters in the movie","label":0},{"review":"Very nice ajay sir totally nailed it superb performance","label":0},{"review":"Shola Shola song\nZubeen garg's voice was amazing love it","label":0},{"review":"I like it very much this movie is brilliant","label":0},{"review":"Watchable movie but it is to boring to watch for 2hour 30 mins long movie it could short but overall good movie","label":0},{"review":"The film was very good .salman and ajay owsem","label":0},{"review":"What a film I gave him 10 rating.  Fantastic movie","label":0},{"review":"What a Movie Yrrrr,...... Outstanding Outstanding Outstanding \nTouch the Soul Of Human","label":0},{"review":"Supper real stick movie original hard all star cast hard work  nice movie","label":0},{"review":"Awesome movie.. Salman khan Rocks.. Ending is weak","label":0},{"review":"Awesome movie","label":0},{"review":"i agreed that movie is good but little slow and end is not good","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0},{"review":"Heart touching movie","label":0},{"review":"Awesom movie","label":0},{"review":"Like blue world","label":0}]