[{"review":"I had watched this movie when it was released in 2012 and 7 years later when I watched it again I still enjoyed it. This movie is simple ,sweet and just a beautiful love story with some really exotic locations.  The cinematography of this movie is on point,  I wish it had garnered more attention.","label":0},{"review":"When I watched it in a movie theater,  I was  a small girl, but now watching it as an adult made me realize that this movie is amazing. There were not so many cliche moments and you love their love. I loved this movie","label":0},{"review":"One of the best movies from bollywood. One feels connected with the chemistry of the lead pair. Aditi Rao Hydari is just so beautiful. A natural film. Beautiful one. Must watch!!!!","label":0},{"review":"Yeah its beutiful love story and mine favorate movei i love this movei even i have seen this movei for nearly 17 times i didnt get bore so plzz make this movei 2nd part also","label":0},{"review":"It's great movie.Lovely,sweet and beautiful story .Ali zafar is not looking Pakistani at this moment.i have watched this movie in in orbit mall Pune.","label":0},{"review":"Good movie with some story. Some middle and poor people can see lpny pictures without going personaly there.","label":0},{"review":"I'm watching it now... I watched it 3 years ago but still enjoying it...it's a simple, romantic and exciting movie <3","label":0},{"review":"I am a big fan of this movie.....so simple.. and so much related to us.","label":0},{"review":"Liked the movie. Nice story line.","label":0},{"review":"Nice movie with a beautiful love story","label":0},{"review":"Excellent concept l love it","label":0},{"review":"One of my favourites, anyday.","label":0},{"review":"A beautiful love story","label":0},{"review":"Nice Movie","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0},{"review":"Boring+Overacting","label":0},{"review":"Reminds me of my college days","label":0},{"review":"Average film","label":0}]