[{"review":"LOOTERA(2013):A movie that is centered around the CONFLICT between LOVE and BETRAYAL,MEMORIES and TEARS,and  the IMMORTAL and MORTAL.\n\nA beautifully crafted film,with mesmerizing and GREAT performance from both RANVEER and SONAKSHI.\n\nThrough-out the movie you will experience only feeble sounds,be it during the conversations or at other times,(which itself is a beautiful aspect that will connect you with the script and the minds of the characters),but the ACTING and the MUSIC of the film themselv ...MORE","label":0},{"review":"LOOTERA(2013):A movie that is centered around the CONFLICT between LOVE and BETRAYAL,MEMORIES and TEARS,and  the IMMORTAL and MORTAL.\n\nA beautifully crafted film,with mesmerizing and GREAT performance from both RANVEER and SONAKSHI.\n\nThrough-out the movie you will experience only feeble sounds,be it during the conversations or at other times,(which itself is a beautiful aspect that will connect you with the script and the minds of the characters),but the ACTING and the MUSIC of the film themselves have SPOKEN OUT LOUD ENOUGH,enabling each and everyone to HEAR and feel the magic of love.\n\nAMIT TRIVEDI has literally transformed his music into one of the characters in the movie itself- playing a very MAJOR role.\nAnd I personally felt that this is one the GREATEST and MEMORABLE performance by SONAKSHI in her acting career. \n\nLOOTERA :A MAGIC-A MASTERPIECE..","label":0},{"review":"The film is based on the 1907 short story ‘The Last Leaf’ by O. Henry, in which the heroine knows she will die when the last leaf falls, so the hero paints and ties paper leaves on the tree until he can do so no more. The music by Amit Trivedi, including hits such as ‘Sawaar Loon’/‘I’ll Decorate My Heart’, evoke the 1950s and the golden age of Hindi film music.\nI think it is by far the best work of sonakshi sinha. She's extremely talented and natural in her acting skills.\n\nI just love the movie","label":0},{"review":"A masterpiece by Vikramaditya Motwane. We often get someone in life who teaches us to live again. We don't have to regret for that last leaf to fall, we can always wait for the monsoon to arrive again. I can clearly remember the last scene when Pakhi is sleeping in Varun's arms, like she is sleeping peacefully after a long time. And then Varun gets up and starts to leave. His eyes were still at Pakhi. That heart wrenching visual of seeing your loved one, for the last time, by making her learn to ...MORE","label":0},{"review":"A masterpiece by Vikramaditya Motwane. We often get someone in life who teaches us to live again. We don't have to regret for that last leaf to fall, we can always wait for the monsoon to arrive again. I can clearly remember the last scene when Pakhi is sleeping in Varun's arms, like she is sleeping peacefully after a long time. And then Varun gets up and starts to leave. His eyes were still at Pakhi. That heart wrenching visual of seeing your loved one, for the last time, by making her learn to live again.","label":0},{"review":"One of the remarkable movie in Indian film history. 2 hours of heart warming romance and a great ending to back it up. The film capture the great  scenic beauty of Dalhousie an the era of 1950's.\n\nEssentially it was a heroine driven movie and Sonakshi Sinha is not disappointing at all. Well I think she was the best actress to play the role. One of the greatest ending in Hindi movies. Definitely an underrated movie.","label":0},{"review":"Surely one of the best movie one can ever watch. Concept of the movie is remarkable, unique and it left you spellbound with a lot of thoughts to ponder over on essence of love in its purest form.\nAmazing cast and cinematography of the movie. Ending note of the movie is surely one of the distinctive features. \nDo watch it for sure to \"see a masterpiece which you'll surely remember forever\".","label":0},{"review":"One of my favorite movies. Vikramaditya Motwane is turning out to be a seasoned film maker. The movie has some beautiful songs, really very fresh! You can find some strong acting, the movie will have your mind engulfed into a entire new world where you will love with the characters even after the movie has ended.","label":0},{"review":"A part of this film is like The Last Leaf written by O. Henry. Well, one of the best thing of the film is Ranveer's \"not-so-good\" boy look and his fab acting skills followed by the superhit songs - Sawar loon & Zinda. Also, the decent Bengoli aspect, which preety much suits sonakshi, is very fascinating. I like the film to a great extent.☺️","label":0},{"review":"Outstanding movie. One of the best cinema i have watched. The story, acting, music, direction, cinematography everything is so well placed. A treat to the eyes, each scenes of the movies looks like a beautiful canvas and the story telling, songs is cordinated with the flow of a poem.  Everyone should watch this movie.","label":0},{"review":"It’s my most most most favourite.. I love watching Ranveer.. & this movie is a complete beautiful package of love, emotions,passion,simplicity & grace. @sonakshisinha was amazingly beautiful. No other movie can ever replace this one for me. It’s one of its own beautiful story & movie. Ranveer u r so much more than  just a actor.","label":0},{"review":"This movie is based on the excellent story The Last Leaf by outstanding O Henry. The Story we can digest because it is much simpler. But the movie has an incomplete love story, hero's betrayal and much more which makes the overall movie very sad and depressing. This movie you can watch for the excellent acting of Sonakshi Sinha, Ranveer Singh, Vikrant Massey and the brilliant direction.","label":0},{"review":"It's a movie for those who love without any logics.a movie for those who sometimes think intensely. By the way movie is good and acting is also good. But i will recommend it to only those who don't judge a film by only fun elements.it's a movie to think about and it's much more deep watch it once to feel it's great essence.....","label":0},{"review":"This movie is a breadth of fresh air . I love the silences between the lines. The background scores are too good. Human relationship is very nice definitely In  this movie.\nThe role by Sonakshi Sinha s dad is very nicely played. The choice of location is Apt.","label":0},{"review":"I loved this movie. I am surprised nobody ever mentioned what a great movie this was. It has been making me think ever since. The tenacity of the father, Pakhi's innocence, and Ranvir Singh's restrained character. One of the best movies I watched in recent times.","label":0},{"review":"It’s superb movie and I was lucky to watch after \nFive years thogh I heard beautiful comments on\nDirection and songs and specially song  Sawaar Loon sung by Monali Thakur and for which she got awards also. Great going\nOne must watch this movie","label":0},{"review":"I have to say it IS ONE OF THE MOST WELL WRITTEN BOLLYWOOD MOVIE. It'll make you cry laugh and make you feel love. Sonakshi did a wonderful job and so ranveer. highly recommended. 10/10 <333","label":0},{"review":"This movie is one of the heart touchable movie for me. This movie shows the pure love and pure bangoli cultura. Which I really love it. It shows the life of looteras and the ending is so good. I also love the songs especially Ankahee,Zinda,Monta Re.","label":0},{"review":"Amazing movie after 5 year I giving this movies review...this is my first movie with my husband I seen..I mean now he is my husband then he was my love one..total recall of this beautiful movie I can't explain how my emotions are bound with this movie..and Ranveer Singh is a versatile actor he prove in this movie .. amezing story line and lovely songs..I give 8 out of 10 points","label":0},{"review":"Lovely!! Just no words for this awsome and peaceful movie!! Bollywood has very less amount of movies similar to this movies. I think they should start making like these ones!! Absolutely amazing movie.","label":0},{"review":"This is one of the best directed movies I have watched. The complications in human relationships are portrayed very intricately and elegantly. The momentary pauses, the slight movement of eyes, very very beautifully carried out.","label":0},{"review":"amazing film one of the best movies I've ever seen indeed. Great job by leads sonakshi sinha, ranveer singh, great direction and great background score too. just blown away by this film","label":0},{"review":"Mujhe chod dho mere hal pe\nZinda hoon yaar kafi hai..\nSome movies makes you laugh,some movies makes you amazed but only some makes u cry ,smile and feel amazed at the same time,only few can create that pain in you that you start to feel yourself that you are the part of a story ,in the last 40 min run ,it appeared to me that I should go to my loved one and hug her cause I don't know whether I can ever get that chance again ..,and I rembered that I never loved one 🤣😅,but this movie made me cry  ...MORE","label":0},{"review":"Mujhe chod dho mere hal pe\nZinda hoon yaar kafi hai..\nSome movies makes you laugh,some movies makes you amazed but only some makes u cry ,smile and feel amazed at the same time,only few can create that pain in you that you start to feel yourself that you are the part of a story ,in the last 40 min run ,it appeared to me that I should go to my loved one and hug her cause I don't know whether I can ever get that chance again ..,and I rembered that I never loved one 🤣😅,but this movie made me cry especially when the above given lyrics were played 😢💓💔👏👌","label":0},{"review":"what an amazing movie bollywood has, best of Sonakshi and Ranveer is awesome. Storyline, direction, music everything was very tasty. Pity for the mass audience who don’t appreciate such great movies.","label":0},{"review":"\"Lootera\" is Perfect package of great music, Awesome lyrics, Superb story, Great  direction, great cinematography & Perfect look and feel of old Bengal and amazing acting of Ranbir, Sonakshi & other co-actors, Classic !! No other word !!! even after so many years i can watch it again, it has a standard & class...........","label":0},{"review":"This could not be Average in box office! It could be SuperHit movie😍 Speechless for any compliments! Just Love it😘❤\nIf you are a romance lover, just watch it","label":0},{"review":"Maan I don't know why it did so badly in box office, this is one of the best movies I have ever seen! The acting was on point, and the feel established is superb!","label":0}]