[{"review":"Now Its 2.39 A.M (4/4/2019) I just finished this movie, watched first time and this movie left tears in my eyes and shows that what is true love.Now I watch this movie every month like Ae Dil Hai Mushkil that are very close to my heart and I am Ensuring that I can't bored and you also can't bored to this one.\nNow, the cast is fabulous Saif shows that what he is actually are in this movie and Deepika is all time great actress of all time. \nand rest of the actors worked great as they do their role ...MORE","label":0},{"review":"Now Its 2.39 A.M (4/4/2019) I just finished this movie, watched first time and this movie left tears in my eyes and shows that what is true love.Now I watch this movie every month like Ae Dil Hai Mushkil that are very close to my heart and I am Ensuring that I can't bored and you also can't bored to this one.\nNow, the cast is fabulous Saif shows that what he is actually are in this movie and Deepika is all time great actress of all time. \nand rest of the actors worked great as they do their roles.\nNow, this movie has 10 years old but It give the fell and essence of true love of all time and generations.\nImtiaz SIr kii baat hi alag hai \nHe gave a real and genuine message of aal his movies like \nLove Aaj Kal - True Love \nRockstar - Live for your dream and your love \nTamasha - Live for your Passion \nJab We Met - Live every moment of life very haapily and joyful and Live for your love .\nAnd many more ...........\nWhen This Movie is released I was in the 3rd class.......\nSo Now looking forward to this movie Sequel Love Aaj Kal 2 in which Imtiaz sir cast Kartik and Sara both are so cute and talented and best choice for this movie sequel.. Now this movie is filming and shooting in process.......\nand I think releases in next year on Valentine's day (14/02/2020) and I gonna watch this movie surely........","label":0},{"review":"Imtiaz Ali's vision might be tough for few to understand and understandably they wont like or get it.\n\nBut those who gets the depth of each sequence what he is trying to portray on screen will always will return happily after watching movie.\n\nComing to this movie, from my point of view it is one of Imtiaz's best work .\n\nSaif is outstanding and his best work after omkara without any doubt. Deepika was also great. Music was faboulous.\n\nBut the real star is script and Imtiaz. His way of depicting h ...MORE","label":0},{"review":"Imtiaz Ali's vision might be tough for few to understand and understandably they wont like or get it.\n\nBut those who gets the depth of each sequence what he is trying to portray on screen will always will return happily after watching movie.\n\nComing to this movie, from my point of view it is one of Imtiaz's best work .\n\nSaif is outstanding and his best work after omkara without any doubt. Deepika was also great. Music was faboulous.\n\nBut the real star is script and Imtiaz. His way of depicting human emotion in this movie is amazing (for instance harleen drinking black tea at midnight interval shot and many more).\n\nIf you feel emotion & love deeply  , you will not be disappointed !!!\n\n10 Years down the line , still watch it time to time to reignite the understanding of real love and reminiscing my college days when watched it for 1st time and being in love ..","label":0},{"review":"I considered \"Love Aajkal\" as my life's favorite movie for whole life. I have original DVD and used to watch on 31st July every year. Storyline is so much near to my heart. I used to spread info/trivia on social media about this movie like \n\n“Jia Bandwala” is common in Chor Bazari (Saif-Deepika) and Veer Singh (Saif Ali Khan) arrives with Herleen Kaur in last lap.\n\nBackground Voice & scene  of Veer Singh (Rishi Kapoor) while Jai discusses BREAKUP-PLOT with Meera.","label":0},{"review":"There's something about Imtiaz Ali movie- the characters are explorers & they can't do mundane repetitive tasks. Love Aaj Kal portrays romance in two different time frames. Love always reincarnate itself. One of the finest Saif Ali Khan's movie. A must watch for Romance-Drama genre lovers.","label":0},{"review":"This movie is one belongs to a new generation it says in world full of technologies love still matter.\nand if love is true you will definitely realise sooner or later.\nThanks, Imtiyaz Ali.\nAll song is really awesome. If you are not in love definitely will fall in love after watching this one.","label":0},{"review":"A must watch movie. Love and work are the two rails of a railway line. If a person wants to live life truly, feel its beauty and spread happiness, he must board this train.","label":0},{"review":"One of the finest work of Imtiaz Ali, he really does it so well.\nIts Its sometimes so tough to realize that its true love although u are into it....great job, and superb acting by Saif Ali Khan....","label":0},{"review":"The movie has two love stories running in parallel. \n\nThe lesson that I learned from the movie is that when the connection between two people is real, they are soulmates. They are willing to go to any extent to win their love back and find their way back to each other eventually.","label":0},{"review":"Best of the best.... So simple yet so effective... You can re-watch it million times... Or to infinity... Hope I could live million of years to watch this movie again and again...","label":0},{"review":"It's today love story told in a great way\nNice songs :Wonderful ⭐cast \nGreat treat to watch\nIf you believe in love see this saga 😍🥰😘😘😘","label":0},{"review":"I saw this movie in 2009 when it was released but still i saw it again and again .\nThis movie reminds me so many things .\nLove to see this .","label":0},{"review":"Really worth watch it. Imtiaz ali brings best of it. Rockstar , tamasha , love aaj kal are great movies.","label":0},{"review":"Everything was predictable abt the movie. Deepika had no dialogues. . n saif ..Well....His dialogues were so funny n hollow... \nDidn't like it at all","label":0},{"review":"Exactly on the same day 31 July 2009.\nI have saw it's Matinee show..This movie is close to my heart ♥.","label":0},{"review":"I swear that the movie shows about true love of true hearts...But why can't Saif and Deepika remain faithful...In a sense the two lovers are dating others when they are miles apart","label":0},{"review":"Very good film romantic and lovely music.  I love the film very much..","label":0},{"review":"I like  this very intresting movie this is my very best movie and director this is a modern thinking of love","label":0},{"review":"Nice movie. A perfect blend of present and past love","label":0},{"review":"It's an awesome movie .. which reflects the life of present generation concepts about relationships","label":0},{"review":"What a funny movie, 2:39? i mean saif ali tantrummed alot, very funny movie except thugs beating saif for deepak.","label":0},{"review":"Awesome movie. Still watching it in 2018. I love this movie n saif ❤️❤️❤️❤️","label":0},{"review":"heart touching 💕  \ndeeply touched \ntrue emotions loved it...   😘 \n oh and the music and  songs😍😍😍😍","label":0},{"review":"Amazing movie. True love takes time","label":0},{"review":"this is the best classic and pop combo,please Imtiaz Sir make this level movie...","label":0},{"review":"Very good movie, i liked it story and direction  and presentation \n👌👌","label":0}]