[{"review":"THE BEST MOVIE EVER!!!!!!!!!!!!!!!\nWhy would anyone hate it? I love the songs and the story is just awesome I wish I could tell Harman Baweja personally that he did the best stunts, dancing, and acting. YOU GUYS SHOULD WATCH THE MOVIE WHO DID NOT YET!!!!!","label":0},{"review":"I liked the couple & the romance and the sensibility of missing n finding someone special. Though movie could have been made better. Any way I watched this movie in theatre and enjoyed the effects.","label":0},{"review":"I am mad about this movie I can see this movie 10000 times harman baweja is the best  why everyone hate it it's just awesome\n😁😃😃😃I have called harman baweja he is a very good person","label":0},{"review":"I don't even had patience to watch this movie till the end. Its a complete disaster movie. Just save your time and watch something else.","label":0},{"review":"Instead of using the time machine to travel to the past to save his dead girlfriend, our hero travels to the future, where he meets the reincarnation of his dead girlfriend in year 2050. 🤦🏻‍♂️","label":0},{"review":"I feel this movie is quite disgusting.....it scares the viewers which causes them to think negatively about the future.....its just a horror movie.....the title of the movie is quite dangerous.....im so happy that it is already in a box office dud.....","label":0},{"review":"This movie is so amazing an 3d I want to se this movie in childhood I love this movie","label":0},{"review":"#BestMovie ...\nIf this movie would made in this ara then it will be a #blockbuster flim...\n#HarmanIsGoodActor\n#Harman≈HritikRoshan...\nboth havesimilar #actingDancingStyle","label":0},{"review":"I like Harman I like his acting I like his voice I ll give 5 star\nI have to see this movie 1 lakh time 2050 year","label":0},{"review":"I would give this movie a good 6.5/10 but definitely not 2.6/10 as on IMDb","label":0},{"review":"Most underrated movie of Bollywood ever...","label":0},{"review":"It is brilliant movie","label":0},{"review":"Bestest movie made ever..","label":0},{"review":"I love this movie","label":0},{"review":"I like the movie but Special Effects Are Worst","label":0},{"review":"Worst movie of all time","label":0},{"review":"This movie is my all time favourite","label":0},{"review":"Good  nice movie","label":0},{"review":"fantastic movie","label":0},{"review":"I really liked the movie..i don't know why its rating is 2.5/10","label":0},{"review":"Mind blowing movie","label":0},{"review":"lovely movie! \n-","label":0},{"review":"Most worst movie...","label":0}]