[{"review":"Again a superb movie with low ratings. I am surprised how this rating business works anyways coming to the movie there are so many plusses in the movie that one tends to overlook its few negatives.\nThe film is set in Russia so the location and the feel of the movie is unlike any run of the mill bollywood movie. The frozen continent is breathtaking.\nThe story is refreshing and presents the tale of two people who could never fall in love were they not destined to meet in the situation of fight for ...MORE","label":0},{"review":"Again a superb movie with low ratings. I am surprised how this rating business works anyways coming to the movie there are so many plusses in the movie that one tends to overlook its few negatives.\nThe film is set in Russia so the location and the feel of the movie is unlike any run of the mill bollywood movie. The frozen continent is breathtaking.\nThe story is refreshing and presents the tale of two people who could never fall in love were they not destined to meet in the situation of fight for survival. Where Lucky is a school girl, naive and innocent, Adi is a charming grown up guy befitting a guardian figure which he acts one in the entire movie. This was the most natural behaviour considering a very huge age difference between them but as you start following them in their journey, every emotion they go through comes to life and their falling in love becomes the most natural thing then.\nThe choice of actors was another field where this film scores a fortune. You keep falling for childlike innocence of Lucky with every scene. Something which could have looked annoyingly immature in a female lead is the most soothing aspect in this love story. Sneha Ullal acts superbly well through her eyes where she completely highjacks the viewers attention and it feels but natural for Adi also to fall for this little softest thing which he is keeps sacrificing himself time and again to protect. She although is shown the damsel in distress needing a man’s support which may not suit well to many feminists but here it looks justified as Lucky is shown a very young overprotected teenager who has not seen the world and Adi is much much older to her so by default he gets the responsibility to protect the kid.\nThe songs are extremely melodious and snugly fits the mood of the film. The last song Shayad Yehi to pyaar hai is the most emotional composition of this overall beautiful album. \nI have to praise Salman for looking so good and performing so great. There are very few films of the actor where i get to praise his performance and this movie ranks very high. The care he has for Lucky and the love he develops during the course can be felt by the viewers completely. He is not able to accept his love even to himself considering their diversity till the major part of the movie. Its a love story where the hero doesn’t accepts his love in words ever and i liked this so much, he didn’t need to. It was so deep and real that words could never match his emotions. \n\nThere were some parts of the movie which definitely needed to be bettered.\nUnnecessarily showing Lucky’s forehead smeared with blood to depict sindoor, or showing Lucky claiming she now will go to Adi’s home as his wife was again not the best ending. She was just in school and the whole movie showed her almost as a kid then showing all these scenes were not going well with the beautiful relationship they developed. They could have showed Adi’s hesitation for a relationship and he could have told her he would wait for her to come of age. Although nothing looked awkward in their relationship but still it would have given it a beautiful yet practical conclusion.\nI have seen this movie several times and everytime i get emotionally invested in Adi and Lucky’s journey back home. \nIts a beautiful movie which cannot be given less than 3.5/5.","label":0},{"review":"I love Salman and Sneha they look very good together, Salman should marry her in real life. Luv the film very much, I like all the scenes of Aditya and Lucky- so romantic and I have watched this many more times. When the film released that time I was five years old and was reading in LKG ♡♡♡","label":0},{"review":"I love the music of this film. It's very close to my heart. Allover a wonderful story and great actors.i love it","label":0},{"review":"I love the music of this film. It's very close to my heart. Allover a wonderful story and great actors","label":0},{"review":"No time for love...ri8?? Actually wrong..  that wonderful feelings that was hidden in this movie... was Love...both spend all time with one another...faces many problems... those all was the love unforgettable moments.... actually I must say... awesome movie it was.. really too good.","label":0},{"review":"It's 2019. I'm now going to fullfill my childhood dream of watching this movie. Had the boards when this one released. I'm sure this movie is wonders. Let's see.","label":0},{"review":"Usually I don't watch romantic movie but watched this . A wonderful location, great music nd a good story. I lost in the movie. 8 out of 10","label":0},{"review":"I love sneha in this role, and forward to see a girl like her in real life. Love you both .","label":0},{"review":"Super,nice,mindblowing,osm\nSalman khan best\nSneha Heroine my favourite actoress Today\nSalman khan biggest fan......\nLucky film is best film of indian film","label":0},{"review":"My most favourite movie of salman khan and sneha ullal luv u both superb movie watched it many more times","label":0},{"review":"That's the one of best movie i've seen it.\nAwesome love story ☺☺","label":0},{"review":"I want to say about this film 'lucky; I think that this is the best film Of film industry, and My best actor sneha ullal is heroine of this film, sorry mughe jayda English nahi ata , and I want to meet sneha ullal one time in my life , when I will succee I will meet you because you are my best actor, l u","label":0},{"review":"Sweet movie , love and love around , must watch if you are bollywood fan and no vulgurarity only true feelings","label":0},{"review":"This movie is best\nIts maked by MY favorite actors\nMis. Sneha ullal and Mr.Salman khan","label":0},{"review":"it's best movie for me i love the movie and it heart touching me i saw the movie 5 more time","label":0},{"review":"I love to watch only romantic movies and this is the best I had seen ever.","label":0},{"review":"I guess this movies has several twist and turns and is really a good picture","label":0},{"review":"Sneha ullal  is so cute  and  played her role  so Beautifully  \nSalman sir  also played fantastic role","label":0},{"review":"Very good movie.  My favourite movie. I am love Salman Khan movie's 😊😊😊😊😊","label":0},{"review":"This is my favorite movie and the songs are the best songs in the world","label":0},{"review":"lots of love for this movie,,i just love this movie from childhood,,really adorable♥","label":0},{"review":"Its best movie and all time awesome salman sir looking best","label":0},{"review":"This movie story is suparb and all song best","label":0},{"review":"This is awesome movie and I like this story because this is Bhai movie","label":0},{"review":"This is amazing picture salman sir is my favourite actor","label":0}]