[{"review":"This movie is based on Bollywood.aamirkhan srk also in it ...good mindblowing story line..really l liked it deeply...worth learning. Debutant dr Zoya akhtar  performed as matured,  lots of thnx to her . Farhan and konkona played perfectly,  put life to  their roles.  Never loss hope in own way , alws be positive.  Never discourage to any one. Each one has something talent in a certain track. Music  of LBC  IS SUPERB MINDBLOWING. Especially  o raahi , sapnon se.  Very entertaining  picture  by pr ...MORE","label":0},{"review":"This movie is based on Bollywood.aamirkhan srk also in it ...good mindblowing story line..really l liked it deeply...worth learning. Debutant dr Zoya akhtar  performed as matured,  lots of thnx to her . Farhan and konkona played perfectly,  put life to  their roles.  Never loss hope in own way , alws be positive.  Never discourage to any one. Each one has something talent in a certain track. Music  of LBC  IS SUPERB MINDBLOWING. Especially  o raahi , sapnon se.  Very entertaining  picture  by pr farhan akhtar  .  Maximum  actors   have  here in .  Anand babu alias aamir saab  and  raju hirani sir  appeared   in a  scene.   Konkona  has  natural  performance  quality  . Sona  character  inspd me  that alws be  happy  , never  complain  , live as per ur term  with  holding  head as high   and with self respect,  bindas.  Supportive  artist  such as  juhi risi sanjay  hrithik  isha dimple   and  etc etc  acted well.  Actually  a masterpiece  of zoya maam.  Thnx  zaved  and shabana jee  .  I found very interesting  timepass  .Each film lover should watch it  with  a passion  atleast  . Inspite of being  death defeat  failure there is  no chance to be valueless  of strong willpower  . Present is right  .future  will be  also right beneficial. Learn from ur past. Meanwhile  enjoy the life   whatever  is  coming  ur way.  Like to give  8  on  10  . Nyc climax.    All in  one. I watched  Superstar Aamirkhan  scene of it  atleast  34  times  and   8 times  to LBC . Released in  2009   as same with  Three idiots  year  .\nWill power is seeds of life..luck is nothing.just by chance...luck created by will ..also achievement by will...root is only will..be happy..never jealous up on stars...always be humble..stars shouldn't forget own family relative friends fans ...a humble superstar is real superstar....enjoy this movie with cheers joy ...fantastic film ..l will watch it again again in my life ....bye all viewers...ok.","label":0},{"review":"Actors acting were very good and realistic. Storyline direction presentation was superb  . And topic was very interesting . Mrs zoya akhtar is realy multi talented director  .  When she try to make movies with new new topics and she brings new commers not old actors .    That in each and every proffesion there is strugelling but in acting industry competition is there a lot.  Good looking is not only plus point acting skill is plus point. For example shahrukh khan has struggle a lot he lost his  ...MORE","label":0},{"review":"Actors acting were very good and realistic. Storyline direction presentation was superb  . And topic was very interesting . Mrs zoya akhtar is realy multi talented director  .  When she try to make movies with new new topics and she brings new commers not old actors .    That in each and every proffesion there is strugelling but in acting industry competition is there a lot.  Good looking is not only plus point acting skill is plus point. For example shahrukh khan has struggle a lot he lost his parents in early age he came from delhi to mumbai for becoming actor . Then he has also faced criticize for his hair one director told him that you have very long hair you can't become actor with this hairthen he didn't care about it at all. He continued with his acting carrer and today he is famous superstar and now we are calling him king khan and dubai ruler has gifted him house in palm island . And that house is tax free . Then mr amitabh bachchan his original name is amitabh shrivastav. But he has hardworked a lot in early life he use to job as radio jockey then for his heavy voice he was thrown out from radio jockey he used to sleep in juhi beach after doing that flim satte pe satta rajnikant was also there after doing that flim he brought jalsa . We always look their bang balance but not strugeling . Shahrukh khan has said right thing that stardom is like cocktail frame money power.  Its almost like medical proffesion and hotel management profesional we always look their bang balance not their hardworking","label":0},{"review":"One of the most underrated hindi movie of the 21st century, makes me sad it didn't do great business. Amazing characters who mostly fall on the grey shade. I have watched it over 5 times, and everytime I catch something new and interesting. Hats off to Zoya!!","label":0},{"review":"I just saw it and liked it and learnt a lot from lead heroine.\n\nAfter a long time I watched a good movie Superb movie... Mostly the last scene I loved it","label":0},{"review":"This is a slow paced movie which hits all the right notes...Beautifully acted, well written story depticting the real bollywood industry with a good message in the end..It will leave u with a bitter sweet pain in the end..Loved it..!!","label":0},{"review":"Good movie. A must watch. Ending is superb. Songs and Music is also good. Awesome acting by Farhaan and Konkana.","label":0},{"review":"Amazing movie, shows you the reality of the Film industry and delivers a good message that you should never forget those who were there with you when you were Mr. Nobody.","label":0},{"review":"Such an intelligent movie. \nIt showed reality and was very Sarcastic at the same time. \nA very funny mockery of nepotism is depicted in this movie.","label":0},{"review":"Movie made much ahead of time Zoya Akhtar what a filmmaker ! Every other upcoming actor should watch ♥️😇✨","label":0},{"review":"This movie based on a young boy who come to mumbai to become an actor.however he got lucky and sighned in big budget movie ...its a lite movie ..good movie to watch for only entertainment  purpose..","label":0},{"review":"Awesome move .. Great acting by Farhan Akhtar","label":0},{"review":"One of the masterpieces i have ever scene💯💯💯. # must watch","label":0},{"review":"Nice comedy & drama bollywood","label":0},{"review":"Too good inspiring movie","label":0},{"review":"Nice movie","label":0},{"review":"Awsm movie","label":0},{"review":"Very well made","label":0},{"review":"Watching only to see Anurag Kashyap","label":0}]