[{"review":"Very much for your time with you to know about the author and may contain confidential information intended solely for addressee you up to you soon best wishes you Happy republic day celebration for the delay in responding with the new one and only you can also do you have any further assistance to shrines for special occasions in this message was automatically to know the hi in hall cn dmn dismissal dj Indian Sharma annual Barnsley hall harmful Sudirman Bhushan's zn GMC zn fb xv xv an NC xv xv  ...MORE","label":0},{"review":"Very much for your time with you to know about the author and may contain confidential information intended solely for addressee you up to you soon best wishes you Happy republic day celebration for the delay in responding with the new one and only you can also do you have any further assistance to shrines for special occasions in this message was automatically to know the hi in hall cn dmn dismissal dj Indian Sharma annual Barnsley hall harmful Sudirman Bhushan's zn GMC zn fb xv xv an NC xv xv my cn NC zn is N Rd zn cz Armando Alam small Skidmore","label":0},{"review":"This song is full of spirit of patriotism, encouraging to every Indians. The soldiers who are dedicated 24hrs in defending our motherland ,are actual heroes. We all are proud of them.","label":0},{"review":"Thanks to our soldier for standing at boarder to protect us and fill our lives with colours of happiness \n      we proud to our Indian soldier .\n                                                      \n                                                                                Jai Hind","label":0},{"review":"Thanks to our soldier for standing at boarder to protect us and fill our lives with colours of happiness \n      we proud to our Indian soldier .","label":0},{"review":"Great India produces great soldiers with great heart and immense courage to fight fearful odds to save our nation","label":0},{"review":"I love this movie song because it is our national song","label":0},{"review":"It's a great song I love song very much","label":0},{"review":"GOOD VERY BEAUTIFUL GIRG I LOVE MY  INDIA","label":0},{"review":"Very good patriotic film I like it.","label":0},{"review":"Superb song","label":0},{"review":"I think it, best movie","label":0},{"review":"This is fantastic movie","label":0},{"review":"Good movie","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0},{"review":"Nice movie","label":0},{"review":"Good moving","label":0},{"review":"So beautiful movie i like.","label":0},{"review":"Ow amazing movie","label":0},{"review":"My favorite movie","label":0},{"review":"Very nice movie","label":0},{"review":"I LOVE HOM","label":0},{"review":"Very nice movie 👍👍","label":0},{"review":"We are proud on my Indian soldiers..","label":0},{"review":"Ye film good","label":0}]