[{"review":"A beautifully and brilliantly executed movie! It might simply be John Abraham's and Nagris Fakri's best work. Excellent direction by Shoojit Sirkar. The screenplay, acting, direction, music and the plot were all amazing. It is a must watch for cinephiles. So not the typical Bollywood masala movie. This is a no-nonsense, intense thriller. The storyline is captivating too and is based on real events leading to the assassination of our ex Prime Minister Rajiv Gandhi.","label":0},{"review":"After many years i liked a Bollywood movie \"MADRAS CAFE\". The climax could have been better by extending till the arrests of terrorists in Indiranagar, Bangalore.\n\nScreenplay was crisp and outstanding. Climax is 75% to actual. \n\nPlease watch Rajiv Gandhi assassination investigation & RAW double agents videos in Youtube to understand this movie easily.\n\nOne dialogue touched me \" Kaun Jeetha..?\"\n\nNo doubt this is an excellent movie which is concluded in 2Hrs.\n\nEvery citizen was seen crying but not ...MORE","label":0},{"review":"After many years i liked a Bollywood movie \"MADRAS CAFE\". The climax could have been better by extending till the arrests of terrorists in Indiranagar, Bangalore.\n\nScreenplay was crisp and outstanding. Climax is 75% to actual. \n\nPlease watch Rajiv Gandhi assassination investigation & RAW double agents videos in Youtube to understand this movie easily.\n\nOne dialogue touched me \" Kaun Jeetha..?\"\n\nNo doubt this is an excellent movie which is concluded in 2Hrs.\n\nEvery citizen was seen crying but not Sonia Gandhi, so sad of Rajiv..!\n\nPrakash Belwadi entry dialogue was ultimate.","label":0},{"review":"This is one of unique war movie casted in India. With error less sound effects it becomes thriller throughout. Thanks to Mr Sujit sarkar for such nice direction.\n Nargis Fakhri's intact dialogue delivery quality is  superb. Every actor with the given character has made balanced delivery.","label":0},{"review":"IT'S a really awesome movie... you can definitely watch it in 2019\nit does not seem old.... it show cases the reality of the Sri Lankan Tamil war..... and busts the myth that we blatantly just armed the Tamils \n it also give a very hard proof of connection of rajiv Gandhis assassination with the Tamil war......\n\nits definitely a must watch","label":0},{"review":"(4/5) You need education and intelligent mind to understand these types of movie. A beautifully excecuted movie with great visuals, music and action sequence. Based on the true story Tamil libeartion during India Sri Lanka guriella war. What a true agent do on the Field you can find out in this movie.","label":0},{"review":"Just loved it  first awesome direction by shoojit sircr n extraordinary acting by john ♥️ His choice of movies lately is good . Sad that movies like this dont make box office n get underrated :( . You can add it in yours  must watch list ! 💕","label":0},{"review":"One of the best films of both  john abraham and nargis fakhri and bollywood cinema. Madras cafe is a must watch film great job love the movie. Hats of to all the people who made this film. Love you john.","label":0},{"review":"This movie is nice but its a lie. This was not the real picture of srilanka's war. It shows as Sri Lankan army is weak and helping LTTE by informing that the indian agents are coming? What is that? if Sri Lankan army is weak as this movie says then how did they win one of the most vicious terorismo in the world? Sri lanka won this war because they kept other countries and thair armies out of the picture including india.","label":0},{"review":"So good, especially the climax where we know whats gonna happen but can't save our Beloved PM, John has done beautiful work ,This is a strong attack on people who know the language of arms.\nLong live India, Long live its democracy and peace.","label":0},{"review":"This was an good example how terrorism effect to civil life. Still this movie tries to give some credits to LTTE which from without mentioning the root cause for starting the war. And also at the end of the movie it gives a false information that this terrorism ended in a brutal way. Better not to spread false facts","label":0},{"review":"very few movies made in bollywood like madras cafe.one of the best espionage story.acting,direction,screenplay everything in this movie is well executed. not for those who are fan of masala and romantic movies.","label":0},{"review":"A must watch film which narrates about the assassination of Rajeev Gandhi and the then prevalent situation of Sri Lanka,and the intervention on india in Sri Lanka's civil war..\nBrilliant acting.\nBrilliant screenplay.","label":0},{"review":"must say it's the john's best movie till now which i have encountered, superbly made. m feeling really happy i spent my time on this just wonderful..","label":0},{"review":"I want full movie online because this movie  very natural movie . I say we feel that incident before Rajeev Gandhi murder. Very very interesting movie. once watched in theatre in 2013 there after unavailable this movie for me,  because I am south Indian unavailable hindi movie amousfiere here from Telangana.","label":0},{"review":"Madras cafe  is one of my most favourite movie because there was about war between India and srilanka war. Awesome movie  John Abraham is my favourite actor. Its basically was a action movie.☺️☺️☺️☺️","label":0},{"review":"Excellent words can't describe the movie how much pain was caused during the civil war and the excellent direction and wonderful acting by john more realistic very much appreciated movie definitely worth watching..","label":0},{"review":"What an amazing movie. Fully researched and well executed. Catchy screenplay, good storyline keeps you engaged.","label":0},{"review":"Nice movie it shows us the history of india and srilanka war and srilankan civil war. Our former president Rajiv gandhi assassination.\nWhich was one of the saddest thing in history.","label":0},{"review":"Yes.This movie is really intellectual. You have to understand situation. But don't take it personally if you are politically influenced by any favourable.","label":0},{"review":"I can say that its one of the best dark movie bollywood has ever produced. And, from my point of view its John Abraham's best movie.","label":0},{"review":"Based on true events. The story explains the journey of a RAW agent who meet a journalist at a war torn coastal area. Intense. Worth a one time watch.","label":0},{"review":"Practically this is that type of particular movie typical bollywood fans are not ready for.It's not a typical bollywood masala brainless movie.Either you study it or leave it but I think it's one of a kind movie and many steps further than contemporary Indian films.","label":0},{"review":"Great film featured, generate Nationalism in  all our Citizens & helped everyone to make themselves honest build strong morality.","label":0},{"review":"Must watch. One of the best movie of john. Portrait the hidden story about indian spy agencies related to assassination of Rajeev Gandhi.","label":0},{"review":"one of bollywood gem i can say  with very good direction & plot to cover neccessary details.\nmind blown","label":0}]