[{"review":"Well, Paresh Rawal, till today, is undeniably one of those actors, who can act on stage. Stage, unlike the movies, is a whole new ball game and not everyone who is a good actor can do it. I have seen the original Gujarati drama, a number of times and I have experienced the magic that Paresh Rawal could create. He use to rule the stage and entire hall with his acting, dialogues and his timing....it is was those times when 'Arjun' was just released and Paresh was tasting the new taste of fame....n ...MORE","label":0},{"review":"Well, Paresh Rawal, till today, is undeniably one of those actors, who can act on stage. Stage, unlike the movies, is a whole new ball game and not everyone who is a good actor can do it. I have seen the original Gujarati drama, a number of times and I have experienced the magic that Paresh Rawal could create. He use to rule the stage and entire hall with his acting, dialogues and his timing....it is was those times when 'Arjun' was just released and Paresh was tasting the new taste of fame....not many knew his this side of drama and he still continued drama even long after he got further more success....\n\nThis movie, is nothing compared to the drama. With three episodes of one hour, and only one stage, one set, the way Paresh and Swarup Sampat acted, along with great performers like Sharad Smart, is still unmatch. \n\nParesh Rawal came with another drama, 'Shiracched', meaning decapitation, immediately after this, which was good, but the impact of Maharathi is such, that no work could match it...\n\nWell, I could only say, that movie adaptation is OK, and I will recommend it, only if you cannot see the drama....I still want to recommend that watch drama first....pay whatever price they ask, if they ever do it again, and be there......I could only hope that Pareshbhai still has that fire inside him, which he had in early nineties.....","label":0},{"review":"One of the best movies. Paresh Rawal has again proved his acting talent by carrying this one man movie. For them who love off beat movie...  This is a must see!!","label":0},{"review":"Accidentally i watched this movie...At the beginning,i thought that it is a normal art-film type movie bt i.was wrong....bt few minutes later it will be interesting slowly slowly.....i was really enjoyed the movie with a strong storyline, unpredictable ending, strong acting of all characters specially paresh sir & naseeruddin sir's acting was as usual awesome.Everyone must watch it.","label":0},{"review":"The best movie I ever saw. One can't explain my feelings about this film man... Superrrr...it would be cheap, if I gave 5star rating to this...","label":0},{"review":"Really good movie with a awesome storyline. Movies like this proves that it does not need superstars to make a good film but a good story and actors like Paresh rawal, Nasaruddin Shah.","label":0},{"review":"Fantastic movie.  Very engaging.  How could I miss it earlier.   Thanking Star Select Gold for forecasting the film.","label":0},{"review":"A wonderful movie with gripping plot and nail-biting finish. I don't understand why it could not get due recognition.","label":0},{"review":"Very well made thriller.\nNot even one dull moment\nAll GR8 actors in one movie.\nParesh,Boman,Tara,Naseer,Om puri.","label":0},{"review":"One of the most underrated Bollywood thrillers.\nBinge on this movie \nYou won't regret it.","label":0},{"review":"Good cinema. Nice acting by Paresh Rawal and Om Puri.\nA good watch.","label":0},{"review":"While a wonderful watch, the point I came to know this is a copy of a James Hadley Chase novel, I lost interest in it. Plagiarism lives on!","label":0},{"review":"Awesome acting... Unbeatable .... Paresh Rawal Boman Irani at their best.","label":0},{"review":"The best thriller I have ever seen. Paresh Rawal is at best.","label":0},{"review":"Awesome movie.  Paresh Rawal at it's best.","label":0},{"review":"Keeps you on edge all the time. Amazing thriller.. Must watch.","label":0},{"review":"Paresh Rawal is a Zabardast Actor.....He role is so powerful acting in this movie....😀😀","label":0},{"review":"loved it...it has some usual flaws but story is too good to ignore","label":0},{"review":"I saw dis movie suddendly on tv...n i cant turn my eyes off from every single scene..man wt comedy suspense...","label":0},{"review":"It's a wonderful movie I  never seen this type of movie great actors.....","label":0},{"review":"One of the best movies I have ever seen.","label":0},{"review":"Really great movie accidentally I watch this movie such great story","label":0},{"review":"This movie is an awesome thriller....one of a kind.","label":0},{"review":"Nice movie.....all d actor's have done good job.","label":0},{"review":"Best crime bollywood movie ever","label":0},{"review":"Wonderful movie. One must see.","label":0}]