[{"review":"Farhan Aktar for Arjuna. (are you serious) horrible choice. Amir Khan as Krishna, man he is aging..  He is a good actor but age really matters. Can't even dream Aamir as Krishna. these two choice will be a deciding factor for the success of this project.","label":0},{"review":"Some people are eager to watch this movie only because many great stars are playing roles in the movie...... To tell the truth the animation could be a little better.... And there was a little too much drama... Sooo... 😶😶","label":0},{"review":"It'll be better if they make it as series like GOT. Bcz Mahabharat story line is the best and nobody can write something like that now.","label":0},{"review":"Mahabharat best Epic to learn dharma, justice, and management... Best animated movie..","label":0},{"review":"I will be waiting for this epic version of Mahabharata .. thanks to Mr khan for his direction in this movie .","label":0},{"review":"some where some part missing in this movi but it is good !!\nand the best warrior is karna !!!!","label":0},{"review":"Farhan Akhtar as arjuna.. Is the worst choice  ever... Tiger shroff.. Wld. Have suited","label":0},{"review":"hmmm what is the language, I am reading the Mahabharata. I may pause to give the movie a look see then continue reading","label":0},{"review":"All time blockbuster movie of the box office. When I see this film I remembered the old Mahabharata serial.","label":0},{"review":"Krishan a is dout able. Akshay Kumar is best for Krishna","label":0},{"review":"Nice epic know more about pandhvas","label":0},{"review":"I m also excited to watch epic Version of Mahabharat....","label":0},{"review":"I am very excited to watch this movie","label":0},{"review":"It is very important epic for all people of India","label":0},{"review":"Best fantastic movie","label":0},{"review":"Nice animation","label":0},{"review":"Eagerly waiting for this movie ..","label":0},{"review":"Nice movie","label":0},{"review":"Must see \nTo learn politics in every day of life","label":0},{"review":"nice movie","label":0},{"review":"Superstar AjayDevgn superr..","label":0},{"review":"For knowledge","label":0},{"review":"Will be osm","label":0},{"review":"I AM waiting","label":0},{"review":"Bangla mahabharat full.","label":0}]