[{"review":"It is based on the 1969 movie Cactus Flower which itself was inspired by a famous French play Fleur de cactus by Pierre Barillet and Jean-Pierre Gredy. The 2011 Hollywood movie Just Go with It was also based on the same movie.","label":0},{"review":"Good film as it contain romance, drama, comedy. Well played by actors and also director and the whole team behind the film who make the film good","label":0},{"review":"Excelent and fantastic movie in which there are drama emotions briliant and awsome acting hats of the director","label":0},{"review":"David dhawan ... is a class director.\nWhat a movie script... and i loved sushmita in here.\nThe most memorable is pyarre","label":0},{"review":"I just realised the movie \"Just go with it \" is inspired from this one. And I checked the release dates so am pretty sure.","label":0},{"review":"I just realised this today, the last scene with plane scene.. Copied from FRIENDS S10E17.. When rachel boards the plane..\nCould you be anymore copy cat?","label":0},{"review":"Most lovable ever green hit and all time blockbuster movie and salman always rocks","label":0},{"review":"Just too boring. You can't afford to see as per sake of time if you are employed","label":0},{"review":"It os a mind blowing film with awesome songs","label":0},{"review":"Amazing movie with an even better actor.","label":0},{"review":"mind-blowing music all song's super hit","label":0},{"review":"Good film as it contain romance, drama, comedy","label":0},{"review":"Outstanding work of all the actors.","label":0},{"review":"Superb yaar  & I Love Salmon","label":0},{"review":"Excellent,fantastic and romantic movie","label":0},{"review":"Entertaining","label":0},{"review":"Very very superb movie \nBest movie","label":0},{"review":"Good sushmita sen too beautiful","label":0},{"review":"Cool \nMovie","label":0},{"review":"Hilarious movie","label":0},{"review":"Very beautiful movie","label":0},{"review":"Wonder full","label":0},{"review":"Superb acting of Salman","label":0},{"review":"Mega movie","label":0},{"review":"I like this movie","label":0}]