[{"review":"First quarter is super boring. Details are so avoidable and daily soap like. Second and third quarters are moderately engaging. Climax is the one we have watched a gazillion times. KK bring life to an otherwise dying and could have been nice screenplay. Rituparna is noticeable.\nRajpal Yadav seems uncomfortable with the role. Rather than coming off as an introvert and complexed person, he projects a weird, depressed person, in a permanent sad mode. Probably trying too hard messed it up for him.\nC ...MORE","label":0},{"review":"First quarter is super boring. Details are so avoidable and daily soap like. Second and third quarters are moderately engaging. Climax is the one we have watched a gazillion times. KK bring life to an otherwise dying and could have been nice screenplay. Rituparna is noticeable.\nRajpal Yadav seems uncomfortable with the role. Rather than coming off as an introvert and complexed person, he projects a weird, depressed person, in a permanent sad mode. Probably trying too hard messed it up for him.\nConsidering the time frame, the movie would have been an entirely unique and magical experience. JK! It was almost a slog.;)","label":0},{"review":"I watched this movie one rainy Sunday with Tea and some pakoras. I know the actress being a Bengali myself and then I watched it for the sake of watching as there was no good movies on other channel. And after watching for 15 - 20 mins I was in love. Rajpal Yadav’s acting along with Rituparna was just so real and original. Both did a fabulous acting. All the characters are chosen very well. I missed watching this in theatre, but must say it a beautiful movie and very well written\n\nOverall 5/5","label":0},{"review":"this is a surprise movie. very well made. never ever expected it to be any good with a title like that and the actors who didn't exactly get my attention:-)...and then just couldn't change the channel as it played on.\n\nwhat stood out for me is the director's belief that the audience is intelligent...can be seen in each frame; no over the top. but a fun movie to watch. \n\nluvd rituparna's acting and of c yadav ji, menon and all the others. its a simple enough story made with heart and the directio ...MORE","label":0},{"review":"this is a surprise movie. very well made. never ever expected it to be any good with a title like that and the actors who didn't exactly get my attention:-)...and then just couldn't change the channel as it played on.\n\nwhat stood out for me is the director's belief that the audience is intelligent...can be seen in each frame; no over the top. but a fun movie to watch. \n\nluvd rituparna's acting and of c yadav ji, menon and all the others. its a simple enough story made with heart and the direction makes it believable.\n\nmost watchable.\n\nRating: 5/5","label":0},{"review":"It is a beautiful movie. The best part is that it is carried out and executed in such a simple manner. I could connect with the characters. Many main stream movie characters are not at all relatable with real life. \nBut the detailing of Lucknow and the other things have been done really well. Nice movie..!!","label":0},{"review":"Unexpectedly superb movie. Very natural acing. Had never known an actress like Rituparna sen before this movie but loved her acting and undoubtedly she is beautiful. And no words for Rajpal Yadav.... extremely impressive. Overall a worth a watch","label":0},{"review":"such a masterpiece!! mindblowing acting by rajpal yadav, every scene seems so realistics, and natural, and portrayal of city Lucknow is awesome feels great after watching this movie.","label":0},{"review":"Many a time I with my Mrs watch this entertaining movie! It’s utterly relax time pass ! Congratulations to Rajpal & Rituverma , KK & team","label":0},{"review":"Rajpal Yadav portrayed his role beautifully, bringing real life emotion and expressions in his acting.Providing viewers a  mesmerizing experience. Overall nice concept and compelling screenplay.","label":0},{"review":"Simple movie that reminds of you of a simpler time !! I like the execution of the movie .. perfect to watch with family .","label":0},{"review":"Superb\n A family oriented film which peculiarly Describes the iinterference of other person in between husband and wife.","label":0},{"review":"A very good movie and not much of Bollywood drama. A simple story but very meaningful movie.","label":0},{"review":"Rajpal yadav Acted superbly. His expression was outstanding. A must watch !","label":0},{"review":"I just love rajpal acting in this movie ...he is such a great actor really sueprb","label":0},{"review":"Superb picture and acting is super natural...i just love the song \"doob jana re\"","label":0},{"review":"very nice movie \nI have watched this many times and never get bored","label":0},{"review":"Good movie our life some  problem but got a better life our confidence..no loose were..","label":0},{"review":"Lovely film. Simple , hilarious and touching.","label":0},{"review":"its a lovely to watch. its slow but sweet movie","label":0},{"review":"This movie is sweet and simple, I have watched this movie so many times.","label":0},{"review":"Really a good movie which can be viewed by entire family together.","label":0},{"review":"The movie is a master piece for the actor \"Rajpal Yadav\". \nI loved it","label":0},{"review":"It's a good movie for a selective audience like me but  for normal audience i think it will be a boring film","label":0},{"review":"Nice movie.rajpal acting so nice.imotional scenes perfect picturisation.","label":0},{"review":"Simple romantic movie. Nice","label":0},{"review":"Rajpal yadav at his best I watched movie many times","label":0}]