[{"review":"I truly love this movie and its my all time favorite one  because of Kareena and Hritik.Kareena is looking too pretty in the movie and love the way she expresses her love for father. I like the chemistry between kareena and hritik and love that song Kasam ki  kasam  a lot. It has love, friendship and all the emotions,I recommend everyone to watch it, i rate it 4/5","label":0},{"review":"Chitchor was much better and had better music\nAmol Palekar & other cast was brilliant\nOnly people who have patience can watch such a simple film but good.\nSongs such as :\nAaj se pehle, aaj se zyada\nGori Tera gaon bada pyaara \nWill remain immortal\nI am 18 (in 2018) but loved this film ( chitchor )\nNot mpkdh","label":0},{"review":"I am a hritik Roshan fan... \nBut this one was cringe absolute cringe..... And yes one more thing I hate Suraj barjatya our whole generation do... For making unrealistic movies...or I am not rich that's why I can't understand..😂","label":0},{"review":"If asked about the worst Hindi movies of 2000s this will top the list.\nEverything is bad about this film, be sure u keep some cotton ready if planning to watch this loud movie.","label":0},{"review":"If asked about the worst Hindi movies of 2000s this will top the list.\nEverything is bad about this film, be sure u keep some cotton ready if planning to watch this loud movie.","label":0},{"review":"I lv this movie & i never get bored of watching it even hundred times . Kareena and hrithik both acted  supeeeeeeeeeeeeeeeeeeeeerbbbbb.","label":0},{"review":"Over acting at its best specially from hritik and kareena.i must say they both have deserves an Oscar for the over acting category.","label":0},{"review":"The film has an ok story, but is destroyed by overacting! It's as though everybody is trying to outdo each other in overacting, except for maybe Pankaj Kapoor.","label":0},{"review":"I can tell easily that I have seen this movie more than 100 times but I never get bored of this movie","label":0},{"review":"Amazing movie. All time my favourite. Kareena love u man","label":0},{"review":"Nice movie kareena and Hritik both act very well and I love the song kasam ki kasam hai kasam se","label":0},{"review":"V Good movie all the songs were excellent hrithik and kareena style was great","label":0},{"review":"This movie is wonderful!kareena and hrithik best act..the song kasam ki kasam was soo nice","label":0},{"review":"I love this movie &i like kareena because she is a so cute in this movie","label":0},{"review":"This is probably one of the worst movie I've ever seen too much overacting ,not attached with reality","label":0},{"review":"One of my fvrt movie\nLv each character nd love equation","label":0},{"review":"Too much over acting by Hrithik in the movie. The original movie chitchor was 100 times better","label":0},{"review":"Over actings by films actor, actress...and others star crew.... over all songs is good..\nbut old movie Chitchor is best acting, song's... everything is good.","label":0},{"review":"I Think it has been nice movie for the couple","label":0},{"review":"Kareena kapoor my favorite actress all time , best actress kareena 😘","label":0},{"review":"Mast h , what an acting of Kareena , really good","label":0},{"review":"THIS IS A VERY GOOD MOVIE .HRITHIK  IS THE BEST.","label":0},{"review":"Awesome movie I love this picture","label":0},{"review":"Fantastic movie,superb acting by gorgeous Kareena Kapoor.....","label":0},{"review":"I love this film veryyyyyyyyyyyyyyyyyyyyyyyyy.","label":0}]