[{"review":"Chinatown is an immense film by Roman Polanski. With the incredible casting of Jack Nicholson, Faye Dunaway and John Huston, and the epic script that merges Biblical references with TS Eliot ‘s Wasteland, it creates supreme allegory for human civilisation. The irony of the Water Engineer drowning in the midst of a terrible drought is the story of modern society. \n Manorama Six Feet Under is a creditable effort to adapt the Chinatown theme from the desert of California to that of Rajasthan with w ...MORE","label":0},{"review":"Chinatown is an immense film by Roman Polanski. With the incredible casting of Jack Nicholson, Faye Dunaway and John Huston, and the epic script that merges Biblical references with TS Eliot ‘s Wasteland, it creates supreme allegory for human civilisation. The irony of the Water Engineer drowning in the midst of a terrible drought is the story of modern society. \n Manorama Six Feet Under is a creditable effort to adapt the Chinatown theme from the desert of California to that of Rajasthan with water and political decadence as the common theme. Though it lacks the flowing quality of the Polanski story and also the formidable acting talents, I like Abhay Deol in the low key role. He is as honest an actor as you can get amongst the modern Bollywood generation. I just love that boy. \n Though the film is thematically too sophisticated, the modern smart phone wielding crowd should be smart enough to enjoy it. Just google Chinatown to prepare yourself for this movie. Even it has an important sequence playing on Balak and white tv in Abhay Doel’s residence where Polanski himself cuts the detective character’s (Jack  Nicholson ) nose for being a nosey fella!","label":0},{"review":"Brilliant! This movie is a hidden gem and one of the most under rated movies. From story to direction, acting, dialogues everything is spot on. Must watch for film lovers","label":0},{"review":"Just amazing... Great work by abhay deol and co.. This thriller  shows some bad politics by the politician in Rajasthan which is relatable with current scenario... Must watch movie if u love political thriller..","label":0},{"review":"Watch it for its brilliant Climax ....... It shows how bad the humans are......how ugly humankind can get ....always try to pull someone/everyone down for their own benefit.....but God punishes bad people.....in climax every1 got punished.","label":0},{"review":"Allover an average film.Suspensive drama with lots of plot holes. But entertaining,intelligent.A must saying negative aspect of the film is acting of Abhay Deol.","label":0},{"review":"the movie lovers of this genre should watch this movie once. one thing i loved about this movie is at the end of the movie thrill is at the top which i liked it a lot.","label":0},{"review":"Too good...one of the best all time thrillers of Indian Cinema.Loosely based on the Hollywood movie Chinatown,nevertheless,I found it very very original on the backdrop of dry barren Rajasthan.","label":0},{"review":"Really awesome movie. I never expected such a suspense movie from Indian cinema. Its worth watching movie... go for it if you hadn't seen it.","label":0},{"review":"A bit too long screenplay makes the film dull. But it's one best Political Drama from Indian Cinema.","label":0},{"review":"Nice movie... Started as boringly slow paced but the last ten minutes is awesome... Must watch...","label":0},{"review":"More than a suspense movie, it is a take on the politicians, an insight on their life style and motives. Kulbhushan Kharbanda enacts well.","label":0},{"review":"The best Suspense thriller of Indian Cinema..A must watch.. nice work by Abhay deol.","label":0},{"review":"A tribute to Chinatown, this is a great movie in its own right. Watch out for Nawazuddin's cameo.","label":0},{"review":"A really nice movie. Interesting to watch. You will have fun.","label":0},{"review":"Great story and acting... the pace and intensity could have been better .. but I think one of the best india thrillers ....","label":0},{"review":"Very gud filim. Pl watch the move as histery of kalabhavan'life every one played.gud","label":0},{"review":"Worth watching.... Loved the plot.. You will be glued to know the end.. N8ce movie","label":0},{"review":"Nice to such thriller some times to feel free from boring hindi movies with similar subjects.","label":0},{"review":"Excellent acting by all actors and awesome suspense movie","label":0},{"review":"This is the first worst suspension movie all history time I don't like","label":0},{"review":"Boring screenplay just last 30 min good and the movie will make you sleep.","label":0},{"review":"Good movie nice act by abey deol and nawazuddin","label":0},{"review":"Brilliant and nice twist at the end","label":0},{"review":"A good movie. Abhay is good","label":0},{"review":"Really loved this movie. one time should watch.","label":0}]