[{"review":"Movie was awesome, hero played as natural as one can be with his matured acting, we feel like its not his debut film. Movie is a mixture of all which one could expect and conveyed the content it has, in a excellent manner. RR gives you butterflies in some scenes and took the film to next level. Srikanth acting was the best. Songs were enjoyable. All credits goes to the cast and crew. A new concept which is far better than an regular films.Its a must watch film","label":0},{"review":"Sch a new aged movie..  Srikanth did an award winning perfrmance..  The newbie Abhay Adaka is jstt awesome..  His looks, dancing skills and perfct dialogue delivery shiws he wil hav bright future in TFI..  \nComing to d story i wemt widout expectations and fully enjoyed every scene in d movie... \nA movie whr evry character has its own importance..   Espcly the comedy is top notch.. \nI dnt knw why ppl r showing less love towards dis movie bt dis movie should b succesful.. \n💟💟💟","label":0},{"review":"Such a great film i have never ever seen...All emotions mixed in this movie like a family pack...Please go and watch the film...support new faces and new commers🎥... Abhay u simply superb good job keep it up","label":0},{"review":"To be frank i loved it, there is no unnecessary side tracks which i like the most and every minute is related to the story, Actor Srikanth, Actor Abay and Heroine Megha did a fantastic job, Not the regular dramatic film, I njoyed the movie,songs(specially the last one).","label":0},{"review":"Superb movie, Director of the film has executed the unprecedented script with great visuals and screenplay. Besides this, Hero Srikanth with vivid looks and acting, Heroine charm and production values all together made Marshal a blockbuster.","label":0},{"review":"Excellent acting by Srikanth.... Top notch performance and songs.. good mother senti and full length Srikanth presence  makes this movie amazing","label":0},{"review":"Aresome movie really fanstastic movie with new theme and new script aresome mother sentiment totolly loved movie alot.super acting by abhay and srikanth garu","label":0},{"review":"Excellent story and  acting also. New hero acted line a experienced hero, congratulations for successful of you Marshal","label":0},{"review":"Just i watched Marshal it is excellent movie. Srikanth acting greate,, nice concept. New concept","label":0},{"review":"What a movie routine love story. headache scenes and different story. Headache matram kachitham ga vasthundhi","label":0},{"review":"Great performances by lead roles and nicely handled the different subject by debutant director Jai Raja Singh ...","label":0},{"review":"Good movie . Must watch\nI recommend everyone","label":0},{"review":"The movie is just awesome with new concept. Go and watch it.","label":0},{"review":"Good story with superb acting by srikanth\nConventional debut directing by jai raj","label":0},{"review":"Screen play.. unbelievable..story..and.direction department did the great working.action..superb.","label":0},{"review":"I'm a actor in this movie I like to proud my self","label":0},{"review":"Excellent,fantastic and awesome movie please do watch the movie","label":0},{"review":"Awful concept ..must watch movie... encourage needed for upcoming and debew heros..&much better than a Nani's movie..","label":0},{"review":"Srikanth acting super overall marshal \nmovie super hit","label":0},{"review":"Nice movie plz encourage new thinks","label":0},{"review":"Simply superb","label":0},{"review":"Must watchable movie","label":0},{"review":"Boring movie routine story","label":0},{"review":"Good film\nMesssge orienred film...","label":0},{"review":"Super movie","label":0}]