[{"review":"A paean of Praise for the legendary Pugilist,!!!!!\n\nPotrayed every struggle and tribulations of the boxer in her life beautifully but with a bit of masala ,P.C and Omung Kumar equally did justice to character and direction respectively .what can be more greater than this ,yet the plot at end leaves us wanting for more ....","label":0},{"review":"this show the actual women empower that how a farmer's daughter become the first  women to win 6 gold medals in world championship we all are unstoppable a perfect biopic for m.c. Mary kom. it is a master piece","label":0},{"review":"Magnificent priyanka did it again..Another top notch powerful performance by her .. Fantastic ..Hats off to director omung kumar for such a inspirational sports biopic...Must watch it ...","label":0},{"review":"Never knew i would like Priyanka Chopra so much. She has really worked hard. I am happy such a movie has brought Mary Kom's life and struggle in front of so many people.","label":0},{"review":"This is a fabulous movie...\nA very well directed movie among all the bio pics.....\nPriyanka Chopra done an awesome work as Mary kom.....","label":0},{"review":"Inspirational film. Priyanka had put her heart and soul for this film.She worked really hard.Salute her.","label":0},{"review":"This movie inspires the all women of our country . This is an example of those women who thinks that their life will finish after marriage.","label":0},{"review":"I really appreciate Priyanka’s hard work and true dedication towards her every films . Love her","label":0},{"review":"Its a fabulous movie...i m very much inspiring frm this movie in my life thank you marry","label":0},{"review":"This film is superb and very inspiring for the future Mary koms.","label":0},{"review":"It was a motivational movie and performance of Priyanka Chopra was amazing","label":0},{"review":"Really an excellent movie for serious watchers and not just funloverds.","label":0},{"review":"They should have made a good movie. They messed it up.","label":0},{"review":"It's a very good life story of Mary kom","label":0},{"review":"Amazing movie, still love to watch it after 4 years.","label":0},{"review":"Motivational story and a high class performance by PC.","label":0},{"review":"Excellent direction...worth watching...i saw the movie on TV today...","label":0},{"review":"This film motivate me in every step of my life...","label":0},{"review":"Its Amazing It Inspires Me To Push To My Limit!!!","label":0},{"review":"It's really motivated movie  .... specially for girls  😊","label":0},{"review":"Nice dedicated work of Priyanka chopra","label":0},{"review":"Best motivational  for students","label":0},{"review":"Terrific movie finest inspirational, 5/5","label":0},{"review":"One of the best masterpiece of Priyanka.","label":0},{"review":"Women empowerment loving so much Mary Kom","label":0}]