[{"review":"This cinema is one of a kind. This reel is an  amazing amalgamation of well direction , acting and music. Ofcurse , this movie is quite different from the commercial types but somewhat alike it. Well known faces will woo you and well written script is what comes as a cherry on the top. \nHeartiest applause to Vishal Bhardwaj Sir for such an unique way to portray the precarious condition of the society and how the farmers are being crushed by the business stalwarts and politicians. Last but not th ...MORE","label":0},{"review":"This cinema is one of a kind. This reel is an  amazing amalgamation of well direction , acting and music. Ofcurse , this movie is quite different from the commercial types but somewhat alike it. Well known faces will woo you and well written script is what comes as a cherry on the top. \nHeartiest applause to Vishal Bhardwaj Sir for such an unique way to portray the precarious condition of the society and how the farmers are being crushed by the business stalwarts and politicians. Last but not the least Pankaj Sir, you were enthralling all throughout!","label":0},{"review":"This is probably Vishal Bharadwaj's most underrated movie. From the face of it, it seems nonsensical but there's definitely more than meets the eye or shall I say ear because the lyrics of some of the songs and certain dialogues remind one of the red revolution and it's proponents.","label":0},{"review":"Really enjoyed a lot..movie with nice sense of humour ,music is too good & excellent concept execution and well performed by the cast members really worth to watch","label":0},{"review":"Don't go by the name ! Movie is really very nice and extremely unpredictable. Not a love story like every other Bollywood movie which is the best thing about this movie !","label":0},{"review":"It's really a good movie and comedy too.I think people should watch and must not judge it by the name.It's story is unique and different so, I really enjoyed it and liked it....","label":0},{"review":"It was a nice movie and funny too ...\nI liked it, i don't know why people are criticizing it ...","label":0},{"review":"Its a good movie, all i can say is \"You want get bored even after watching it several times\"","label":0},{"review":"Did this movie,shown the real life story of mother who is doing everything for the power and to make the career of her son?","label":0},{"review":"Nice movie with good to watch.. comedy scene of Pankaj are very nice and music is nice","label":0},{"review":"The movie put an end to Imraan khans acting career!! so it must have been good :P","label":0},{"review":"Don't going into the technicalities. But through this movie ask your self  question that when the revolution is coming.","label":0},{"review":"Such a waste of time. Instead of watching this movie paint a cow pink and laugh","label":0},{"review":"Vishal Bhardwaj is a genius..my Lal Salaam to his direction 🙏🙏..watch movie if you appreciate Left( communist) ideology","label":0},{"review":"Very boaring and extremely irritating one","label":0},{"review":"yep its good movie","label":0},{"review":"Good movie","label":0},{"review":"Bakwas worst film ever","label":0},{"review":"It's good movie","label":0},{"review":"Worst movie","label":0},{"review":"Its good movie","label":0},{"review":"I liked the movle","label":0},{"review":"Must watch movie😊👌💐","label":0},{"review":"Art of living","label":0}]