[{"review":"Beautiful movie. Perfect blend of emotions,  situations, misinterpretations...and what not. Director Pankaj Kapoor blends and merges the contemporary indian scenarios - babri masjid demolition, 1992 blasts, kargil , gujarat riots. I Waited till last to know what happens finally. I saw it on 2/6/18, almost 7 yrs of its release, still it feels fresh. Definitely must watch romantic movie.","label":0},{"review":"Very lovely story, acting of shahid, sonam & of all others is very nice and natural, just fell in love with first half of film, the last half was little bit slow going but MUST WATCH film❤","label":0},{"review":"Very good movie. Free from  fake stunts and fake stories. It has a great story and great acting by those in supporting and leading role.","label":0},{"review":"A totally useless movie. Must be in list of top 10 movies you should never see. Story line is useless, direction nonsensical and actors did what they were told to do. Must not watch.","label":0},{"review":"Well directed movie..Flow of emotions were real and connecting..A bit slow but still whats the joy of cherishing a lovely romatic movie if its not paced slow and with proper sowing of emotions into it.","label":0},{"review":"One of the most lovable and moving epic love story,  filled with heavy flow of emotions and romance. A love story moulded by tragedies...","label":0},{"review":"This is one of the best movies of shahid and sonam. Movie is just fantastic. Very nice","label":0},{"review":"A very well directed movie. Director has done a great job! Love like this is love.","label":0},{"review":"Have watched it a couple of times just to understand whether I like this one or not but again i am not able to figure it out :((((\nAnyways the music album of the movie was amazing","label":0},{"review":"Nice movie with perfect casting plots,  amazing and superb acting by Shahid Kapoor. ..music was beautiful. ..how can such movie overlooked. ..","label":0},{"review":"Beautiful movie. Perfect blend of emotions\nAnd qwinswit viry nice movie super song","label":0},{"review":"Beautiful movie loved the concept n perfect blend of emotions acting of sonam and shahid was outstanding and perfect loved it.","label":0},{"review":"Don't believe in the rating in IMDb for this movie ...this is one of the best love stories ever produced in bollywood","label":0},{"review":"A perfect and must watch love story.\nA pure piece of love and emotions.","label":0},{"review":"Different type of treatment given by director. Slow but never off track. Musically ok.","label":0},{"review":"This is a great movie & very good act by every person","label":0},{"review":"He is my fvrt movie Nd I love all movies of Shahid I love you Shahid....","label":0},{"review":"Good movie I like the song saj dhaj ke","label":0},{"review":"one of the best movie . next to veer zaara","label":0},{"review":"This movie portrays true love in all sense...loved it","label":0},{"review":"Mausam movi and the love life and bast movi and my life w.","label":0},{"review":"The song was very nice rabba main toh mar gaya","label":0},{"review":"Nice movie I love sahid sir","label":0},{"review":"Very imotional and country loving movie","label":0},{"review":"Very underrated","label":0}]