[{"review":"It's really a good love and patriotic movie. \nBlending of these two different themes is fantastic. Patriotism is shown simple and touching way. The Hotel scene and the dialogues in Pakistan are hair raising. Akasha acted well but needs some more maturity. And he look so young to do some heavy and performance needed characters. Heroine is good and gave needed performance. Of course there are heart touching scenes It would have been a great movie if the movie touched the hearts some more. Anyway a ...MORE","label":0},{"review":"It's really a good love and patriotic movie. \nBlending of these two different themes is fantastic. Patriotism is shown simple and touching way. The Hotel scene and the dialogues in Pakistan are hair raising. Akasha acted well but needs some more maturity. And he look so young to do some heavy and performance needed characters. Heroine is good and gave needed performance. Of course there are heart touching scenes It would have been a great movie if the movie touched the hearts some more. Anyway all the best to Akash.","label":0},{"review":"It's really a good love and patriotic movie. \nBlending of these two different themes is fantastic. Patriotism is shown simple and touching way. The Hotel scene and the dialogues in Pakistan are hair raising. Akasha acted well but needs some more maturity. And he look so young to do some heavy and performance needed characters. Heroine is good and gave needed performance. Of course there are heart touching scenes It would have been a great movie if the movie touched the hearts some more. Anyway a ...MORE","label":0},{"review":"It's really a good love and patriotic movie. \nBlending of these two different themes is fantastic. Patriotism is shown simple and touching way. The Hotel scene and the dialogues in Pakistan are hair raising. Akasha acted well but needs some more maturity. And he look so young to do some heavy and performance needed characters. Heroine is good and gave needed performance. Of course there are heart touching scenes It would have been a great movie if the movie touched the hearts some more. Anyway all the best to Akash.","label":0},{"review":"Akash puri a good mature actor,neha shetty totally involved in her charecter, and puri sir your story and concepts of the movie make them blockbuster but you even proved that your way of showing the visuals is also a treat for your fans a best launching movie for your son akash puri i firstly went to movie coz i was getting bored the theater i went was only filled with 25 ppl remaining is empty i thought the movie is a flop but genuinely its a blockbuster movie with great values of love and resp ...MORE","label":0},{"review":"Akash puri a good mature actor,neha shetty totally involved in her charecter, and puri sir your story and concepts of the movie make them blockbuster but you even proved that your way of showing the visuals is also a treat for your fans a best launching movie for your son akash puri i firstly went to movie coz i was getting bored the theater i went was only filled with 25 ppl remaining is empty i thought the movie is a flop but genuinely its a blockbuster movie with great values of love and respect towards couple and our country and rival country with the great music arabic bgm in pakistan my god wat an abstract throughly enjoyed the movie came out from the theater with feel that yes this is what a movie called super really its awsm movie a must watchable youthful movie all the best hope these type of different stories need to our tollywood","label":0},{"review":"Please don't believe all those fuss..... Amazing experience after a long time watching such a great love story.... \nBgm and oh priya is heart touching...... Simply awesome in one word... \nGreetings to the entire team and specifically puri sir and his son... What an amazing performance he did.... Like an actor of experience... Super... 👌 cool I'll","label":0},{"review":"A different attempt from Puri sir and good direction though. Special mention needed to Sandeep chowta , all the songs were good and background was also good. Aakash puri , there is lot to go brother and you look more younger for this role and female lead ,look beautiful . Overall a different attempt with non -linear screenplay, songs and dialogues makes this film an one time watch , but it's good enough.","label":0},{"review":"Shows good emotions in many parts of movie. Those who understand complexity of two nations can know actual theme of movie. Excellent movie in recent times. Hands off to puri for delivering very difficult story in an interesting manner. Super gift for his son who excelled in all scenes.Too good movie. Loved through out.","label":0},{"review":"There are many factors involved in the movie especially removing the barriers between the borders of Indo-pak... I think this kind of movie was not done yet by anyone #purijagannath Garu superb... I really like... #Akash Puri is created benchmark... #Neha shetty did well... Love scenes are really awesome in the movie...  Especially his voice is really energetic.. Songs are superb...","label":0},{"review":"I went to dis movie with my boyfriend (krishna vardan) which is an amazing experience. i lovvd dis movie.. my boyfrnd somhow managed to get cornr seats wher we havv romanced realy wile romantc scenes in film progressed. ovrall its an amazing nd fruitfl momnt.. Movie is Gud.","label":0},{"review":"What a movie its just mind blowing treat to watch. to handle a character like this in his first movie akash puri really given his best performance, narriation of story his really fantastic by puri sir. must watch film for the ones who really no what is a film called","label":0},{"review":"Nice movie good to watch \nAkash done Fab job.good dilouges by puri.\nA huge respect towards the women and no vulgarity from puri.great visuals.\nBest in recent films...\n\nPassable First half and good interval bang\nSecond half is good...\n\nMy rating is 2.5 \nAnd good watch##Mehabooba##","label":0},{"review":"Future Super Star Akash Puri bro\nin this debut movie as hero your acting is at peaks and matured.\ntq Puri Sir for this beautiful movie.\nMehbooba is feel good, intense love story, beautifully directed\nWATCHED WITH MY FAMILY TWICE IN THEATER","label":0},{"review":"A mve vth human values and respect towards country is shown whatever may be d country one must love their own nation and also a pure love story.but somewhat lag in the story and remaining everything is perfect,everyone can watch this movie it depends on mentality of an audian some people may won't like this movie.","label":0},{"review":"This is really I say to thank for puri jaganath sir. Bcz, he is give a wonderful movie in all over Indian film industry ... Offcourse I remember my lover so long gape in my heart ,in the theartre... I love it and I fall this fidaaa..... Well done ,for ur movie , my rating is 4/5....","label":0},{"review":"Sir really this movie is would be very thriller and blockbuster. I think it is the love story of two different religious people of India and Pakistan,  very interesting and we are waiting for this movie to watch. And it also a soldier's love story I think.\nUnchecked boxHelpful? • 19 people found this helpful.","label":0},{"review":"I'll really loved this movie. Sum sens look like a magadhera but this movie is totally different to any movie really. Aakash pori is  try his level best Incas I didn't expect he's acting is very good  heroin also gorgeous.   Pls  guys.   If u gave a feedback see the movie first   jaihind","label":0},{"review":"Wonderful movie\nA cute lovers \nAmazing  love story\nI love this move\nIt's  very good love story created by puri sir heads of  to u \nReally it is very good movie \nAnd love between enemies like India and Pakistan  taht i loved mostly in movie\nVery very interesting sir and mind blowing  movie \nI love  that two characters done by ashok and neha\nThey both  are very good actors  i love them\nAnd i love neha\nL u neha❤\nL u akash❤❤💞\n💞M💞E💞H💞A💞B💞O💞O💞B💞A💞","label":0},{"review":"Puri's attempt is futile.. Nothing tasty in movie.. His taking very ordinary.. Seems like a new and an immature director.. Worst screenplay.. Music also noisy... No Melody.. Photography is ordinary.. Wrong selection of story line for his son debut hero film.. Puri seems to loosing gripping and romantic narration in recent times.. His last movie paisa vasool debacle continues with this most awaited film.. No bigger scope for artists performance... Yet another illogical, routine tollywood movie","label":0},{"review":"Story is so nice but execution is not like puri sir type..  Especially climax is not good,  took lot of liberty instead, expected reality of puri style.. Akash and neha are awesome..  So natural and wonderful chemistry. Overall awesome attempt","label":0},{"review":"Mehbooba Telugu movie\nVery nice to see .\nCo  writer   thatavarthi Kiran  has\nWritten good  words in this movie.\nHeroine  neha shetty  acting is superb. \nHero  akash puri  has done\nSuperb action in this movie.","label":0},{"review":"puri is fast losing his touch. this movie is formulaic, routine and mostly boring. it is a cross-breed of veer zara and magadheera. puri uses the cliched themes of indo-pak issue and reincarnation. there is no good music or comedy in this entire movie. there are no puri's trademark engaging scenes. the first half is passable and the second half is horrible. i wasted my time and money by watching this below average movie. don't waste yours.","label":0},{"review":"Good movie first half is awesome...\n\nComing to second half the story telling of flashblack is good but some scenes feels bore overall its a good movie. \n\nBgm is awesome... \n\nSongs good \n\nMy rating 3/5","label":0},{"review":"It was an excellent story and we'll executed by Puri garu. Patriotism is shown to its core. Everybody has done justice to their role.\n\nPeople who love India would like this movie. I enjoyed.","label":0},{"review":"I think Puri director taking different style compare with his previous movies.\nWhile watching promo is very positive way and hero elevation is good.\n\nFor struggling and loving to each other between two countries .That is with different geographical regions.","label":0},{"review":"I got more excited my watching this movie nice acting MR. Akash puri bro and fights and love and I inspired more at  last seen in Border and I got more excited nice Direction. Puri Sir. And plz let me one Chane with u r son Sir by next up coming movie","label":0},{"review":"One of Favourite movie in my life. When I'm watching this film\nI luv so much.\nThis Film is Biggest Hit for Akash Puri in Carrier","label":0}]