[{"review":"Ratings: 4/5\nIt's Really A Wonderful Movie With Unexpected Turns. And I Think That Manish Paul Has Did His Debut Brilliantly. You Will Be Suspensed Till The Climax Of The Movie. The Star Cast Was Also Amazing. The Movie Deserves To Earn More But The Public Has Rejected It And Made It A Flop 😠.","label":0},{"review":"Never ever watch this movie if you are seeking a hacker based movie. This movie is a non-brainer. The whole movie doesn't make sense. The hacking techniques shown in the movie are horseshit. The white hat hacker in this movie is not even a nerd he is a \"cool\" extrovert.\n\nThis movie is just for those who has never seen a computer or else you will die laughing till the end. \n\nIf you think that this movie has anything to offer regarding hacking just see this movie poster and you can imagine what ki ...MORE","label":0},{"review":"Never ever watch this movie if you are seeking a hacker based movie. This movie is a non-brainer. The whole movie doesn't make sense. The hacking techniques shown in the movie are horseshit. The white hat hacker in this movie is not even a nerd he is a \"cool\" extrovert.\n\nThis movie is just for those who has never seen a computer or else you will die laughing till the end. \n\nIf you think that this movie has anything to offer regarding hacking just see this movie poster and you can imagine what kind of movie it is and to whom this movie is targeted.","label":0},{"review":"MANISH PAUL IS GOOD SOYAS HI JE BERI TELENT HU COMEDIS SHOWS AND LAS GO AND VICKY VIRUS MOVIE ELLI AVRAM BUTIFULL ACTREES NEW MOVIE FRAUD SAIYAAN FAST SONGH CHAMAA CHAMAA HI BEUTIFULL AND \nSTARCAST NAME ARSHAD WARSHI AND SAURABH SHUKLA SARA LOREN","label":0},{"review":"I find the movie very complicated and boring, plus direction was poor. Yes it was very low bugdet film I know ......\n\nBut if you low bugdet then why make a movie ?\n\nBetter make a serial .........","label":0},{"review":"Great job saurabh verma! I enjoyed the movie including My favourite song #ToSeNaina \nfabulous!","label":0},{"review":"Really wonderful muvi.....great job 'manish paul\" May all time favorite song @ ToSe Naina@","label":0},{"review":"Superb movie \nDifferent and unique theme and plot\nAmazimg movie manish u nailed it","label":0},{"review":"a movie with lots of twists\nmust watch\na mixture of romance drama and thriller","label":0},{"review":"yes, very funny movie, i enjoyed every mins while watching movie.\nfunny dialogues.","label":0},{"review":"Gr8 movie. Contained most of the movie elements","label":0},{"review":"Nice manish and elli. Nice.","label":0},{"review":"It is a wonderful movie with romance suspense thriller.","label":0},{"review":"Mind blowing  movie... Brilliant...  👏👏","label":0},{"review":"Awesome movie. I want  give ratings 5/5  for this movie.\n\nSupereb .....","label":0},{"review":"Manish paul is the best ankere in the world","label":0},{"review":"Best hacking movie ever","label":0},{"review":"These kind of movies are rare in Bollywood. Must watch.","label":0},{"review":"Tose naina is very nice song","label":0},{"review":"Nice movie you should watch","label":0},{"review":"I love this movie","label":0},{"review":"Loved the concept of the movie","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0},{"review":"Superbb...👌👌 \n7 on 10\n👍","label":0},{"review":"Awesome movie but sad for indian response.","label":0}]