[{"review":"It is really a superb movie guys ...I have watched so many times from my 7th std...It was still my most fav movie ...bcz now I'm n my final year ... I didn't understand the song lyrics... But I used to hear frequently...fantastic music which will never make u bore ..Believe  me yaaar... It ws reallllyyy a wonderfull lub story... I just love ittt.","label":0},{"review":"Fantastic movie yaar...this reminds me of school days specially the childhood romance. I listen this song when I used to go school by pool car, there was a FM radio and then this music starts so it was very memorable for my life and miss those days.","label":0},{"review":"This movie came at a time when many of us were in schools.It struck all the right chords at that time, crush, love, proposing, talking with your girlfriend and all the innocent teenage things. \n\nAlthough for many like me, the teenage love and innocence is long gone, but this movie still keeps a place in your heart.","label":0},{"review":"This is a heart touching love story . I just loved it . I can't describe it in one word . It's fantastic, awesome, superb, extraordinary, mindblowing and my all time favourite love story movie. 👌🏻👌🏻","label":0},{"review":"This movie really steals the heart , u watch it once, u can never forget it , it's simply awesome especially it has shown pretty simple innocent luv story with no vulgarity at all which all of us seek in our lyf be it in school or college.","label":0},{"review":"Some movies are made by clean heart and you find yourself in one of the leads. MP3 really touches you.Portrays one of the purest teenage romance & mischievous school life.","label":0},{"review":"I watched this film one night in 2008 or 2007 and i forget the name of this romantic film but i didn't forget the best momentes at the eiffel tower so i search it in every where typing romantic film in paris, young romantic film hindi in paris and i didn't get it but one day i wrote romantic hindi film at eiffel tower hahahaha","label":0},{"review":"this movie was so amazing. i had a plan to watch this movie with my ex. but she left me its been 2 years, however i watched this movie today though. i miss her right now.","label":0},{"review":"This movie has some magic in itself, every time I watch I feel like I'm in school. Ruzlan Mumtaz and Hazel Crowney are so innocent in this film and moreover, I would suggest this to all teenagers.","label":0},{"review":"childhood is just amusing as always and this movie and every song is just like a part of life... love my childhood all because of this Movie... <3","label":0},{"review":"I still remember when i was in my childhood this movie created buzz .\nJust sweet movie .worth watch .","label":0},{"review":"this movie is for teenagers who got their 1st love. worth watching. love this movie. watch again and again.","label":0},{"review":"My first hindi romantic film at school days.) So much innocence which today's movies and lives lacking ( So sad....These are true love which lasts longer","label":0},{"review":"Luv this movie...it always boost serotonin level and gives a good nostalgia","label":0},{"review":"Great movie takes me back to my school days. My crush😍🤩","label":0},{"review":"One and only one best movie based on first love in school 💖","label":0},{"review":"The rush of first love, first kiss. Ah... To be young again. Highly recommended.","label":0},{"review":"It cam when i was in 11th standard, loved it","label":0},{"review":"one of the best college life love story !","label":0},{"review":"Yesterday I see this movie... What a movie  I love this amazing love story movie❤","label":0},{"review":"Loved the movie and enjoy the school days","label":0},{"review":"Great movie to watch for teenagers","label":0},{"review":"Best romantic film\nI love it","label":0},{"review":"Best romantic flim. I like it.","label":0},{"review":"Best  movie and I like it..","label":0}]