[{"review":"Here is a review of the movie Mujhse Fraaandship Karoge(2011)\n\n'An underrated which succeeds on winning your heart.'\n\nRatings: 4.5/5\n\nStory: Vishal(Saqib Saleem) and Preity(Saba Azad) must set aside their never-ending-dispute and team up to organise a function together while chatting on facebook being someone else unknowingly that they are chatting with each other. \n\nWhat's Good: Basically everything. The movie always tips you with a laugh or two. The whole new approach towards the concept of th ...MORE","label":0},{"review":"Here is a review of the movie Mujhse Fraaandship Karoge(2011)\n\n'An underrated which succeeds on winning your heart.'\n\nRatings: 4.5/5\n\nStory: Vishal(Saqib Saleem) and Preity(Saba Azad) must set aside their never-ending-dispute and team up to organise a function together while chatting on facebook being someone else unknowingly that they are chatting with each other. \n\nWhat's Good: Basically everything. The movie always tips you with a laugh or two. The whole new approach towards the concept of the movie. The movie giving a message is damn good and acting.\n\nWhat's Bad: A clichè ending(which is just fine) and that the movie could explore many things more.\n\nBore Part: None\n\nReview: The movie is something I wish to see again and again. It is that good. I personally felt that this movie is highly relatable and fun.\n\nSuggestion: It is one of those sweet movies so don't expect mass and fighting.\n\nTo Watch or Not To Watch: Watch it for Saqib and fun comic.\n\n                                       A HASAN'S REVIEW","label":0},{"review":"I think is best movie bcoz this movie in which new idea ,how to choose our good life partner. sometimes bf and gf relationship lot's of misunderstanding👈 this reason sometimes make big problem👉🏼 and then break up.\nMy all dears bf &gf plz tell y,re frend y,re problem. if discuss with that problem then I know some solution obviously founded .☺️👍\nVaishnavi bali.","label":0},{"review":"Definitely a fun to watch with your friends and cousins. It has good humor, simple storyline and it's a great choice if you are looking for something light hearted to watch .","label":0},{"review":"It is nice movie to watch on a weekend With u friends, cousins. This is a light hearted rom-com  .I personally liked this movie.","label":0},{"review":"i think its gr8 as it shows that if we love someone truly we should be honest instead of hiding ourselves behind the computer screen","label":0},{"review":"Saqib is always well. So I liked the movie. It was at the same time funny...Coz of Saqib's dialogue framing way. 😊","label":0},{"review":"Such a fun loving Movie.\nThroughly enjoyed it! Specially \"Priety's\" and \"vishal's\" performance😚","label":0},{"review":"Very nice movie .No exaggeration but simple approach to the Screenplay which makes it worth watching.","label":0},{"review":"awesome movie..\nwho knows that your biggest enemy will fall in love with you....","label":0},{"review":"Most irritating..... stereotyping roles..... misleading for all college students from real life problems..... waste of time and money","label":0},{"review":"Gr8 movie...simple and real story wth gd acting...worth watching","label":0},{"review":"I have watched it 14 times. one of my favorite movie.😍","label":0},{"review":"Awesome movie... A must watch","label":0},{"review":"I just love this movie😍❤️","label":0},{"review":"I love this movie a lot","label":0},{"review":"Love my poonam and my life","label":0},{"review":"I loved this movie because I like saquib saleem.","label":0},{"review":"Awesome movie","label":0},{"review":"Best movie","label":0},{"review":"Underrated, entertaining, funny and adorable....","label":0},{"review":"It's awesome movie. ..","label":0},{"review":"Must watch","label":0},{"review":"fRAAANDship name is uh oh...","label":0}]