[{"review":"DHOBI GHAT (MUMBAI DIARIES) \ni can watch it 10k times, so my mindwish  to watch it atleast before going to bed daily. Masterpiece  excellent mindblowing heartfelt surprisable movie .Really this film is my type , very different movie, incomparable , top class .Incredible achievements. I think Dg can be understood minutely  thoroughly by a creative mind, mainly introvert people only.Much more perception  or sense of humour  / deep concentration  needs to clear suggest  vividly. Usually whenever it ...MORE","label":0},{"review":"DHOBI GHAT (MUMBAI DIARIES) \ni can watch it 10k times, so my mindwish  to watch it atleast before going to bed daily. Masterpiece  excellent mindblowing heartfelt surprisable movie .Really this film is my type , very different movie, incomparable , top class .Incredible achievements. I think Dg can be understood minutely  thoroughly by a creative mind, mainly introvert people only.Much more perception  or sense of humour  / deep concentration  needs to clear suggest  vividly. Usually whenever it rains,  my mind 'd lean to watch just DG. I can write a book based on plot summary of Dhobi ghat  and its aspect to our entire  human society , it is the  first picture,  which is watched  continuously thrice in a day  by my eyes.valuable life philosophy lies within  1:40 duration  wrapped movie. Acting in this movie is very natural instinctive. So,  easily could attract an emotional audiences. \n   Monica kriti prateik kiranmaam aamirsir -all did magnificently  outstanding performance. Fitest and eligible actors for their choosed characters. Shay role well played by monica,  who has very broad outlook. Monica's appearance, eye contact  r mind blowing. Kriti's voice is too sweet, lovable, cute as well as her similarities  innocent  look.  Munna-childish, sensitive, dreamy. Well performed by prateik. Finally  AK is well suit  for Arun role,perfect matchable. He acted  with full p.c of dedication passion minutely observations. I saw myself in Arun\n   Anyway, 4 people of different fields intersect each other in a city  named Mumbai.shay well connected  with 2, Arun with 3, Yasmin with 1 (indirect) ,munna with 2.These  4 persons climax happened with  tragedy- melancholy  -nothing. So life is just abt  dream or veil, nothing guarantees  reality in this wicked world, still humans r running for finding fake  honey. None knows the Truth.Life is thus since oldest past-present- future.lt denotes our ignorance. So we have to live within the society just in lightly with knowing  the real inner truth  - detaching worldly  materialistic affairs;  only those people can be successful to  acquire peace something in the heavenly earth,  no doubt.In this picture,  Arun only  wants to find out \"what's called real life \" and for this  always he hides  to both self as well as to others. He wants to manage his art work  in a narrow studio apartment  ; that's why he'd  be able to vision  the entire field  of imagination world  and can discover himself better way with  as  more n more  introvert  for his  living creative touch. This story  is purely based on  all of us,  earth people,day to day life.\n     Arun  connected emotionally  only with yashmin  and that's  vast journey for  him for reaching  at aim of creative- knowing the Humanity better.He had natural affection towards yasmin , not love atall..Ultimately yasmin's effect  reflected on him as well with   munna's effect on shay. Although once Arun's physical touch  to shay  but that's not fixed,but accidentally. In opposite, shai  had little dissapointment  in the fact of affairs.  She had love towards  dual and her inner mind  searched a company  but  n't in a right way  exactly. Finally she is crying  having with emotions  abt Arun-munna-new address  -melancholy atmosphere- local culture-  values of life. Arun was single  (separated)   alws engrossed  himself with  devotion,  thought abt life as a painter cum philosopher  And it was the  best job idea  of him forever.shai returned  with her research  abt culture, deep sensitivity  feelings  abt frs  and  things as a learner .Yasmine was cute,  simple, sensitive and  natural instinctive, less modern  and that's the reason  behind  unhappy married life  and finally tragic self made death. Munna role denotes  our proverty,  struggle, dreams.How the behaves is a fact  towards  innocent lower level  people of  rich  powerful  hands. In last munna got very upset  after death of intimate brother  and realized the differences  discrimination between poor and rich,  kind and cruel,   violence  and humanity,  &life .He lost  love.LIFE SHAPE CHANGED  FUL","label":0},{"review":"Every day I go through the movie specially the making of this movie is so much inspirational. ..whenever I watch the making of this movie ...I had tears in my eyes ...Kiran mem is such a inspiration to all of us ...she had the capability to think differently. ..and the making of this movie also talks about here nature. ...she is really fruitful,  emotional , touchy , creative, imaginative,  intelligent , softhearted ..and a nice human being...she knows how to cultivate the work from the characte ...MORE","label":0},{"review":"Every day I go through the movie specially the making of this movie is so much inspirational. ..whenever I watch the making of this movie ...I had tears in my eyes ...Kiran mem is such a inspiration to all of us ...she had the capability to think differently. ..and the making of this movie also talks about here nature. ...she is really fruitful,  emotional , touchy , creative, imaginative,  intelligent , softhearted ..and a nice human being...she knows how to cultivate the work from the characters...she did a awesome job and all the actors and actresses did the fabulous job according to their characters  also ..I want to appreciate amir sir...to always stand there for  this project. ..and introduce us with the work and music of gustavo . .as he did remarkable job , well this credit also goes to kiran mem as she bring him to india ...still the music is vibrating in my ears whenever I sit quite and remembering that movie.","label":0},{"review":"Incredible movie,top-notch directorial Debut of Kiran Rao, Brilliantly written plots and its unique way of unfolding tiny details.\nThe best part of all is its subtle artistic narration of Mumbai's Lifestyle from different perspective of Shaaye(Monica),Munna(Prateek) and Arun(Aamir).\n\nI owe an apology for being so late to watch this film,after 8 years of its official release (as I was A Kid-Teenager back then).\n\nHats off Kiran Rao.","label":0},{"review":"Mind blowing..... \nFor me it's Aamir khan's best movie ever. Even better than 3 idiots.\nIt's like reading a very good book. If someone doesn't like this movie, then he surely doesn't know about movies.","label":0},{"review":"One of the best movies ever made in bollywood considering artistic experience. Aamir was really nice. The music is mind blowing. You will have to see the expressions, feelings of characters to really enjoy the movie.","label":0},{"review":"A movie made to delight, observe and feel. It certainly belongs to a different place, that's wasted in Bollywood. Thumbs up for Kiran RAO!","label":0},{"review":"I love this movie..a new cocept, a fresh story and most importantly the acting of the actors are so effortless that i got connect to the characters of the movie wih an ease.i love to watch movies that are realistic rather than to be a dramtic one.","label":0},{"review":"Enjoyed the movie very much. It was filmed with such realism. It gives you an insight into the daily lives of people in Mumbai. It is bit sad and you almost wish you could do something to change the lifestyle of the struggling/poorer people of Mumbai.","label":0},{"review":"This film is an artistic exercise for a  director in which she(Dir:Kiran Rao) loves the other parts of mumbai.\n\nBy seeing this movie we can also visualise  the work of legendary french film maker  Louis Malle's a earlier documentary of India called \"Calcutta 1969\" & \"phantom of India \".","label":0},{"review":"The movie is very good in capturing diverse Mumbai life as well as intense human emotions. The city always welcoming everyone with open arms without judging, discrimination  but with full generosity.","label":0},{"review":"I just love this movie... It's realistic which is presented with a simplicity but with an element of suspense..\n\nI can see this movie for more than 50times","label":0},{"review":"I watched this movie 20 times. I cant sleep wthout watching it. So inspiring and best movie ever. 10 thumbs up for this kind of story.","label":0},{"review":"The great movie done in bollywood. \nIt iwa da story,feelings,mentality n a great acting...... the acting of all characters will teach u da lesson of loveing n thinking...","label":0},{"review":"Just impressed !! I'm speechless how artistic talent shown in this movie !! Loveable 💓  hat's of 🤘","label":0},{"review":"After reading all reviews.. I saw the movie but I couldn't find any thing special or extraordinary nor people's opinions on it .\n\nJust a painting says about a house wife and her  marriage life and her final decision and we cannot see and usual  acting by Amir Khan ..","label":0},{"review":"I think this movie is okay but not damn good because it's not comedy show that you can understand.It's movie so atleast everything should be in detail & as my point of view the most indian people are not understand this type of movie & so we can not be accept this movie as hit movie.","label":0},{"review":"I watched Oscar winner Shape of water but I didn't feel like this movie. Just one word outstanding 👌👌👌 movie.","label":0},{"review":"Such a brilliant movie..Superb ..Hats off to Amir sir & kiran rao ..For making a Masterpiece... Must watch movie .👌","label":0},{"review":"Very very impressed with debutant director Kiran Rao ma’m.. very honest and true to camera ‘story telling’.","label":0},{"review":"Superb movie with amazing plots.  All characters, diverse yet longing for the same. To belong.","label":0},{"review":"Aamir Khan's best art film.Prateik is very good.Actually the movie is fantastic done by Kiran Rao.","label":0},{"review":"In this Mumbai dairy many untold stories.  It is a very fantastic experience to me.","label":0},{"review":"Superb. Reminded me of 'Lunch Box' in it's quality and tempo!","label":0},{"review":"No movie has ever made me write a testimonial except Dhobi Ghat. Exceptional.","label":0},{"review":"The movie is a frame... Where the director has experimented four characters in their different shades... It's a discovery of meeting lives.","label":0}]