[{"review":"One of the best movie ever made by Mohit Suri, and villain's role is the backbone of this movie. Emraan Hashmi is one of the best actor in Bollywood and I don't know why he is so underrated. BGM of the movie was spine chilling and terrific. Screenplay of the movie was also good and kept audience engaged throughout the movie.\nRating:8/10.","label":0},{"review":"Awsome....Bahut khatarnak movie hai...i saw this movie at fourth day third show on 12th july 2011 and then i was just 14th year old.after return to the home i was so scared to saw this movie and literary mujhe raat me neend nhi aayi thi.it was a blockbuster movie see this movie Wikipedia.","label":0},{"review":"Dark and thrilling... Emraan is always the best but the main hero was the villain and compact direction. The screenplay is little slow but it will never bore you.","label":0},{"review":"It's interesting movie. We can watch it with friends..not with family. . We come to know from it .. where or the order a keener can go in situation ..  So please be careful","label":0},{"review":"Murder 2 So Good movie to other murder movies..and so heart break story.. also love it Emraan","label":0},{"review":"Awsm ❤ movie outstanding songs starcast in my ways this is the best bollywood movies list wonderful directed by mohit suri","label":0},{"review":"Even if Murder 2 fails to tide over the bad reviews and gets bogged down at the box office, it seems pretty certain that this is the film that could well be the turning point of Prashant Narayanan","label":0},{"review":"Superb thriller crime film emraan hashmi superb acting in the film mohit suri most wonderfull director of bollywood","label":0},{"review":"i love this movie! This a great movie of my life! This movies's script is very very uncommon...........","label":0},{"review":"Superb movie superb acting of ptashant Narayan and Emraan Hashmi and jaquline Fernandez looks Hot and sexy","label":0},{"review":"Ooosam movi...\nI was watching every time...\nThe songs was... All time fav.. Hale dil...\nPhir mohobbat krne chala h tu....\nAnd the story.... Grt....","label":0},{"review":"A nice movie. Pretty psychic and scary but overall a nice movie.","label":0},{"review":"the movie is very scary though its not horror movie. this bcoz of the murderer's chracter. its very nice movie.","label":0},{"review":"This is a movie which worked only because of Prashant Narayanan the villian of this movie....Apart from this I think there was hardly anything to be celebrated about this movie...","label":0},{"review":"One of the best creations of the Mohit Suri s,\nWonderful movie and best reminded","label":0},{"review":"Superb movie one of the best movie of Mohit Suri and one of the best series of murder after Murder 1 murder 3 is super duper flop movie","label":0},{"review":"It's a entrusting movie.... Good movie    Also movie songs are to good","label":0},{"review":"Super movie. Villain role is best in Bollywood so far.","label":0},{"review":"Awesome movie by Mohit Suri.And Prashant Narayanan did the best.","label":0},{"review":"Very dangerous movie but nice movie I like emraan Hashmi and jackqin ferdandes","label":0},{"review":"Best action by emran hasmi no body can beat me","label":0},{"review":"awesome movie \n\n i watched every time..\n\nand my favorite songs..","label":0},{"review":"This movie is best and song are sweet","label":0},{"review":"I never like this movie Emraan I am your Fan like you but this film no worth of you","label":0},{"review":"Emraan is outstanding \nSizzling suspense  & thriller","label":0}]