[{"review":"This movie was eight years ago, and I am writing this in 2019. Yes, its late. But anyways, here it is...\n\nIn nutshell, this was a Bollywood movie, made for Hollywood audience. A world class movie in real sense with equally mesmerizing performances from SRK, Kajol and of course, Mr Johar, the director. And this happens often. Talented people like Karan Johar, give their best, their everything to one project. They pour everything, even their soul, just to realize they probably knew already....Boll ...MORE","label":0},{"review":"This movie was eight years ago, and I am writing this in 2019. Yes, its late. But anyways, here it is...\n\nIn nutshell, this was a Bollywood movie, made for Hollywood audience. A world class movie in real sense with equally mesmerizing performances from SRK, Kajol and of course, Mr Johar, the director. And this happens often. Talented people like Karan Johar, give their best, their everything to one project. They pour everything, even their soul, just to realize they probably knew already....Bollywood is not for such movies.\nI still remember when this was being released. They tried to do everything perfect. even the publicity was very good and there were many new things tried for publicity. I guess it was 2009 - 2010, and India, with its 1200 M population was still not using android phones like they use now. If this movie was in 2019, it would have done well. Not only in terms of earning money, but in terms of earning fame too.\n\nIt is funny though, that had this movie was from Hollywood, with some big actors, the same Bollywood audience would have praised this. There would have been crowds outside theaters. The Bollywood audience, understands good movies masterpieces but they don't want their own people to make one. If you are a Bolly actor or director, you must make only masala movies.....Indians believe that only Hollywood can make a masterpiece, and all the characters speak must speak English if it is a masterpiece...\n\nIt is my sincere belief that this film had every potential to win an Oscar award. It had everything. But for the reasons said above, it did not happen. SRK and Johar again went on making masala movies.\n\nThe film begins with a wonderful performance from veteran actress Zarina Vahab. The young generation would not know how famous she was in her time. She delivers a wonderful permanence as mother of SRK. The film continues with equally good performances from SRK, Kajol and Sonya Jehan. Jimmy Shergil, well,you notice him.\nSRK did really good, portraying the character of Rizwan, suffering from Asperger's Syndrome. ( yes, I did not know what it is before this ) At the time of release of this movie, he was on the top of the world, playing romantic a action roles, ruling box office. So was Karan Johar. The only reason I can think of they made this, was to quench their thirst for creativity.\n\nThe move is really good and smooth till the first half. It loses it a bit in the second half, and good performances re washed away by weak pen. An Indian, wanting to meet US president, just to give one emotional message, was not exactly the audience wanted. But then, who knows what audience want?? But still, in the whole, this is still a very good movie. And even after these years, there are people who still watches this.\n\nWatch this, for brilliant acting from SRK, Kajol and others. Music, was ok. Screenplay, good in first half. Direction, five stars from Karan Johar, and same to SRK for keeping those eyes straight and delivering one of his best performances...","label":0},{"review":"This one's a powerful character drama. Watched it years ago but there are certain things that made this film memorable even today: and one of them is undoubtedly Shah Rukh Khan's outstanding performance.\n\nThe film is very serious and indeed depressing at times, but then, just like The Shawshank Redemption, it showcases the power of hope. It inspires the viewer to be hopeful and be good. It's full of emotional moments that make one care for the protagonist even more. The tension too is quite high ...MORE","label":0},{"review":"This one's a powerful character drama. Watched it years ago but there are certain things that made this film memorable even today: and one of them is undoubtedly Shah Rukh Khan's outstanding performance.\n\nThe film is very serious and indeed depressing at times, but then, just like The Shawshank Redemption, it showcases the power of hope. It inspires the viewer to be hopeful and be good. It's full of emotional moments that make one care for the protagonist even more. The tension too is quite high, especially in the second half. The music truly resonates.\n\nI think this is one of the most powerful drama films of all time. Despite of its long duration, My Name is Khan is a film that will make most viewers emote when they see it. One of the best movies of SRK!\n\n9/10.","label":0},{"review":"\" A Must Watch\"\nThe only thing that you could take from this movie is that love is everywhere you just need to open your eyes and see it . I am not a big fan of Srk but after watching his magnificent art in this movie truly made me one of his fan. This movie talks about the harsh reality of how Muslims are being treated in the eyes of the world. Srk did a really fantastic job in portraying a Muslim(Rizwan Khan), who is suffering from a disease \"Asperger's Syndrome\". Kajol (Mandira)  a single Hin ...MORE","label":0},{"review":"\" A Must Watch\"\nThe only thing that you could take from this movie is that love is everywhere you just need to open your eyes and see it . I am not a big fan of Srk but after watching his magnificent art in this movie truly made me one of his fan. This movie talks about the harsh reality of how Muslims are being treated in the eyes of the world. Srk did a really fantastic job in portraying a Muslim(Rizwan Khan), who is suffering from a disease \"Asperger's Syndrome\". Kajol (Mandira)  a single Hindu mother who marries Rizwan believes his son died because she married Rizwan. Rizwan believed their are only two types of people either Good or Bad. In a hope to change the mindsets of people he decides to meet the President of the America and tell him that \"My Name is Khan and I am not a Terrorist\". \nActing - 10/10\nSongs-  9/10 \nDirection -7/10","label":0},{"review":"I watch this movie today. Like and Feel Good after watching this movie. There is a hope for better world and we think about the needs for the people victims of natural calamity, war and terrorism. Love is much powerful than hate, generosity is much powerful than selfishness. We need to thinks about others and gratitude to God for all resources we have. SOMETIMES WE FEEL THAT EVIL IS MORE POWERFUL AND DIFFICULT TO DEFEAT IT, but believing  in Good and truth in longer run we can DEFEATS lies and E ...MORE","label":0},{"review":"I watch this movie today. Like and Feel Good after watching this movie. There is a hope for better world and we think about the needs for the people victims of natural calamity, war and terrorism. Love is much powerful than hate, generosity is much powerful than selfishness. We need to thinks about others and gratitude to God for all resources we have. SOMETIMES WE FEEL THAT EVIL IS MORE POWERFUL AND DIFFICULT TO DEFEAT IT, but believing  in Good and truth in longer run we can DEFEATS lies and EVIL. People so called smarts are more selfish than the People with some physical or mental disabilities. This is one of the best movie and  Shahruk Khan acting remind me the Dustin Hoffman in Rain Man\nand Tom Hanks in Forest Gump.","label":0},{"review":"Best movie I have watched in my life.\nIt tells us about Hindu Muslim social division on in our world and the same time srk acting was fabulous. No one other than him can play this role of a man suffering from autism. I would like to give it 4.5 /5 stars","label":0},{"review":"One of the best movies I have ever seen in my life. Tells us that courage is the best human quality. Srk is at his best and the script is also too good. I can't kept my eyes off while watching this movie. This is a real masterpiece made for humanity and family","label":0},{"review":"Superb , fabulous , fantastic , Emotional , heart touching , story tells something . Makes you cry in the end . Never seen this type of movie before . Songs are very heart touching . Atlast this is a must watch movie for everyone .\nWhen it comes to shah rukh khan nothing to say his acting in this movie is beyond your expectations .","label":0},{"review":"So this movie released in 2010,N I watched the movie today in 2019...So My name is khan is jusst Supperbb movie Too good,,Just loved it...Its so emotional that it touches ur heart I just became emotional while watching,That in many scenes my Goosebumps came up,N srk what an acting he did Woow,That's the reason he's the King Of Bollywood,A Must watch movie,This movie even motivated me A Lott😍🔥👌👌","label":0},{"review":"Wow! Awesome. My first favourite movie in 10 years is this. A great thinking of Karan Johar. I can spend a whole day watching this movie. But is is short and not shown in a great detail. As long as strechible as a chewing gum. Very good!! Keep it up! Great work Karan Johar. Make more movies as sam. All the complimentary words of the dictionary belongs to this  movie. Thankyou. Regards Sidrah","label":0},{"review":"Among the best . Always touches my heart and soul.  Shahrukh Khan is at his best. After Swadesh , this movie showcases how authentic actor he is.  One can doubt while seeing , whether he is acting or he is just like that character in real life two.","label":0},{"review":"I just loved this film...I am looking for this movies so long time bt I couldn't find it on YouTube or any other site ...today I found it on Hotstar and off course I watched...great acting by SRK, Kajol and everybody gives their best in this film...good work by Karan Johor and his team ...keep it gys... And eagerly waiting for such like movies...","label":0},{"review":"Srk one of best performance. i wish climax portion much been tighter. After srk release from jail the all hurricane and srk met president portion could have been execute well by karan johar but Neverthless this movie told us about humanity and i wish we all see this world by rijwan  eyes that there are only two types of people good people and bad people.","label":0},{"review":"It's really a feel good movie... Caste, creed, religion, color etc. never make an individual bad. It's the mindset of the person. Hat's off to Karan Johar, always my favorite director and a much much much favorite personality. And the rest of the people who worked in the film, well done to them.","label":0},{"review":"Fabulous, fantastic, awesome, outstanding these words r also not enough for this movie!!! Really a great movie. Perfect direction, perfect casting, perfect acting and the scene where Khan was telling the story of his son was really brilliant and emotional.","label":0},{"review":"This movie was released in 2010 and that time I was just 11 years old and I went to watch it with my friends and at that time it touched my heart and I got so deeply connected with it  now after 9 years ie in 2019 I watched it again and it is still the same. this movie is beyond expectations and a pure masterpiece which inspires you to spread love and kindness everywhere.","label":0},{"review":"Wow !! It's a great movie with a impressive storyline and also srk has  done very good acting in it !! This movie has lot of meaning in it !! It is one of best movies and it can be nominated for an oscar too !!","label":0},{"review":"A turuely must watch movie very emotional and thought provoking fabulous acting by kajol and shahrukh khan. makes you change prespective tells what humanity means and how love can make this world a better place to live.","label":0},{"review":"Fabulous movie....superb direction by karan johar...excellent story and screenplay....one of best performance of Srk, Kajol, Jimmy sir and zarina wahab mam....excellent music and background score by shankar ehsaan and loy... One of my favorite film.....hat's off.....my name is dhruv and I'm not a terrorist...","label":0},{"review":"This is one of the best movies made by the bollywood. And SRK sir.. oh my god! You just nailed it! Seriously! I couldn't stop my tears during KHAN giving speech about his son in the church! That's the seen where I realized greatness of SRKs acting","label":0},{"review":"This is bestest movie till date based on Humanity in the world. story, direction is Incredible. SRK's acting is beyond perfection. Rare movie, wouldn't witness another like this. Can watch it always.","label":0},{"review":"Best movie In this planet \nMuslims. Is not a terrorists\nThis. Movie teach real lesson\nHow human behave \nand in this world have two types of people\nGood people and. bad people \nOnly one differences à1 movie really.....","label":0},{"review":"Exceptional direction and excellent acting. One of the best movies ever made in Hindi cinema industry. It is in the list \"the movies you must watch before you die\".\nOnce again, SRK proved his mettle in acting, he proved why he is the best.","label":0},{"review":"perhaps each person from the indo-muslim community must watch this film,it sounds quite awful when a person belonging to the muslim community said \"my name is khan and i am not a terrorist.\"A bollywood film with least exaggeration and a stellar cast. this is one of the most stupendous  performances of srk....moreover amongst many stupid bollywood movies this stands quite as a benchmark....","label":0},{"review":"one of the best movies of decades...Karan Johar did an excellent job in this movie...songs were really heart touching in fact the whole movie was heart touching and thoughtful...Amazing message was send through this film...actors also did a mind blowing job, especially SRK,  a great acting skills...MUST WATCH IT!!!","label":0},{"review":"god = good deeds, if you strongly believe in good deeds and are alert enough to grab opportunity you become stronger than any evil, god is no figure its just a strong belief in what is right similarly satan resides in us its for us to choose, this movie opens your thoughts on what is right or wrong and why right is has been and will always be stronger than wrong, all religion portray this, incapability to breakdown religious stories into morals will leave you confused and dependent on preachers  ...MORE","label":0},{"review":"god = good deeds, if you strongly believe in good deeds and are alert enough to grab opportunity you become stronger than any evil, god is no figure its just a strong belief in what is right similarly satan resides in us its for us to choose, this movie opens your thoughts on what is right or wrong and why right is has been and will always be stronger than wrong, all religion portray this, incapability to breakdown religious stories into morals will leave you confused and dependent on preachers who sometimes can be highly misleading, so educate yourself and one good way is to watch this movie","label":0}]