[{"review":"Akshay Kumar is in jubilious role after getting command on comedy roles.a dash of human emotion,conviction ,love and jealousy.katrina is an epitome for statue,block or earthen pitcher.but the role suits her best as far as her comic skills goes.kya aap sab me ghee lagati hai..Rishi Kapoor plays typical Punjabi nri father and good at it.he strikes well through comic and emotional scenes.Clive stranden,Nina Wadia are honest British actors they play their part unforgettably.himesh Reshammiyas career ...MORE","label":0},{"review":"Akshay Kumar is in jubilious role after getting command on comedy roles.a dash of human emotion,conviction ,love and jealousy.katrina is an epitome for statue,block or earthen pitcher.but the role suits her best as far as her comic skills goes.kya aap sab me ghee lagati hai..Rishi Kapoor plays typical Punjabi nri father and good at it.he strikes well through comic and emotional scenes.Clive stranden,Nina Wadia are honest British actors they play their part unforgettably.himesh Reshammiyas career best music and songs written by Javed Akhtar solid wordings..Upen Patel ,Javed sheikh do their best as supporting roles.","label":0},{"review":"MY MOST FAV MOVIE AND LOVE IT TO THE CORE...\nFROM THIS MOVIE I BECAME KATRINAs😘😍😚😙😗DEEPEST FAN.....\nLOVE MY KAT \nEPITOME OF NATURAL BEAUTY....\nMOST MAGICAL COUPLE ONSCREEN KAT+AKKI....\nHOPING 2 C THEM TOGETHER AGAIN IN NEAR FUTURE AND PRAYING THEY DELIVER BLOCKBUSTERS LIKE THIS ONE😍😘😗😙😚","label":0},{"review":"One of the movirw you can watch over and over again without getting bored. The plot is good, direction is nice and the acting of the lead pair is perfect to the roles they are portraying. Nicely written, some of the scenes are a delight to watch as the scene on the yatch after the engagement of Katrina to Charlie. Worth a watch at least once.","label":0},{"review":"superb movie..this is my all time favourite movie ,I have watched it so many times..songs of this movie are really good  ..katrina acted really well in the movie n the role in the movie suits her personality  n akshay kumar is as always osm..i love akshay so much ..this ia a must watch movie .everyone should watch it atleast once.","label":0},{"review":"Best movie and best pair of Akshay Kumar and Katrina Kaif....most loving movie for all loving people for experience there Love to feel loved and passionate and remember that all flashbacks story related to love story easily...i love this movie and the climax...of the movie make it more interesting...love you Akshay Kumar 😊😊","label":0},{"review":"Akshay Kumar's best movie ever .. com+rom .. best story ..  plenty of times I had watch .. never gets bore .. Thank you Akshay sir to giving such a amazing act.","label":0},{"review":"A rom-com with a touch of patriotism. Heartwarming dialogues and great performance by Akshay Kumar. I personally loved it. Great soundtrack and scripting.","label":0},{"review":"Such an incredible performance of by akshay sir\nThis movie has everything emotions,romance, heart touching music \nLoved that\nKatrina looks so cute and adorable in desi look","label":0},{"review":"I was always his fan ,since watching his all action movies like mohra,khiladi,main khiladi tu anari and all but after watching Namaste london I just became his devotee... People love DDLJ but I love Namaste london...","label":0},{"review":"My all time favourite..must watch..no comparison with others...superb acting of Akshay. his command on comedy and emotional role is outstanding..Good direction..","label":0},{"review":"Superb movie we say in present movies but i watch less hindi moviess sorrry for commenting and its the other parady for mallishwari in telugu i liked it soo much","label":0},{"review":"Beautiful music,good story,good acting.Mix of comedy,patriotism,drama and romance.I never miss it when aired on tv and of course it has some unforgettable dialogues.Love it!","label":0},{"review":"Such an amazing film. Not a typical stereotype; loved the script and cast. Must watch romantic movie😀😀","label":0},{"review":"Really akshay kumar is legend he is perfect in every role and every genere whether it may be Action,comedy,drama,thriller,emotional,romantic,villan everything❤","label":0},{"review":"GREAT MOVIE NICE CHEMISTRY BETWEEN AKKI AND KAT GOOD CONTENT SONGS OFF THE CHART BY HIMESH ESPECIALLY WATCHED THIS OVER A MILLION TIMES","label":0},{"review":"I love this movie from my childhood akshay is my most fav actor he is a all rounder in romance, action, comedy, etc.","label":0},{"review":"Best indian romantic movie ever made..atleast for me..why cant we get more movies like this.. I guess we cant.. as I said it was the best","label":0},{"review":"Himesh reshamiya ji is music director of this movie.then movie are hit .\nSuch a great music himesh ji .\nYour legend of music.","label":0},{"review":"This is all time favorite movie like you can watch it for 1000th time and won't get bored ❤ songs are amazing and obviously akshay is ❤❤❤❤❤❤","label":0},{"review":"my favourite movie. The story is very good and I like the dialogue where akshay kumar  is telling about the true India.","label":0},{"review":"nice movie, totally recommend this because I love these two actors especially katrina so its a great movie!","label":0},{"review":"Love this movie. Is one of my favourite.watching again again never feel boring","label":0},{"review":"I love this movie katrina looking very beautiful in this movie and akshay is also good very nice movie","label":0},{"review":"Refreshing...must watch..if u r in bad mood this movie will definitely made ur day...good job","label":0},{"review":"Arjun Kapoor is set to replace Akshay Kumar in the sequel of Namastey London? It was the fantastic ...","label":0}]