[{"review":"It's an underrated gem of a movie.  So realistic rom com with tons of comedy and serious perspective to friendship and love as well.  \nUnlike other rom coms where the leads are so perfect,  this movies lead is soo human that he keeps making not one or two but series of mistakes throughout the whole movie.  He does everything wrong and yet is forgiven because thats what love and friendship is all bout.  \nMake mistakes and correct them and keep going ❣❣","label":0},{"review":"This is my no.1 favorite movie in my movie collection.Songs are so lovely and also gets funny n romantic touch 😂 . This movie have twisting and and so romantic story.\nMy problem is,I can't see complete movie; else it is possible to me very easy😖.After all i will be my fevret movie forever","label":0},{"review":"It's an entertaining movie with a gripping screenplay among its counterparts in Bollywood. It is made against the backdrop of Theatre which is obsolete in Hindi movies. I did like it a lot especially the acting efforts of Ayushmann Khurrana and music of the film.","label":0},{"review":"One of the most beautiful movie ever seen, songs are quite romantic and pleasant,  is a good mixture of love and comedy. Enjoyed the movie throughout from its funny comedy scenes to romantic nautanki","label":0},{"review":"It's an entertaining movie, but too much annoying comedy scenes. This is why it's titled as Nautanki Saala. Ayushman performs his role  very well. Romantic sequences are worth watching with melody songs.","label":0},{"review":"One time watch only for timepass purpose otherwise movie gives no moral at the end.funny dialogues will keep you entertain that's it. Ending not satisfied it should b happy one for both the leading male actors.","label":0},{"review":"It's quirky romantic comedy film I really like this movie whenever I feel bad then I watch it and I feel good seeing how Ram helps others without expecting any profit in return and I laugh a lot whenever I watch it.","label":0},{"review":"One of the underated movie of Bollywood. It reflects true friendship unpredictable love. And the climax it owns the heart of audience.","label":0},{"review":"I really liked this movies unlike Ayushman's other movies... But but... But I was expecting different ending... It was very fast..","label":0},{"review":"Awesome Music and Sweet Comedy Romantic Movie. Authentic Screenplay 👌👌 I love this movie.","label":0},{"review":"It's excellent . Ayushman has done a good work .Totally entertaining .Loved it☺☺","label":0},{"review":"It's a beautiful film! If you appreciate art, you should watch it!","label":0},{"review":"Most underrated movie I guess.. people couldn’t understand the essence","label":0},{"review":"Amazing movie. A lovely romantic movie.","label":0},{"review":"nice movie with good mixture of romance and comedy.","label":0},{"review":"Awesome movie and die hard fan of aynshuman khurana...","label":0},{"review":"This Is A Very Interesting And Very Graceful Movie","label":0},{"review":"It's really funny and entertaining one!","label":0},{"review":"Other than songs, movie was very boring, can't even see the whole movie","label":0},{"review":"Awesome movie with great comedy","label":0},{"review":"Best comedy and romantic movie","label":0},{"review":"Awesome movie","label":0},{"review":"Really great movie!","label":0},{"review":"Nice movie","label":0},{"review":"It so nice,but Ayushmann sir he will not grow his beard.","label":0}]