[{"review":"Narrated by Omar, a soul whose lost plenty but was still hopeful \n\nIt would take eternity to discuss Mr. Kabir Khan's stunning portrayal \n\n\nThis film really showcased Miss Katrina Kaif’s acting. Her critics should watch it. \nNeil, John, Irfan. Good job. \n\nNawazuddin Siddiqui, you did a Phenomenal job.\n\n Like any customary story. A start of a fellowship and a future where every individual wishes to settle down for contentment. \nThree incredible beings cross paths. They embark on one hell of a jou ...MORE","label":0},{"review":"Narrated by Omar, a soul whose lost plenty but was still hopeful \n\nIt would take eternity to discuss Mr. Kabir Khan's stunning portrayal \n\n\nThis film really showcased Miss Katrina Kaif’s acting. Her critics should watch it. \nNeil, John, Irfan. Good job. \n\nNawazuddin Siddiqui, you did a Phenomenal job.\n\n Like any customary story. A start of a fellowship and a future where every individual wishes to settle down for contentment. \nThree incredible beings cross paths. They embark on one hell of a journey. Each carrying out a story of their own. Wages of dreams to unload.  Life unites them, yet much to their dismay that this expedition would change their lives forever. If only they had a glimpse of their future. A foreshadow. A dull tunnel was ahead. Omar this fresh off the boat meek beguiling lad would fall in love. Little did he know it would torment him. That he’d face two heartbreaks. A broken heart and a love that's not returned. That's not it. There's plenty more horrific news in store for this chap. On the bright side fortunate to have gotten a scholarship. A scholarship that would change his life forever. Samir, on the other hand, this sturdy brilliant lad. His life. A fairytale but a twisted one. One with an agonizing end. Poor Maya. if only, ..... maybe your love was one-sided and Samir didn't reciprocate his feelings for you, and that horrendous night didn't happen you'd be with Omar. It sucks to Omar. He never stopped loving Maya after all those years. A Friendship with an astounding beginning but a painful end. We're the inclusion. Verily whatever happens around us will eventually have an impact on our lives. 9/11 happened. Muslims became a target. Innocent lives were ruled guilty. Their dignity stripped away. Most importantly their freedom vanished. The place they once called home haunted them. Their identity spewed hate. Because of one incident, a religion was targeted. Islam. A community. Muslims. Human beings lost their human rights, lives. Abused and violated.","label":0},{"review":"Have just watched this movie couple of times but I have to say this movie still has that impact on my mind. Some very sad and disturbing moments in the movie. Great acting especially by John and Nawaz, good songs and brilliant direction. 1st half is little slow but 2nd half is so good and touching. I must mention about the climax, it is very sad. Overall very good movie. 3.75 out of 5.","label":0},{"review":"A similar mistake happened in my name is khan..i really wish to believe they dont make such mistakes on reality..i think of america as an open minded country and dearly wish it to be true.. i wish the govt. Comoensated him and well, pls if this ever happens to u..don't become a terrorist...tell ur story...bt don't kill ur conscious...there are times when u will feel unjust in life, i hope u will be able to keep a clear mind and still thank God for ur remaining time on earth.. and live with even  ...MORE","label":0},{"review":"A similar mistake happened in my name is khan..i really wish to believe they dont make such mistakes on reality..i think of america as an open minded country and dearly wish it to be true.. i wish the govt. Comoensated him and well, pls if this ever happens to u..don't become a terrorist...tell ur story...bt don't kill ur conscious...there are times when u will feel unjust in life, i hope u will be able to keep a clear mind and still thank God for ur remaining time on earth.. and live with even more love for others and support the victims who are like you and guide them to a mindful path..i agree that they destroyed a life...bt does it make any sense to destroy luves in return..i mean that only brings both u and em more hardships to face..","label":0},{"review":"Though I watched this movie only once, it left a far-deep impact on my mind that it is still so new when I watched it. A brilliant performance by wonderful star-cast and a heart-tearing visualization of all the events of 9/11 by an amazing director.\n\nThumbs up to the film and the members who worked so emotionally on such a sensitive subject.","label":0},{"review":"Best Movie I Have Ever Seen In My Whole Life. Salute to Mr. Aditya Chopra For Written Story. I Don't You What's Wrong With Media Critic Score. They Should Give 10 out of 10. 💯% out of 💯%.\n\nThe Film Direction Is Very Great By Kabir Khan. Must Watch","label":0},{"review":"A heart touching masterpiece movie.First when i watched it i was literally crying after the climax.Beleive me i never cry as i am a tough guy but this movie is a masterpiece.Amazing story amd narratio.Katrina kaif is amazing she is the leading lady.Sge acted so flawlessly and fantastically that i am speechless.","label":0},{"review":"One of the best movie of bollywood.... It presents every emotion and expression in its truest form.... their love, friendship, patriotism, anguish, hatred, sense of responsibility.... Etc. It is truly a gem of hindi movies portraying the lifestyle of immigrants in NYC after 9/11","label":0},{"review":"Best Movie Ever I Have Seen In My Life. So Many Times I Cried 😭 💔. Story Is Totally Fantastic All Credit Goes To Aditya Chopra And Kabir Khan. #Greatest #mustwatch","label":0},{"review":"I hv seen this movie for 3rd times still didnt feel bored.. Loved the theme,acting,songs everything everything loved the whole movie..\n10 years have past after releasing this movie..still its my fav one❣❣","label":0},{"review":"Storyline direction presentation was fabulous. Actors acting were too good specially nawazuddin sidiquies natural act. Songs were too good. Nice movie.👍☺️👌","label":0},{"review":"One of the best movies ever watched,take some time out and give it a watch. Great piece of art.","label":0},{"review":"Love the soundtrack and most of the cast has acted well.\nA very real story , which asks some relevant hard-hitting questions","label":0},{"review":"It was a wonderfull movie leaving a deep impact on my mind.I wish a sequel of this can be mad but u know that.","label":0},{"review":"This is one of my favorite movie. All the cast of the movie are act well and the best thing is this that it is still new","label":0},{"review":"Just a fabulous movie...one of the best movies i have ever seen in any language throughout whole my life.......","label":0},{"review":"pierced this movie deep in my heart ...at the end i cried....great acting by all stars...brilliant movie ..no words","label":0},{"review":"very good movie..\nreally can't explain what is going inside of my mind and heart after watch the movie..","label":0},{"review":"Its too good ....\nThe story line n all \nI got goosebumps at the end\n😊🤑👍🏻👍🏻","label":0},{"review":"Movie shows us the hope and humanity .. The concept of the movie is very Deep and intense.","label":0},{"review":"Very nice movie ever.. Emotions, ❤️ touching and reality... Can't describe...","label":0},{"review":"A beautiful climax. With a wonderful chemistry btw the actors..","label":0},{"review":"awesome script. damn yrf can make such good films🙂","label":0},{"review":"brilliannt actors great movie.. only rating is low.. but movie can be watched 10 times without boredom","label":0},{"review":"It is a nice friendship and emitional movie.... Thanks director for directed this film....","label":0},{"review":"I didn't watched it...... But willing to watch it after reading the description of this film","label":0}]