[{"review":"It's not about cheating n age differences among two people who are deeply in love but about the fact that love has no boundaries..It sees nothing , right or wrong, true or not bt the feelings both possess.. it has sacrifices and happiness in the deep pain of separation and not having ur love with you..\nThe character vijay is also suffering from this pain in this movie even though he doesn't want to get rid of it and live little more with the pain and the memories of his beloved..  it was gud mov ...MORE","label":0},{"review":"It's not about cheating n age differences among two people who are deeply in love but about the fact that love has no boundaries..It sees nothing , right or wrong, true or not bt the feelings both possess.. it has sacrifices and happiness in the deep pain of separation and not having ur love with you..\nThe character vijay is also suffering from this pain in this movie even though he doesn't want to get rid of it and live little more with the pain and the memories of his beloved..  it was gud movie . I like it","label":0},{"review":"It is merely a remake of \"Poison ivy\" and \"Lolita\" . \nAnd falling in love with a girl of your daughter's age is okay ,as long as you don't have any family i. e . Married  . Cause cheating will never be okay . So it was clearly a case of adultery as he had developed the relationship while he was married and living with his wife. \nAnd I'm wondering seeing many fellow people including People of my parent's age , supporting this by saying \" love is love \" \"we can't control our feelings\" and so on. I ...MORE","label":0},{"review":"It is merely a remake of \"Poison ivy\" and \"Lolita\" . \nAnd falling in love with a girl of your daughter's age is okay ,as long as you don't have any family i. e . Married  . Cause cheating will never be okay . So it was clearly a case of adultery as he had developed the relationship while he was married and living with his wife. \nAnd I'm wondering seeing many fellow people including People of my parent's age , supporting this by saying \" love is love \" \"we can't control our feelings\" and so on. I am so glad as I will expect them to show the same kind of respect towards LGBTQ community .","label":0},{"review":"This movie is worth watching. Though the kind of love shown here is hard to accept in our society but still it teaches us many things. It depends on individuality how he/she views and understands the entire content.\nAwesome acted by each one of them (cast and crew)","label":0},{"review":"This movie must be watched and felt. How an aged man falls for a younger girl of his daughters age is shown from a mans perspective. Felt so sorry for the man, his wife, his daughter and also the girl's characters. We cant blame anyone. RGV has captured all the emotions nicely. Great to see Amitabh accepting the role where actors of his age think a lot of image and all, which he dint. His performance is highlight of the movie.","label":0},{"review":"This movie warn us from consiquency of any wrong action is taken. So it should be stopped at the starting point. It's not always right to  live your life as per your choice, especially if others are affected by it.\nAmitabh is always outstanding in most movies, but I found Ziya khan's acting unexpectedly extraordinarily\n And I felt we lost a very good talent by her death.","label":0},{"review":"It is very nice and heart touching movie..... and feeling has no boundaries ..... we Cannt stop our feeling.... and the movie morale is old age people also has childies nature..... inshan ki umar ho jati hain par Bachpan usme jinda  rhta hai....jiaa ne sirf amitabh ke usi bachpane ko bahar nikala.....and my view is nothing is wrong in this movies like others.....","label":0},{"review":"This movie is thought provoking. With ageing thoughts also age. But to a knowledgable person thoughts, perception and mind are just non truth i.e. maya effect. The truth is soul.Few people can keep the soul intact.","label":0},{"review":"Unspoken words that resides in each one of us but we let our minds take the decision of confiding it within ourselves.Here the difference is that the man finds his liberation in accepting his feelings and confessing it.The film is not about a illicit relationship but it's about the unspoken need of being happy n spirited till death even if the source of your happiness is unacceptable in the world.","label":0},{"review":"Undoubtedly It's a beautiful movie.I just love it.Actually some love stories are never meant to understood.The theme,the story,the characters,the music these all have made the movie more attractive❤️❤️❤️","label":0},{"review":"Very good to watch. But not to follow considering the consequene at the last. The acting is excellent. The lesson learned need viewer discretion. Anything against society is not accepted. End result gives us the lesson.","label":0},{"review":"I really loved this movie and was one of Amitabh’s best acted roles.  Somehow the public could not accept the concept of a much older man falling in love with a teenage girl.","label":0},{"review":"According to this story our society accept what is happening from previous .But I am unable to understand that what is right \n1 what this movie show\n2what our society follow \nBut what this movie show is the teenage girl right.Actually I don't know but according to me she is not .but the man who is mature Fall in Love it is not a stupid thing.","label":0},{"review":"Really good and meaningful movie without any sleazy scenes for a movie on such a topic! \nAs usual, Mr. Bacchan's acting is terrific! \n👏👏👏","label":0},{"review":"Wonder why this movie was underrated!!!\nSuch an excellent movie from RGV.\nPowerful actors, emotional scenes...no words!","label":0},{"review":"Through this story, we have known that must keep your age and relationship undermine,  because man in love Doesn't seem to any age. So love makes blind to humans.","label":0},{"review":"Movie with a heart touching message, must watch. I literally cried in the last scene. Very nice movie","label":0},{"review":"One of the greatest performance by Amitabh Bachchan. Odd storyline, off bit movie but definitely a must watch.","label":0},{"review":"Zia Khan and Amitabh's acting is superb.But not the relationship. \nFalling in love is natural but the age gap and life stage of prtaogonists leaves much to say.","label":0},{"review":"Beautiful film. But may not be digestible to society as our lives revolve around our family and any break in it cannot be justified.","label":0},{"review":"Once u start watching this movie u get hypnotised by outstanding acting of Amitabh Bachhan love has no Boundaries","label":0},{"review":"Movie depicts that there are no barriers if your heart loves anyone. Neither age nor any inhabited relation.","label":0},{"review":"One of the best movie of its kind , must watch by every progressive family of this society.","label":0},{"review":"V unconventional but Amitabh s acting was awesome...proves age is not a factor f true love","label":0},{"review":"Nice but difficult to understand what is the actual love and when it happens","label":0},{"review":"I really this type of movie. Who look him kind of love","label":0}]