[{"review":"I missed this movie in theater, but now that I have watched it, I can't stop myself from writing about it.\n\nVidya, playing role of sister of barmaid namely Jessica, who had been murdered at high profile party, and Rani, in the role of NDTV reporter. Both of them are at their best, specially Vidya (She is adorable and Incomparable.)\n\nThe story of murder of this innocent girl went on air, and amid the politics, the case had been suppressed, witnesses had changed their statements and the culprit di ...MORE","label":0},{"review":"I missed this movie in theater, but now that I have watched it, I can't stop myself from writing about it.\n\nVidya, playing role of sister of barmaid namely Jessica, who had been murdered at high profile party, and Rani, in the role of NDTV reporter. Both of them are at their best, specially Vidya (She is adorable and Incomparable.)\n\nThe story of murder of this innocent girl went on air, and amid the politics, the case had been suppressed, witnesses had changed their statements and the culprit did not found guilty.\n\nRani Mukharjee, NDTV reporter who had been, ignoring the entire Incident in the beginning, considering it as an Open and Shut Case, later take the story on his hand and then the twist happened.\n\nThis movie also shows us, what journalism can do, rather than being puppets of politicians.\n\nRest in Peace, Jessica.","label":0},{"review":"Can anyone explain me y this movie is certified A..?and who say its a thriller..Its looks more like a clean dramatic plan ...If i compared it with Mardani..ya that was a thriller....but this movie..not a single slap...no nudity....nothing to certify in A category except in one scene were Rani uses abusive language. No bloodshed nothing. Movie starts like a bomb..but bomb fuses very soon.Its a  drama of solving case of murder. Its overall overrated by imbd.According to my review 5/10","label":0},{"review":"It's a movie really showed the truth of our society , system , politics,police and judiciary. I have seen movie in theatre ,with my daughter . At that time she was just 11years but she still remembered. We could not imagine the pain of a family who faced this . Always stood for right","label":0},{"review":"Show reflection of society,cover real issues,movie is so awesome,some people have problem with her language,i mean people are like 'she use abusive language,slang word's,if other famous actor can do same then it will be cool,so stop judging her ok,AIB ko esay log hi dekhtay hai,vaha gali nahi hoti,and please stop judging,these kind of people are like,if you use slang,you are not good person,ager nahi use krtay toh pao pkd lo in kay,kyuki uni rago mein toh dudh dodh raha hai,dudh say dhulay huya, ...MORE","label":0},{"review":"Show reflection of society,cover real issues,movie is so awesome,some people have problem with her language,i mean people are like 'she use abusive language,slang word's,if other famous actor can do same then it will be cool,so stop judging her ok,AIB ko esay log hi dekhtay hai,vaha gali nahi hoti,and please stop judging,these kind of people are like,if you use slang,you are not good person,ager nahi use krtay toh pao pkd lo in kay,kyuki uni rago mein toh dudh dodh raha hai,dudh say dhulay huya,go watch this movie, different concept,at least 100x time better than a man play with belt and sing hud hud🙄","label":0},{"review":"What's wrong with our society? When vulgar movies are made with so many item songs then society changes soo rapidly adultely and vulgarism spout up in our so-called society...but when these movies are made then why dont society changes? Why dont justice delivered? Why there is still high rape rate? Why powerful man is free? Why poor common man is suffering? Very beautiful movie indeed.","label":0},{"review":"It is brilliant movie. Making people aware of there rights. Upset abt it that u need to fight for your truth. It is not enough telling truth but you should b prepared to prove it. But overall justice matteres.","label":0},{"review":"Makes you wonder about the kind that for country we live in ! Hopefully someday there would never time where nirbhaya's scream won't be heard and innocent children's tears won't be shed!  \nEveryI watch a movie like this or Talwar I feel sad for my country and my people. .","label":0},{"review":"This is good movie of a real situation.. Movie shows a real situations of middle class family in India. They fighting for justice.. Felt a disgust to everyone while watching the movie...","label":0},{"review":"Honest effort to describe the struggles through which one has to encounter to prove truth that has occurred in front of hundreds, if you are just a common silly citizen of India. \nGives hope to never let go!","label":0},{"review":"Loved this movie.....it not only revolves around the conditions of the women in our country...but always also on political aspects to handle it....how our judicial system being so powerful can also be corrupted...music given by Amit trivedi is great dealing with the intensity of the film","label":0},{"review":"I love watching movies of Vidya as well as Rani, but for sure I felt Director couldn't succeed in keeping the viewer on the toes... Something is not missing... A lot is missing....","label":0},{"review":"The film is no good at all, it show that Indian Police is not responsible. Taking bribe it totally show that Indian people is No Good, they hide MURDERER!!!\n \nEven if it only a MOVIE but you people show Indian Police are very BAD!!!","label":0},{"review":"Vidya is versatile actress. She is most beautiful woman i had ever seen especially whenever she wores saree","label":0},{"review":"One of the best movie ..powerful performance by my fav  Rani and Vidya","label":0},{"review":"Superb movie,  Now bollywood is really making g8 movie based on true story","label":0},{"review":"Excellent movie .This  film shows the exact society we live in","label":0},{"review":"I feel very nice because my cousin samara has acted in it","label":0},{"review":"Great movie love to watch here.","label":0},{"review":"One of the finest movie of Indian cinema👍👍👍👌👌","label":0},{"review":"Rani and Vidya at their best !","label":0},{"review":"This movie is not a thriller , the plot is very lame","label":0},{"review":"Excellent movie.","label":0},{"review":"from where can i get this movie..plzz help me","label":0},{"review":"Nice movie..","label":0},{"review":"substandard...please don't waste your time...","label":0}]