[{"review":"Film recognizes neither time nor space, only the limits of man's imagination. \nNicholas Ray\n\nReleased in 2007, directed by Anurag Kashyap, No smoking is a black comedy that is most remembered for its unconventional narrative and bizarre plot. When released in 2007, it met with strong criticism even from the AK die-hards and bombed at the box office. Note that Black Friday and Paanch were already released by this time and had somewhat established Anurag as an auteur. \nBut what this film has myste ...MORE","label":0},{"review":"Film recognizes neither time nor space, only the limits of man's imagination. \nNicholas Ray\n\nReleased in 2007, directed by Anurag Kashyap, No smoking is a black comedy that is most remembered for its unconventional narrative and bizarre plot. When released in 2007, it met with strong criticism even from the AK die-hards and bombed at the box office. Note that Black Friday and Paanch were already released by this time and had somewhat established Anurag as an auteur. \nBut what this film has mysteriously managed to achieve over time is to rouse the curiosity to make some sense out of it. There is something that is so appealing, visually or viscerally, that it leaves one craving for a plausible explanation. Anyways comprehension is not what Anurag cares about, neither does he makes any attempt to make the storyline any coherent for his audience to feel in control.\n\nK happens to be a chain smoker who is detached in a Camus' existentialist sort of way. He is a narcissist and as a consequence finds himself in absolute control of his surroundings (or so he perceives). His marriage with Ayesha Takia is on the rocks due to his egoist and self-consuming ways. In a brief moment of remorse, he consults Baba Bengali, played with extravagant humor and wit by Paresh Rawal, to quit smoking. What happens next can only be imagined as the story spirals down into the labyrinthian maze of both the narrative & physical setting. The film borrows elements of surrealism, dystopia, and neo-noir which may seem way over the top during the first viewing but subsequent reflections unveil the eternal debate of individuality & free will. \n \nTo sympathize with the heart of this movie requires a little acquaintance with Kafka's Trial and Anurag Kashyap's traumatic experience with the Censor board. The film as painting does a remarkable job of portraying both the subject which essentially is doing something against the free will while also focusing on the painter (AK) in portraying his own ordeal as a director while dealing with Censor board. This is mirrored in the convalescence of K who is essentially the alter ego of Anurag himself. The physical setting of Prayogshala deep down the bustling metropolis breaks away any semblance of our known sense of space and perfectly serves as a dystopian office space of The Trial. Adding to that are the supernatural elements which makes it even more nightmarish and sometimes funny.\n\nThe film is fraught with symbolism with Cigarette signifying the free will, Prayogshala as the decrepit bureaucratic system, 1 rupee as the trivial last bit to accomplish the gargantuan task and lastly the two “missing” fingers which is the price K pays to do as he chooses in this world.  \n\nIn a brief appearance, Ranvir Shorey shines as a terrified quitter who seems to hide more that what he reveals. Gulzar's lyrics add another layer to the movie which makes it more penetrable and palatable. The casting of John Abraham as conceited K is one his most fitting roles where he simply embodies vanity & withdrawal thus not giving any scope for the character to express or more simply put act. For Paresh Rawal it is merely another feather in the crown, he is totally credible in his otherwise outlandish world and bringing in is his own charm through improvised local dialect. The brief farcical scene by Joy Fernandes where he parodies Fidel Castro seems a bit out of place but is refreshingly funny and does take the plot (ahem!) forward.   \n\nA film like this is very essential in order to push the envelope of cinema, a film which defies any categorization will always be remembered for inciting the outrage in the whole cinema fraternity and more than that inspiring us to look beyond what merely meets the eye. It may be too much to expect for an average moviegoer to extol this movie but what it at least deserves is to be seen, discussed, dissected and then if still required, disparaged.","label":0},{"review":"I must say that some people in the comment section has labelled themselves as 'enlighted audience' and some as 'Hollywood drum beaters' but I want to say one thing that I don't know what it is based on(I read that it is based on Stephen King's short story) but I want to tell this that the ending was not very well either written or  directed. \nThe whole story was spooky and I don't think it could be termed as a psychological thriller if it doesn't have a good end(As many enlighted didn't comment) ...MORE","label":0},{"review":"I must say that some people in the comment section has labelled themselves as 'enlighted audience' and some as 'Hollywood drum beaters' but I want to say one thing that I don't know what it is based on(I read that it is based on Stephen King's short story) but I want to tell this that the ending was not very well either written or  directed. \nThe whole story was spooky and I don't think it could be termed as a psychological thriller if it doesn't have a good end(As many enlighted didn't comment).\nI overall liked that something new was tried and the story was different but the basis of it was a bit vague and no so much of a strong ground to base a story on. \nIf the ending would better, this might get a lot more recognition. PS Whenever an Indian say that Indian audience isn't prepared for a certain type of movie or genre or script, they are not only saying something about the rest of the nation but clearly saying a lot of their preception. Cockiness is everywhere isn't it, even in review section.","label":0},{"review":"Well, honestly I felt that it was a good start, but Anurag couldn't end it well. That's what the difference between Hollywood and bollywood, drama, suspense and unconventional climax. From the half ways film starts moving on side track and makes it quite complicated and confusing to understand but it's new subject after all, hats off for it","label":0},{"review":"Well If you don't like this movie, is just because you don't get this movie. Your brain is still under-developed. They have some empty cage for you at the zoo. This is actually a good movie. Good job by Anurag K on Stephen K's short story.","label":0},{"review":"I am a big fan of Anurag and I appreciate what he was trying to do with this film. But he is not David Lynch. This film is confusing for the sake of being confusing. David Lynch can pull it off because he has been doing it for years.","label":0},{"review":"I didn't understand the main idea of movie but I want to understand it.It make me curious to know the depth of movie. First movie who make me to think so deeply. How can such movie make people to left cinema theatre in between?\nBtw after becoming a producer John's every movie is exciting, inspirational and must to watch type","label":0},{"review":"Actually the Indians are not familiar with this kind of movies . And the plot of the movie is very creative as well as unusual also . So , most people are not interested in these psychological thriller film . Otherwise it's a very good movie.","label":0},{"review":"It's a thriller but I was a little scary while watching the movie. Loved it. Great movie Anurag kashyap #bestdirector.Good acting by paresh rawal and john","label":0},{"review":"Intresting . . . i was searching for best and i got the best .. Movie plays with your mind and one more thing this Movie is too ahead of it's time to get it","label":0},{"review":"To be honest, It's the most underrated film and one of the best thriller to come out of india. Anurag kashyap was right this movie is surely ahead of its time and a must watch 4 *","label":0},{"review":"Marvellous a true master piece. I am shocked to see this movie and its content. In india this type of movie should be made more. Hats off. The best I have ever seen.","label":0},{"review":"New attempt from Anurag. influences David Lynch's work, As for indian viewers it's well made movie though not many people understand.\n\nAnd John's performance is pure.\n\nWorth to watch once.\n\nWhen it was released, the film story was ahead of that time.","label":0},{"review":"NO DOUBT THIS IS ONE OF THE BEST MOVIE....\nANURAG EXPLAINED IT VERY WELL...\nCANT UNDERSTAND IN 1 TIME WATCH \nGOOD JOB AND KEEP MAKING SUCH MOVIE FOR THE AUDIENCE LIKE US","label":0},{"review":"It's a masterpiece.. must watch . Well you will not understand if you don't use your brain .\nMy experience was amazing .. it's my cup of tea.","label":0},{"review":"This movie is best movie of all time with some flaws obviously but that's make it best ... It's ahead of it's time and can truly called better than any Hollywood movie. Art hai bro.","label":0},{"review":"Except the music everything is perfect, perfect means scare you till the end.\nI Can't listen music of this film, AK has a taste of music and it lacks in only this one, background is perfect.","label":0},{"review":"I can't believe that I haven't watched the movie till now. It's not everybody's cup of tea. But what a movie man. A very underrated movie.","label":0},{"review":"I love anurag kashyap and his movies for his different ideas and his ongoing better direction quality. He is the best director in India along with Rajkumar Hirani.","label":0},{"review":"Superb film all the scenes are very confusing and entertaining superb script anurag kashyap my fav director","label":0},{"review":"Kudos to Mr. Kashyap for making such a worthwhile film.Hope to see more such movies in the future.","label":0},{"review":"I just watched it casually but came across a complicated creative movie which is ahead of it's time in filmmaking whole credit goes to anurag kashyap","label":0},{"review":"Thrilling, absolute underrated masterpiece,abstract and stunning directing by Anurag Kashyap.","label":0},{"review":"One of the best movies in psychology thirllers,Anurag kashyap✌","label":0},{"review":"Best bollywood suspense movie i had ever seen","label":0},{"review":"Good movie .. its unique compare to other films","label":0}]