[{"review":"Though I’m fanatic about Intense Romantic Movies, I watched this intense action drama just to experience the RGV mark yet again after long time.\nThis movie will be enjoyable if you go without any expectations and comparisons. \nThere are no unreasonable sequences or emotions in the film. It’s about a cop  investigating another Cop who was already famous for destroying the underworld.\nThe only emotion you can see in the movie is between the father and daughter. \nNagarjuna solely had pulled this fu ...MORE","label":0},{"review":"Though I’m fanatic about Intense Romantic Movies, I watched this intense action drama just to experience the RGV mark yet again after long time.\nThis movie will be enjoyable if you go without any expectations and comparisons. \nThere are no unreasonable sequences or emotions in the film. It’s about a cop  investigating another Cop who was already famous for destroying the underworld.\nThe only emotion you can see in the movie is between the father and daughter. \nNagarjuna solely had pulled this full off his shoulders along with the villain Pasari. No other characters played any significant role. The heroine and the daughter has played their roles best in their vicinity.\nThe sound designing is so unique that it time and again reminds that’s it’s an RGV movie. However, the sound was used more than required in few frames and unreasonable in some scenes. \nThe action sequences are always plus in RGV movies and you can see the real and raw action which is to the human capacity threshold of fighting the demons. \nThe Distinctive Camera work was simply amazing as the GoPro and flow cam was used to the optimum which again reminds you of RGV in every frame. However it disturbs the plot and stresses the eyes but in very few instances. \nThe two songs are situational and lyricist did a decent job in jotting the simple liners which will be hummable.\nBackground score and Theme music is apt to the script and well served.\nNo Punch dialogues nor any memorable liners are in the movie.\nThe investigation sequences are very interesting and realistic but interlinked story seems illogical in some places as the flash back was not properly narrated. Villain role was so prominent as of the hero, so casting a strong looking villain would have been an added advantage. \nThough the movie was filmed in low budget, the production values are supremely high and there was no compromise in cinematography and resolution.\nAll Inclusive, the director had done a commendable job in filming the story to the celluloid with the content what he believed without any apprehension.\nOverall it’s a Paisa Vasool movie and watching it in theatre will be much impactful. \nComparing with Siva is brutal however this will remain as one of the BEST of RGV’s movies by far.\nMy suggestion to watch the movie. Don’t miss it.\n\n*RGV himself is a Galaxy of Talent and a Volcano of technical brilliance. So rating him with any Stars will be utter Rubbish.*\n\nP.S. :- The story which was leaked as Officer script earlier has no resemblance with the actual movie at all.","label":0},{"review":"Though promotions are very crucial, Wish I could convey / shout / plead to stop promoting the film with immediate effect from business angle, one trailer gave enough evidence on what to expect. Let down!!!\n\n- Never try to over publicise and over commit, specially using references to Cult Classics (Leave them alone) like Shiva.\n- Have strong & experienced team of Technicians especially Cinematographer (Gopal Reddy was a Gem in Shiva), Music Director, Lead actors and Villan (Raghuvaran was Scrary  ...MORE","label":0},{"review":"Though promotions are very crucial, Wish I could convey / shout / plead to stop promoting the film with immediate effect from business angle, one trailer gave enough evidence on what to expect. Let down!!!\n\n- Never try to over publicise and over commit, specially using references to Cult Classics (Leave them alone) like Shiva.\n- Have strong & experienced team of Technicians especially Cinematographer (Gopal Reddy was a Gem in Shiva), Music Director, Lead actors and Villan (Raghuvaran was Scrary and Deadly) - No compromise on either of them!!!\n- Dont be in a “hurry” to complete the film!\n- Keep it Simple, not Silly (referring to the camera angles, “sound”, they are big distractions or attractions)\n\nShiva will always be a reference point in “all aspects” of movie making, especially for young directors. But dont compare the upcoming film to it. Let word of mouth speak, Create an USP for itself!\n\nIm sure Nagarjuna knows the fate of this film, his body language spoke volumes. \nIts a fresh day tomorrow!\n\nEagerly looking forward to Shiva re-release! It was supposed to right? But, Did it???","label":0},{"review":"By seeing the reviews from all sites and some people am disappointed, actually this movie is very good, I really enjoyed a lot.\n\n1) DOP / Camera work: Super camera angles, some scenes you feel like watching a 3D movie, VR kindaff experiences. DOP is really inlined with story, you wont feel like unnecessary shot, there is alot to learn for rest of directors.\n\n2) You will feel to kill the villain like anything with extreme anger, creating an emotional feeling in second half.\n\n3) The Arrest scene,  ...MORE","label":0},{"review":"By seeing the reviews from all sites and some people am disappointed, actually this movie is very good, I really enjoyed a lot.\n\n1) DOP / Camera work: Super camera angles, some scenes you feel like watching a 3D movie, VR kindaff experiences. DOP is really inlined with story, you wont feel like unnecessary shot, there is alot to learn for rest of directors.\n\n2) You will feel to kill the villain like anything with extreme anger, creating an emotional feeling in second half.\n\n3) The Arrest scene, The SL world sceen , The chase sceen, The climax fight, the way the party song pictureized and kid .......are extraordinary.\n\n4) BGM in some scenes creates goosebumps \n\nConclusion: A must watch movie, it have different story line, different way of story telling , dont belive in tasteless felows reviews. Cheers","label":0},{"review":"Watched “Officer”. Given the enormous amounts of admiration I have for RGV genre, it’s not just impulse but also took some courage to book tickets . Stoking the almost dead ambers of hope that RGV would somehow bring cheer to his distraught fans, I gingerly stepped into the theatre. The theatre was sparsely occupied obviously by diehard RGV fans who appeared to be apprehensively praying for the director. Nobody talked but stared silently at one another and waited with bated breath for the film t ...MORE","label":0},{"review":"Watched “Officer”. Given the enormous amounts of admiration I have for RGV genre, it’s not just impulse but also took some courage to book tickets . Stoking the almost dead ambers of hope that RGV would somehow bring cheer to his distraught fans, I gingerly stepped into the theatre. The theatre was sparsely occupied obviously by diehard RGV fans who appeared to be apprehensively praying for the director. Nobody talked but stared silently at one another and waited with bated breath for the film to start. In five minutes everyone realised the film is a dud! Sometimes the hero and heroine doubled as photographers who took selfie shots while acting ! As everyone prayed for the movie to end, the audience were careful not to make that sigh of relief audible. The resilient audience felt sorry for RGV and seemed forgive him though....! I would still wait for comeback RGV film and wish him success.... because...he champions the cause of a free spirit!!","label":0},{"review":"Nagarjuna surprises all with his handsome looks and charming personality even at his age. He showed good expressions and emotions and enacted deadly stunts exhibiting good energy. Infact he is the saving grace in the film.\n\nMyra Sareen who made her debut as a lady officer is OK in her role. Actor who played the role of the villain attracted with his performance. Others performed according to their roles.\n\nBut the thing is movie was boring in minutes of time. RGV missed some logics.,unfortunately ...MORE","label":0},{"review":"Nagarjuna surprises all with his handsome looks and charming personality even at his age. He showed good expressions and emotions and enacted deadly stunts exhibiting good energy. Infact he is the saving grace in the film.\n\nMyra Sareen who made her debut as a lady officer is OK in her role. Actor who played the role of the villain attracted with his performance. Others performed according to their roles.\n\nBut the thing is movie was boring in minutes of time. RGV missed some logics.,unfortunately he finishes the story in short line.....\n\nRgv has should taken care in all aspects when star hero is leading the role but he failed","label":0},{"review":"If rgv sir took time to make this movie in a best path . Then the movie can make sensations  but the only reason movie flopped because of his time taking process and the movie content.\nSee when we watch Shiva the content easily reached the public but when we came out to watch officer the content of this film doesn't make any sense.\nRgv Sir is a very good knowledgeable person if we came back with a best filim no one can stop him... \nProud to be rgv fan🙏","label":0},{"review":"in recent times, rgv seems to be resting on his past accolades to promote his below-average, sub-par movies. he promoted officer citing his earlier crazy combination with nag. irrespective of the negative publicity, i watched this movie, and the trolls were never more true. the movie is a free-make of various recent hollywood movies. there is no novelty. but thats okay. however, the screenplay is slow, irritating, insipid and very predictable. for a thriller, there are no good thrills in the ent ...MORE","label":0},{"review":"in recent times, rgv seems to be resting on his past accolades to promote his below-average, sub-par movies. he promoted officer citing his earlier crazy combination with nag. irrespective of the negative publicity, i watched this movie, and the trolls were never more true. the movie is a free-make of various recent hollywood movies. there is no novelty. but thats okay. however, the screenplay is slow, irritating, insipid and very predictable. for a thriller, there are no good thrills in the entire movie. even crime patrol episodes are more interesting than this movie. the music is a jarring cacaphony. the cinematography is sometimes very weird as in the opening shots of some upendra movies. except for nag, the remaining actors are either below average or underutilized. rgv has very much lost his touch, sense and this movie is its evidence. i got a headache while watching this boring movie, and later felt frustration for wasting my time and money. if you value your resources, better wait for its release on tv or youtube (where one can fast forward the horrible portions) rather than watching it in a cinema hall.","label":0},{"review":"this is one of the horrible movies I have ever seen.  We were thrilled to see the combination ( no belief on RGV though ) but unfortunately it turned out to be a fatal to the audience.\n\nWe cannot praise even a single scene which is good in this mood.  They claim BGM is extra ordinary but in reality its opposite.  Camara angles are horrible as they must have used mobiles to shoot panorama views.\n\nAn actor like Nagarjuna should not have accepted this.  Only Plus point of this movie is a its a smal ...MORE","label":0},{"review":"this is one of the horrible movies I have ever seen.  We were thrilled to see the combination ( no belief on RGV though ) but unfortunately it turned out to be a fatal to the audience.\n\nWe cannot praise even a single scene which is good in this mood.  They claim BGM is extra ordinary but in reality its opposite.  Camara angles are horrible as they must have used mobiles to shoot panorama views.\n\nAn actor like Nagarjuna should not have accepted this.  Only Plus point of this movie is a its a small movie we can come out early.","label":0},{"review":"As usual Nagarjuna has done a superb job. But then it ends there. The cheapo director Verma shoots his dirty mouth so often that he has forgotten how to shoot good movies! And the villain role is so ineffective, and poorly performed! Verma's recent string of flops show that whatever God given talent one has, humility is what makes it work!","label":0},{"review":"Never seen such a worst movie never before .. I am just thinking about producers , are they using their black money to turn white ??  After watching movie I felt producers might have huge black money . To avoid illegitimate money , they choose RGV it seems ... NO ENTERTAINMENT.. \nAbout RGV.. he is outdated director , no creativity , no imaginative , he doesn't know atleast 10% of general audience taste or what they expect from movie .... he just made a movie for time pass and thrown on public .. ...MORE","label":0},{"review":"Never seen such a worst movie never before .. I am just thinking about producers , are they using their black money to turn white ??  After watching movie I felt producers might have huge black money . To avoid illegitimate money , they choose RGV it seems ... NO ENTERTAINMENT.. \nAbout RGV.. he is outdated director , no creativity , no imaginative , he doesn't know atleast 10% of general audience taste or what they expect from movie .... he just made a movie for time pass and thrown on public .. I pity Nagarjuna sir accepting this movie ... I GOt frustrated after watching this movie ... trying to get back my peace of mind .. \n\nIf I have a right to lawsuit on my peace of mind .. I would file a petition on RGV for his meaning less movies..","label":0},{"review":"Very nice movie  without any obscenity. Fantastic performance of all the actors. Nagarjuna should act in more movies as he looks for better and fit than many of the present heroes. Satisfaction of watching a good movie. Do not know why the ratings are less","label":0},{"review":"A fantastic soundtrack with RGV elements that offer a unique experience for a crime - thriller and Police chase movie. Watch it solely on your taste as it offers pure flavor of RGV direction and camera. \nPoint is if you are technical movie geek, then you will enjoy such RGV movies thoroughly!","label":0},{"review":"If you have more money either drop in the dumpyard or watch officer movie.rgv's mind was saturated.he can only make cheap movies he can't be a mainstream film maker anymore.he is still living in the past.when was the last time rgv worked on his scripts seriously? Hits and flops are different point but rgv lost the determination and intensity.yes am writing the review on rgv than officer movie .its because there's nothing to tell about this routine movie.how nagaruna was trapped by this pervert r ...MORE","label":0},{"review":"If you have more money either drop in the dumpyard or watch officer movie.rgv's mind was saturated.he can only make cheap movies he can't be a mainstream film maker anymore.he is still living in the past.when was the last time rgv worked on his scripts seriously? Hits and flops are different point but rgv lost the determination and intensity.yes am writing the review on rgv than officer movie .its because there's nothing to tell about this routine movie.how nagaruna was trapped by this pervert rgv was a million dollar question.its time to go rgv.go and comment on pk .that's the only thing u know","label":0},{"review":"Just watched this film.\nI felt little bit bore at the climax, but entire movie is fine with great thrilling moments, characters, action sequences, sound and RGV style shots.\nNagarjuna acting is fantastic.\nI think it's pure action thriller in recent times.","label":0},{"review":"People state that movie is boring. But Nagarjuanan acting is truly awesome. Nag fantastic Performances get worth for your ticket. If you like music you probably enjoy the energetic back ground music...","label":0},{"review":"Rgv didn't changed his routine way of telling under world story... Officer is not exception.. No twists.. Predictable scenes.. It seems that Rvg lost his typical way of directing thriller . Officer is an ordinary thriller.. Of and within cops.. Rgv to be a good director, should consider himself now   to engage best story teller, associate with good screenplay writer...","label":0},{"review":"hard to see, movie not for entertainment for sure...\nOld style story telling, not cop up to the contemporary movie making.\nRGV better retire and continue his Psycho ISM series. He's out dated again & again proved. \n\nBetter Stars and Big heros and hero's avoid doing film with RGV. at least they can save their film career.","label":0},{"review":"I watched this movie with lot of enthusiasm because of Nagarajuna and Ram Gopal Varma combination. But coming to movie only performance of Nagarajuna is good. Firstly the story is good. Casting is set and production is fine.  \n\nBut main drawbacks are dialogue and narration. Climax is not good. Ajay and shindey characters are waste. \n\nMy Rating is 1.5/5","label":0},{"review":"Nagarjuna suits perfect in his role. It's far better than recent rgv movies but still he has to improve a lot. There's no story in this movie. If we have pocket full of money can watch once otherwise skip.","label":0},{"review":"Camera work good sound effects too good but the main defect was the screenplay.action sequences are too realistic if the screenplay was good this will be a super duper hit but it ends with a average if RGV concentrates on screenplay the film will be in a another level . Nagarjuna action superb . For the Nagarjuna fans it will b a worth watching movie","label":0},{"review":"i love RGV's philosophies but not his movies, reading reviews of the movie i thought that this movie too was a poorly edited film with awkward camara angles ...\nbut, this was a gripping thriller .... awesome background score .... awesome suspense .... awesome twists .... enjoyed the movie throughout","label":0},{"review":"By seeing the reviews from different stupid people.. I've got disappointed, but actually film is very good .DOP 👌 nd felt like watching 3D film.. and thos is not at all entertainment film.. it is different trail story..with realistic fights.. as usual NAG surprises wit all his handsome looks even at this age.agn proved as KING","label":0},{"review":"I guess, if media refrain from the thought the movie is directed by RGV, then they might praise the movie.... As usual telugu media is biased.... It is obvious that RGV has not been upto the mark in recent past, but he is an extraordinary director....\n\nInspite the negative reviews given by media, i dont think it would effect Nag on a level , 5th movie in the combination of nag rgv will b seen by audience....","label":0},{"review":"#Officer is as brutal as it is , as realistic as it is .... Have seen many movies but can never witness such a movie where sound drives the movie in the years gone by and years gonna come.... @RGVzoomin Fantastic 🙏🙏🙏 @iamnagarjuna is superb😍😍😍","label":0},{"review":"It has a good story line, but pathetic action, acting, and dubbing. The only part of the movie I can appreciate is the story, but at places it completely falls apart and weak points with a unworthy conclusion. The title is not even apt to the movie. A disappointment that Nagarjuna had to play this cheap role.","label":0}]