[{"review":"It's  a phyco movie. It shows the mental status of director towards a lady. Suppos a women was in relation with a man before her marriage. And now she is changed totally and ready to establish her home.  But the man is always conscious towards her old past. Why he is love with that women whom he thinks that andhe is liar. In this case the man is untrue towards the lady.\nI have full sympathy for Kareena as an role in this movie.","label":0},{"review":"beautiful movie. and totally practical. and just look at the casting. ajay devgan , nasserudin shah, vivek oberoi(excels in gangsta roles), saif, konkona, deepak dobriyal and gangs of wasseypur ka sultan and the coy kareena . wonderfully directed. but the mainstream audience might find it boring. i absolutely loved it. better than Haider (superb in itself)","label":0},{"review":"Aamir Khan refused to play the role of Langda Tyagi. Saif proved that he is capable to act in a dark role😎.I have seen Shubha Maharat, a Bengali film where his mother played the antagonist. Both are beyond praise. Vishal Bhardwaj made a masterpiece.","label":0},{"review":"Superb...acting speaks a lot. Songs, story, dialogs, delivery of dialogues .,. everything is marvellous, excellent...\nAjay Devgan, Saif Ali khan, Kareena ..everyone are live Omakara life. So realistic acting..hats off ...","label":0},{"review":"A must watch movie which can blow ur mind by all factors such as impactful acting , genius direction , hilarious music etc. One of the best indian movie A MASTERPIECE 🙏🙏","label":0},{"review":"The movie Is really amazing with strong performance from all the lead actors.\nDirection is so good that keeps the viewers spell bound till the movie concludes.\n\nMust watch for Bollywood movie buff.","label":0},{"review":"Great... Ajay's acting, his expressions, dialogue delivery is excellent. This dark themed movie is a LEGEND. Must watch if you want to watch quality movies from Bollywood.","label":0},{"review":"Exemplary work by visual bhardwaj!!! And kudos to the entire crew and cast. Wonderful wonderful movie it was.","label":0},{"review":"Masterpiece ❤\nThe character of langda tyagi played by saif is just phenomenal.Deepak dobriyal also did well as usual.Perfect adaptation of othello.","label":0},{"review":"Movie very ameging everyone is good  Ajay Devgan Kareena Kapoor Konkona Vivek but like to maintion Saif Ali Khan was superb he make this role very realistic","label":0},{"review":"Superb Story. Its a different kind of movie and all the actors has done good work.","label":0},{"review":"One of the finest movie I've ever seen.  Spectacular performances by all the actors...  Hat's off","label":0},{"review":"langda is a pure evil. Best adaptation of Shakespeare only after RAN ,throne of blood and bad sleep well","label":0},{"review":"I always like this movie in acting in so good of all carrcter & langda tyage carracter is absolutely amazing","label":0},{"review":"Awsum movie...\noll the cahracters are superbbb.\n\n#Ajay Devgan and Saif was outstanding.\n\n\n\n#Cheers to Team!!!!!!!!!","label":0},{"review":"Excellent performance by kareena Ajay and saif. VISHAL Bharadvaj sir thank you for directing Shakespeare.","label":0},{"review":"It's  fantastic  movie  sply saif Ali Khan acting superb.all actors are doing good job","label":0},{"review":"WORST STORY...\nWith this kind of starcast they can do something different\nEverything is Negitive","label":0},{"review":"Superb great real bollywood..Saif ali khan ..vivek..and deepak.. wonderful performance must watch movie","label":0},{"review":"This movies is my one of tha favourites movies I like roll of ajay Devon nd kareena Kapoor.","label":0},{"review":"Beautifully Directed Shakespeare's Gem. The Best Tragedy ever","label":0},{"review":"Yes yes yes we can we can.... Make such strong movies thanks to the team omkara","label":0},{"review":"one of the best bollywood movies with great performances of ajay and saif.","label":0},{"review":"Indian adaptation of Othello. A deep and courageous movie with great rewatch value.","label":0},{"review":"Awesome movie just listen the beautiful lines in the movie directed by its director.","label":0}]