[{"review":"I have to start from the songs. Wow. They set the undertone for everything in this raw thriller piece. So honest in its lyrics, powerful in delivery and driving the relationship of characters. \nOne thing that sets it apart from other movies is its unpredictability. It always took the wrong turn and championed its way out given some powerful yet disturbing acting by Kay Kay, especially. \nIt manages to capture the soul of Mumbai, its vices and the perils of being destitute without boring me out. T ...MORE","label":0},{"review":"I have to start from the songs. Wow. They set the undertone for everything in this raw thriller piece. So honest in its lyrics, powerful in delivery and driving the relationship of characters. \nOne thing that sets it apart from other movies is its unpredictability. It always took the wrong turn and championed its way out given some powerful yet disturbing acting by Kay Kay, especially. \nIt manages to capture the soul of Mumbai, its vices and the perils of being destitute without boring me out. The characters were fleshed out and everyone had real motives for doing things.\nIt's a shame it never did hit the cinemas to give an iota of satisfaction to our own QT, Anurag. The violence is so real yet it's not so graphic. Use of colour, camera movements, and lighting allows for a gripping experience.","label":0},{"review":"What a movie !!!\nSalute u Anurag Sir ...\nGreat work ....\nThe era will come soon ..when people gonna watch movie not by actor's name ...but the director's ...\nI shown ur film to my 450 people ...\nWe are eagerly waiting for ur next work ...\nNot less than 1000 people are waiting....","label":0},{"review":"I think this movie was brilliantly directed by Anurag kashyap . One of the best thriller movie in Indian cinema.","label":0},{"review":"What an awesome movie made by anurag kashyap I won't believe that CBFC didn't passed this film😶","label":0},{"review":"Outstanding","label":0},{"review":"The film is a true masterpiece..What the hell was the censor board done to this film..this film is a inspiration to many dark shaded films..","label":0},{"review":"fantastic movie....k.k.menon is best","label":0},{"review":"must watch for every Anurag Kashyap fans","label":0}]