[{"review":"This one of the worst movie ever made by Puri Jagannath. Except locations and good acting of Balakrishna there is nothing in this movie.\nPathetic Screenplay,no emotional touch,worst and dumb comedy scenes,below average BGM,brainless action sequences. \nA complete wastage of time\nRatings:2/10 stars.\nPuri Jagannath you have the potential to make good movies, take time and work more your on direction style and screenplay then you will definitely succeed.","label":0},{"review":"Balayya is the greatest comedy actor of all time..he is doing a great service to humanity by making such movies..everytime i get stressed i watch a balayya movie..it provides non stop comedy material and u laugh your heart out for 2.5 hrs completely relueving you of all stress ..this movie has an added bonus - he has also sung a song ☺️ keep it up balayya","label":0},{"review":"Mindless movie brainless movie.. Paisa wasool is wrong actually its waste of time and money movie oo.. Audience plz choos good movies and pramote good movies its upon uu to make any one hero or zero plz dont come in the trapa like... fans kosam always ready .... Etc","label":0},{"review":"if you want to really enjoy the movie you should watch balayyabaabu movie. and PAISA VASOOL is the best mark of entertainment along the cast of puri jagannath and baalayya babu. its awesome.","label":0},{"review":"it is illogical according to some of the scences but still its amazing and as u know tamil and telugu movies r unforgettable and nice so u should watch it\n                       THANK YOU","label":0},{"review":"A mass masala movie with twists that are out dated. The Balayya factor too doesn't work well due to his screaming at many occasions.\n\nAvoidable !!","label":0},{"review":"Typical balayya movie & also puri entertainer..mass movie..nice locations songs n fights..fully enjoyed..powerful dialogues..thanks puri..I liked this Theda singh..highlight balayya's song..nagin dance..","label":0},{"review":"great movi both in action and romance. Me greatest die hard fan of Nandamuri Sir. I watched this movi 15 th  times.","label":0},{"review":"for me this movie enjoyed a lot \nBalayya did good performance ,\nSongs also extraordinary \nI was really happy about this movie as a balayya fan","label":0},{"review":"Story, direction, acting, songs might be good. But you must have to take a Zandu Balm. Because you will get irritated with Balakrishna vocal voice.","label":0},{"review":"Puri Jagannath chinnapillala script balayya tho teesadu.   Balayya should choose wise script before accept.. All the best for next film for both Puri and babai","label":0},{"review":"MAST TIMEPASS MOVIE. WATCH IT WITHOUT USING YOUR BRAIN. GET REFRESHED FROM ALL SORT OF TENSIONS FOR TWO HOURS.CONTINUE BALA SIR","label":0},{"review":"Extraordinary performance.....balayya lived in a character as usual........energy level peaks......puri's direction is really and totally shows as perfectly in this character....balayya is youth icon.....","label":0},{"review":"One of the best entertaining movies in my life;i enjoyed a lot not in the movie but due to this movie","label":0},{"review":"Super move good action Balakrishna and very good story from puri Jagannath and second pokire move very nice good back ground music plus and totally very good comedy picture","label":0},{"review":"yes it is quite different from NBKs traditional movies,and its another experimental script of PJ as usual. overall its not upto satisfaction","label":0},{"review":"Same old things are shown in this movie overacting nd there is no logic at all movie will bother the audience heroine acting is just below average","label":0},{"review":"Worst story, Bore screenplay and bad direction.Entertaining dailogues.Movie tested the patience of audience.Finally flop movie.\n1/5","label":0},{"review":"NBK style in fights & dialogs are good \nBackground music & photography is good\nI think title not match for the movie.","label":0},{"review":"Balayya Acting super. ...It is one man show....for his fans...It's a Good treat....","label":0},{"review":"It was actually great to see Balakrishna's relentless energy throughout, but it was sad to see that he invested that in this kind of mindless movie","label":0},{"review":"I am  very big fan of NBK this movie is super movie in talliwood","label":0},{"review":"Nbk acting good...a new balayya good looking and character.one man army of this movie","label":0},{"review":"Worst movie, It would even be disrespectful to call this a movie. Bad music, worst acting, worst dialogues, worst action.","label":0},{"review":"It is good movie. And it is full time entertainment. See soo","label":0}]