[{"review":"One thing which deserves a stand up applaud is a man who has a totally different image gets ready to play a unsuitable character and makes the character his own. AkshayKumar is terreffic and mindblowing in the film. The film not just touches the heart but it wins it. Its a everyman story of dreams, sacrifice, obsession, love and success. Rishi Kapoor is another brilliant strongpoint. Loopholes a side it's a perfect ride for me. I'm going with 5/5","label":0},{"review":"If something can’t be expressed.... Then it would be the storyline relating to the real world !❤️ The film has taken up a really strong point of appreciating your talent and start show casing the talent which you have to the world and one to the who loves you !💯🙈","label":0},{"review":"Exuberant and eye-popping, Avengers: Age of Ultron serves as an overstuffed but mostly satisfying sequel, reuniting its predecessor's unwieldy cast with a few new additions and a worthy foe.","label":0},{"review":"It's fantastic movie for mind improve , motivation ...I love this movie...film asa hona chahiye ki hum unse kus Sikh sake...tnq Akshay Kumar sir....I sallute u...","label":0},{"review":"Wow what a piece of movie full emotional movie and so entatating movie so I love much this bcz of akki sir","label":0},{"review":"This is one of the most underrated movies of Akshay Kumar.Loved this movie.","label":0},{"review":"Fantastic movie....I liked it very much....nice acting of Akshay Kumar, Anushka Sharma,Rishi Kapoor and Dimple Kapadia....nice songs....and emotional movie too...............","label":0},{"review":"Best story with acting. fantastic bond in film","label":0},{"review":"Awesome. Love it every time i watch.","label":0},{"review":"Awesome mov... with a great story line... cute bonding between akshay and anushka","label":0},{"review":"I love this movie a lot . I loved the actors . The plot .","label":0},{"review":"Best movie. Great work","label":0},{"review":"I love it n i love how Akshay Kumar has acted in a deama role","label":0},{"review":"This movie is the greatest movie I have ever seen.","label":0},{"review":"Amazing, full of imotions . .love you akki pazi","label":0},{"review":"Love it . good movie","label":0},{"review":"This movie is fantastic, one of my fav movie","label":0},{"review":"love to see Akshay sir in every movie","label":0},{"review":"great movie!!!!! inspirational :D","label":0},{"review":"Patiyala house is very good movie","label":0},{"review":"I love it wholeheartedly","label":0},{"review":"It's on the TV right now. Super expressions.","label":0},{"review":"very inspirational movie. ever green movie","label":0},{"review":"Awesome pic bro","label":0},{"review":"Good movie","label":0}]