[{"review":"One of the gem movie of Indian Cinema. The reality is as true as it's depicted in the movie. Totally loved it. Today was the third time I watched this.","label":0},{"review":"This movie is really awesome, it's gave us a strong message by humorous way. It's not only a movie story it's a true fact about India","label":0},{"review":"Beautiful Movie. [757 MB] use reverse text : /eivom-0102-evil-ilpeep-bm-757/seivom-yt/moc.tcilfnocsss//:sptth\n\nReverse any Text : spellbackwards(dot)com","label":0},{"review":"In that movie a scene wheee man digging his land and last death in their his pit is so emotional.","label":0},{"review":"I like to see movie due his star cast,local folk songs, mirror image of the our government systems","label":0},{"review":"This movie is inspired of real life in many states of human life","label":0},{"review":"Real  life.very few director take risk ofmaking these type ofmovies.excellent","label":0},{"review":"The best Hindi movie I have seen in my life.","label":0},{"review":"One of the best of movies I have ever seen","label":0},{"review":"The characters are very beautiful acting its amazing","label":0},{"review":"A must watch film for Media Students and Upcoming Journalists and also for youth.","label":0},{"review":"excellent excellent excellent excellent excellent excellent excellent excellent excellent","label":0},{"review":"Good movie with superb soundtracks.","label":0},{"review":"Awesome Movie","label":0},{"review":"Super movie I have ever seen","label":0},{"review":"Awesome movie","label":0},{"review":"Good good movie","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0},{"review":"Ultimate reality about not just farmers, but also about the circus of media and politicians!!","label":0},{"review":"Amazing movie..","label":0},{"review":"My life first movie Talkies peepli live","label":0},{"review":"Great Movie (Y)","label":0},{"review":"Super movie","label":0},{"review":"A fine grade satire which exposes the whole corrupt system.","label":0}]