[{"review":"Perfect satire on the law and administration scene in a country where the people who can read and write blindly follow the falsehoods spread by media. Expect for the last sequence, the rest of the movie could be a reality. Of course honesty amongst thieves seems to be the Moto of this film. It waivers between being an off beat and commercial film. Luckily no songs, could have done with sharper editing as it trends to drag sometimes","label":0},{"review":"What a piece of cinema! One of my favourite EVER films! A satirical masterpiece, actually. Thank you, you beautiful scriptwriter, screenwriter, casting director, background scorer, and the brilliant actors and director. Three cheers for all of you!!!","label":0},{"review":"My first experience of subhas  kapoor was with jolly llb 2 and became his fan and very eagerly watched the flim jolly llb1 and so inspired and next enjoyed the flim phas gaya obama.awsome screen play writer wonderful story teller and flim directer.","label":0},{"review":"It's a must watch movie for all. Nice and light plot. All the charecters specially Sanjay Mishra is outstanding.\n\nEnjoyed the movie.","label":0},{"review":"Nic all of movies which directored by Subhash Kapoor like LLB and LLB 2 and fas gye re Obama  twice of movies are best and mine favorite .I'm fan of Akshay Kumar , arshad warsi , Sanjay Mishra , rajpal yadav and brijender kala","label":0},{"review":"One of the best satirical comedy movies by Shubhash Kapoor. Undoubtedly you enjoy the act of Sanjay Mishra, Amol Gupte, Rajat Kapoor , Neha Dhupia and others.","label":0},{"review":"One of the best executed comedy caper.\nSanjay Mishra & Rajat Kapoor at their best.  Amole Gupte and Neha Dhupia too well acted.","label":0},{"review":"Awesome. No Vulgarity, No Violence. A complete entertainer package. Manu rishi kapoor reminds me of vinay pathak.","label":0},{"review":"one of the finest satirical gem of our country ,,, top notch humor with sensible and polished dialogues are icing on the cake with the over the top acting","label":0},{"review":"Great story, constantly gripping throughout the movie with great acting. This director is a genius !","label":0},{"review":"A very good entertainment movie liked very much congrats for all cast and crew members..","label":0},{"review":"The best part is the unfolding of the simple story which is innocent enough yet not childish.","label":0},{"review":"Original concept and must watch movie because this type of movie not earn fame so much in Bollywood","label":0},{"review":"Undoubtedly the best hindi comedy movie of the decade","label":0},{"review":"I learned a lot from this movie Because I am also a businessman","label":0},{"review":"One of the few good comedies from bollywood.","label":0},{"review":"Good. Satirical. Plot was a bit exaggerated though.","label":0},{"review":"Fantastic movie with wonderful actors.","label":0},{"review":"Light film nice to watch.","label":0},{"review":"They don't make such movies anymore in India.","label":0}]