[{"review":"This movie was from the heart.Watched it when i was in 10th standard and have been a fan of shahid kapoor since then.\nIt is a family movie,full of comedy,bit of action and full on entertainer.\nShahid kapoor has rocked the acting,he is really great in this movie,doing something different and the songs are really great.\nDo watch this movie now  even if you skipped it earlier,you won't be dissapointed and feel this movie relatable.\n\nRating:8/10.","label":0},{"review":"Storyline direction presentation was very nice. It's about relationship between mother and a son. Her mother wish was that she wanted to see him as a well known police inspector.  ☺️👍Nice movie.","label":0},{"review":"The storyline was an old one, a wannabe policeman, mother-son relationship, kidnapping, don- the father.\nIt had all the masala that is needed for entertainment.\nAll in all a good movie.","label":0},{"review":"This movie is a movie worth watching with everyone in the family. Watching this movie will awaken the love of the mother for the child and the devotion for the mother in the child.","label":0},{"review":"Very interesting movie & and all full comedy & shahid sir of acting is great. \n  The next Superstar of Bollywood industries Shahid Kapoor.","label":0},{"review":"realy so funny,intresting.very beautiful.some is unliked it.they are foolished mans in this world.i love this film.","label":0},{"review":"Lovely movie by taking Kumar santoahi like andaz apna apna it's also a nice movie about bond between mother and son","label":0},{"review":"This movie is so nice to see in this film I like dialogs the film was superb","label":0},{"review":"Very interesting movie. \nI used to sing all songs of this movie for my sweetheart.","label":0},{"review":"this movie really is so nice n spcially the song janam janam really its hrt touching song","label":0},{"review":"A light comedy , can't be bore, doesn't matter how many time you watch it","label":0},{"review":"Really nice film story is funny and an unique one","label":0},{"review":"😒😒😒😒 I wasted my hours watching this!!! Beware, Beware and don't watch this movie. \nIn order of public welfare.","label":0},{"review":"This movie is best no. 1 \nand it best actors","label":0},{"review":"Song is main rang sarbato ka tuch the heart beats.   Vvsingh faridabad","label":0},{"review":"Nice movie ..not big hit ...but comedy is good Shahid, ileana acting is Good","label":0},{"review":"I love this movie sooo much I recommend it 100%","label":0},{"review":"Good time pass flim., Don't think of logic just chill","label":0},{"review":"This movie is very good. Full intertainment","label":0},{"review":"I like that song \"janam janam ho tu hi mere pass maa\" very much!!!\n😍😍","label":0},{"review":"Nice movie must watch it ...Janhit me jari by diwana ....","label":0},{"review":"Nice movie every one should watch","label":0},{"review":"I like shahid kapoor's commidy on this film","label":0},{"review":"shahid is very good in this movie","label":0},{"review":"I think ,so it is verry well for all young boy & girl.","label":0}]