[{"review":"I thought to write about Pinjar as I saw the trailer of Hellaro and immidiatly recall this one as I could relate it with this one. Even today Pinjar  is still my favorite. It was recommended by an English teacher who was Panjabi.  Loved the story and the characters, especially Manoj sir's, the transformation of his character and he has played it so well. There are some unexpected turns and emotions how Puro's family forgets about her and moves on but her brother still keeps on searching for her. ...MORE","label":0},{"review":"I thought to write about Pinjar as I saw the trailer of Hellaro and immidiatly recall this one as I could relate it with this one. Even today Pinjar  is still my favorite. It was recommended by an English teacher who was Panjabi.  Loved the story and the characters, especially Manoj sir's, the transformation of his character and he has played it so well. There are some unexpected turns and emotions how Puro's family forgets about her and moves on but her brother still keeps on searching for her. Suspense, thrills, there is so much going on in this drama. love it.","label":0},{"review":"In 2003 people enjoyed the film, but as situation stands today, it would be suicidal even to think of showing this film in theaters. The Kashmir issue has overshadowed almost everything related to India and Pakistan. But, personally I feel sad. Its a catch 22 situation as far as the Author is concerned. Born in Pakistan and Died in India. No offense meant, but who will decide Right and Wrong as far as re-releasing the film is concerned in Indian theater . Lets leave it to Allah and God. The Cast ...MORE","label":0},{"review":"In 2003 people enjoyed the film, but as situation stands today, it would be suicidal even to think of showing this film in theaters. The Kashmir issue has overshadowed almost everything related to India and Pakistan. But, personally I feel sad. Its a catch 22 situation as far as the Author is concerned. Born in Pakistan and Died in India. No offense meant, but who will decide Right and Wrong as far as re-releasing the film is concerned in Indian theater . Lets leave it to Allah and God. The Cast appearing on the silver screen have done their job brilliantly as usual.","label":0},{"review":"Excellent movie. Brings alive the trauma undergone by millions on both sides of the border.could not stop my tears.We need to learn from history and stop  creating divisions based on religion for narrow ends.\nUrmila matondkar as puro lived the character. Why dont we see her in movies anymore?She should make a comeback.Manoj bajpayee is excellent,as always. All the supporting actors have acted well.A must watch for all.","label":0},{"review":"This is so nice movie. Every character is played very well . Nice story which show the reality when partition take place.in this movie the village kachche house are superb. I like to watch this movie again and again.","label":0},{"review":"A brilliantly woven & acted movie with a great message. Screenplay will definitely make you cry sometimes. Songs are also good with fantastic lyrics.","label":0},{"review":"Today I watch  WORLD BEST character of ever LIFE. this character goes very deep of My soul. \nTHIS IS WORLD BEST BEST BEST MOVIE....\nTHANKS YOU SIR FOR THIS MOVIE PRODUCTION ....\nI'M PROUD OF YOU. AMRITA JI ALWAYS MEMORIES OF THIS CONTRIBUTION .........\n\nTHANKS THANKS THANKS........//\\\\","label":0},{"review":"Every Indian must watch this movie. \nBest work by everyone in every department of film making. \nA unique love story with many many memorable scenes and dialogues.","label":0},{"review":"Very Good Movie - Heard about such stories during those times from  my elderly. Those times were very tough, world has seen and has gone through a lot in our past.","label":0},{"review":"To rise above good and evil is not easy. Only a free mind can achieve that. It is very taxing for an individual more so for society at large. Individual emancipation is seemingly possible.But as a group ...it is harder tp acieve.","label":0},{"review":"Much emotional.... An excellent plot on unjust based on gender.... Shrewdness faced by women during partition with some awesome act by Urmila.","label":0},{"review":"Pinjar really a good movie good act done by all movie cast espacially manoj sir & urmila ji, nice movie lots of love for this one","label":0},{"review":"I love love love this movie and ask everyone to watch. acting of all is superb","label":0},{"review":"Pain has no religion, no culture. It must be felt beyond boundaries. Must watch classical movie...","label":0},{"review":"Everytime i see this movie i learn something new from this pure masterpieces of indian cinema,\nI love this movie","label":0},{"review":"A realistic story, too historical, transnational, multi-religious; above all a havoc of Partition in muti-cultural India. Too artistic to believe.","label":0},{"review":"Words would not be suffice to tell the beauty of this movie. This is a must watch.","label":0},{"review":"Tears rolled out . Atlast love is great. No Hindu no Muslim.","label":0},{"review":"A masterpiece that would shatter your heart with the pain of millions during the period of partition","label":0},{"review":"Pinjar film is best film urmila and manoj best acting in film nice hard touch film","label":0},{"review":"Most touching film I have ever seen its good","label":0},{"review":"Excellent  movie portraying facts related to partition","label":0},{"review":"Exellent no words about this film great","label":0},{"review":"Beautiful movie... the love between siblings are very touching.","label":0},{"review":"One of the best movies i watched","label":0},{"review":"Best movie, which I have been ever seen","label":0}]