[{"review":"A superb movie asking all us all to take care of humanity rather than just religion. Because humanity is the religion we must care about before anything else.Once again, Aamir Khan (actor) takes away all the limelight and Cool to see Shushant Singh Rajput act beautifully.\nAnushka sharma pokes fun when she runs after Amir Khan, alien in the movie. She has done a very beautiful work as a journalist. The movie clearly  portrays all your Doubts about God's existence,Which God to Believe.!! Though th ...MORE","label":0},{"review":"A superb movie asking all us all to take care of humanity rather than just religion. Because humanity is the religion we must care about before anything else.Once again, Aamir Khan (actor) takes away all the limelight and Cool to see Shushant Singh Rajput act beautifully.\nAnushka sharma pokes fun when she runs after Amir Khan, alien in the movie. She has done a very beautiful work as a journalist. The movie clearly  portrays all your Doubts about God's existence,Which God to Believe.!! Though the cocept of movie have been copied from 2012 movie \"oh my god\".A must watch. If not for fun then for the content it presents. The ambiguity of our societies and the unexplained norms or barriers are explicitly shown to generate evolutionary thoughts. Definitely 5 stars.","label":0},{"review":"PK is an incredible movie that communicates a very complex and personal topic extremely well that, hopefully, most will understand.  It demonstrated very cleverly, without denigrating anyone's personal beliefs about their religion, that all religion is a bunch of man-made rules that people interpret take very deeply personally.\n\nDifferences in religious beliefs will always exist, its just the nature of human beings.  Hopefully, this movie will help toward developing an understanding and respect  ...MORE","label":0},{"review":"PK is an incredible movie that communicates a very complex and personal topic extremely well that, hopefully, most will understand.  It demonstrated very cleverly, without denigrating anyone's personal beliefs about their religion, that all religion is a bunch of man-made rules that people interpret take very deeply personally.\n\nDifferences in religious beliefs will always exist, its just the nature of human beings.  Hopefully, this movie will help toward developing an understanding and respect for each others beliefs systems.\n\nAbsolutely brilliant movie on many fronts.  I would encourage everyone to see it, and then see it again.","label":0},{"review":"I am big fan of aamir sir but BIG disappointment... Writer was so engrossed in making audience laugh especially on hindu culture  that he forget to relay message he  wanted to convey through the  movie. Secondly as usual  unnecessarly  love story was added of pakistani boy and indian girl ... After All this typye of movie make conterversy  and it will trigger intrest in audience and do buisness ........ Though aamir sir performance was good .Omg was much better  than this ,lord krishna(akshay)ca ...MORE","label":0},{"review":"I am big fan of aamir sir but BIG disappointment... Writer was so engrossed in making audience laugh especially on hindu culture  that he forget to relay message he  wanted to convey through the  movie. Secondly as usual  unnecessarly  love story was added of pakistani boy and indian girl ... After All this typye of movie make conterversy  and it will trigger intrest in audience and do buisness ........ Though aamir sir performance was good .Omg was much better  than this ,lord krishna(akshay)came and showed that  have faith in god not through godmen who make fake calls.","label":0},{"review":"A great movie with comedy, romance, sci-fi and a great message too. But they probably should have shown the how islamic jihadist terrorists misuse religion.This is a much bigger problem. At least the hindu priest aren't killing people. It only shows misuse of Hindu religion issues because it's the major religion of India. But I'd like to see a movie that addresses problems in Islam. But overall I enjoyed this movie a lot and the actors did great.","label":0},{"review":"PK is a story of pure love for me. When I first started the movie I was very confused because I was wondering how can a story with an alien turn into to something meaningful and excited. But turns out that PK fascinated me. It's one of my favourite movies of all time. It showed me how weird is it like to be a human. It showed me how we put borders to ourself and live like robots. It showed me how to sacrifice and what true love is. This movie is magical. Everyone should watch it. Don't leave it  ...MORE","label":0},{"review":"PK is a story of pure love for me. When I first started the movie I was very confused because I was wondering how can a story with an alien turn into to something meaningful and excited. But turns out that PK fascinated me. It's one of my favourite movies of all time. It showed me how weird is it like to be a human. It showed me how we put borders to ourself and live like robots. It showed me how to sacrifice and what true love is. This movie is magical. Everyone should watch it. Don't leave it at the half! You'll get it in second half if don't understand at first.","label":0},{"review":"One of the greatest movies in recent history. It is a brave try by Raju Hirani and also great work by Aamir Khan. The film tells us to place humanity above religions. It is fully logical- God is our father. When we need something we ask that directly to our father. He does not tell us to pour a cup of milk on his head or do a fasting.","label":0},{"review":"Message given was judge a person humanly keeping religious affiliation in the background....but this was with copious amounts of anti-Hindu flair. All Hindu religious men were shown as gung-ho goons. And then coincidentally or not, Pakistan and Pakistanis were shown in a highly positive light. Recently I found out that the film director is an outspoken anti-Hindu. Try giving parallel message to Muslims for their teen talaaq, purdah and other medievalistic rituals. Bollywoodians want to live in t ...MORE","label":0},{"review":"Message given was judge a person humanly keeping religious affiliation in the background....but this was with copious amounts of anti-Hindu flair. All Hindu religious men were shown as gung-ho goons. And then coincidentally or not, Pakistan and Pakistanis were shown in a highly positive light. Recently I found out that the film director is an outspoken anti-Hindu. Try giving parallel message to Muslims for their teen talaaq, purdah and other medievalistic rituals. Bollywoodians want to live in their own Wonderland and don't want to have anything to do with reality. Certainly not for Hindus.","label":0},{"review":"In the movie , anushka sharma pokes fun when she runs after Amir Khan, alien in the movie. \nShe has done a very beautiful work as a journalist .\n\nThe film has mind blowing music. \n Good luck to entire cast of pk. I have seen this movie in theatre with family. It was a laugh riot.","label":0},{"review":"According to movie belive in Humanity . Humanity means  there is only one god so don't worship different god and godess.  Lord shiva is just joker for the movie not a god (toilet scene). All pandits are evil but they are not human. Wheras all malluvi are good human.\nSecondly what is the NEED of adding marriage of PAKISTANI boy and INDIAN girl       \nFinally ,the writer was succeded and  the movie was blockbuster in india (by conterversy) and south asian islamic country ( by making fun of hindus) ...MORE","label":0},{"review":"According to movie belive in Humanity . Humanity means  there is only one god so don't worship different god and godess.  Lord shiva is just joker for the movie not a god (toilet scene). All pandits are evil but they are not human. Wheras all malluvi are good human.\nSecondly what is the NEED of adding marriage of PAKISTANI boy and INDIAN girl       \nFinally ,the writer was succeded and  the movie was blockbuster in india (by conterversy) and south asian islamic country ( by making fun of hindus) .                Inspite of showing drawback of all relgion writer was engrossed in making fun of only hindus belives.","label":0},{"review":"One of the best films out there which challenges religions, I am not an atheist and believed in religions, but this has a fresh take on religions without being offensive and raises some really good questions with a good sense of humour. A must watch for anyone who is religious, non-religious, likes humour and more","label":0},{"review":"This is a must watch movie. It takes  brilliant and brave mind to put this together and have an alien to tell the truth. I love this movie because i never limit myself with religions.  Serve humanity! . I see many reality and facts that finally came to light in this movie.","label":0},{"review":"One of the best movie i have seen ever . Telling truth to pupil but it is really disappointing that many of us never use our own brain but blindy following what babas or our forefather had told us even some of us  are ready to kill anybody for religion.😶Best part about movie is it has targeted every religion","label":0},{"review":"I have only one thing to say and that is this is an awesome movie. It shows us some scams that some people are doing in the name of religion and fooling people and getting benefits from them. And for some people who gets confused this movie does not disrespect any religion instead it tells all people of different religion to live in harmony trusting each other","label":0},{"review":"Absolute brilliat and tried to give a very good message. Aamir sir performace was just WOW. Some how direction and screenplay was good. I can say that it is a must watch movie for all indians because the kind of message this movies gives is incredible..","label":0},{"review":"I see people liking the movie. But little after they start discussing the movie has shown about Hindus and not about Muslims and so on and the very though that comes into my mind is people just want entertainment and they are not interested in real issues. They just want to make money and party. What happens in the world has no meaning for them. Even though the movie clearly said what it wanted to say people aren't willing to listen. They want to live in their own wonderland.","label":0},{"review":"A good message delivered in the form  of entertainment. Movies like this are very rare . I'm not an prolific movie watcher. But there are some books and movies which you cannot miss before you die.  \nA movie which touched my heart after 3 idiots..","label":0},{"review":"This is what Indian directors are making movie on. There are more things on which the movie can be made. Movies are made to make people entertain as well as to make people passionate or make them confident. Most of the bollywood movies are now a days focused on a particular religion. This movie is spreading hatred among the people.","label":0},{"review":"I will say PK is one of the best movie with a great meaning behind it. Aamir Khan i love u and ur great works. Keep it up. I will be experting another great movie from u next year.","label":0},{"review":"Just caught this movie on Netflix about an Alien visiting earth.   Entire movie was in subtitles and possibly one of the best films I have ever seen.   Couldn't pull myself away from the screen.   \n\nJust simply astounding","label":0},{"review":"A great movie for humanity. Nowdays, people attract to prejudice and wrong religion. They pray wrong Gods that was nevet create. This movie must watch Hindu peoples. It proofs that Islam is True and Allah is right we all should pray  Allah","label":0},{"review":"This movie is great. Everyone should see this film and know who God is. Which religion is best known by God? Muslim religion is the best religion.In the Qur'an, God has said that the most complete religion is Shi'a. I am a Muslim and accept the prophets of God♡","label":0},{"review":"A must watch. If not for fun then for the content it presents. The ambiguity of our societies and the unexplained norms or barriers are explicitly portrait to generate evolutionary thoughts. Definitely 5 stars.","label":0},{"review":"Pk is outstanding movie I ever seen, every time watch this I feel that we are not born with thaapaa.This movie saw us that our eath is not only a planet which were created by god. WE WANT PK 2","label":0},{"review":"It is one of my favourite movie in Hindi. It was really good movie and comedy was really good. Songs are also nice. Giving it 4/5 and 8.5/10","label":0},{"review":"PK is a fantastic film and a variety story.A good entertainer and good acting from the actors. Overall I'm giving 4.7 rating out of 5. I'll guarantee you it will entertain you","label":0}]