[{"review":"hello ayesha how are you what are you doing where are you ok ayesha when can't where are we took as soon it's true love but only if you can't would be i have a good girl i'm not sure... it ok ayesha😀👧 happy girl .... bye!!! Why I'm not  sure if you  come to  home","label":0},{"review":"When you are 1/2 hour into the movie yu start to realise it's a complete rip-off of the famous Hollywood movie The Italian Job.When will we get back to being original ?? I wonder.","label":0},{"review":"Superb movie but abhishiek bachachan and bobbey deol acted very well .and even nithin also acted as hero  and villian mode .movie was absolutely interesting but I don't know why this movie imdb has less ratings.","label":0},{"review":"This movie is extremely amazing ..... N Omi     \nActing was superb ..even though he is an American.     I like his acting 💕","label":0},{"review":"Best movie but they shouldn't robed that gold train cause gold belongs to Romania and to make one persons dream to real they shouldn't take the gold of Romania to make the best  orphanage for their country cause people in Romania might need that gold .","label":0},{"review":"I think it's one of the worst movie by great director duo Abbas-Mastan and as usual abishek bacchan worst acting and I actually came back until the interval only and wasted by money and time surely","label":0},{"review":"Yet another example of bollywood plagiarizing from hollywood, and still somehow manage to do worse in every aspect. well done.","label":0},{"review":"Awsome movie and BGM Abhishek Bachchan and Sonam Kapoor just rocked I love them","label":0},{"review":"Very interesting movie. I love it sooo much.😘😘","label":0},{"review":"They absolutely copied the story of the famous movie The Italian Job. Haha indians always be copying from Hollywood","label":0},{"review":"It is very niece movie but in the last seen your players done very well niece movie it was","label":0},{"review":"People who like this movie will also like Italian job. You know, the original movie. How lazy is Bollywood?","label":0},{"review":"This flim is awesome I like gold stoling Sean","label":0},{"review":"U people don't know how to make Remake movie (The Italian job).... waste of money...","label":0},{"review":"Another bang up job ripping up the Hollywood movie \"The Italian job\" \n\nJust as they always do\n\n😂😂\n\nHar har har","label":0},{"review":"Copy of hollywood movie \nWhat a waste movie\nTotal waste of time to see this movie😒😒😒😤","label":0},{"review":"havent seen it im in school good movie","label":0},{"review":"Thes is so nice\n                     Nice","label":0},{"review":"It was an amazing movie","label":0},{"review":"Excellent fabsouly","label":0},{"review":"Best movie","label":0},{"review":"Why man why there is no open download link for this movie ?","label":0},{"review":"Excellent movie 🎥","label":0},{"review":"This is very Nice picture","label":0},{"review":"JUST LOVE IT","label":0}]