[{"review":"One of the best bollywood films ever made..... One of the finest bollywood film got flop just because it was ahead of its time and people were unable to understand the concept of the film.... brilliant and heart touching music,   awesome songs and a nice n non copied story,  i still listen to Prince's songs and they r still my favourite hits of all time.....bollywood today has become nothing but copy of South Indian films, hollywood stories n action copied.....growing nepotism.....and stupid rem ...MORE","label":0},{"review":"One of the best bollywood films ever made..... One of the finest bollywood film got flop just because it was ahead of its time and people were unable to understand the concept of the film.... brilliant and heart touching music,   awesome songs and a nice n non copied story,  i still listen to Prince's songs and they r still my favourite hits of all time.....bollywood today has become nothing but copy of South Indian films, hollywood stories n action copied.....growing nepotism.....and stupid remixes of old songs (not all.....obviously)...and thats it.......this is the summary of today's bollywood industry.....where r new stories guys ?......if u all r unable to create a story then just start searching for talents.....indians can come up with a superb story....yeah but for that our industry needs to reduce nepotism......give equal chances man....for now lets just pray for a good future of bollywood....I'll be more than happy if my comment makes a difference........even i can contribute a bunch of stories written by me.....\n\n\nP.s. good films like stree, sanju etc are excluded from the list......","label":0},{"review":"Prince is a stylish, intelligent action movie. I remember the time its promos were played across televisions. I got so excited and always wanted to see it, cause it felt like my type of movie. Sadly, couldn't get to see it on the big screen, but this year, I saw it and loved it to the core! The script is really innovative and unique in its own. Critics at that time did their usual \"action movie bashing\" but it's good to see the viewers slowly and slowly appreciating it. I want to collect this fi ...MORE","label":0},{"review":"Prince is a stylish, intelligent action movie. I remember the time its promos were played across televisions. I got so excited and always wanted to see it, cause it felt like my type of movie. Sadly, couldn't get to see it on the big screen, but this year, I saw it and loved it to the core! The script is really innovative and unique in its own. Critics at that time did their usual \"action movie bashing\" but it's good to see the viewers slowly and slowly appreciating it. I want to collect this film on Home video. Let's see if I can get a copy. \n\n4.5/5 stars.","label":0},{"review":"Movie is below average.\nPositives:Good Storyline which had a futuristic and great concept,Awesome songs and the song O MERE KHUDA was simply a masterpiece song and the vfx used in it was of another level, Good cinematography and VFX, great foreign locations, VIVEK OBEROI steals the show with his acting,GREAT BGM.Direction was so so.\nNegative:Huge List=Rubbish and worst screenplay which will make you bore after 20 minutes,Lack of perfection in action sequences,Bad Editing,WORST HEROINE AND WORST  ...MORE","label":0},{"review":"Movie is below average.\nPositives:Good Storyline which had a futuristic and great concept,Awesome songs and the song O MERE KHUDA was simply a masterpiece song and the vfx used in it was of another level, Good cinematography and VFX, great foreign locations, VIVEK OBEROI steals the show with his acting,GREAT BGM.Direction was so so.\nNegative:Huge List=Rubbish and worst screenplay which will make you bore after 20 minutes,Lack of perfection in action sequences,Bad Editing,WORST HEROINE AND WORST VILLAIN.\nThough the concept of the movie was way ahead of his age but Lack of perfect crew just ruined the movie.\nRatings:2/10.","label":0},{"review":"Today I watch this movie after 8 years of realising this movie the movie is too good too awesome out standing and vivek Oberoi is too much good he's action he's acting very wonderful and outstanding and ofcource song AA BHI JA SANAM AND TERE LIYE is rock love u #AATIF ASLAM but i tell u gyuz if prince role played  #SRK then the movie were blockbuster\nafter all Its Jhakkas and Bole toh chha gaye guru!!!","label":0},{"review":"Vivek did a good job playing as prince. This movie is really underrated. Bollywood today copies south Indian movies. The weak point of the movie is the cast around Vivek. I would still recommend this movie to u all","label":0},{"review":"This movie is very good . The action was of the next level at that time . The music is very very good . I love all the songs of this movie . This movie should perform well at the box office . It didn't get what it deserved. I think this is the best movie of Vivek obroy.","label":0},{"review":"dont know why vivek is called flop actor. this movie is far better than salman sharukh movies.. best actions best story...5 out of 5.  but indian dont like these type of movies they only like stupid romantic movies with all same story...i just loved this movie...should release again..now days people will love this","label":0},{"review":"I was in class 6 when this movie came and now I m in 1 st yr of college....I loved the movie that time also and now also....Tere liye and O mere khuda are still played on the mobiles of the people of this generation and I want to see a Prince 2 comming....plz Director sir plz I want to re-live my childhood....All the songs of this film was played in the 2011 World Cup","label":0},{"review":"This was one of my favourite fiction movies in my childhood. Now eight years since then, it feels like \"Hey, Childhood welcome back!! Let's make this life playful\"","label":0},{"review":"thanks to vivek and all the actors for this film its where i found my real talent because of this film and everybody who knew me called me prince after years the name still stands and i support other comments an reviews where by this movie is better than most of sharukh an salman khans movie its just that indian people did not understand the concept of the movie","label":0},{"review":"I watched this movie more than thrice and it is an awesome , amazing, fantastic movie great job by Vivek Oberoi and all actors in this movie. Must watch it is a wonderful movie and it's songs mind-blowing","label":0},{"review":"This movie was best. As it's box office in India is lower than Worldwide box office.  This movie should be continued and it's name Prince is back. I like this movie and it's songs are best. So I think this movie should continue","label":0},{"review":"It is best movie i've ever seen. This movie is awesome and i keep watching it again and again and i still love it.This is movie from future  and people could not understand the theme the time it released.","label":0},{"review":"very good movie, big fan movie, good than mission possible movie, tom cruz fail, vivek top actor, i exchange my carrier after watch this movie, thanks vivek, dhoom 5 movie, i take my kick from salman khan and give to you","label":0},{"review":"i don’t understand the bad rep this movie gets\nhonestly think it was ahead of its time, good plot good action \nentertaining movie overall","label":0},{"review":"I can't understand why rating of this movie is so less. It's great movie with good story.","label":0},{"review":"all songs are very good and lovely . dil ko choo jaane wale songs he best dilogs and best singers","label":0},{"review":"The movie was awesome compared to current action movies, unfortunately it got flop. No reason of it. Blind public. we want PRINCE 2. :)","label":0},{"review":"I like this movie. I think that it showed have rate 100%. Role of Prince is best in this movie","label":0},{"review":"Only starcast problem but overall the movie is just awesome and one of the best movie ever made.","label":0},{"review":"excellent fiction movie..\n\nthe memory of the man deleting seens and all super\n\nreally its like a james bond movie..\n\nsuper super super","label":0},{"review":"songs at that time are very popular now I watched movie 3 days ago movie is great","label":0},{"review":"Movie is soooo amazing.. I just love the way it's scripted.! ❤❤❤❤ PRINCE👑","label":0},{"review":"Fantastic and entertaining movie.  I have not seen such a Sci - fi action thriller film before.","label":0},{"review":"Amazing movie..... For me this movie is just incredible \nLuvv uu vivek😘😘😘","label":0}]