[{"review":"Really... it's a nice nice great movie... usually i don't cry..but after watching this movie made me cry... writers ko salute bro..such a nice story..yrr pata nhi chalta itni aachi movie ko log boring q kehate he..aacchi movie he yaar meine ise release kr 5 years bad dekha par aaj bhi story aachi lagti he... this movie defined the true meaning of friendship..and the actors are so... good..I loved to watch this type of movies agar life mei 1 bar bhi pyaar kiya ho to is movie ko jarur dekhna.. mos ...MORE","label":0},{"review":"Really... it's a nice nice great movie... usually i don't cry..but after watching this movie made me cry... writers ko salute bro..such a nice story..yrr pata nhi chalta itni aachi movie ko log boring q kehate he..aacchi movie he yaar meine ise release kr 5 years bad dekha par aaj bhi story aachi lagti he... this movie defined the true meaning of friendship..and the actors are so... good..I loved to watch this type of movies agar life mei 1 bar bhi pyaar kiya ho to is movie ko jarur dekhna.. mostly I love the sam character..I love you bro..\nBhai is tarh ki movie ko to 500 credit tak par karne chahiye","label":0},{"review":"One of the finest movies based on friendship...It makes you feel Nostalgic and you will definitely miss your friends. A must watch for every one because we all make friends at least once in our lifetime...Overwhelming and Emotional...","label":0},{"review":"I usually don't cry after watching films but this pierced my heart and made me cry..❤The characters are ever engaging. Finest piece of description.IT IS JUST SIMPLY     B E A U T I F U L.❤❤Strongly  recommend it .","label":0},{"review":"I just fall in love with the story as the purani jeans movie when I watch, before I watch the movie,the dil aaj kal song always make me exited to watch the movie, and then I see.I see the real friendship fillings in the story.this is one of the best cinema I've ever seen.awesome😍😘😉👍👍👌😀","label":0},{"review":"love this film a lot.. it make us to realize that whether it is any condition we should care and not hurt the feelings of a friend.. hope everyone realize the value of friends in our life like in the film sam is.,.","label":0},{"review":"It's just brilliant... just watched it on cable tv ... didn't realised it could be this good .. one of the best movies on friendship... bet it will bring sense of nostalgia.....","label":0},{"review":"True Love and true friendship never ends in life because it's very sensitive and beautiful part of our life  we all know that love is like a free bird and 😍😍😍😍😘🤗🏞️","label":0},{"review":"Now it's my favorite film, there is no weak point in this fim. Truly it was a outstanding movie.","label":0},{"review":"Extremely Beautiful Movie and Background Music is very engaging. One of the Best Movies on Friendship ❤️","label":0},{"review":"The only movie which made my eyes wet and not cringe inside which friends centric films usually do ,the narrative simple yet peirces Ur heart","label":0},{"review":"Felt the urge to watch this film after watching the video song dil aaj kal and was left speechless after watching this amazing story.","label":0},{"review":"Really a great movie man... If True friendship had a face... Cried a lot... Writer and all the cast deserves a standing ovation....","label":0},{"review":"Very hrt touching movie I had ever seen it's makes me cry get example of frndship ND lv","label":0},{"review":"This is my favourite movie this movie was lovely great so thank you for everyone\nAnd friends forever","label":0},{"review":"Nice movie for group of friends like this     can anyone suggest some more movies on friendship","label":0},{"review":"I just fall in love with the story as the purani jeans movie when I watch, before I watch the movie,the dil aaj kal song always ...","label":0},{"review":"It is so emotional movie about love and friendship. Movie is  showing the real friendship ...I was crying at the end of the movie..","label":0},{"review":"I like this movie. It is really a very very good and beautiful story about friendship","label":0},{"review":"Cryied alot watching this movie , this movie tells us about relation between best and old friends , everyone must watch this movie.","label":0},{"review":"Best ever movie!!\n\nBut you will feel cry & sad after watching it.","label":0},{"review":"Nice movie. I love you  friends","label":0},{"review":"This move v good.and loving heart touching move.and very emotional sad story.","label":0},{"review":"Very imotional, sentimental movie.I knew the value of friends after watching this movie.","label":0},{"review":"Amazing movie on friendship.. Truly incredible.. ❤️","label":0},{"review":"This movie story is so expensive 4 Frnd\nIt's story heart touching .. . .\nI lv this story. . . . . . .","label":0}]