[{"review":"The greatest advice and tips for survival ! Enjoy the good days, don't worry behind to find a girl. So eager for SEX then find a hooker not a girl, when your ready to love and so does a girl is ready for a lifetime partnership then think of a girl. Until that enjoy enjoy enjoy","label":0},{"review":"Great..being a girl i would think neha was becoming  too much chipku types..even boys want space with thier frns as girls want..i love rajat (kartik 's) smile so much..as if its awsum..so cute so natural..luv to c other upcuming movie's  of his..","label":0},{"review":"Who says sequels lack punch?? This punchnama is full of punches which will tickle your funny bone for sure. A must watch for people in love and out of love. Likes it thoroughly.","label":0},{"review":"Great movie. A must watch for teenagers who are searching for love. After watching this movie you'll never search for random girls on fb. It'll change your perspective towards girls.","label":0},{"review":"Great Movie. Life saving advice for men. Stay away from marriage and cunning women.","label":0},{"review":"after a long time I watched a wonderful movie..every teen who is seeking love should watch this","label":0},{"review":"Loved the movie. So Realistic story and everyone acted very well.","label":0},{"review":"One of the best new age movies I have ever watched. Worth watching again and again...","label":0},{"review":"Movie showed that friendship is way better than a relationship. Movie is a must watch for people in relationships.","label":0},{"review":"Such a good movie..everyone who falls in love or not.. Must watch this movie..","label":0},{"review":"Nice for Teenagers.... love to watch it... if you watch it you will never find a girlfriend...so enjoy","label":0},{"review":"Great movie for single cz engaged people already knows the trouble","label":0},{"review":"Very nice movie everyone must watch this one, n one of the realistics movie","label":0},{"review":"Amazing ...stupendous, a new recipe with a new tint of flavours of love , comedy and sarcasm... a must watch , with new tints and flavours of actors","label":0},{"review":"I hardly recommend the people to watch this movie at least once..........the way every act has been portrayed seems to be very realistic","label":0},{"review":"Great movie on boy that heart break and being perfect","label":0},{"review":"El fantástico...\nLove kills...\nJust watch it..","label":0},{"review":"Awesome Movie waiting for sonu ke titu ke sweety","label":0},{"review":"Actually It's Just Not A Fabulous Movie, It's A Reality Of Truth..........Superb 10/10","label":0},{"review":"Don't judge the movie by its name, worth watching it, done well.","label":0},{"review":"I'm full  enjoying this movie, stars superb performance.","label":0},{"review":"ONE OF THE BEST MOVIES IN BOLLYWOOD","label":0},{"review":"One of the best romcoms by Bollywood","label":0},{"review":"Mind-blowing","label":0},{"review":"I love this film you can watch this film","label":0}]