[{"review":"Damn Emotional !!!!\n\n\nAfter watching this movie, you'd feel like no other movie is worth watching!\n\nA masterpiece decades ahead of its time!!!\n\nEverything in this movie is A grade starting from direction , acting , music , theme , story. But the thing that stands out unique and best is the amount of intensity and its ability to make audience feel that intensity . The whole movie goes on telling you a story about struggling poet. You are watching the movie and have an idea how it may end but only ...MORE","label":0},{"review":"Damn Emotional !!!!\n\n\nAfter watching this movie, you'd feel like no other movie is worth watching!\n\nA masterpiece decades ahead of its time!!!\n\nEverything in this movie is A grade starting from direction , acting , music , theme , story. But the thing that stands out unique and best is the amount of intensity and its ability to make audience feel that intensity . The whole movie goes on telling you a story about struggling poet. You are watching the movie and have an idea how it may end but only for last twenty minutes of movie. The last twenty minutes of movie are the strength of this classic flick. You may not be remembering the story when you get out but you will be feeling the thoughts emerging and revolving around the drama of last 20 minutes. And thats where the movie succeeds brilliantly. That much amount of theme with excellent dialogs and turnarounds, no one else has ever put in just twenty minutes of cinema. Definitely this is the best movie ever made in Indian cinema history and do not have any reasons with current bollywood trends , to believe that it won't remain best forever. I will say that this is a must watch for everyone who believes in quality cinema and does not want only entertainment. 10 on 10 points for this movie.","label":0},{"review":"I am 67. Wanted to see this film Pyasaa (1957) for decades finally saw it on TV through Youtube. Must be one of the greatest Hindi Films ever made. Restrained acting, no colour no glamour hardly any technology at the times mostly shot on sets in a studio. No doubt the actors were great but what is overlooked are the heart rending songs penned by the great poet / shair Sahir Ludhianavi put to music  by SD Burman each one an all time hit. Very important for a film based on a poet.","label":0},{"review":"My favourite ones dear departed Guru Duttji, Mala Sinha, Waheeda Rahman, late Johny Walker as well as Rahman sb were all there in Pyaasa.The picutre's  message has for long been etched on the memory of all the Hindi movie-goers even as the music and all songs of the movie were super hits. Waheedaji as Gulabo has left an indelible imprint upon the minds of thousands of her fans, Malaji's difficult role was essayed by her with her signature elan and Johny Walker Sb like always was hilariously good ...MORE","label":0},{"review":"My favourite ones dear departed Guru Duttji, Mala Sinha, Waheeda Rahman, late Johny Walker as well as Rahman sb were all there in Pyaasa.The picutre's  message has for long been etched on the memory of all the Hindi movie-goers even as the music and all songs of the movie were super hits. Waheedaji as Gulabo has left an indelible imprint upon the minds of thousands of her fans, Malaji's difficult role was essayed by her with her signature elan and Johny Walker Sb like always was hilariously good.\n\nSar jo tera chakraye...\nYeh mehlon yeh takhton yeh tajon ki duniya...\nHam aapki aankon is dil basa dein toh....\nJaane kya tune kaha jaane kya mein ne suni...\n\nstill ring in ears of all the film buffs.","label":0},{"review":"There are no words to describe this masterpiece. Simply awesome. Everything is great about this movie. The story line, star cast, music, songs, direction, you name it. The movie grows on you. Movie covers so many aspects of society. Main plot is the life struggle of a poet, but many other characters are also portrayed beautifully. This is surely one of the best movies ever made in bollywood. Every Indian must watch this classic and feel proud that this is a product of Bollywood.","label":0},{"review":"This movie was made well ahead of it's time. \nI love this movie and I was even born after 40 years of the release of the movie. \n\nIf you are thinking that you should watch or not then let me warn you\n1. The poetic dialogues of the movie can bring tears out of a stone. \n2. Guru Dutt did the Direction Production and lead role in the movie. And by the end of the movie you'll be a big fan of him.\n\nDon't watch  :\n\n1. If you want some item songs and raps. \n2. You'll not find any hot girl with sexy dre ...MORE","label":0},{"review":"This movie was made well ahead of it's time. \nI love this movie and I was even born after 40 years of the release of the movie. \n\nIf you are thinking that you should watch or not then let me warn you\n1. The poetic dialogues of the movie can bring tears out of a stone. \n2. Guru Dutt did the Direction Production and lead role in the movie. And by the end of the movie you'll be a big fan of him.\n\nDon't watch  :\n\n1. If you want some item songs and raps. \n2. You'll not find any hot girl with sexy dress but the simplicity of waheeda rehman can still take your heart. \n3. There are no double meaning punches and that job is done by johnny walker.","label":0},{"review":"One of the finest..Guru was true Romantic..a seagull whose flight , world failed to understand.,gamut of soulful performances added sheen..  a poem in celluloid..I met V K Moorhy ji the Phalke award winner..full two hours we talked about Guru, a few years ago..  this is sweet , sullen autumnal music.. Sheer magic..wish Guru had survived 9 Oct 1964 night...it would have been a different cinematic world ..  Long live his Legacy ...       Prof Ramesh dutt","label":0},{"review":"I am very fortunate that i may be one of the very few people born in 21st century to watch this classic movie. I was humming the tune \"Jaane woh kaise log the jinke\" and suddenly i thought of searching the movie name and eventually end up watching it on youtube. Such a wonderful movie that showcases the reality of this world which only values a person when he has something to offer.","label":0},{"review":"After watching the movie, I can definitely say that the respect for Guru Dutt g has increased in my mind. Such a classic movie even today you can relate to. Not only this but all the movies he directed / acted are cult classic. I wish he would be alive today to see his fans loving his work even today....","label":0},{"review":"I'm 20 (on the day of writing this) and had been planning on watching this movie for the past several years but got to watch it just on my 18th birthday and God! There couldn't have been a better present. It would still be an understatement if I told Guru Dutt sir was well ahead of his time. A classic in every sense, every moment every scene of the movie will make you think and ask yourself if we should be calling ourself a human when all we ever care about is money and fame. Every rating system ...MORE","label":0},{"review":"I'm 20 (on the day of writing this) and had been planning on watching this movie for the past several years but got to watch it just on my 18th birthday and God! There couldn't have been a better present. It would still be an understatement if I told Guru Dutt sir was well ahead of his time. A classic in every sense, every moment every scene of the movie will make you think and ask yourself if we should be calling ourself a human when all we ever care about is money and fame. Every rating system is an underestimation for this one.","label":0},{"review":"Pyasa\n\nMy first Guru Dutt movie....Just finished watching. Had bought his 6movie DVDs years ago but could never watch them in that mystery and spirit i had bought them, after hearing about him.\n\nReview... 122 minutes long movie. Don't watch I say.\n\n 122 minutes ain't long enough, but in those 122 minutes, I  related to the essence deeply many times. I got hit where it hurts many times. I lived and I died many times. On many levels.\n\nA masterpiece...is an understatement.","label":0},{"review":"I thought it would be very difficult to touch films like Anand, Mother India, Guide but pyaasa is class apart.\nPerfect film , acting, screenplay, lyrics, music, direction. \nFilm is so intense and emotional , that you need some time to come out of that.\nGem of indian cinema. It need guts to make film like this.","label":0},{"review":"A unforgettable memories this movie made in my life. I really felt intensely so sad for Vijay. I had literally cried for him.  Best music, best diologues and best screenplay. Lighting and timing is perfect. Best cinema of all time. Personally my favorite.","label":0},{"review":"We don't have to see this movie PYAASA twice. The first viewing itself is enough to remember for rest of life.  It's impact is so powerful one will get mute throughout the film run. Wah! Guruduttji,  you gave us a master piece and left to remember it for lifetime.","label":0},{"review":"Sometimes you watch a movie and don't know what to say about it. As if you cannot encompass all the things you want to mention or fear you might forget something pivotal. Therefore, I will not make an attempt to do so. Released in 1957, if the movie can still resonate with the viewer then that fact says it all. Just imagining how things are still same, that human will be human and society will have the same shape regardless of time, place, race and everything else.","label":0},{"review":"Good acting by Gurudutt but he left Geeta Roy in his life was a big draw back and that wahida Rehman came in .and that may be the entry by this film overall nice story and fine acting Apart from this , Mr Kundan Lal Saigal is the best ever singing star in his time.","label":0},{"review":"Old movie...but songs and references are still continued even in this era...\nLate she..Hemantkumar sung ....jane who raise with immense depth...& dard....umcomparable ....He was the best choice for this song...\nActing of late Shri.Gurudattaworth Oscar...\nIn fact entire movie....writer , Director , actors , geetkar..music director...a complete team work....","label":0},{"review":"What conceptual story, dialogues, cinematography, expressions, everything...Salute to such Indian cinema..you can't think, pen down such stories in the present scenario...also lyrical songs with meaningful scripts...I really loved this movie... conceptual story with a moral behind it..when one struggles nobody helps him, when they get to know he has become rich, everybody wants to be known as his family, friend..for what...to get thier share of wealth....","label":0},{"review":"I saw  this movie in Nov 2017 for the first time.  It was a film of 1957.  I could not see this movie for 60 yrs of its production. Hats off to the entire team of pyaasa. Now I  really wonder  why my parents, uncles used to praise this often. What a subject.  Can any one present directors can think of such literally truthful themes and direct a film today  to reform the society especially the younger generation. Pl reply.","label":0},{"review":"It was such a masterpiece of Indian cinema.  I m very choosy for movies.  Watch only selected movie.  But this movie was simply and truly - the pride of Indian cinema.  Jinhe naaz hai hind par vo kahan hain.  Great","label":0},{"review":"Great Gurudutt ... Realistic picturisation ...All are Pyasaa for paisa , power or prem or anything ... pyas has become life ... great film Salute to Gurudatt n his excellent work 👌👌👌👌","label":0},{"review":"This movies shows the real conditions of our society.  Humanity is merely a word with no meaning to us.  \nThe thirsty one is, no doubt, a masterpiece of all times.  \n#mustwatch#bestmovieever#pyasaa#pyaar 😊👏💯","label":0},{"review":"This move was avsome .pyaasa move top ten moviesin Indian cinima ,love lirekys life three r very important.guru dutt was so talented director.hatsoff to him .in the move song's and lirekys high voltage tuck to the hearts.my best movie in top five.","label":0},{"review":"This is truly a masterpiece! One of the greatest films of all time. Superb direction, mesmerising music and incomparable lyrics.4.8/5","label":0},{"review":"By far the best movie I have seen. Guru Dutt was a genius. Pyaasa is a masterpiece. I would recommend everyone to watch this.","label":0},{"review":"Bst movie I hv ever seen! Wht a heart touching acting by Guru Datt nd dialogues r jst mind blowing...Aatma trapt ho gai...👍👌","label":0}]