[{"review":"It's a truly great movie!! Watching it for the fourth time!! It portrays how women are suppressed and how women easily give up things for the sake of the person close to them. It shows how important it is to never underestimate your capacity. Even though Rani appears to be innocent she proves to be a very strong girl with very good intentions. The hardest of times in life can put you down but this movie shows that you should pick yourself up and brush off all the dust.... Keep moving and learn n ...MORE","label":0},{"review":"It's a truly great movie!! Watching it for the fourth time!! It portrays how women are suppressed and how women easily give up things for the sake of the person close to them. It shows how important it is to never underestimate your capacity. Even though Rani appears to be innocent she proves to be a very strong girl with very good intentions. The hardest of times in life can put you down but this movie shows that you should pick yourself up and brush off all the dust.... Keep moving and learn new experiences in life.... It will keep you happy.... Also never underestimate anyone... You never know when where and how they could influence or affect your life later on....","label":0},{"review":"This movie is inspiration for all girls who are going through what Rani went through. That induced feeling of being inferior when the significant other moves abroad and decides to call off the relationship, because he realized that we aren't his type now, can be positively used for self betterment. I have had to go through something similar, and I love what this movie portrayed. Self love and happiness, prioritizing self is more important than recognized.","label":0},{"review":"A true masterpiece by Kangana. This movie is a strong inspiration for all the girls , to live their lives  to the fullest,to seek  their own happiness. Most valuable message the movie gives is that you are not less than anybody in this world. You are able to achieve everything and there is nothing you can not do.  You don't need anyone to complete urself.This movie leaves an indelible mark on the minds of audience and  you can just feel her character . Hats off to the direction. Infact movie has ...MORE","label":0},{"review":"A true masterpiece by Kangana. This movie is a strong inspiration for all the girls , to live their lives  to the fullest,to seek  their own happiness. Most valuable message the movie gives is that you are not less than anybody in this world. You are able to achieve everything and there is nothing you can not do.  You don't need anyone to complete urself.This movie leaves an indelible mark on the minds of audience and  you can just feel her character . Hats off to the direction. Infact movie has uplifted the level of Indian cinema. Lots of love","label":0},{"review":"The sheer brilliance of the story and the character of Queen itself is more than enough to pull you towards it with might . Aforesaid , the rendering of Queen by Kangana Ranaut is so elegant , it seems as if she is among us .\n\nThis movie is beautiful to its core . The way Rani speaks , the humorous situations and the dialogues , the characters she meets , the transformation she undergoes , the anxiety , the love , the adventure , the realization ; everything is sheer beauty in this movie .\n\nBut  ...MORE","label":0},{"review":"The sheer brilliance of the story and the character of Queen itself is more than enough to pull you towards it with might . Aforesaid , the rendering of Queen by Kangana Ranaut is so elegant , it seems as if she is among us .\n\nThis movie is beautiful to its core . The way Rani speaks , the humorous situations and the dialogues , the characters she meets , the transformation she undergoes , the anxiety , the love , the adventure , the realization ; everything is sheer beauty in this movie .\n\nBut in my personal opinion the most important undertone of this movie was not the acknowledgement of a woman as a free soul .","label":0},{"review":"This movie is a lazy collection of cliched scenes thrown together with no decidable purpose other then to facilitate the edition of another song. It's called queen but has almost nothing too do with the other band mates. \n\nIt might as well have been the Freddie Mercury movie, which would have been fine if it didn't feel the need to constantly remind the audience of how special he is.\n\nIt fails as both an tribute to the band and a stand alone movie. Most the the gratification comes from 'recogniz ...MORE","label":0},{"review":"This movie is a lazy collection of cliched scenes thrown together with no decidable purpose other then to facilitate the edition of another song. It's called queen but has almost nothing too do with the other band mates. \n\nIt might as well have been the Freddie Mercury movie, which would have been fine if it didn't feel the need to constantly remind the audience of how special he is.\n\nIt fails as both an tribute to the band and a stand alone movie. Most the the gratification comes from 'recognizing the thing' like the opening of bohemian rhapsody  rather then a any genuinely well crafted moments.\n\nVerdict: Just go watch some old queen music videos instead.","label":0},{"review":"Watched this movie for the first time. It's nothing like the other usual movies. Kangna has done a wonderful job. \"When a woman is shy and not exposed much to the outside world, she is left at the mercy of the man. But, when she leaves her home and her safe circle and ventures into a new different world, she gets exposed to a lot of new things and understands that the world is not a small place.\" This is what the movie tries to convey which is a good message for all the shy women out there.","label":0},{"review":"I love Queen! This movie depicts life in almost every scene. So skillfully shot! Also, this movie is one to which everyone can relate, not marriage but heartbreaks which everyone in this world go through. Life is all about finding yourself and giving yourself happiness and love which Rani did in the end. Thankyou for such an awesome movie. 💙","label":0},{"review":"At many points of the story, you'll find things being very relative. Everytime, in the plot there is a complete mess, and thats why I love it. It sways down everything. Brilliantly directed film, apt background musics, songs and plays. The plot too is emotional yet strong and interesting. The potrayal of friendship is also commendable. I liked the movie very much.","label":0},{"review":"Lovely, comedy related movie. It's touches my heart.. kangana played so versatile character and she is just awesome.. how you could recover your most painful break up, kangana shows it..every girls can feel it. It's not just a movie, it's a real fact in our life.. I will give 200 out of 100..👌","label":0},{"review":"The best movie I've seen in years and Malek deserves an Oscar for his Freddie Mercury portrayal but every actor looks very much like the person they are portraying it's uncanny how much and watch the Live Aid piece of the film then watch the actual Live Aid Queen performance and it's amazing just how every detail is correct down to the drinks on the Piano,Amazing movie 5 Stars.","label":0},{"review":"This is one of my favourite movie based on female character.After watching this movie I became the huge fan of Kangana Ranaut .She is  my favourite actess. And her acting in the movie was superb .\n     She played her part very well and I loved  that typical Indian girl in \" The movie \" and her friends.","label":0},{"review":"I love this film because there  ar lots of women how sacrifice their life for the sake  of the family  and I think ever girls have there own happiness in there life so . let her enjoy her life I love this film very much it touched on my heart as awomen I also what to live like the way which rani lived","label":0},{"review":"A movie that changes your life completely. Great way of portraying that self love is the most important thing which we fail to implement even when we know it. So let us remind ourselves what is important and prioritise ourselves. 🥂","label":0},{"review":"One of the best movie i have never never seen in my life. Storyline direction was very good of this movie. Actors acting were real good specially kangana rannuats. Nice movie. Songs were real good. London ghum ke ta.","label":0},{"review":"Not a better band from the 70s to honor with a movie. Unless you actually seen them which I did a few times you couldnt grasp just how powerful of a stage presence Freddie was. From his flawless voice to Brians unique guitar sound a band whos songs will live on forever.","label":0},{"review":"This is best Hindi movie I have seen in current time. Kangana Rocks. She is the best actress of present time. No other actress comes close to her acting. I wish her all the best for her future movies. She single handedly carried *Simran*. All the best for *Manikarnika*","label":0},{"review":"One of the best bollywood movies i have watched so far that uplifts women and inspires them to discover themselves on their own terms against all social norms. Absolutely, one of the best.","label":0},{"review":"An amazing movie, it makes you feel like you're watching from within the heart of Rani itself. Each character is very cast in the movie. A pleasureto watch. Great performance by Kangana as always.","label":0},{"review":"Travelling cures depression, and friends keep you busy never leave you alone thinking about past.\n     The movie portrays  that in our country\nMen and society have defined narrow/limited role for women. \nAnyway, good movie worth watching.😀😀","label":0},{"review":"This movie  is outstanding.  Kagana  mam is the outstanding  actress . Story of this movi amazing  nice best outstanding  .l have  no words say for this movie.i much  like  this  movie.","label":0},{"review":"One Of The Best Movies Of Indian Film Industry! I Loved The Movie A Lot Even The Songs! Literally One Of The Movies That Goes To 'Must Watch' Movie List! Amazing Movie And Story Line ❤️","label":0},{"review":"The best movie I have seen in a long time. The music was fantastic. The cast was excellent especially the lead. A must see film","label":0},{"review":"It is n excellent movie in senses of acting, direction, screenplay and obvious locations with a perfect editing. It is really rocking and can be seen lot of times, it' rocking .","label":0},{"review":"I can't explain how much I love this movie !!!!\nThis is an inspiration movie for society \nI love each and every Sean of this movie \nEverything is perfect \nThank you so much for your efforts!!!","label":0},{"review":"Kangana is just best,superb, here natural acting hairstyle, Simplicity, non voilance suits here well,can watch the movie countless times never felt bore,also feeling proud of India and kangana the queen.","label":0}]