[{"review":"A film which is lush in appearance and star cast, but very malnourished in script and direction. SRK plays a dual role and gives full justice to it. Kareena too has done a great job. The place where Ra One fails, is a good story. It is absolutely baseless and meaningless. The direction is done in bits and scrambles, and makes the audience feel miserable after its screeentimw. The only saving grace of the film, are its thunderous song tracks and a lively performance exhibited by the lead cast, wi ...MORE","label":0},{"review":"A film which is lush in appearance and star cast, but very malnourished in script and direction. SRK plays a dual role and gives full justice to it. Kareena too has done a great job. The place where Ra One fails, is a good story. It is absolutely baseless and meaningless. The direction is done in bits and scrambles, and makes the audience feel miserable after its screeentimw. The only saving grace of the film, are its thunderous song tracks and a lively performance exhibited by the lead cast, with a special mention to the dubious performance of Kareena. Although her chemistry with SRK, is not being given enough light, she does manage to save the film’s fragile story with her eccentricity of dance and diversity of emotions, making the sluggish film , a little more interesting to watch and enjoy. I give it 2/5.","label":0},{"review":"For all those critics and people who didn't like this movie, you all are illiterate. When a foreign movie with same concept and execution comes out, these people jump right in to criticize Bollywood for not attempting such movies. And when these kind of movies do get made you all say it was bad. I mean come on. I know the story wasn't anything sort of spectacular but you've got to admit, it was one hell of an entertainer.\nAlso, I wanna say to all people, please don't judge a movie by it's review ...MORE","label":0},{"review":"For all those critics and people who didn't like this movie, you all are illiterate. When a foreign movie with same concept and execution comes out, these people jump right in to criticize Bollywood for not attempting such movies. And when these kind of movies do get made you all say it was bad. I mean come on. I know the story wasn't anything sort of spectacular but you've got to admit, it was one hell of an entertainer.\nAlso, I wanna say to all people, please don't judge a movie by it's reviews only. These critics just like those so called 'art films'. I think they are biased. Commercial cinema never gets praise from them.\nAnd just to make it clear, I'm a cinema lover. I like all genres of movies. I also watch indie movies too. But all movies don't need to have just 'story'. Some have to be entertainer. And I appreciate it. There are a lot of aspects to cinema and one should notice it all not just story. That's all I wanna say.","label":0},{"review":"I don't wanna say much i personally very much like this movie,and i appreciate the fact that they made this kind of sci fi movie i bollywood.this movie is a masterpiece, i know it is not perfect and a little lose at some points but it is a sci fi movie, what do you expect?\nHollywood is been doing this for such a long lime and everyone likes that ,so why not give bollywood a chance?\nThe only reason this film crashed cause this movie was way ahead of it's time in india, but now india thrives for s ...MORE","label":0},{"review":"I don't wanna say much i personally very much like this movie,and i appreciate the fact that they made this kind of sci fi movie i bollywood.this movie is a masterpiece, i know it is not perfect and a little lose at some points but it is a sci fi movie, what do you expect?\nHollywood is been doing this for such a long lime and everyone likes that ,so why not give bollywood a chance?\nThe only reason this film crashed cause this movie was way ahead of it's time in india, but now india thrives for such movies\nKyunki sb wo chutye pyaar wali stories se bored ho chuke hain\nI don't know when we are gonna get similar movies in bollywood like this again","label":0},{"review":"I think,This movie was released on wrong date. Because that time people do not understand the value of graphics. it should be released in 2019-20. Because it is based on action ,science.at that time few people know about the science fiction movies.now they are developed they didn’t know  that ra one is the wonderful movie.\n\nI love it very much and i have seen it more than 200 times ❤❤❤ \n\n\nNow i am waiting for the 2nd part.i hope that film maker will understand our excitement and give again new t ...MORE","label":0},{"review":"I think,This movie was released on wrong date. Because that time people do not understand the value of graphics. it should be released in 2019-20. Because it is based on action ,science.at that time few people know about the science fiction movies.now they are developed they didn’t know  that ra one is the wonderful movie.\n\nI love it very much and i have seen it more than 200 times ❤❤❤ \n\n\nNow i am waiting for the 2nd part.i hope that film maker will understand our excitement and give again new twist to us in this movie \n\nEverybody knows that g one was ready for the next part in the last of the movie \n\n❤❤❤❤❤❤❤\n\n\nI am waiting for the next part... please vote for next part👍","label":0},{"review":"Seriously, 4.8, It deserve at least 7. or 6plus, People don't respect there own peoples. Ra-one is the best movie. And SRK always tried to do something new but indian public only wants and accepted from Bollywood is only Bollywood masala, item song and romance. Even Ra-one movies grafics are lot better than bahubali. In bahubali there are so many flaws. I am from that department so i knew.","label":0},{"review":"People those not liked this movie are really illitrate...  If they not like this movie then why they are thhe fans of other comic universes....\n\nThey should love this movie belong it's belon to our indian costumes and those power given to raone are so real one , and may be designed real \n\nI request to make another movie of G- one\nBut the story should be good.....Plz..\nMay be the last story and origin not understand us so well.....But it can be made good in this\n\nAnd another is plz make a movie w ...MORE","label":0},{"review":"People those not liked this movie are really illitrate...  If they not like this movie then why they are thhe fans of other comic universes....\n\nThey should love this movie belong it's belon to our indian costumes and those power given to raone are so real one , and may be designed real \n\nI request to make another movie of G- one\nBut the story should be good.....Plz..\nMay be the last story and origin not understand us so well.....But it can be made good in this\n\nAnd another is plz make a movie with all indian superheros........And let india shine\n.....I have some of them....And new one","label":0},{"review":"Why don't people like RA One? \n\nNew scientific Concept: As far as Bollywood is concerned, there has been a lot of “Mutation” and “Time Travel”. But RA One delivers something new. It was the first time in Bollywood, that someone made a movie with “Wave-Particle duality” and “Conversion of energy into matter” as its core concepts. But this didn't strike with the audience very well. Why? Because they had problems understanding it.","label":0},{"review":"It's a  superb movie in context of indian cinema. SRK and his production company red chillies have achieved excellent achievements regarding improvement of indian cinema to Hollywood level.   Many many congrats for their effortless execution. Love u SRK sir.","label":0},{"review":"This is my favorite superhero movie. In this film stunts, songs and red chilli vfx are awesome. But sometime this movie boring. Srk sir is awesome and Kareena mam is good. Child artist play his role very well. Some people think this is flop but it is superhit movie.","label":0},{"review":"RA.ONE IS AN REAL BOLLYWOOD SUPERHERO FILM OF INDIA. THERE ARE NO BOLLYWOOD SUPERHERO FILMS EXCEPT FLYING JATT AND KRRISH SERIES WHICH HAS PERFECTLY OUTSTANDING STORY, CHARACTERS, SONG(CHAMMAK CHALLO) AND SCIENCE FICTION. RA.ONE WAS FULLY CAPABLE OF BECOMING SUPERHIT FILM OF 2011 BUT DUE TO STRANGE PEOPLE OF INDIA ITS POPULARITY GOT DESTROYED. OTHER WISE IT IS OUT OF GLITCHES","label":0},{"review":"The Movie Jumaji was very well appreciated in which characters enter a video game  and broke Box office records.\nWhile in this movie, a character came out of the game in real life and this Film was a major flop.\nHats off! to logic!!\nP.s:- Happy Birthday King Khan","label":0},{"review":"I watched this movie in my childhood with my friends. I was stunned by the quality of VFX and action scenes. It was ahead of its time. Thank you SRK for stepping ahead and doing something that nobody else could dare to do at that time. I give this movie 8.5/10.","label":0},{"review":"I actually think that if Ra.one is only hit in the blockbuster movie but in my Heart it is my biggest superhit movie for me as I like it very much \" if no one like ra.one Film I am only the people who always like this Film very much \"  we are waiting for sequel part I. E  Ra.one2 love you srk sir","label":0},{"review":"I totally loved this movie it had a very new and amazing concept with some great acting and emotions it's sad that people were finding reality stuffs in a superhero film and the same people would love a marvel film 😏. . it was great in cinematography and different from the regular films and deserved greater appreciation","label":0},{"review":"THis movie posessed the potenial to become  the best scripted conceptwise movie of 2011..but just because of narrow visioned n stupid indian tunnel minded people it failed to gain much recognition...had it been released on todays date this movie would definitely be a blockbuser coz afer seeing movies like robot 2.0 wih such loose concept yet gaining popularity it can be assured that RA. ONE would have been n epic movie for todays generation!","label":0},{"review":"I will appreciate srk sir ...not only bcoz I'm his fan...but srk sir always try something new in the Bollywood...but some of them think that a movie like Spiderman and batman are good bcoz they are made in Hollywood and Ra one is disaster bcoz this is made by an Indian production company...\nRemember im not saying anything bad  about Hollywood movies.","label":0},{"review":"A movie which can be compared greatest Hollywood movies.❤😘😘.This movie can be considered as the one of the most underrated movie so fall time in Bollywood 😭🙁.Anyway after Raone movie no movies where ever made in Bollywood with this much of visual effects. \nMy rating :10/10😊","label":0},{"review":"Critics should be changed in #google please look into the reviews and make people's opinions also presented as a count in next to critics opinion , let the critics understand what people think ,\nThis movie is such a owsem movie 😍\n#Hateindiancritics","label":0},{"review":"Don't give a F about what others say, this is an awesome movie. there are some foolishness in the movie like soniya's scolding thesis etc a typical stereotype of depicting heroin as a adorable fool, other than that the story telling is fine","label":0},{"review":"This is the first time Shah rukh Khan play a Science fiction Super hero film! Good concept! Great action,comedy & Romance with Kareena Kapoor! Must watch this film!","label":0},{"review":"Nice movie. Storyline direction is good . Action thrilling romance felling was there in this movie. It's family drama movie. Songs were real good. Specially chamakh chalo by akin. Nice movie.","label":0},{"review":"At point of 2010 the Indian movie creating probably the best technological movie but it failed because of poor story content which includes like more focused on family entertainment movie. non-theless the movie seems really good VFX and fights.","label":0},{"review":"This movie is beat for kids.it is one of the best Indian science-fiction movie in all.the character of g-one is clearly best act fiction by shah rukh khan..best movie and superb train stunt by him it was like a real one done by SRK.","label":0},{"review":"I really luv this movie. You get to see comedy, romance and battle with modern technology. Really loved the script","label":0}]