[{"review":"The movie which have narratives on the same line as Mahabharata. The indectical characters and thier struggles for power. The director Prakash Jha has done commendable job in bring mythology and facts on same page. The political rivalry between half brothers is treat to watch. Screenplay is good could have been tighter. The grandeur of the movie showing the cruel dark sides of political systems and the families who run them is easily relatable. The performance of star cast is what makes movie sp ...MORE","label":0},{"review":"The movie which have narratives on the same line as Mahabharata. The indectical characters and thier struggles for power. The director Prakash Jha has done commendable job in bring mythology and facts on same page. The political rivalry between half brothers is treat to watch. Screenplay is good could have been tighter. The grandeur of the movie showing the cruel dark sides of political systems and the families who run them is easily relatable. The performance of star cast is what makes movie specail.\n Manoj bajpayee is the stellar and is in top form as Verendra Pratap, Arjun Rampal is sincere in his performance, Nana patekar prooves yet again why is the master of the craft. Ranbir kapoor shines equally and arguably brighter than rest as he nails the role of shrewd kingmaker successfully. Katrina is good too.","label":0},{"review":"Best Political Drama made till date, \nEveryone has acted really well and this time Katrina kaif too acted in a film.. Of course Nana sir is outstanding in the film, followed by Ajay sir,Manoj Sir, Arjun Sir...\nRanbir Kapoor best Performer and exceptional actor, not even for a while it looks that his performance was overshadowed by anyone.. \nThe performance he has given in really early stage of his carrier is commendable.. Waiting for Sanju..","label":0},{"review":"It's entertaining movie. But Samar Pratap is so copied from Micheal Corleone. And car bomb scene also looks like the scene from Godfather. Basically Rajneeti is a fusion of Mahabharata,Gandhi family and Godfather.Characters could have been more layered. Manoj Bajpaye was as usual amazing. But overall acting was so average and typical. Sometimes so melodramatic.","label":0},{"review":"Amazing movie. Storyline direction was very good. Actors acting were real good. They have given us true message that achieve success in politics career is not easy and it's a risk job. Enemies problems is there in politics career. It's better to not get involve in politics. Nice movie. In our country politician are curropted and selfish.","label":0},{"review":"Not well written script... Tried to create a modernized version of Mahabharata.. I feel they just tried to make it look similar... Too much melodrama... slow screenplay... Maniratnam's Thalapathy was also on same grounds but he perfectly blended the script with Mahabharata.. Except for the cast there is nothing big about this movie","label":0},{"review":"The movie is unsatisfactory from its logical conclusion becz it shows only the power of the ruling elites who only holds power. In many instances here only ranbhir Kapoor role had been given prominent if though he had no political experience. The role of Ajay Devgun as a leader of Dalits and lower caste is shown unpotent and lastly he could have killed Ranveer Kapoor when ranveer made planned to kill him. He allowed to be killed by ranvir which is unlogical.","label":0},{"review":"The movie was outstanding. Perfect casting, perfectly acted and direction was also good. Ranbir, nana, Manoj, Arjun and kat were tremendous and ajay was as usual good. I bet you will enjoy. This is the best political drama movie. Go and watch.","label":0},{"review":"The message sent through the film is again same that the political leaders understand the politics as their father's property, I mean baap mar Gaya to beta adhyaksh,Pati mar Gaya to patni.....toh baki  leaders kya Z** marte hai party mein...Lead role should have been performed by Ajay Devgan rather than Ranbir Kapoor....Nana Patekar sir's role is also restricted,his personality demands for more dominant role....poor story telling overall inspite of such a big duration...casting is also not that  ...MORE","label":0},{"review":"The message sent through the film is again same that the political leaders understand the politics as their father's property, I mean baap mar Gaya to beta adhyaksh,Pati mar Gaya to patni.....toh baki  leaders kya Z** marte hai party mein...Lead role should have been performed by Ajay Devgan rather than Ranbir Kapoor....Nana Patekar sir's role is also restricted,his personality demands for more dominant role....poor story telling overall inspite of such a big duration...casting is also not that good...","label":0},{"review":"The film has great inspirations from Mahabharata.The characters are well written.But when acting is concerned Ranbir,Ajay,Nana patekar are the main highlight of this film. Ranbir in such a early stage of his career have dominated in the film, in some scenes he even overshadowed his seniors also.","label":0},{"review":"Raajneeti is so good 🎥  I love it so much and I 😍 rabbit kapoor too. Politics is very controversial topic of all times. Every politician came under same radar be it on construction, terror or scam.","label":0},{"review":"Wonderful movie about India's politics. Politics somehow circulated in family for ages. From family devide into two groups and war started between two's and ended killing eachother. I have little doubt, this movie somehow based on some true incident but what's this I'm still searching.","label":0},{"review":"In few words, a class art for politics lover and also suspense. Ranbir kapoor makes most of his role best of his role.And also none other than my fav Ajay devgan sir nailed the role.","label":0},{"review":"Blockbuster movie...ranbir you are fabulous..nana sir is perfect and arjun rampal sir iam big fan of your,katrina,ajay and manoj bajpayee done good job...such a wonderful political drama biggest hit..Sarah Thompson is cute..","label":0},{"review":"Rajneeti is an engaging and gripping political thriller, a perfect execution of The Godfather and Mahabharata, all actors habe done justice with their roles but Manoj Bajpeyi was the one who stole the entire show.","label":0},{"review":"Raajneeti is a good mix of modern-day Mahabharata and The Godfather, which turns out to be a pretty deadly combination. Its about a political family which has just lost its leader in the midst of the upcoming election","label":0},{"review":"one of the few political based movies of bollywood. it is a one time watch for the plot, some actors did a very good job in their roles while some are very bland. nothing very special in the cinematography and if it had been more acting eccentric this could beat 'Arakshan'.","label":0},{"review":"Amazing movie and it shows the real face of politics in india, but I think the end was not that great as compare to first half","label":0},{"review":"Amazing movie on political view...I think prakash ji is genius..And amazing act of ranbir, katrina ,arjun ,ajay dengan...And alll","label":0},{"review":"Great movie. Everyone was fabulous. I really hope there is a sequel for it.","label":0},{"review":"Extraordinary movie ..... hatsoff to Prakesh Jha Sir. for comparing each and every character in the movie with Mahabharata .... LVU u Ajay","label":0},{"review":"De best movie till date based on Indian politics superb dialogues \nWonderful movie \nEntertainment entertainment and entertainment","label":0},{"review":"First congratulations all the filim members. Most congratulations the filim director. He is also paority in filim back side song.","label":0},{"review":"Best movie for poltical lovers...watch this for Ajay devgan and nana patikar ...m","label":0},{"review":"This is a tremendous movie....nd shows a best gonna of thriller is Indian politics!","label":0},{"review":"Awesome movie about the politics, and the cast selection is noteworthy","label":0}]