[{"review":"The best Indian film in the last three decades. The movie has an enormous amount of darkness attached to it because of the novelty factor of the narrative. The expressions of Aishwarya Rai's face in the song \"Behne de\", Actor Vikram's characterization throughout the movie, the face off between the two lead male actor on a bridge depicted from each character's viewpoint are few notable mentions for this novel narrative. This is easily Abhishek Bachchan's best performance till date. These kinds of ...MORE","label":0},{"review":"The best Indian film in the last three decades. The movie has an enormous amount of darkness attached to it because of the novelty factor of the narrative. The expressions of Aishwarya Rai's face in the song \"Behne de\", Actor Vikram's characterization throughout the movie, the face off between the two lead male actor on a bridge depicted from each character's viewpoint are few notable mentions for this novel narrative. This is easily Abhishek Bachchan's best performance till date. These kinds of films will easily take Indian Cinema to greater heights. The movie is a must watch. I highly recommend it to everyone. Two thumbs way up.","label":0},{"review":"I'm not into this genre of movies but boy I loved it and not only the hindi version but also the Tamil version.  Aishwarya is phenomenal , Abhishek is amazing but Vikram is just the best.  In Tamil he plays the role of Veera or Veeraiya and he is so convincing both as SP and Veera. Music is awesome and the direction too. A must watch movie.","label":0},{"review":"Although not a comercial hit, I loved the movie. The cinematography, the characters and the intensity of love irs all awesome. I would rate all the actors top class in terms of their performance.  I feel the critics were too harse on this movie n killed it right after release","label":0},{"review":"I saw this movie in 2019 only because of all negative reviews attached with this movie… but after watching this movie I found it remarkably beautiful with good acting beautiful locations melodious songs and a brilliant story… Guys just ignore negative reviews and watch it… it won't disappoint you..","label":0},{"review":"This is the true story of rama ravana war when it balance the summary of this movie. I do not know how indians get this. Bcz according to indian point of view ravana is an evil man. Valmiki wrote the ramayanaya by adding fake facts to humiliate the great king ravana. I think this move make fair Judgment 💗","label":0},{"review":"Intense....... Dark...... One of best movie of Abhishek. Vikram and Aishwarya were amazing. To understand this type of genure u should have deep thoughts. Love this Masterpiece","label":0},{"review":"Mani Ratnam tries to depict invisible respect behind the Raavan-Sita \n relationship in a artistic way but it failed to reach up to the mark! But the music and location is too good in this film.","label":0},{"review":"hindi version is a freaking disaster in contrast to the Tamil version which is a masterpiece, Credit goes to the amazing acting skills of Vikram and aishwarya","label":0},{"review":"Don't know why this movie was flop? One of most wonderful movies I've ever watched. .......","label":0},{"review":"One of the movie in Indian cinema. Unbeatable songs, Natural Music, Best location & Acting is To Good","label":0},{"review":"Oh ending is very sorrow full I cried a lot but it as best movie I love it .","label":0},{"review":"Loved this movie so much... specially Abhishek was awesome ❤️","label":0},{"review":"when i was joined my college then this movie was release, i really appreciate the song RANJHA RANJHA.","label":0},{"review":"it's the super movie  i like this movie so much","label":0},{"review":"Vickram is versatile actor, who gave life to this film.","label":0},{"review":"Great story must watch....i lost in this movie","label":0},{"review":"One of abhishek best movie","label":0},{"review":"its a very good movie","label":0},{"review":"Good night friend sweet bream","label":0},{"review":"TAMIL RAVAN IS THE BEST...Chiyan outstanding...","label":0},{"review":"Nice Movie","label":0},{"review":"Amazing movie 😊 ❤️","label":0},{"review":"Epic movie 😍😍😍\nMust watch one. 😍","label":0},{"review":"The worse movie I ever seen😑","label":0},{"review":"Best movie.","label":0}]