[{"review":"Oh my gosh, this movie is sooo good! It’s full of romance, comedy, drama, and a little bit of action too. I love SRK so much, and he really outdid himself in this movie by being able to switch between simple Suri to bold Raj. Anushka’s acting was excellent too considering it was her debut film. This movie really made me feel warm inside because the love story is so simple. Nowadays, Bollywood romance movies are full of partying and sex, but this movie depicts love in a pure way. I highly recomme ...MORE","label":0},{"review":"Oh my gosh, this movie is sooo good! It’s full of romance, comedy, drama, and a little bit of action too. I love SRK so much, and he really outdid himself in this movie by being able to switch between simple Suri to bold Raj. Anushka’s acting was excellent too considering it was her debut film. This movie really made me feel warm inside because the love story is so simple. Nowadays, Bollywood romance movies are full of partying and sex, but this movie depicts love in a pure way. I highly recommend this movie!","label":0},{"review":"Its very good movie . Actors acting were very good . Shahrukh khan was looking like tmkocs tarrak mehta ka ooltah chashmah ptrakar popat lal pandey same make up and same specticals and same mustache and only he was carrying bag like tarrak mehta . Anushka sharma was behaving like anjali mehta giving tiffin box to shahrukh khan . I think this tmkoc has copied from tarak mehta ka ooltah chashma . Because same year released . Taarak mehta ka ooltah chashma started in 2008 28th july and rabne banadi ...MORE","label":0},{"review":"Its very good movie . Actors acting were very good . Shahrukh khan was looking like tmkocs tarrak mehta ka ooltah chashmah ptrakar popat lal pandey same make up and same specticals and same mustache and only he was carrying bag like tarrak mehta . Anushka sharma was behaving like anjali mehta giving tiffin box to shahrukh khan . I think this tmkoc has copied from tarak mehta ka ooltah chashma . Because same year released . Taarak mehta ka ooltah chashma started in 2008 28th july and rabne banadi. Jodi released in December 2008 . 11 years old movie. Still it's good movie","label":0},{"review":"Some movies are made to be watched 1000 times and still you find them fresh. It's of that kind. One of the best performance of Shahrukh Khan till date. The movie rotates around the ways  a husband try to bring his wife to normal lifestyle after a setback.The slow version of the song-'Tujhme Rab Dikhta Hai' sung by Shreya Ghoshal still stop my heartbeats.","label":0},{"review":"I think this movie is so relatable. An ordinary man with an extraordinary love story. Most of us are ordinary but with extraordinary hopes and dreams. Beautiful movie hope to see films that move people to love and honor like the lead character Suri. Definitely moved me 😊","label":0},{"review":"I may have watched it more than 20-30 times in 2017 only, and everytime I watch this movie I get something new about how to love. A story of ordinary man with no evil characters. Whenever I feel blue I just watch this movie. \nHats off to an ordinary man who teaches us to do extraordinary love, just by loving someone. No questions asked kind of love.","label":0},{"review":"I may have watched it more than 150 times up to 2018 and still waiting , and everytime I watch this movie I get something new about how to love. A story of ordinary man with no evil characters. Whenever I feel blue I just watch this movie. \nHats off to an ordinary man who teaches us to do extraordinary love, just by loving someone. No questions asked kind of love. The match made by God","label":0},{"review":"I thing this flim Publish to out. Because it happening to present time.  it flim too romantic so I love this film.Some movies are made to be watched 1000 times and still you find them fresh. It's of that kind. One of the best performance of Shahrukh Khan till date. The movie rotates around the ways  a husband try to bring his wife to normal lifestyle after a setback.","label":0},{"review":"One of the Best Movie In SRK'S Carrier . The acting of SRK as Surinder sahni just blew my mind .Top Notch Acting !! Melodious Songs .. the scene where SRK proposes Anushka on Terrace was brilliant . Golgappa competition was also funny . A must watch movie !!","label":0},{"review":"Some movies are meant to be cult classics , and it is one of a kind hindi cinema\"s probably magical movie of that period excellent script and srk was just spell bound ,\nAnd a Punjabi falvour to it made movie look so realistic \nIn 2018, have watched it more than 100 times since it's release , it should now be named now as \"Rab ne Banadi Classic \".","label":0},{"review":"It was excellent movie in the life . I like it very much.And the songs I like very much. And l like dancing Jodi class it was amazing. I like raj and he looks funny and he were goggles all time. And Raj and Taani are husband and wife . They came first number in dancing Jodi. \nFrom tanay.","label":0},{"review":"This movie was s amazing,as I  saw this movie with my family at home for the first time and I liked it so much.and if ur searching for more good movies then I have an option that movie is Baar Baar Dekho (eng translation-watch it again)it is a movie  giving u a lesson of you should spend time with Ur family not only Ur job.","label":0},{"review":"This movie shows what true love is ,and one famous and emotional dialogue of this movie ,Tujme rab dekhta hai means I have seen in God in u and I love u forever,Srk sir's acting was marvellous.I am from Hyderabad this shows his acting skills and pride of our Indian cinema to have our amazing actor.This movie can change the society about true love.","label":0},{"review":"Best movie ever. Surinder Sahani love towards Tani Ji shows the respect and importance  towards a woman and her feelings. I really wanted to be in love 😍 when ever I watch this 🤩","label":0},{"review":"I love thia movie\nActually I was not aware of love? \n But I knew actual meaning of love by watching this movie.....surinder was best....i was impressedby his acting and Dialogue\nI am a big fan of srk.....and i become his fan by watchingthis movie\nLove Rab ne bsna di jodi","label":0},{"review":"man ....! this flim is so so good , watched more than 100 times and still watching , its so fresh and new everytime when i watch the movie ,sharukhan and anuska acted so good , music was extra bonus to this lovely movie , songs were mindblowing and its a emotional beautiful love story .","label":0},{"review":"It is a very simple and beautiful love story we all know about srk's acting but Anushka did very well in her first movie I really enjoyed this movie and watched so many times well done Yashraj ji👍👍","label":0},{"review":"Movie is really awesome and acting of shahrukh and anushka is fabulous. I have watched this more than 15 times but still want to watch again and again. Whenever I feel bored I watch this movie it makes me happy.","label":0},{"review":"Rab ne bana di jodi is my favourite movie. Shahrukh khan and anushka sharma very good acting in the full movie. Very good romance and comedy scenes is very funny and nice.","label":0},{"review":"It is my evergreen  film I saw more than  50 times ,this is the best film ,that I ever saw an excellent message included in this film . which will be helpful for any generation there's no pain in real love  which touched me","label":0},{"review":"Just in love with this movie... Have no words to describe the feel you get while watching... Just outstanding... Loving it every bit... Truly refreshing love....","label":0},{"review":"One of my fav movie. Great ending that make me feel better. Bgm and songs were awesome. Ending make me to smile with a tears ❤❤❤","label":0},{"review":"I have watched it more than 60-70 times. but everytime it feels just as\nFresh and touching as it felt the first time. It reminds me of the beautiful bond between me and my husband.","label":0},{"review":"As always spectacular acting by King Khan as well as anushka sharma in her debut movie. Shows how an ordinary man can express his extraordinary love towards his wife..","label":0},{"review":"Shah rukh Khan is the soul and heart of this movie catching this movie single handedly on his shoulder with is evergreen and mind blowing acting....reason why he is called #superstar #romanticking ....love you shahrukh Khan 😚😙😘🤗","label":0},{"review":"So many time I watched this movie ❤️ I fall in love to this movie ❤️,This movie was legend. Hats off Team To give ya such a Good movie 👍.","label":0}]