[{"review":"The first part is much better than this. Only attraction is Sunny Leone nothing else.\n\nReview- As I said the only attraction is Sunny Leone. Otherwise it has too much of steamy scenes and lots of \"F\" words good for listening but overdose is not good for anything. Direction is not bad average, there is no hero the film totally depends on Sunny Leone and she does her work in which she is expert!!!\nConclusion- It is an above average movie but strictly for adults becoz of its content..","label":0},{"review":"I am a great fan of sunny leone fan. I want to marry her when i reach 21.","label":0},{"review":"It's an amazing movie of my favourite actress sunny and I luv it","label":0},{"review":"This is very good story and good cheracter and research character Dr.d I love this character","label":0},{"review":"Nice movie because story is good but some scenery are bad in this movie","label":0},{"review":"Replace sunny by beautiful mia malkova,stormy daniels sexiest","label":0},{"review":"I would recommend the movie for the best entertaining material and must watch just for  to enjoy fake shown or given entertainment.","label":0},{"review":"She's the best Sunny of Bollywood <3","label":0},{"review":"Not so good and not so bad also. 50-50%percent.","label":0},{"review":"Sandhya mridul  showed her  excellence again.","label":0},{"review":"Amazing Picture","label":0},{"review":"I love this movie","label":0},{"review":"It's is almost a total rip-off of 'The Conjuring'","label":0},{"review":"LOVE YOU SUNNY LEONE","label":0},{"review":"Nice movie","label":0},{"review":"Nice movie","label":0},{"review":"It's same as \"The conjuring\" movie even climax scene is copied.","label":0},{"review":"Very good performance","label":0},{"review":"Good morning vagharina bapesh","label":0},{"review":"Good, morning","label":0},{"review":"Very . good movie","label":0},{"review":"This movie super","label":0},{"review":"good acting in this movie sunny leone","label":0},{"review":"Very hot movie","label":0},{"review":"I like sunny Leone","label":0}]