[{"review":"This horror movie has gripping power. The movie starts with light moments and within sometime the stage is set to scare you. The story is clubbed with boyfriend trying to film the close moments with Ragini, the main character, on hidden cameras, not knowing that the place he is trying to do all this is haunted. The background sounds are effective and if one is watching this movie a bit alone can enjoy the horror scenes much better. \nThe movie has some move making scenes too, which are generally  ...MORE","label":0},{"review":"This horror movie has gripping power. The movie starts with light moments and within sometime the stage is set to scare you. The story is clubbed with boyfriend trying to film the close moments with Ragini, the main character, on hidden cameras, not knowing that the place he is trying to do all this is haunted. The background sounds are effective and if one is watching this movie a bit alone can enjoy the horror scenes much better. \nThe movie has some move making scenes too, which are generally expected with Indian horror movies.","label":0},{"review":"I really liked the movie very very much this movie is just awesome though the incidents of this movie are all not real but the spooky moments just will put you in a thrill and the sound effects are like heart attack almost. I really appreciate rajkummar rao and kainaz motivala cause these two are lead roles of the movie and kainaz performance is beyond outstanding mind-blowing job you are better ragini than new comer ragini(karishma Sharma).","label":0},{"review":"Mind bending representation. This movie is a revolution in Indian horror. Loved it !","label":0},{"review":"Movie is not much horror but if you watch alone you will enjoy some horror scene and this is real story so you should watch it .","label":0},{"review":"I love this movie because it's not a picture it's real story of Ragini","label":0},{"review":"horror atmosphere was tense and the story is good and acting is also good","label":0},{"review":"Real story ragini mms so I love to watch","label":0},{"review":"Ragini Mms So Nice Sexy Movies","label":0},{"review":"Some may thing this movie about love and other things","label":0},{"review":"All characters r very well nd nice movie..😃😃","label":0},{"review":"This is not very horrer movie,but still good movie","label":0},{"review":"Good Movie","label":0},{"review":"I love you and","label":0},{"review":"Mixed reviews. . Loved how rajkumar rao acted ..","label":0},{"review":"Nice movie","label":0},{"review":"Good intertenar","label":0},{"review":"I like this movie charttor are very cerious movement","label":0},{"review":"This is not so horrible .","label":0},{"review":"I like this movie that is very horror","label":0},{"review":"Waste of time.Garbage.","label":0},{"review":"Ilovesanileo","label":0},{"review":"I don't watch movie 🤔","label":0},{"review":"Not bad...","label":0},{"review":"It is to very","label":0},{"review":"What's the end","label":0}]