[{"review":"Most emotional movie of all-time .. and learning for those parents who don't even think of their children while separating!\nChildren don't deserve this thing .. they only want love and care from both mother and father ...\nGreat movie, awesome casting specially little boy..","label":0},{"review":"Its one of those movies that have been close to my heart. In this fast pacing world i always watch such movies to keep a emotional soul alive in myself.Perfect plot,Extra ordinary direction !","label":0},{"review":"Thanks to zee cinema anmol to telecast this beautiful movie today.. reminding me of the good time of bollywood.","label":0},{"review":"I couldn't stop crying when I first watched the movie. I want to watch it again but don't find it in the DVD shops. Can anybody help me watch the full movie online ?","label":0},{"review":"This is very nice movie,  emotions full and with good message,  I love Rahul in this movie,  he is so so so cute, and I want to play with him,  but it's impossible 🙁","label":0},{"review":"honestly i would say story is not unique but emotions explained everything.... love to watch again and again","label":0},{"review":"It has a good message for those couples who because of their intolerance and ill temper not only make their life hell but also make their children suffer throughout life.","label":0},{"review":"Rahul is cute boy when ever his movie comes on TV without looking full in don't leave the place and I can watch Rahul movie   many times","label":0},{"review":"Awesome movie,  Rahul is soooooo sweet.","label":0},{"review":"Rahul is very very very awesome movie","label":0},{"review":"Awesome movie","label":0},{"review":"I Like that sweet boy too much","label":0},{"review":"Very very nice movie","label":0},{"review":"Very nice movie","label":0},{"review":"I love you","label":0},{"review":"Lovely movie 😊😊","label":0},{"review":"Nice movie 😊😊","label":0},{"review":"Rahul is nice movi","label":0},{"review":"Watching it right now 😇","label":0},{"review":"Ilovestore,","label":0}]