[{"review":"It's a great movie ever made in Indian history. It reflects how a housewife tries to conceal her originality to maintain dignity of her husband. This movie doesn't make you weep but leaves a lot of heart touching memories and questions before the audience which make them feel sad. Acting skills of Ajay devgan and aishwarya ray is incredibly awesome. Just watch it.","label":0},{"review":"Its simple and beautiful . Just talking to each other. A beautiful tale of  love shown in expression and melodius calm soothing envt. Love it. One can only watch once to get a lasting effect . Second will ruin it","label":0},{"review":"Awesome movie. Story is really heart touching and brilliant performance by Ajay Devgan and  Aiswariya Rai. The theme poem of Gulzar Sir makes the movie more attractive. One of the fantastic movie of this industry.","label":0},{"review":"Really it made me stick  to the chair 4 full 2hrs..Awsum...Really..So touching...Movie only 1 heart break for the thing is ajay and aish would have been a good jodi s compared to both f dem in wrong hands .Which I personally believe","label":0},{"review":"The movie is full of melancholic emotions. Both the main characters are  in denial mode till the last few minutes of the movie. The backdrop of rain and antique furniture simply adds to it. A brilliant movie made memorable by out of skin acting by Aishwrya Rai and Ajay Devgan..","label":0},{"review":"One of the best movies that bolllywood has ever produced. It's a combination of a heart touching story perfect acting by Ajay Devgan and Aishwarya Ray wonderful direction that will leave you in tears .It will leave you in tears","label":0},{"review":"Its the most simple and wonderful movie i have ever watched.Some films don’t need spectacular sets or budget. Its the content and direction that makes raincoat a brilliant work","label":0},{"review":"It's a fabulous movie ever I seen, every character of the film is great, it shows us that humanity and kindness never die, if you won't but whatever situation in you are.","label":0},{"review":"This is such a nice movie,it reflects how a housewife try their level best to keep the dignity of her husband.Both of them have played the role so well and mainly Aishwarya.","label":0},{"review":"Wow, amazing.. this movie is a true gem.. Ash's acting is so flawless, just wish the movie could be a bit longer.","label":0},{"review":"This movie completely moved me. Both of the actors Ajay Devgan & Aishwarya Rai in their best perfomances. One of the greatest movie made in bollywood.","label":0},{"review":"Such a great story,we salute our Indian women who sacrifice their lives for their families and their love. Very heart touching.","label":0},{"review":"It really nice movie.The emotional scenes in the movie is really fabulous. Love aishwarya rai and ajay devgan acting.....","label":0},{"review":"What a movie! A masterpiece! A must watch! O.Henry's stories are so touching. The latest being Lootera. I am so overwhelmed.","label":0},{"review":"Only few movies made in the history of bollywood like raincoat. Powerful perfect performance by Ajay & Aishwarya.","label":0},{"review":"This film is a masterpiece. Every bit of the film is a piece of passionate art and never overdone.","label":0},{"review":"A masterpiece movie both actors were fabulous. It is so natural that it didn't feel like it was movie..👌👌👌","label":0},{"review":"A poetic composition by Rituparno Gosh. It lingers in the mind for very long. An adaptation of \"The Gift Of Magi\" by 'O Henry'.","label":0},{"review":"Yes it was nice experience for me.\nActing skills is awasom.....\nBest movie...","label":0},{"review":"A fantastic nimble of art which will leave u with a sense of desperate want for more yet with odd satisfaction.","label":0},{"review":"Just wow. These types of movies reflect the society. At the same time the sacred Indian love is portrayed there. 😘😘😘","label":0},{"review":"the best romantic movie of world-leading cinema if you believe realtey  if you ask god i am 100% believe god says i am right","label":0},{"review":"This is the best movie of entire Indian cinema every one just watch its awesome","label":0},{"review":"It is a beautiful film about true love. Love its simplicity.","label":0},{"review":"What a movie.\nI will never forget this.\nSalute Bollywood due to making this type of brilliant movie.\n*****","label":0}]