[{"review":"In my opinion it is the best movies which is ever created in the history of Bollywood industry. I have seen many Hollywood and Bollywood movies but it is the best movie.\nThe acting of girish kumar and shruti Hassan was an amazing. Sonu sood has do very good role. Vinod khanna is the key of the movie. At last I say that ramaiya vastavaiya is the best movie of Bollywood. I request to the Director Mr. Prabhu deva to make the second part of the movie please.","label":0},{"review":"One of my favourite movie.This movie is emotional funny heart touching and romantic.Shruti hassan is being absolutely magnificent in the movie.Girish Kumar has also done a great job,this movie was not able to gross at box office but still iys an amazing movie.Romantic movie lovers should definately watch it.Its a family movie and a good one too.\nShruti hassan has become my favourite actress","label":0},{"review":"One of my all type fav movie becoz of the pure and simple love story with beautiful songs... The star caste of the movie specially girish sir  nd shruti mam r perfect in their roles... Shruti mam looks so stunning in this movie in her salwar suits... Awwwsome movie yar just loved it","label":0},{"review":"What a mindshot movie.pat see 💓.you know very well well movie. unbelievable story.i saw the movie in 15 regularly.i can't believe that how i sow that movie many time.intersting.intersting.intersting______________$uper.thanks","label":0},{"review":"I don't know about original one but today I have seen this film , The Good Dinausur both of them are too much amazing and fun and also to mention very very emotional (P.S.  I am very sentiment al and emotional person)","label":0},{"review":"It is a very good movie. Girish Kumar as a rich family son he acted so innocently and politely  and Shruti Haasan also did very good acting .I appreciate their acting","label":0},{"review":"It is one of my favourite movies.....I love both the actor and actress. It's just lovely...I have watched it for many times but still watch it every week 😃😃😃😃😃","label":0},{"review":"so meticulously , very well woven movie. all artists have worked superbly well . Sood's performance is par excellence . best wishes","label":0},{"review":"In this film shruti mam and girish sir involved an important role which is like by the people. And one more thing we have to know that love is not done by rich people or poor people. In love we have never talk about rich or poor because love is love","label":0},{"review":"I just loved the movie fantastic work by actor and actress on the other hand it is funny as well as touching also.... I just loved it .....","label":0},{"review":"Loved The Role Of Shruti In The Movie.Hr Character Sona Is Educated,Smart & Sensitive,Unlike The Stereotypical Roles Of Heroines At That Tym(Who Intended TO\"ONLY LOVE THE DREAM MAN\").","label":0},{"review":"It was very cliched but it that is what is wanted by the targetted audience. It was a nice story and worth a watch.","label":0},{"review":"This movie is awesome; I love to watch it whenever i watch and since then Shruti ji is one of the my biggest fans...😚","label":0},{"review":"Best movies of the day.  Very fantastic and excellent acting and action.  I like this movie","label":0},{"review":"This is so nice movie story is too good ... In my opinion best movie of Shruti Hassan in Bolloywood","label":0},{"review":"In this movie gives us a so most beautiful song Jeene laga hoon sung by Atif Aslam & Shreya Ghoshal 😍😍😍","label":0},{"review":"I love this movie.  And I love you girish Kumar & Lovely cute beuti Shruti hassan ummmhaa","label":0},{"review":"Superb Movie.. Must Watch Great Acting By All characters... Fabulous  \n5/5","label":0},{"review":"possibly one of the most sweetest romantic movie from bollywood. \nLoved it, just loved it <3","label":0},{"review":"This is very beautiful move i can think my past amazing song I love this movie","label":0},{"review":"NYC.. I loved it.. Its an amazing chemistry of Girlish sir and shruti mam","label":0},{"review":"This Movie Made For Lovers I saw it first Time in 2013 I Said What A Movie😍😘","label":0},{"review":"Very good story of the film. Must watch movie. I loved it","label":0},{"review":"this movie made up a man for trust in love... it is very beautiful movie","label":0},{"review":"I love this movie very much\nThis is my favorite and best movie\nI love the actor and actress of this movie","label":0}]