[{"review":"Rang de basanti. I've no word for this magnum quintessence  project. What a movie? Really heart touching,  thrilled totally. Watched it 16 times only.Each time I'd cry & 4 only Rdb,A preparation needs before watching bcoz;  whenever I'd watch,  usually became very upset emotional and the impact for whole day.Big issue lt's not a movie for me but a living story- characters is just touching deeply 2 me; that type feelings comes to my inner mind spontaneously alws. Thus my own blood people became m ...MORE","label":0},{"review":"Rang de basanti. I've no word for this magnum quintessence  project. What a movie? Really heart touching,  thrilled totally. Watched it 16 times only.Each time I'd cry & 4 only Rdb,A preparation needs before watching bcoz;  whenever I'd watch,  usually became very upset emotional and the impact for whole day.Big issue lt's not a movie for me but a living story- characters is just touching deeply 2 me; that type feelings comes to my inner mind spontaneously alws. Thus my own blood people became martyrs Dj sukhi laxman ajay karan aslam . At any time if i thought abt Rdb, lmpossible 2 control tears-  so amazing!!                  A rebel and revolution in Aamir khan's ( Artist  cum social activist)  own way; that's why  he could manage this up most project very well. Greatest aamir sir. All my best wishes to siddharth sharman kunal madhavan atul soha wahedajee   .Nice performance. \nAnyway wonderful msg lies within-  \"Galat kaam nahin karenge, aur galat kaam ho raha hai to awaz uthaenge \".Now it's time to fight  against injustice corruption misdeal crimes & that must be possible by youth power only.Rdb provided additional supplements  to do such.Aamir Rakeysh discovered magnificently \"THE REALITY OF OUR OWN HOME \" .Thanks a lot to both the talented. All performers' powerful touch to bring the life to the character.welldone...musical track beautiful!!especially \"tu bin\" whenever  I listened it , l moved to the inner world  and about people who r in out of appearance already  and u have  to memories them and 2 fall sad water in their memorance. \nWhen I listened \"roobaroo\"  I could memorize  eternity of happiness  joy cheers helpful-spirits ;such things made me out of human .  I would like to dedicate my comment and salute chandrashekhar Azad  Bhagat singh  Rajguru Ramprasad bismil Ashfaqullah khan  Durga vohra  all Indian martyr soldiers with deep love respect.  A memorable favt dialogue  \"AB BHI JISKA KHOON NA KHAULA, KHOON  NAHIN WO PAANI HAI, JO DESH KE KAAM NA AAYE WO BEKAAR JAWAANI HAI\" \nSo frs Trust on me .it should be watched on 15.8,26.1, friendshipday  atleast .plz watch this Indian movie (patriotic)   & try as our best to wash the dirty things from our beautiful  nation and be a humanitarian. A  wonderful journey into real from reel. \nNice interesting story line. AAMIRKHAN sir acted beautifully  hearttouching  really. He gave life to DJ .All supportive artists did well. Pathshala dance is mind blowing  .  Rang De... means a generation awakens . Or paint me with the colour of spring.Dr Rakeysh omprakash mehra is well talented..This film is eye witness  of morality  , a stand point for the representative  of our section  . Very emotional movie with patriotic touch,  ended with tragic. I hope the young sensations  must be inspirabl  by watching this outstanding RDB . Mile stone in  Bollywood history.  Special  unique movie  forever  alws  d motivate  our present to next generation.. Thanks  the entire team of  Rdb . I feel very grateful  to be a part of RDB.  An appeal  - each Indian should watch it atleast  in life.   FANTASTIC  AMAZING  MUST-WATCH RANGDEBASANTI. I love Rang De Basanti  very much. I can watch it 10k times  with proud  and honour  having held my head as high.  True  Indian movie  with true Indian audiences.  Best of luck 👍👌\nMeanwhile,  more we watch this creation,  so more rebel, eternal peace 'd enter to our brain & the results  to be expected. JAYHIND. SATYAMEV JAYATE ..\n\nSarfaroshi ki tamanna  ab hamaare dil mein he dekhna  hai zor kitna  bajuye -ka til me hai.\"MERA BHARAT MAHAAN \"","label":0},{"review":"Hands down the best movie ever made in Indian history. I like this even better than 3 Idiots. Flawless direction, acting and music scores for the film. A must watch for every Bharatiya. This movie actually impacted my life in a positive way and has the capacity to do the same for all the youngblood of our nation. It instilled patriotism in me, which I had always lacked prior to watching this movie. I only wish Bollywood came up with more movies like this one. \n\nSome of the memorable, unforgettab ...MORE","label":0},{"review":"Hands down the best movie ever made in Indian history. I like this even better than 3 Idiots. Flawless direction, acting and music scores for the film. A must watch for every Bharatiya. This movie actually impacted my life in a positive way and has the capacity to do the same for all the youngblood of our nation. It instilled patriotism in me, which I had always lacked prior to watching this movie. I only wish Bollywood came up with more movies like this one. \n\nSome of the memorable, unforgettable quotes from the film (sort of spoiler alert for those who haven't seen it yet, but I can't help it) - \n\n--- Koi bhi Desh perfect nahi hota.. use perfect banana padta hai \n--- Ab bhi jiska khoon na khaula khoon nahi woh paani hai.. Jo Desh ke kaam na aaye woh bekar jawani hai\n--- Zindagi jeene ke bas do hi tarike hai.. Ek, jo ho raha hai hone do, bardasht karte jao ya fir zimmedari uthao use badalne ki\n\nP.S. Watched this again and writing this review on the day after the Pulwama terror attacks. Martyrs never die. Utmost Respect to their souls. No virtue, absolutely no virtue is greater than courage/bravery. Salute to the bravehearts. \n\n'Kuch kar guzarne ko khoon chala'. \n\nJai Hind !!!!!! \nJai Bharat Mata !!!!!! 🇮🇳","label":0},{"review":"One of the finest movies of Indian cinema! Excellent story, screenplay, directing.This one carries a strong social message! Comic timing is also perfect & will get you the current state of India!A very good film showing the enthusiasm and youthfulness of Indians Despite from that it conveys a very strong message to the youth about the present situation of our nation. The film that I consider should be re-released because I  believe that it may bring many changes to our youth. The movie shows str ...MORE","label":0},{"review":"One of the finest movies of Indian cinema! Excellent story, screenplay, directing.This one carries a strong social message! Comic timing is also perfect & will get you the current state of India!A very good film showing the enthusiasm and youthfulness of Indians Despite from that it conveys a very strong message to the youth about the present situation of our nation. The film that I consider should be re-released because I  believe that it may bring many changes to our youth. The movie shows strong bond of friendship between the friends. Not only Aamir Khan but all have done to their best versions. The turning point comes when one of their close friend dies. Then revolutionary thought came to their mind of doing something so that thousands of such cases comes to end for Innocent people and of course they had to start for it. It also shows how irresponsible the government is. The story has pathetic end depicting the documentary on which they were working started become realistic.All in all the movie is a must watch for every citizen.","label":0},{"review":"There are only a handful of Hindi movies, unfortunately, that leave an impact as profound and deep as Rang De Basanti. Yes, the movie does have it's technical flaws like poor editing and a few unnecessary scenes here and there. But the rest of the movie more than covers for it. From the flawless integration of the Indian freedom fighters like Bhagat Singh and Chandrashekhar Azad, to the main plot point of the movie, that is, the MiG plane incidents and the corrupt government, the entire story wa ...MORE","label":0},{"review":"There are only a handful of Hindi movies, unfortunately, that leave an impact as profound and deep as Rang De Basanti. Yes, the movie does have it's technical flaws like poor editing and a few unnecessary scenes here and there. But the rest of the movie more than covers for it. From the flawless integration of the Indian freedom fighters like Bhagat Singh and Chandrashekhar Azad, to the main plot point of the movie, that is, the MiG plane incidents and the corrupt government, the entire story was so well thought of.\nDon't even get me started on the actinig performances in this movie. Of course the veterans like Anupam Kher, Kirron Kher and Om Puri were masterful. Aamir Khan, while being the most experienced and bigger in stardom than the rest of the cast, knows that he is but one cog in the wheel of this movie, and thus does not steal the spolight for himself and instead lets the story move forward. But the focus here is on the rest of the ensemble. This movie introduces two new faces - Kunal Kapoor and Siddharth Suryanarayan, although the latter was an established Tamil and Telugu actor. Even the newbies have done such a wonderful job. Also, Alice Patten, who plays an English director in this movie, plays the character so masterfully, again keeping her self-interests away and helping the bigger picture move forward.\nThe message in this movie is so clearly branded in the mind that the audience is left wondering whether they are really as good and patriotic as they put on to be.\nOverall, this movie is certainly a benchmark in Bollywood, one which can only be reached or exceeded by thinkers like Aamir and others.","label":0},{"review":"I watched this movie last night. And i found that it is one of the masterpiece by Rakeysh Omprakash Mehra. It shows strong bond of friendship between the friends. Not only Aamir Khan but all have done to their best versions. The turning point comes when one of their close friend dies. Then revolutionary thought came to their mind of doing something so that thousands of such cases comes to end for Innocent people and of course they had to start for it. It also shows how irresponsible the governme ...MORE","label":0},{"review":"I watched this movie last night. And i found that it is one of the masterpiece by Rakeysh Omprakash Mehra. It shows strong bond of friendship between the friends. Not only Aamir Khan but all have done to their best versions. The turning point comes when one of their close friend dies. Then revolutionary thought came to their mind of doing something so that thousands of such cases comes to end for Innocent people and of course they had to start for it. It also shows how irresponsible the government is. The story has pathetic end depicting the documentary on which they were working started become realistic.All in all the movie is a must watch for every citizen.","label":0},{"review":"When you are done with your school. You are on your way to meet the new world of colleges and universities, big cities, big crime and problems then you need to reflect on what is wrong with us and this country. This movie gives you an idea on which the youth need to think, act and react not only on WhatsApp and Facebook but on roads and streets with full measure and strength. When I'm writing this post I'm in a protest. Today is 17 march and Delhi south area Vasant Vihar is blocked by students.  ...MORE","label":0},{"review":"When you are done with your school. You are on your way to meet the new world of colleges and universities, big cities, big crime and problems then you need to reflect on what is wrong with us and this country. This movie gives you an idea on which the youth need to think, act and react not only on WhatsApp and Facebook but on roads and streets with full measure and strength. When I'm writing this post I'm in a protest. Today is 17 march and Delhi south area Vasant Vihar is blocked by students. I'm one of them. I must say start early, with what you have because complaining doesn't help. This movie is a must watch, every year and everytime you find yourself helpless Infront of this mighty fascist government. Remember, love for the country always unconditionally but love for the government  only when it deserves it  Jai Hind.","label":0},{"review":"This is the one movie I watch every year on 15.08, to remind myself that India's good and bad, is all reflected in me, that I can't just be an armchair theorist, or run away from the fact of being responsible for the direction my motherland will take, that it's future is shaped by my actions, though I be one amongst a billion...\nSuperb acting, tight script, great music - but beyond everything else, this movie has a soul, and it will leave you wondering exactly what you've done with your life so  ...MORE","label":0},{"review":"This is the one movie I watch every year on 15.08, to remind myself that India's good and bad, is all reflected in me, that I can't just be an armchair theorist, or run away from the fact of being responsible for the direction my motherland will take, that it's future is shaped by my actions, though I be one amongst a billion...\nSuperb acting, tight script, great music - but beyond everything else, this movie has a soul, and it will leave you wondering exactly what you've done with your life so far, and just what you've given back. It's a story of angst and joy, the promise of tomorrow that only youth brings, and the cynicism that plagues each successive generation of Indians. It is also ad deeply patriotic tale of giving back, and what being Indian really means.","label":0},{"review":"Very nice khangressi Khalistani movie, very good, (sarcasm of course),, these people will protest for and protect whom,it is readily apparent from this movie. \ni could never understand why everyone would love this movie, but not even for one second i could ever appreciate the movie nor its songs, wow, dont watch this Ghatia movie its ek dumm bakwas, there is no story traectory, absolutely lazy writing, and fake solidarity what a pile of trash, i never appreciated it then i find it more revolting ...MORE","label":0},{"review":"Very nice khangressi Khalistani movie, very good, (sarcasm of course),, these people will protest for and protect whom,it is readily apparent from this movie. \ni could never understand why everyone would love this movie, but not even for one second i could ever appreciate the movie nor its songs, wow, dont watch this Ghatia movie its ek dumm bakwas, there is no story traectory, absolutely lazy writing, and fake solidarity what a pile of trash, i never appreciated it then i find it more revolting now.\nmaybe the  bri ish would like to make a movie where james bond saves the day all the time, one idea you limeys how about james bond in the Bri ish Raj, hmm would that not be epic, XD LOLOLOLOLOL","label":0},{"review":"Rang de Basanti is one of my most favourite movie it was a really nice movie. There was comedy drama action and emotional.  Songs were very good . They have given right message that our Indian government is not doing  anything. They are just giving big big speech in steg  and having luxury life. Nice movie and they have given right message.,","label":0},{"review":"Some films are must watch for all because of their good plots, social messages and others. But there exist very few films that give you the real inner peace of mind. Rang De Basanti is that kind of movie. It was in my laptop for months, but I was ignoring it. But when I finally watched it, trust me, I was overwhelmed and astonished. I really loved the performances of Aamir Khan, Siddharth, and Sharman Joshi.  This movie is..  Epic..","label":0},{"review":"It's a heart touching movie \n''Rang De Basanti\" ..... It's all about the feelings towards your Great pilot friend ...who is desperate towards the country Actually ...And He dies because of the bed Quality of parts of the plane ....And The corrupt politicians... ministers was saying after great pilot's death that he is not a good pilot not a trained pilot ...and it's just to overcome his (the politicians) corruptions ... They are just spoil his sacrifice his love towards the country ... They sham ...MORE","label":0},{"review":"It's a heart touching movie \n''Rang De Basanti\" ..... It's all about the feelings towards your Great pilot friend ...who is desperate towards the country Actually ...And He dies because of the bed Quality of parts of the plane ....And The corrupt politicians... ministers was saying after great pilot's death that he is not a good pilot not a trained pilot ...and it's just to overcome his (the politicians) corruptions ... They are just spoil his sacrifice his love towards the country ... They shamed it...\nAnd .. The pilot's friends decided for justice...And for this they shots the corrupt minister ...And then they broadcast this news to all over the country with the help of Radio....And told that ...\"No country is perfect ...But we have to make it perfect \"...\"What is country .. What is government ..'WE' ..We all are corrupt ..We have to change ourselves .. That's the way We'll make our country ..As a perfect country\"..","label":0},{"review":"Movie rightly depicts what this country is in need right now. Where the youth should be focusing on, the fire and rage inside them should be for what cause. This movie from ROM is a genius who dared enough to show the real Patriotic heroes who actually got us freedom.A must and should watch for all generations.AR Rehman masterwork and entire team have given their best.","label":0},{"review":"One of the best movie of all time... A movie which moved millions of people across the globe. It's not a movie, it's an experience in itself. Screenplay of the movie is absolutely brilliant. Music.... Given by AR Rahman and that is enough. The story is provoking and revolves around the six youths. It's just so amazing how this movie connected to the chords of the youths. If you want to feel and know what patriotism is, watch this movie... Life is incomplete without watching this movie...","label":0},{"review":"Just watched Rang De Basanti and i don't have words to tell how great was that....\n10/10. The way they show the period of Bhagat singh and make it relatable to the present is just amazing. This movie has great tunes , i literally love all of them.","label":0},{"review":"A very good film showimg the enthusiasm and youthfulness of indians ...despite from that it conveys a very strong message to the youth about pur country and the present situation of our nation...the film that i consider should be re-released coz i beilieve that it may bring many changes to our youth...the writer may had a vision coz as a youth i can relate the film with the present condition now i am living in .. but at past india was not such a country it had give importance and respect to all  ...MORE","label":0},{"review":"A very good film showimg the enthusiasm and youthfulness of indians ...despite from that it conveys a very strong message to the youth about pur country and the present situation of our nation...the film that i consider should be re-released coz i beilieve that it may bring many changes to our youth...the writer may had a vision coz as a youth i can relate the film with the present condition now i am living in .. but at past india was not such a country it had give importance and respect to all religion but now things have changed wake up youth we should see humans as humans not on their religion, not on their money , not on their abilities but on your will ...\nWake up YOUTH....","label":0},{"review":"I. Think the plot of the movie got off track as firstly they were not at all what they were at last .......and in reality govt. Or police cant shuffle a protest untill and unless it is harmful for society and if wanted justice they should have read some laws to find the correct way out...and lastly even in reality as in 26/11 attacks every possible thing was done to catch those terrorist live....but in movie they had order of shoot at sight even when aamir was surrendering......i yhink the direc ...MORE","label":0},{"review":"I. Think the plot of the movie got off track as firstly they were not at all what they were at last .......and in reality govt. Or police cant shuffle a protest untill and unless it is harmful for society and if wanted justice they should have read some laws to find the correct way out...and lastly even in reality as in 26/11 attacks every possible thing was done to catch those terrorist live....but in movie they had order of shoot at sight even when aamir was surrendering......i yhink the director of the movie should have read the norms and laws of our country before adding these illogical twists...😂","label":0},{"review":"Is there anyone still watching this movie in 2019 ? \nit is my all time favorite Hindi movie... Each & everyone is rocking on their roles....AR Rahman's music leading viewers to a crazy level... This movie giving a strong message to the contemporary politicians as well.","label":0},{"review":"\"Be the change you want to see in the world\" - A contemporary take on nationalism and patriotism. With amazing performances, the film will make you realise the importance of the sacrifices made by our freedom fighters. It isn't preachy but delivers its message in a hard but subtle way. Please watch this film if you get the opportunity.","label":0},{"review":"This movie is a landmark of bollywood cinema.The movie starts with a straightforward funny way but it gets a sharp turn after the interval and it's climax is so much thought provoking and realistic that it leaves a stress in heart.Besides amazing script the sound score is awesome.I think it's a must watch Hindi film.","label":0},{"review":"Again an Excellent Output of Actor's Hard Work. Hats Off to the Direction. Superb Movie. Mind blowing Songs. Inspiring Lesson. Motivation for Youngsters. One of the Best Movies Ever.","label":0},{"review":"One of the finest movies of Indian cinema! \nExcellent story, screenplay, directing.. This one carries a strong social message! Comic timing is also perfect & will get you the current state of india!","label":0},{"review":"we really need to hit our mind and think...be an ias officer, police, politician... there are only two type of people one who says this country can't do anything (KUCH NAHI HO SKTA IS DESH KA) or you take the responsibility to change this to do something better ...this movie has changed my life ...it's not necessary to show your patriotism when your are under british colony,there are some serious issues that is haunting our society go for them... always remember                                   ...MORE","label":0},{"review":"we really need to hit our mind and think...be an ias officer, police, politician... there are only two type of people one who says this country can't do anything (KUCH NAHI HO SKTA IS DESH KA) or you take the responsibility to change this to do something better ...this movie has changed my life ...it's not necessary to show your patriotism when your are under british colony,there are some serious issues that is haunting our society go for them... always remember                                      SATYAMEV JAYATE","label":0},{"review":"The true patriotic Indian movie which brings corruption to light and inspires the youth to contribute to solve problems and make our country better. Politicians divide us like the British to rule our mind and body and declare us anti national for fighting for truth. Bhakts will dislike this movie.","label":0},{"review":"One of the best Indian movies till date.....The subject told a story about our indian politics & How it's eating our country day by day, Anybody raises a voice it is suppressed through violence & framed...... A masterpiece by Om prakash mehra","label":0},{"review":"Well, when I watched the movie back in 2006 to me it was one of the best movies I had ever seen, I had goosebumps so I watched it again and again then I found out some areas of improvement in the movie but there is always room for improvement, you know, so it still is one of my all time favorite movies...","label":0}]