[{"review":"This movie got released in 2010. If you remember the political landscape of India at that time, you would understand the nature of the plot. Corruption and political aspirations are the two points this movie revolves around. \n\nWith actors like Amitabh and Paresh Rawal, the acting couldn't be an issue but other actors were flawless as well, and there were many of them. Ritesh Deshmukh played a good and important role.\n\nThough some of the things shown in the movie were not practical and were overd ...MORE","label":0},{"review":"This movie got released in 2010. If you remember the political landscape of India at that time, you would understand the nature of the plot. Corruption and political aspirations are the two points this movie revolves around. \n\nWith actors like Amitabh and Paresh Rawal, the acting couldn't be an issue but other actors were flawless as well, and there were many of them. Ritesh Deshmukh played a good and important role.\n\nThough some of the things shown in the movie were not practical and were overdramatized, it was, however, a good watch.","label":0},{"review":"I basically won't provide feedback but this movie was remarkable. Excellent performance by everyone. Sir Amitabh Bachan created another milestone. But what makes me really stunned was Mohnish behl act. He was amazing in his character. Hat's off Mohnish Sir.","label":0},{"review":"Now a days this is the real scenario of Politics in India. if one has to know the real situation behind  motive of a political party then one should have gone through the entire situation. if India have to build strong enough then every single man have to understand the situation in their own thought, not by the respective political parties, cause most of the work for their own interest. last of all regards to RamGopal ji !!","label":0},{"review":"Great movie ever seen!\nA lots of great thing in the movie,a fully time wasool movie.\nGreat work done by every actor.","label":0},{"review":"Very good movie. Story is very well written and star cast is also promising. I hope one day a news channel will broadcast the news unbiasly. In India every channel is controlled by some ministers.","label":0},{"review":"Very predictable but honest take on  idealism in journalism . Great  performances by all. Nobody will learn. Public bewakoof banti rahegi.","label":0},{"review":"This an interesting film which exposes the wrongdoings prevalent in the world of News Television Channels. Definitely worth watching.","label":0},{"review":"A great work done by every legendary actors...the whole concept was very nice.recomended to all to watch this movie","label":0},{"review":"I don't know if this film is cliche but, it takes us close enough to reality of relationship between politicians and media.\nWe are unknown of reality happening around us bcoz of corrupt media.","label":0},{"review":"This is the kind of cinema we need today. Excellent story with superb acting.  Must watch","label":0},{"review":"Very Nice movie...& i think this movie is inspire to many audience...on the serious matter of business between media & govn.","label":0},{"review":"I think it truely reflect the  (2014)political, media and business situation in india. I found rajkumar rao as a news anchor. Just surprised","label":0},{"review":"Good Movie. Liked the way Amitabh sir explained about daram in the movie.","label":0},{"review":"Must watch movie, great direction, performance, very very underrated ! Milestone acting by bachchan Saab, ritesh deshmukh, sudeep !","label":0},{"review":"The movie that shows us true picture of politics and media.\n\nEveryone is fooling the public.","label":0},{"review":"One of the best I have ever seen amazing performance 😍❤️","label":0},{"review":"A must watch.Excellent acting.Thought provoking","label":0},{"review":"Osm movie  ,this movie shows that truth politics","label":0},{"review":"It reminds me of Amit Shah And Narendra  Modi and other politicians who are ruining Hindustan.","label":0},{"review":"It's Really Truth..Business between with Politics & Media","label":0},{"review":"Gr8 msg with gr8 acting","label":0},{"review":"I will say only one word \"Superb\"","label":0},{"review":"Da best movie ever","label":0},{"review":"Awesome movie","label":0},{"review":"Great movie","label":0}]