[{"review":"First of all I don't review every movie which comes and goes. But this movie is having special place in my heart. \n\nSo why to watch-\n\n1- a lovestory that is so true and pure teaches, if you really love something or someone in your life you will get it irrespective of all the hurdles.\n\n2- it's also about friends who will be with you throughout your life sometimes creating troubles and sometimes helps you without you noticing it.\n\n3-if you really wanna know \"what a girl really wants\" then this mov ...MORE","label":0},{"review":"First of all I don't review every movie which comes and goes. But this movie is having special place in my heart. \n\nSo why to watch-\n\n1- a lovestory that is so true and pure teaches, if you really love something or someone in your life you will get it irrespective of all the hurdles.\n\n2- it's also about friends who will be with you throughout your life sometimes creating troubles and sometimes helps you without you noticing it.\n\n3-if you really wanna know \"what a girl really wants\" then this movie is a sure go.\n\n4- this movie will teach you, what not to do when in love.\n\n5- and yes watch it for the amazing performance of main leads as well as supporting cast like vrajesh hirjee for his amazing comic timing. You won't forget him easily.\n\n6- Amazing songs that you will be singing in your mind for so many times that you will forget the count.\n\n Bonus review-\n\nI really love the background music Everytime hero meets or sees heroin. . .just amazing. . .","label":0},{"review":"I was 11 years old when this movie was released.\n\nMovie gave me the engineering college feel in my childhood.\nHad the same feeling like Maddy when I broke up during my engineering.\nI still enjoy this movie. It reminds me how I completed my engineering and handled my love life simultaneously. And yes there were fights in my clg life. I acted like a hero. Movie had such impact on me. But seriously at some point of my clg life, I got treated as a college star.\nIts been 6 years now that I passed out ...MORE","label":0},{"review":"I was 11 years old when this movie was released.\n\nMovie gave me the engineering college feel in my childhood.\nHad the same feeling like Maddy when I broke up during my engineering.\nI still enjoy this movie. It reminds me how I completed my engineering and handled my love life simultaneously. And yes there were fights in my clg life. I acted like a hero. Movie had such impact on me. But seriously at some point of my clg life, I got treated as a college star.\nIts been 6 years now that I passed out from my clg. My college is still using my pictures in the brochure and advertisement and on display boards.\nRecently went for my college alumni meet. Current students recognised me as the college advertisement guy. That nostalgia was like whole RHTDM was going through my mind. Met my ex there. Recalled what we had. Things aren't like what u wish for. I was trying to recall how she looked 6 years ago. Now she's a mother. She became a woman now. Spending time with her made me go through my whole college life all over again. This reunion thing is quite emotional. Friends, teachers, Old places, classes made me feel like Maddy again. I was again a hero. I again acted like Maddy without regret. This time i collected all those in my pictures❤️","label":0},{"review":"It was the Day of 19 October,  a cyclone of love came in Bollywood named RHTDM. Still it is the most beautiful love story ever made. Its become a clut now among yooths. And see me 19 October 2001 to till now 28 August I have watched this movie 356 times but still it feels that I have to watch it again and again. Love U Maddy and Reena.","label":0},{"review":"I have seen this movie since my childhood days and i really loved it ....i never post publicly but i can't stop  myself from doing it now because i really want to tell the others that whoever hasn't seen it already trust me you are really gonna miss one of the best romantic  movies made by bollywood .....above all you will love R.madhavan's acting , his expressions and his eyes ......today after all this years i rewatched and seriously i will never hesitate watching it\nAgain .....and its songs a ...MORE","label":0},{"review":"I have seen this movie since my childhood days and i really loved it ....i never post publicly but i can't stop  myself from doing it now because i really want to tell the others that whoever hasn't seen it already trust me you are really gonna miss one of the best romantic  movies made by bollywood .....above all you will love R.madhavan's acting , his expressions and his eyes ......today after all this years i rewatched and seriously i will never hesitate watching it\nAgain .....and its songs are so touching and beautiful ......","label":0},{"review":"If you are confused as to whether you love some or not, just question yourself two things.\n1. whether you have the same passion, desire and will to do anything for her/him just like Maddy is until the arrival of Rajeev.\n2. Whether you have the same resoluteness, desperation and determination Maddy has to get her love back after the arrival of rajeev.\n\nThis just is one of the best films of all time whichever language and industry it might be. Madhavan just killed it in this movie.","label":0},{"review":"This is one of the evergreen movies 90s kids have ever noticed. It actually connects and relates you on a deeper emotional level. And personally like every 90s boys and girls out there, its my favourite. I think hardly any movie would ever come up with such love story and classic acting.","label":0},{"review":"Ohh my God....this is my all time favorite movie... don't know what is that thing in the movie that makes it full of intense love and emotion. It's so pure... feelings are beautifully expressed, best is the entry of heroine...Diya is so gracious...and off course mady... good support by saif as well... over all a lovely film that I can't resist watching...","label":0},{"review":"This movie will always be in my heart no matter how older i get no matter what situation would be.That rainy part where  Maddy (Madhavan) first time saw Shruti (Dia) dancing in rain with kids and flute starts epic romantic scene in bollywood movies i don't think any other scene can replace that masterpiece.","label":0},{"review":"Just Fantastic! Fantastic! Fantastic!\n\nThis movie gives me nostalgic feel every time i watch it...\nwhenever i watch this i feel my school time love story and my stupid friends who always helped me.","label":0},{"review":"This movie is masterpiece, really some movie is evergreen this is one of them.\nIn my opinion this one of the best movie in Indian cinema (In Romantic category).\nThis movie really \ndeservethis rating Like this 👉   5/5 ✨","label":0},{"review":"Superbb movie... I loved this film ❤️❤️😍Never forget this film in my life .... Heart touching ..👌👌👌👌 please make RHTDM 2 movie same story and cast.💐","label":0},{"review":"The best romantic movie, India has ever produced. No nude scene, no over-acting, no item song, no illogical fighting scene. A complete family movie! This type of movie comes once a decade.","label":0},{"review":"I am not a fan romantic movies but this was something exceptional it was jewel of early 2000s , A must watch bollywood movie !! With some great music","label":0},{"review":"How to impress a Girl learn by Maddy (R.Madhavan), who impress his dream girl in only 5 days with using only another Name, Rajiv. Most Romantic love story plz watch it once in your life.","label":0},{"review":"I love the movie RHTDM so much.it has special  place in my heart. Whenever the movie comes on tv I don't leave a second to watch...so much love this movie","label":0},{"review":"It's one of favorite film. R. Madhvan is too good. And songs on this film is truly malodious\nI love this move for ever.","label":0},{"review":"A heart touching story of all those who were in teenage I too was can not express the feel. Best movie of all-time.","label":0},{"review":"One of the best Love Story movie of all time. I have seen this film thousand of times but never get bored. TRULY MAGICAL","label":0},{"review":"This movie brings my old memories back. One of my friends is still using this movie tune for his phone ring. It's a really good movie.","label":0},{"review":"what a movie , i first see this movie in 2009 and after that whenever i feels sad then i watch this movie . this was so beautiful movie and chemistry between Reen and Madhavan was so nice.i watched this movie almost 123 times","label":0},{"review":"Superb movie. Always touches the inner soul of the body whenever I watch it. Reminds me my childhood.","label":0},{"review":"Superbbbbbb movie Love you diya\nWe should learn how to propose and love a girl from this movie\nR madhawan is best actor ever","label":0},{"review":"It is 15 june today and i watched this movie today and i must say this is one of the finest love story with some good humour and flirt lines... 3.5 🌟","label":0},{"review":"Films like these are  those ones which you will never forget and will love to watch on any given day.Cult film for a reason.","label":0},{"review":"Class movie...given that dia Mirza doesn't know acting, Maddy carried full movie on his shoulder and whataa performance....super duper hit for all seasons","label":0}]