[{"review":"Probably one of the best movies I've ever seen. Also I got vinny's number at the beginning, and weve been chatting it up about plans for the sequel. So stay tuned you Neil lovers, because hes coming back, and hes gonna be even zombier than before","label":0},{"review":"My pick for the worst zombie movie ever made. Pointless scenes, bad acting, bad effects, this movie has it all. A notably bad scene is the bachlor party. Why was it included in the movie? It added nothing to the plot. In fact nothing adds to the plot. There is no plot. \n\nRandom music plays inexplicably. There are long drawn out flashbacks to scenes that have been shown already. There are flashbacks to scenes that add nothing to the non existent plot. Nothing is resolved at the end and it all end ...MORE","label":0},{"review":"My pick for the worst zombie movie ever made. Pointless scenes, bad acting, bad effects, this movie has it all. A notably bad scene is the bachlor party. Why was it included in the movie? It added nothing to the plot. In fact nothing adds to the plot. There is no plot. \n\nRandom music plays inexplicably. There are long drawn out flashbacks to scenes that have been shown already. There are flashbacks to scenes that add nothing to the non existent plot. Nothing is resolved at the end and it all ends up being a complete waste of time. \n\nI imagine this monstrosity ending up on Mystery Science Theater 3000 one day. On a scale of 1/10 \"Rise of a Zombie\" gets a Z-. Absolute trash.","label":0},{"review":"Not very awesome !!!! (My rating would be 8 out of 10)\nBut a very nice movie, great work, good acting. \nAlthough the movie is a bit slow, the story is good. \nVery different from typical Hollywood zombie apocalypse movies.","label":0},{"review":"Probably the worst movie I've seen this year. And I watch trash so that's saying something! Such amazing commitment from me to get through to the end, wish I had THAT in my last relationship","label":0},{"review":"Worst zombie movie ever seen in my life. common man how you be so careless. your hand rotting and you are not doing anything to save yourself. just roaming around on a bicycle.","label":0}]