[{"review":"SIMPLE and ELEGANT but so EXQUISITE.. Its sad to see that such good movies are not well marketed enough for them to reach the masses. Many people are not even aware that such a splendid movie even exists. Given the slow pace of the movie, Kudos to Paresh Rawal for performing a difficult role like this with such finesse. Splendid work by Amit Rai for taking up a small but fundamental issue, and turning it into a thought provoking masterpiece. MUST WATCH!!","label":0},{"review":"Must watch movie. Slightly flawed potrayal of Indian Muslim,  don't think anyone hangs Jinnahs picture in their house. Indian muslims don't have any love or any emotion towards him , might even hate him to some extent. Also I wish there was such good unity in the muslim community. We do fight like cats in our mosques sometimes but everyone has a rotten fish don't we.\nOverall a nice movie.","label":0},{"review":"Very nice story. Sangam is merging of 3 rivers Ganga, Jamuna, Saraswati. Same like this it was a beautiful ending where people of all religion come together walking in unity with no differences.","label":0},{"review":"Very positive movie. It is as better as OMG but I dont know why very few people have seen this movie. Even I saw it today itself.","label":0},{"review":"I have recently seen this movie and it's one of the most important and beautiful screenplay and film. Absolutely fantastic","label":0},{"review":"One of the best movie of Indian Cinema..Stupendous performance by Paresh Rawal...Must watch if you really like a movie with a message and reality.","label":0},{"review":"So much of learning we get through this movie can't believe it's made in 2010 I felt I was living in the era after independence, it clearly shows the cause why our country is behind instead we could have been the most powerful country of this time which in past we were there before the invade of britishers.","label":0},{"review":"Road to Sangam is one of the hidden gems of Indian Cinema. I dont know how many people want to watch sensible movies like this but concept shown in movie is universal.","label":0},{"review":"Great movie....portrays how muslim community is being befooled on the name of religion by its own leaders...","label":0},{"review":"Very boring movie and acting . There are many good movies about Hindu Muslim unity.","label":0},{"review":"What a Beautiful and Pure film..This Is what we Need Our India to be..","label":0},{"review":"Great movie must watch if you think that you are Indian not Hindu Muslim Sikh or Christian","label":0},{"review":"One of the best films I have ever seen. Director saab jug jug jio.","label":0},{"review":"One of the best movie i have seen in my life","label":0},{"review":"It's great movie one of the best, it's must watch for everyone.","label":0},{"review":"Absolutely must watch movie ! It should be marketed enough to reach maximum audiences...","label":0},{"review":"Very inspiring movie... and it let me know more about Gandhiji and India","label":0},{"review":"It's a very nice movie, unfortunately these kind of sensitive movies are not much advertised properly to do very well in box office","label":0},{"review":"Nice movie....  I wish religious leaders of every community could watch this movie.....","label":0},{"review":"This is my best movie and it is best for national integration","label":0},{"review":"a very good movie. A must watch","label":0},{"review":"One of the best movie of its kind ever seen.","label":0},{"review":"What a fantastic movie.verygood acting by all actors.","label":0},{"review":"Very inspiring and simple movie... Everyone watch it...","label":0},{"review":"Awasome movie. These actors know how to tell story.","label":0}]