[{"review":"BEFORE READING MY REVIEW please note: \n\n\nMy opinion does and will not affect others' opinions in any way that would encourage people to dislike each others' opinions.\n\nThis review may include spoilers\n——————————————————————-\n\nRoadside Romeo:\n\n          I don't know about you other reviewers, but I loved this movie as a little kid. I was maybe 4 years old when I first saw this movie. The main reason why I love this movie so much is because of the songs. The songs are catchy, some are beautiful/pe ...MORE","label":0},{"review":"BEFORE READING MY REVIEW please note: \n\n\nMy opinion does and will not affect others' opinions in any way that would encourage people to dislike each others' opinions.\n\nThis review may include spoilers\n——————————————————————-\n\nRoadside Romeo:\n\n          I don't know about you other reviewers, but I loved this movie as a little kid. I was maybe 4 years old when I first saw this movie. The main reason why I love this movie so much is because of the songs. The songs are catchy, some are beautiful/peaceful and some are action songs. The best part about the songs is I could play them a thousand times and they would never get old (btw I probably have played them over a thousand times). \n\n          Now, I understand this movie isn't as great as some people suspect it to be. I think the biggest reason why a lot of people don't like the movie is because most of the dialogue is in Hindi. I bought the English-subtitled version of this movie and trust me, it helps a ton. The only friend I know who can understand the majority of the movie without subtitles is my friend, Kareen. Though, in order for me to understand the concept or the plot of the movie I had to see it for myself.\n\n          Another great part of the movie are the characters and their designs. Sure, some look like they came from Foodfight!, but the rest actually aren't that bad. I really liked the design of Laila. The scarf she wears really adds style to the character. Laila also has great character. She would love Romeo if he promised to do as she asked. So, ever since he heard that, Romeo has been trying to win Laila over and, very close to the end of the end of the movie, he does.\n\n          The animation is okay. I wouldn't say it's the best I've ever seen. I do like the animation of Romeo though. I don’t really like the animation of Chhainu. The way the animators designed Chhainu's movements is a little awkward or quirky.\n\nAnd, finally, the story:\n\n          This movie has a good story. The story of how Romeo came on the roadside was he used to be a dog owned by a rich family, but then the family moved to London to find and own a new dog. Although, the true story of the movie is basically, Romeo trying to win Laila, his one love, over by impressing her using her own antics against her and achieving what she wants him to do and trying to avoid the aggressive beatings from Charlie Anna. Not a very wide variety story, but a good one.\n\nIn my opinion, this is a great movie with excellent songs, okay (sometimes understandable) dialogue, very good character and designs, okay animation, and a well put together story.\n\nMy rating for this movie is an 8 maybe 9 out of 10.\n\n-Trey Grove","label":0},{"review":"This is one of my favorite animation movie till now. I don't know why it is underrated. I really liked the animation, along with good storyline, great voice acting, even the songs are so catchy!! Overall it is a great movie for me!! :D","label":0},{"review":"It's like a really bad parallel universe version of Lady and the Tramp. Hard pass.\nI also don't understand why on earth the animation was as bad as it was. Digital animation had been around for decades at this point, and it was made by YRF, who could definitely hire better animators if they wanted. Toy Story was made almost 15 years before this movie, but the animation was still so much better.","label":0},{"review":"Amazing animation movie . Storyline direction was superb. Conception love between two animals were unique. Dubbing technique idea was superb. Songs were real good . One of my favourite movie. Ñice movie.","label":0},{"review":"Well I can see how bad the movie is and the rip offes . Also heard it's kinda predicable and stuff . But I liked the movie because I think it's very interesting . The reason I think people didn't like it was because people think it was so cliché and maybe even bad script .","label":0},{"review":"i love this movie i used to watch it on youtube but my dad bought the cd off amazon and i was so happy","label":0},{"review":"My Autistic sister loves this film i would say that she watches it once every day i would recommend it for 12 and up","label":0},{"review":"It is a really entertaining movie animation is not good but that is the least of the protagonist makes the story is very entertaining thanks to the charisma that gave the character.","label":0},{"review":"The best movie I have ever seen anybody who is dissliking it is a big fooool","label":0},{"review":"Makes me want to poke my brain through my eye sockets and swirl it around","label":0},{"review":"It is amazing  I saw the flim first time in our school","label":0},{"review":"i think it was interesting. still trying to search up the songs tho >.<","label":0},{"review":"i love it good the it good and cool","label":0},{"review":"it is an excellent movie .","label":0},{"review":"Best cartoon","label":0},{"review":"I love this movie","label":0},{"review":"fantastic, keep it up jugal hansraj sir.","label":0},{"review":"The animation is certainly not pleasant, but the movie itself is charming and cute.","label":0},{"review":"Nice movie","label":0},{"review":"This is my fav animated movie..","label":0},{"review":"I love it but I want a number 2!!!!!!!","label":0},{"review":"its better than flushed away","label":0},{"review":"Hi friends","label":0},{"review":"What if my mom saw me watching them kiss?","label":0},{"review":"It is very non graphic movie 🤬","label":0}]