[{"review":"This is not an usual bollywood flick with songs, action and comedy. The movie revolves around a sikh graduate(portrayed authentically by Ranbir Kapoor) who aspires to be salesman. As he steps into the corporate world, he is shocked by the reality of sales business where unethical practices, cut-throat atmosphere, unrealistic targets, selling products with high markups are norms & customers are seen just as numbers. He doesn't wishes to abide by these norms drawing a lot of flak from seniors and  ...MORE","label":0},{"review":"This is not an usual bollywood flick with songs, action and comedy. The movie revolves around a sikh graduate(portrayed authentically by Ranbir Kapoor) who aspires to be salesman. As he steps into the corporate world, he is shocked by the reality of sales business where unethical practices, cut-throat atmosphere, unrealistic targets, selling products with high markups are norms & customers are seen just as numbers. He doesn't wishes to abide by these norms drawing a lot of flak from seniors and colleagues and gets isolated by them.\n\nHe realizes that by being nice one can never survive in this competitive world. So he decides to crave his way through the sales business by following his ideology of treating customer as people with heart not as numbers as they are the one who gives business to them and not the other way around. Also stressing on focusing on services before sales. \n\nRealistic movie definitely worth a watch.","label":0},{"review":"These movie is genuinely a awesome crafted movie where they showed the journey of sales man. I have come across many of ma friends/classmates who chose marketing during their graduation days thinking it's easy subject to clear than compared to finance subject. But truth is marketing is not the cup of everyone where actually they showed in these movie. Love the Ranbir acting and the narration of struggling graduate !!! The irony of india is they appreciate more of masala movies ...","label":0},{"review":"What a movie man? Such a thought-provoking film with 0% nudity, 0% violence, 0% weed, 100% honest content.\n\nSometimes I wonder how fans of Bollywood easily fail these kinds of movie without watching it and whining about students of the year 2.\nIf you guys fail these kinds of movie means, you will get that kind of movies with nudity, sex and violence.\n\nMovie that teaches honesty to upcoming entrepreneurs and it says the employer on how to treat it staffs.\n\nRanbir kapoor and other actors simply ki ...MORE","label":0},{"review":"What a movie man? Such a thought-provoking film with 0% nudity, 0% violence, 0% weed, 100% honest content.\n\nSometimes I wonder how fans of Bollywood easily fail these kinds of movie without watching it and whining about students of the year 2.\nIf you guys fail these kinds of movie means, you will get that kind of movies with nudity, sex and violence.\n\nMovie that teaches honesty to upcoming entrepreneurs and it says the employer on how to treat it staffs.\n\nRanbir kapoor and other actors simply killed it. Music by merchant brothers and direction by shmit amin is on next level.","label":0},{"review":"I watched this movie and wondered why did i miss such a nice movie.. Ranbeer kapoor looked amazing in that turban look and acted pretty well.. loved the whole content of the movie. they actually showed the dirty politics of sales and how one tries to achieve the targets. overall the movie was really good.","label":0},{"review":"Realistic movie.Worth a watch.\n\nInspiring & Worth watching\n\nMost underrated movie but sadly made at a wrong time where the Indian audience hadn't evolved much unfortunately from a content perspective.\n\nTerrific movie with honest performances from Ranbir,Naveen Kaushik and Manish Chaudhary.","label":0},{"review":"This is evergreen and must watch movie with good Management lesson to youngsters. \nGood script with beautifully played all characters by all actors. \nI always recommend to watch this movie.\nBefore ending specially impress by Ranbeer kapoor and Sunil Chawdhary acting.","label":0},{"review":"Inspiring, thought-provoking & revelatory. \nThough the plot is not flawless, But the essence of this movie still outshines its demerits. All in all, it's a 'Healthy diet' of a movie for any struggling entrepreneur.\nTotally worth watchin'!","label":0},{"review":"Great performances by Naveen kaushik who plays the Manager and Manish chaudhry who plays the role of Sunil Puri\nNot a typical Hindi movie masala but I really enjoyed it. Watched it on TV again after many years","label":0},{"review":"Such an amazing movie! Won't mind watching it again. I was told that this movie is real bad and all, I still had something which wanted me to watch it and trust me, its a perfect piece.","label":0},{"review":"I have no clue why this film tanked at the box office. One of the finest films that I have watched. Inspiring one, of course!","label":0},{"review":"This is the Movie , which made me to open my Own Company.  And iam proud to say in a span of 2 years i have have almost achieved my Goal.  Today i have 600 Employess in my Company\n \n\nRocket Singh .....You are my Turning point in my life","label":0},{"review":"Great movie to watch. I have watched it several times and never felt bored while watching totally unique and unconventional bollywood film.","label":0},{"review":"While watching I was thinking what if that double return contract could backfire the parent company.... It is still a good movie, i saw some very unsatisfying transition.... Like ppt.","label":0},{"review":"amazing movie should have definitely been nominated for awards but sadly audiences doesn't prefer watching and appreciating a good movie ....... better than any of that love story concept","label":0},{"review":"This movie touches principles of Salesmanship- truth & relationships.If people are happy numbers will automatically grow in business😊.A \"Feel Good\"  movie.A must watch.","label":0},{"review":"The movie is awesome.... Nice story and awesome screenplay and direction. Ranbir kapoor is a complete actor.Total cast was good.","label":0},{"review":"Best movie which describes today's newcomer struggle for making him useful for his company and how company treats him back and what he do to become something else from others!","label":0},{"review":"One of the most underrated movies of Bollywood. I wonder why audience missed on such a realistic concept. Worth watching!!","label":0},{"review":"Such class movies are now a rarity in bollywood....enough of those romantic and love flicks......hope bollywood ko upar jane ki qualities aani chahiye...","label":0},{"review":"One of the best Bollywood movies and great acting by Ranbir Kapoor and the rest of the cast. A must watch for the new-generation.","label":0},{"review":"Watched in 2010 since then one of my favorite movies. Helped me change my life. Movie full of optimism.","label":0},{"review":"This film has taught me how to become at marketing skills, I like this film very much","label":0},{"review":"One of the best movie of Bollywood. This movie is so Underrated Every Should watch This movie","label":0},{"review":"Very Motivating..\nSuperb acting and casting ...hatke movie","label":0},{"review":"Great movie, highly motivational for young professionals,  must watch if already haven't","label":0}]