[{"review":"as someone said in this section :\n\nOne of the most underrated movies of bollywood. Surely a must watch for all movie lovers.\nJourney of Janardan from a loafer boy to a passionate lover and finally a legendary rockstar has been marvelously portrayed.\nAside from Nargis Fakhri, everybody has outdone himself. From Ranbir's acting, Imtiaz's direction and A.R.'s music everything deserves an standing ovation. But Mohit Cauhan's singing is what completes the portrayal of the titular character.\n   The fi ...MORE","label":0},{"review":"as someone said in this section :\n\nOne of the most underrated movies of bollywood. Surely a must watch for all movie lovers.\nJourney of Janardan from a loafer boy to a passionate lover and finally a legendary rockstar has been marvelously portrayed.\nAside from Nargis Fakhri, everybody has outdone himself. From Ranbir's acting, Imtiaz's direction and A.R.'s music everything deserves an standing ovation. But Mohit Cauhan's singing is what completes the portrayal of the titular character.\n   The film also serves as a ride to some of the scenic places of Prague and Liberec and helps to delve deeper into the life of the protagonist. The music fits with every situation and grasps its emotions completely.\n   Watch it if you dont wanna miss a gem from Bollywood.\n\n\nyes he's true true true 🔥 💯 💯 💯\n\nmust watch bollywood movie 🌡️🌡️🌡️✨✨✨🎉🎉🎉","label":0},{"review":"One of the most underrated movies of bollywood. Surely a must watch for all movie lovers.\nJourney of Janardan from a loafer boy to a passionate lover and finally a legendary rockstar has been marvelously portrayed.\nAside from Nargis Fakhri, everybody has outdone himself. From Ranbir's acting, Imtiaz's direction and A.R.'s music everything deserves an standing ovation. But Mohit Cauhan's singing is what completes the portrayal of the titular character.\n   The film also serves as a ride to some of ...MORE","label":0},{"review":"One of the most underrated movies of bollywood. Surely a must watch for all movie lovers.\nJourney of Janardan from a loafer boy to a passionate lover and finally a legendary rockstar has been marvelously portrayed.\nAside from Nargis Fakhri, everybody has outdone himself. From Ranbir's acting, Imtiaz's direction and A.R.'s music everything deserves an standing ovation. But Mohit Cauhan's singing is what completes the portrayal of the titular character.\n   The film also serves as a ride to some of the scenic places of Prague and Liberec and helps to delve deeper into the life of the protagonist. The music fits with every situation and grasps its emotions completely.\n   Watch it if you dont wanna miss a gem from Bollywood.","label":0},{"review":"[4/5] This movie is an underrated gem. Direction, cinematography, acting everything is almost perfect. The characters have great arcs. It didn't feel I was watching characters, it felt like they're real people evolving with me over the course of time. The Music & Songs are soulful, meaningful and even gut wrenching sometimes. The movie is directed and edited in a way with many flashbacks & flash forwards which creates an emotional impact. As for the flaws, the flashbacks & forwards can make few  ...MORE","label":0},{"review":"[4/5] This movie is an underrated gem. Direction, cinematography, acting everything is almost perfect. The characters have great arcs. It didn't feel I was watching characters, it felt like they're real people evolving with me over the course of time. The Music & Songs are soulful, meaningful and even gut wrenching sometimes. The movie is directed and edited in a way with many flashbacks & flash forwards which creates an emotional impact. As for the flaws, the flashbacks & forwards can make few scenes confusing, where it takes a while to understand at what time this is happening. Though it doesn't affect the overall experience of the film. I Highly recommend it.","label":0},{"review":"IT is very difficult to characterize the movie with a single emotion. It is so beautifully layered that it will take repeated viewings to form a consensus within yourself as to WHY you love the film. Just like its soundtrack, 'Rockstar' is a movie you will have to allow to grow on you. The film can best be described as a heady cocktail of love and fame and how each has an effect on the other. It's the free-falling nature of the story that gives it a feeling never before experienced in Indian cin ...MORE","label":0},{"review":"IT is very difficult to characterize the movie with a single emotion. It is so beautifully layered that it will take repeated viewings to form a consensus within yourself as to WHY you love the film. Just like its soundtrack, 'Rockstar' is a movie you will have to allow to grow on you. The film can best be described as a heady cocktail of love and fame and how each has an effect on the other. It's the free-falling nature of the story that gives it a feeling never before experienced in Indian cinema. The movie borders on self-indulgence every once in a while but wonderfully balances it out with realism.\nThe direction, cinematography, and most importantly the music and acting by Ranbir kapoor is of top notch. \nWe don't see Ranbir kapoor in this movie. We see a transformation of a struggling Delhi guy \"Janardan\" becoming International fame \"Jordan\"\nThe movies truly is a cult classic 👌","label":0},{"review":"Rockstar is absolute gem(4.5/5) really loved the movie. If you are an artist you must watch it. Story is good, locations are lit, direction was so good but screenplay could have been better. Performance of ranbir Kapoor is so powerful, he gave one man show, because nargis was not as good as expected but still she managed to give whatever she could.\nMusic is top class, but for class audience only. AR rehman has done a wonderful job as always.\nThe only bad point one can see in the movie is that th ...MORE","label":0},{"review":"Rockstar is absolute gem(4.5/5) really loved the movie. If you are an artist you must watch it. Story is good, locations are lit, direction was so good but screenplay could have been better. Performance of ranbir Kapoor is so powerful, he gave one man show, because nargis was not as good as expected but still she managed to give whatever she could.\nMusic is top class, but for class audience only. AR rehman has done a wonderful job as always.\nThe only bad point one can see in the movie is that the screenplay is designed in such a way that the movie became a treat for class audience but underperformed when it came to mass audience. But overall movie is must watch","label":0},{"review":"One of the best movies I have ever seen in my life. It is  so heart touching love story which will not let you close your eyes for a second. This movie has best acting performances, best direction, best locations(Himachal and  Europe),best photography, well written and good script. Ranveer Kapoor has nailed it from his acting. If you want to watch a good then this is the best opinion.Whether you are Indian or not, you will really love it.\nNo ratings for this movie because I do not give ratings t ...MORE","label":0},{"review":"One of the best movies I have ever seen in my life. It is  so heart touching love story which will not let you close your eyes for a second. This movie has best acting performances, best direction, best locations(Himachal and  Europe),best photography, well written and good script. Ranveer Kapoor has nailed it from his acting. If you want to watch a good then this is the best opinion.Whether you are Indian or not, you will really love it.\nNo ratings for this movie because I do not give ratings to the best in its own field.","label":0},{"review":"I like movie story line, direction, songs, location, the originality of the story, song selection and timing. This movie is full of emotion, perfect comedy, love, passion. Ranbir kapoor's acting and  his character was just amazing . Nargis Fakhri was looking so beautiful.Songs by mohit chauchan and music by A.R Rehman is like cherry on the cake especially 'Kun Faya Kun\" was my favourite one.  Overall this movie is perfect blend of love, emotion, comedy, passion n music. One of the best movies I  ...MORE","label":0},{"review":"I like movie story line, direction, songs, location, the originality of the story, song selection and timing. This movie is full of emotion, perfect comedy, love, passion. Ranbir kapoor's acting and  his character was just amazing . Nargis Fakhri was looking so beautiful.Songs by mohit chauchan and music by A.R Rehman is like cherry on the cake especially 'Kun Faya Kun\" was my favourite one.  Overall this movie is perfect blend of love, emotion, comedy, passion n music. One of the best movies I have watched till now!","label":0},{"review":"Rockstar is bench mark for bollywood no other direction or story writer can match that level of imagination and the way of story telling.... This movie is not meant masala movie lovers.... This one is epic amazing masterpiece with awesome music and lyrics.... I love this movie i can watch it 100 times in repeat... I connect myself with the flow of the movie everytime.. And I m really thankful to Ranbir kapoor for his awesome realistic acting.. Gorgeous Nargis,  and Imitiaz ali sir... At the end  ...MORE","label":0},{"review":"Rockstar is bench mark for bollywood no other direction or story writer can match that level of imagination and the way of story telling.... This movie is not meant masala movie lovers.... This one is epic amazing masterpiece with awesome music and lyrics.... I love this movie i can watch it 100 times in repeat... I connect myself with the flow of the movie everytime.. And I m really thankful to Ranbir kapoor for his awesome realistic acting.. Gorgeous Nargis,  and Imitiaz ali sir... At the end Sir AR Rehman  for magical music love u all team","label":0},{"review":"Well I watched it again for the nth time.\n The locations will force you into self dreaming and will make u feel energetic.\nDont know about others but this movie gives me a unique motivation i.e not giving F about others while focussing on your own Goals.\nI played the Movie just to watch some of the beginning scenes but was again temped to complete the whole.\nSuch a fantastic script and acting and obviously the songs..\nGenerally people skip the songs in between a movie but in this case you will b ...MORE","label":0},{"review":"Well I watched it again for the nth time.\n The locations will force you into self dreaming and will make u feel energetic.\nDont know about others but this movie gives me a unique motivation i.e not giving F about others while focussing on your own Goals.\nI played the Movie just to watch some of the beginning scenes but was again temped to complete the whole.\nSuch a fantastic script and acting and obviously the songs..\nGenerally people skip the songs in between a movie but in this case you will be forced not to skip , credit goes to Mohit chauhan sir.","label":0},{"review":"Its an understatement to say am a minority here:-)...i absolutely hated this movie from the first 15 min for various reasons and that's when i quickly checked the reviews here and endured it fully. I was reminded of the movie \"Tamasha\" which was another tamasha according to me on the audience by Imtiaz Ali.\n\nJust an implausible plot and some very bad acting by the lady lead made it unworthy of a movie made by a director who also made Jab We Met, Cocktail, Love aaj Kal & Highway.\n\nI lost it when  ...MORE","label":0},{"review":"Its an understatement to say am a minority here:-)...i absolutely hated this movie from the first 15 min for various reasons and that's when i quickly checked the reviews here and endured it fully. I was reminded of the movie \"Tamasha\" which was another tamasha according to me on the audience by Imtiaz Ali.\n\nJust an implausible plot and some very bad acting by the lady lead made it unworthy of a movie made by a director who also made Jab We Met, Cocktail, Love aaj Kal & Highway.\n\nI lost it when Ranbir, the all quiet and shy guy suddenly on director's instructions started acting so aggressive to woo the gal and then in disbelief I watched how the lady seemed to be just waiting for him...come on...is this plausible!!! And a husband who allows his wife to go off to her lover just coz she wants to??? And the director doesn't even pause to explain how this could possibly happen. \n\nThroughout, the movie jumps frames as if to say that the audience is a fool and wont understand. I hate this type of movie making. I have no issues with the morality or lack of it in going after a married lady...but for God's sake make it well. And I just didn't understand why Ranbir was angry??? Was society against him to make love to a married lady?? What was the reason for his angst...I mean its so stupid to show a normal guy suddenly very angry and talk about Sadda Haq...What haq? Not explained. \n\nMost times the lady looked disinterested for a relationship and Ranbir looked like one of the thousands of creeps (men) who just don't take 'no' for an answer...and this i found very disturbing.  \n\nIt is a movie which was panned by critics and the audience and I am happy that happened. However it now seems to ring a bell with few and well...everybody has their own way of looking at things.\n\nTo me a movie you must not waste your time on!\n\nRating: 0.5/5","label":0},{"review":"Jordan's pain and subsequent success and failure are highly spiritual in nature. Rockstar signifies Imtiaz Ali's achievement as a spiritual storyteller of all times... And to heal it's minimalistic downfalls, A. R. Rahman and Irshad Kamil come together to lend the biggest helping hands ever. Ranbir's second best performance (I rate Tamasha above Rockstar) for sure. Thank you Imtiaz! If you ever read this, believe me mate, my soul can rest in peace through your films. ❤️🎥","label":0},{"review":"If you like to listen real music or want to get a feel of love an d separation, do watch this movie. This movie has shown that how an ignorant Man fell in love and turned to be a criminal according to the society but actually he's innocent but just different from others. Brilliant Movie I still remember when watched it in theater.. I was speechless","label":0},{"review":"Its a must watch film.The type of direction is rarely seen in bollywood and is excellent. Film just brings you through pain,passion,inspiration and everything which as a sum is so thrilling . This is the films that has to be promoted,which had a great impact on teenagers. How come every song became so touching and beautiful.","label":0},{"review":"This movie is something that will not only ring your bells for a moment but it also has intense emotions like aggression,temper and passion.The songs are so soulful and the best one is 'tum ho' for me. The locations of shooting the whole movie makes it more realistic and romantic.\nThis movie may make you to fall in love❤❤\n \nHighly Recommended","label":0},{"review":"Similar to it udta punjab has same problem , means that Both film's Post intervel part is Amazing, awesome , well direct , wee grabed but After intervel Film Goes down .\nBeside this , Rockstar is Well Made film.Why ? ...BEACUSE This is Pure Creation of Rockstar . A Boy Who wants Inspiration For be a Rockstar . But After became Rockstar He Can't see himself what he became A rockstar or Phsyco Arrogant Person who takes alcohol a lot .","label":0},{"review":"I like movie story line, direction, songs, locations, the originality of the story, song selection and timing, this movie is full of emotion, perfect comedy, love, passion...... Ranbir kapoor acting n his character was just amazing n songs by mohit chauchan n music by rehman sir is like cherry on the cake. Overall this movie is perfect blend of love, emotion, comedy, passion n music.... Best movie i watched till now","label":0},{"review":"It's just okay film. Though I like Imtiaz's other films Jab we met, Tamasha, Highway, socha na tha and Love Aaj Kal. I found this just ok. Story was not bad but I found the screen play boring. And I hated when the lead actor starting to woo the girl despite of her continuous disapproval. Nargis acting was poor Though Ranbir's acting was good. Also Aditi Rao was good. 2/5 from me","label":0},{"review":"The movie is good for most parts. Jordan (Ranbir) 5/5. Been a fan of his ever since Tamasha. However let's not forget about that little sore thumb in the movie ,Heer Koul. What a despiteful acting. It's like the battle of 2 actors, one a timeless masterclass, another a forgetful dumb voice actress. Apart from her terrible horrifying mundane tear-jerking mindless acting, everything else was just wonderful.\n3.75 / 5, for a 5 rated movie. That's what bad casting choice does to a good script. Shame.","label":0},{"review":"To tell you the truth..I m watching this film after seven years of it's release and I loved the film every which way...Mohit Chauhan has done wonder on kamil's lines...\nAnd the jugulbandi of SHAMMI KAPOOR and RANBEER KAPOOR is something to cherish for a lifetime,now that SHAMMI is in the heavens...\nImtiaz Ali has proved once again that he is one of the best directors in INDIA....","label":0},{"review":"I have no words to describe. It is the best experience of my life. Those 3 hours will never come back. Just see this Movie and i am sure u will love it. Sequel we want please\n\nJordan Janardhan jhakar JJ ❤️","label":0},{"review":"This is one classic movie of bollywood, an intense and a very sophisticated film. There were many  strong and intense scene which will leave you in splits. Everything from dicrection to acting was perfect. Bollywood can proudly say that they have made a movie like \"rockstar\".","label":0},{"review":"Absolute Gem from Imitiaz Ali!!Ranbir proved that he is a Class Apart with his steller performance  and the Real Magic was done by the Songs!!!\nAditi rao was stunning with her cute looks!!!\nGreat Cast and the Remarkable songs makes it worthwhile to watch!!!!","label":0},{"review":"I think this movie is just awesome!! It is very thoughtfuly directed,the actors have acted very well and the music is tatefuly composed. This movie is like a roller-coster ride after every fifteen minutes we get goosebumps. And the ending is really very heart breaking. But loved it like anything!","label":0},{"review":"this is my most favourite movie ever, ranbir kapoor is awesome in this one, well he always is, but okay this movie is something else, imtiaz ali is a mastermind, that person has won my heart over, i mean, with jab we met, rockstar and tamasha, he's undoubtedly my favourite. aslo, my favourite moments:- \"itni si chatni main do samose khau main?\"\nkun faya kun is the best thing to happen to this planet.","label":0},{"review":"A must watch for all people who love a musical with an intense story. i think that the actor must be the best actor in bollywood at present. starting however put many females off but they must carry on watching to feel the real intensity of the movie.","label":0}]