[{"review":"It is one of the best movies I had ever seen. It has a good story and really good execution. It is successful expressing the emotions when it is serious. It has really funny moments too. It is has memorable quotes and scenes that's why I love this movie.","label":0},{"review":"Akshay's presence and his returns in action avtar is the main USP of the movie....Nice story line...Superb acting by the other actors.... Again will praise akshay' action....superbbbb👌👌👌👌","label":0},{"review":"I know most of the people will bash the living hell out of this movie for being too over the top but this is the USP of the movie itself, this is a very entertaining movie and people should just concentrate on that and enjoy the spectacle","label":0},{"review":"However good Akshay's acting is in this film it is still just a Hindi adaptation of the Tamil movie siruthai. That movie was the original and a smash hit. If siruthai had not been so good this movie would not have existed.","label":0},{"review":"Entertaining yet emotional and a bit romantic. Loved the acting of 2G and of course akshay kumar is dashing here. Should watch this movie.","label":0},{"review":"Mr. Akshay Kumar is versatile. He’s a funny guy and yet very dignified and a total gentleman when doing military officer  roles.👍🏻😍","label":0},{"review":"sir aap kabi rolatai ho or kabhi hasate ho i love you sir you are world the best actor and i love you so much i wish i can meet you byeeeeee sir you are my love you are jaan i love i want to merry you","label":0},{"review":"This film is very good because of action and comedy. I don't know why this film has low ratings..","label":0},{"review":"One of the biggest blockbuster of 2012.. Akshay Kumar's towering performance was the highlight of the movie besides superhit songs, hair raising action and splendid cinematography and choreography.","label":0},{"review":"The collection of this film was 206.5 cr. Worldwide(20-30 days back) according to google. But why it decreased? This is not fair GOOGLE.","label":0},{"review":"Akshay and salman are the two original mass stars and this film is excellent and all songs are also good plus the fighting sequences are good also","label":0},{"review":"This movie is my fev. i like you and I love you Vikram rathod ( Akshay Kumar)","label":0},{"review":"It's a best action movie. Dashing role of Akshay Kumar.","label":0},{"review":"This movie encourage us to behave in a good way.And to learn many things.","label":0},{"review":"Good Movie. Really allowed me to embrace my culture!","label":0},{"review":"The most entertaining film I ever seen speciálly the Starting half an hour","label":0},{"review":"Fully Entertaining Movies. Akshay is in full mood.","label":0},{"review":"Good comedy  action thriller movie  i have enjoy a lot","label":0},{"review":"This film portrayed the real scenario of a Bihari Village . A very average movie with a mind blowing soundtrack .","label":0},{"review":"he is my craziest actor omg i just love him","label":0},{"review":"It is a good movie.the story is enough good and romantically","label":0},{"review":"Brilliant Movie...Super performances by akshay & little baby girl.","label":0},{"review":"Look at the shoulder insignia on akshay kumar uniform, the symbol denotes DIG of police but he is acting as ASP in the movie","label":0},{"review":"This movie is romantic and full of action and funny also","label":0},{"review":"One of the best  Akshay kumar movie","label":0}]