[{"review":"One of the best movies ever made. I'm so glad I got to watch this masterpiece from Ron Howard who presents this legendary rivalry between two of the greatest drivers in F1 history Nikki Lauda and James Hunt to absolute perfection and Hans Zimmer's score (particularly one from the climax) makes it so much more beautiful. It is a compelling and engaging story of two fierce rivals who can't stand watching the other win yet share a mutual admiration towards one another. Needless to say, it is one of ...MORE","label":0},{"review":"One of the best movies ever made. I'm so glad I got to watch this masterpiece from Ron Howard who presents this legendary rivalry between two of the greatest drivers in F1 history Nikki Lauda and James Hunt to absolute perfection and Hans Zimmer's score (particularly one from the climax) makes it so much more beautiful. It is a compelling and engaging story of two fierce rivals who can't stand watching the other win yet share a mutual admiration towards one another. Needless to say, it is one of the finest movies I've ever watched.","label":0},{"review":"One of the best sports drama and my favourite is Nikki Lauda.\n\n\n\"\"men love women, but even more than that, men love cars\"\"\nMarlene Lauda: Will someone please tell me what’s going on?\n\n \n\n[to Niki]\nMarlene Lauda: Who are you? Should I know you?\nItalian Man #1: What? You don’t know? He’s Niki Lauda, Formula One driver. He just sign with Ferrari.\nMarlene Lauda: Him?\nItalian Man #1: Yes!\nMarlene Lauda: Impossible.\nItalian Man #1: Why?\nMarlene Lauda: Well, you know, Formula One drivers they have long ...MORE","label":0},{"review":"One of the best sports drama and my favourite is Nikki Lauda.\n\n\n\"\"men love women, but even more than that, men love cars\"\"\nMarlene Lauda: Will someone please tell me what’s going on?\n\n \n\n[to Niki]\nMarlene Lauda: Who are you? Should I know you?\nItalian Man #1: What? You don’t know? He’s Niki Lauda, Formula One driver. He just sign with Ferrari.\nMarlene Lauda: Him?\nItalian Man #1: Yes!\nMarlene Lauda: Impossible.\nItalian Man #1: Why?\nMarlene Lauda: Well, you know, Formula One drivers they have long hair, are sexy, their shirts are open to here.\nNiki Lauda: Thank you.\n\n \n\nMarlene Lauda: Yes. Anyway, look at the way he’s driving, like an old man.\nNiki Lauda: There’s no need to drive fast, it just increases the percentage of risk. We’re not in a hurry, I’m not being paid. Right now, with zero incentive or reward, why would I drive fast?\n[Marlene leans across a little closer to Niki]\nMarlene Lauda: Because I’m asking you to.\nNiki Lauda: [subtitled] And do you always get what you want?\nMarlene Lauda: [subtitled] Usually.\n[Niki looks at her for a moment then slams his foot down on the pedal and speeds ahead making Marlene shocked and amazed at the same time while the two Italian men are yelling in excitement as Niki accelerates down the road weaving past cars]","label":0},{"review":"I loved this movie. Being a lover of cars, motorsports, and F1 this movie was a natural choice for me. They picked the perfect cast to represent the characters. Seeing the dynamics of an extravert and an introvert being rivals in the sport was fascinating because their different perspectives and values and reasons for desiring the championship. What a contrast the two character brought to the film. The film showcases some well known race tracks ie Monza, Nürburgring, Fuji Raceway and the racing  ...MORE","label":0},{"review":"I loved this movie. Being a lover of cars, motorsports, and F1 this movie was a natural choice for me. They picked the perfect cast to represent the characters. Seeing the dynamics of an extravert and an introvert being rivals in the sport was fascinating because their different perspectives and values and reasons for desiring the championship. What a contrast the two character brought to the film. The film showcases some well known race tracks ie Monza, Nürburgring, Fuji Raceway and the racing scenes were well done.\n\nI love this movie.. 9/10!","label":0},{"review":"Im glad I was able to see a film adaptation of the rivalry between James Hunt and Nikki Lauda as its one of the best sports rivalries ever existed. It shows that they just didnt want to beat eachother and saw eachother as enemies but it shows how they looked out for eachother and showed respect between them. \n\nI feel Chris Hemsworth and Daniel Bruhl did excellent job at recreating these motorsport heros.","label":0},{"review":"This movie is a masterpiece. It surprises me that the movie hasn't got the recognition it deserves, but this is a fantastic movie with an outstanding background score from Hans Zimmer. Perfect adaptation of rivalry and how the rivals respect each other on and off the field. Glad to have seen and experienced this movie numerous times and the song 'Lost but won' will remain my all time favorite.","label":0},{"review":"One of the best movies I have seen. Breathtaking cinematography and heart pumping background score which depicts rivalry, emotions, and what not. Daniel Bruhl and Chris Hemsworth lived their roles. And not to forget Peter Morgan's fantastic script writing skills and Ron Howard's direction. Watch it. I strongly recommend it because it has got everything a watcher wants to see in a movie.","label":0},{"review":"One of the best in the best I would say. The portrayal of both nikki lauda and james hunt characters were amazing. I engulfed into the movie with the dialogues and screenplay. And hats off to the music director Hans zimmer for such a soulful music which keeps us engaging. The director has made a masterpiece out of this movie","label":0},{"review":"One of the best movie I ever watched. Both Niki Lauda(Daniel Bruh) and James Hunt(Chris) nailed their character. Background score is legit awesome. It makes you feel you are one among them. Hans Zimmer at its best. Totally a worth movie to watch. Screenplay, Direction, Dialogue all are perfect.","label":0},{"review":"When it comes to my opinion, its broad approach widens my thought process even though I was ever wondering what is hero, A man who sacrifices or the the man who believe in doing rather any impact of its outcome even being noticed or not, but coming on conclusion it is based on people society they made u they destroy you, values are just some virtue if it succed  you become great but it not succed u r nothing with your empty hands. Happiness sorrowness are just virtual impact of short time span.","label":0},{"review":"I loved the movie and I don’t even like F1 racing. That’s how good it is. The real emotional gut punch is seeing the real Niki Lauder at the end of the film with the look of sadness in his eyes when he remembers the memory his friend and rival James who passed away years before.","label":0},{"review":"One of the best inspirational and motivational movie. Chris Hemsworth and Daniel Brühl has potrayed the characters and their rivalries at the best form. I got no time to take my eyes off the movie, and ears also because of Hans Zimmer's marvelous background score.","label":0},{"review":"One of the underrated movie and this is one Best Racing Movie Ever. The rivalry between Niki Lauda and James Hunt is so intense and Director exhibit it very perfectly. As expected Hans Zimmer made it again with his Harmonic.","label":0},{"review":"No film has got me emotionally connected to an extend as this one. The relationship between man and his machine visualised at its best. One single dialogue from the film sums it up. Watch and you can relate.","label":0},{"review":"The acting was phenomenal.  The storyline was intense and gripping. Perfect movie. I loved it. Didn't hurt to have Chris Hems worth top the cast. Eye candy for we ladies!!","label":0},{"review":"Nikki Lauda passed away today. This film with magnificent actors, is a true homage to his life; his struggle after the terrible accident that he had. My advice, don’t miss Rush, watch this spectacular movie","label":0},{"review":"This movie is the greatest movie i've ever seen. My favourite is of course Nikki Lauda. The way he drove after his brutual accident shows his stubbornness and the his will to drive the car in that condition.","label":0},{"review":"My hair looks fantastic after getting it done!! ☺️ Lovely welcome (even though i came in very early!) give great advice too for someone who doesnt really know what they want every time i come in!!","label":0},{"review":"The dialogue I liked the most.....\nScene: Niki Lauda to James Hunt after the tragic German Grand Prix accident and back to racing again in Italy..\nLauda: Watching you win races while I was fighting for my life. You were equally responsible for getting me back in the car.","label":0},{"review":"Amazing movie, loved every part. This movie had me on the edge of my seat. I'm not much of a F1 fan but this has me hooked. Would recommend to anyone.","label":0},{"review":"One of the movie I will remember throughout my life not because of good character and F1 but whole plot, direction and acting.\nAfter watching this movie Chris Hemsworth became my favourite character/ actor and Nikki Lauda was actual hero in movie, overall 10/10","label":0},{"review":"Superb Movie, I regret that I have missed a masterpiece in a theatre when it was released back in 2013. Hans Zimmer nailed the Bgm Score once again...","label":0},{"review":"It is such a good movie. Lots of action. The Hans Zimmer music in the last race was awesome. Please watch!!!","label":0},{"review":"This movie does everything right with Catchy lines, screenplay, Stellar Cast which makes it a pleasure to watch and perfectly shows the drivers dedication to their passion....","label":0},{"review":"I'm really amazed by the fact that Ron Howard directed this movie inspite of his history brief movies and seriously he again proved his experienced by his work amazing movie","label":0},{"review":"Fantastic story with nice turns and shifts (no pun intended).\nMust watch for both Drivers as well movie  enthusiasts.","label":0}]