[{"review":"This is a really luvly  film. I don’t watch Indian films a lot but I like this one and can watch it again and again. It’s probably my favorite Indian film. It’s a heart warming feel gud film the whole family can sit down and watch together. It’s got a very simple light hearted romantic story as it’s main plot. It’s very funny too. There’s no violence or strong language or nasty fighting at any point in the film.","label":0},{"review":"This movie was already in future in 2003.\nGreat work by whole team of saathiya.\nVivek and raani were really good! And when it comes to music it was lit.\nVivek is such a talented actor! \nAmazing work. 🔥","label":0},{"review":"The themes of the movie is not that impressive, it is some what same as other movies where the love stories undergo struggle and truce. The best past of the movie is how magically Rehman dyed the Hindi Folk Songs into his Musical colors.","label":0},{"review":"It is a fantastic movie with great acting skills by vivek and rani, not to forget the good music on display","label":0},{"review":"I like this movie heart touching and lovely couples and great love story\nAnd that would be given medal","label":0},{"review":"My all time favourite movie Saathiya and songs too....\nAwesome job done by both Vivek and Rani","label":0},{"review":"This movie is amezing,,I like it nice cuple vivek n Rani,,.,.,.love u heart touching movie.,fantastic","label":0},{"review":"One of the best movies.... kudos to Vivek and Rani!!!!!!!!\nJust Watched in 2019 ;)","label":0},{"review":"One of the revolutionary movie which had huge impact on Indian marriges lol...","label":0},{"review":"I like this romantic film. Vivek and rani's\nacting is to good.","label":0},{"review":"Whenever you feel u lost love and confidence on love simply watch this movie without disturbance...","label":0},{"review":"U want to see at any cost. I love this a lottttt","label":0},{"review":"I love this movie...Rani Mukherjee my all time fev actress","label":0},{"review":"This movie is my favorite movie and Rani Mukherjee is my favourite actresses","label":0},{"review":"Heart touching love story very close to my heart","label":0},{"review":"All time favorite movie and music.. Vivek and Rani just nailed it...","label":0},{"review":"Love this movie basically simplicity of the song of the movie!!","label":0},{"review":"Amazing movie with such innocency in performance","label":0},{"review":"Rani and Vivek both were the good choice for the movie.","label":0},{"review":"It is my all time favorite movie.","label":0},{"review":"Awesome movieeeee","label":0},{"review":"MD Raju khan i Love","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0},{"review":"Very good movie","label":0}]