[{"review":"Usually, We don't have this kind of films from Bollywood. It's such an amazing film that simply prevails love atmosphere around those who view this. So many different varieties of feelings can be experienced at one stop that is Saawariya. Then came the songs, placing of songs, Music, Composition all add more flavour to the recipe of Love. I simply love this","label":0},{"review":"This film is a very mesmerising one. Set of the film itself brings you to another world. The songs are best of the best if you get its flavour. The direction of Sanjay leela bansali made it magical. It's a move with different kind of excellence. No the typical punch dialogues & hero's revenge kind of stuff","label":0},{"review":"I fell in love with ranbir  kapoor  after watching this film. sonam looks like a dreamgirl here. nd the set of this movie is verry much dreamy <3 the love story between sonabir is really innocent nd painful :( i just love this movie, each and every song of this movie is awesome :) one of my favourite movies ..","label":0},{"review":"Mystical, dreamy, flows smoothly from scene to scene like a Disney movie. Sweet songs. Lyrical.  It was the first movie of Sonam Kapoor that I saw (late in life) and fell in love with the movie and HER.  ....... and led me to watch  all movies.Real koollll.  ðŸ’•ðŸ’–ðŸ’ŸðŸ’žâœŒðŸ‘","label":0},{"review":"One beautiful woman, two very different men vying for her affections, who will she choose? The movie, acting, scripting, direction and choreography coming out of Bollywood put Hollywood to shame sometimes. This is one of those times! A brilliant, fun movie with outstanding soundtracks that perfectly rub the final polish onto a masterpiece! 10/10!","label":0},{"review":"This is one of the best of RK. He is very tallented and great actor in this type of movies...nd love you bhansali  sir for your directing. Aap aisi filme banate  rahe also sonam is very good in the movie","label":0},{"review":"Saawariya is just like a masterpiece of an artist....for sure one of the best from  SLB and Bollywood. The set of film is beyond any beauty...Ranbir and Sonam are just awesome....And no words for Rani...\nMust watch movie....ðŸ˜ðŸ˜—ðŸ˜‰","label":0},{"review":"I don't know why it was a flop movie....it is one of the greatest creation of SLB.Most of the people didn't like it.That's why so low imdb rating.....it will send u to a dream world.....the film is so mesmerising.....it can't  be expressed in words....the music has played a great role in this film....the story is very simple....but the essence of this film is very much exquisite.","label":0},{"review":"Wow what a movie. Everything is perfect In This movie from casting direction story everything. It's something beyond. I am in love with this couple Sonam Kapoor and Ranbir Kapoor. Want to see them again in sawariya 2","label":0},{"review":"My favourite sanjaylila vansali... And he is the inspire for true lovers... I will meet u atonce in my life... Forever love story..tremendous...","label":0},{"review":"Beautifully acted by both Ranveer and Sonam and Wonderfully directed by SLB Sir.It gives you a beautiful look of the short story \"white nights\". Totally an aesthetic feast for the eye .","label":0},{"review":"One of my favourite movie. Ranbir is looking very smart in this movie .I fell in love Ranbir after watching promo of the movie.my teenage crush .most memorable year of my life2007.","label":0},{"review":"Truly i feel deep inside my heart after seeing the set and high imaginations another world.....truly awesome and mind blowing songs 1000 times i listen jab se tere naina...but still i love that","label":0},{"review":"Beautifully made by bhansali, like and dislike is completely depends on your attributes and taste.Where Ranbir was simple and innocent, Salman was tough but hot.I was in vicarious love for Sonam after this. Salman's part is little yet impactful.Loved!","label":0},{"review":"Hell much underrated movie...If it was realeased now it could clearly enter 100 crore clubâœŒ.Songs are Outstanding & Acting of Ranbir and Sonam is damn Fabulous...","label":0},{"review":"I didn't  enjoy this movie, felt very bored and all actors do their job nicely some some songs were too irritating.... I think the director try to make a diffrent way to tell the story... But the dialogues were  too dramatic","label":0},{"review":"I like the movie so so much.Really sonnam looks awesome.wow!The songs what a beautiful lyrics.Ranbir acted so well.love this movie sooooo much","label":0},{"review":"This so much beautiful story... Salman is my favorite start..and Sonam is so beautiful.. looking in .muslim\n...i love this","label":0},{"review":"Ranbir kapoor means ranbir raj his my favourite and saawariya film was awesome movie just becoz of ranbir  lovely story .","label":0},{"review":"This film was awesome and very romantic movie.ranbir is also very handsome and done outstanding job.","label":0},{"review":"Most beautiful film I have ever watched. In love with this.â¤â¤â¤â¤","label":0},{"review":"I am really a fan of Ranbir Kapoor and Sonam Kapoor. They are really talented and fantastic","label":0},{"review":"Great film great story, acting is not quite good, ending might be better","label":0},{"review":"Mesmerizing and lovely like dream land where Love is acting like Humans....","label":0},{"review":"This movie is very interesting and Ranveer Kapoor acting fantastic","label":0}]