[{"review":"An under-rated film.It maintains suspense till the very end as everyone thinks that the antagonist(serial killer) is going to kill the singer but something else end up happening due to the mistake made by the cop earlier in the story.Even though he is killed at the end by the cop but he still wins as he is able to convince her to kill him.Overall, a must watch movie.","label":0},{"review":"One of the very few true thrillers of bollywood. The best thing about this movie is it revolves arround the main storyline without any unnecessary songs/character's personal life plot, however the climax is somewhat influenced by Se7en(1996)","label":0},{"review":"I'm surprised why I've never heard of this movie. Taut storyline, excellent direction & sublime acting..... Recipe for one of the best crime thrillers in bollywood !!!","label":0},{"review":"Good suspense and story which creates thrill while movie goes on. But during the climax , it is already realised that suspect must be jackie shraff, as he never appeared in story before.","label":0},{"review":"What a suspense & thriller movie.. Incredible. I don't know how it missed. Jackie Shroff's chilling performance. Story line, exact ingredients. Overall great movie.","label":0},{"review":"One of the most underrated movies to be made in bollywood..  a damn good thriller with an excellent cast","label":0},{"review":"A very good suspense thriller on the line of Seven (1995). Keeps you engaged and at the edge of the seat.","label":0},{"review":"Awesome movie. I recommend it if you are interested to watch suspense+mystery+investigative movie. 5/5","label":0},{"review":"Good movie suspense thriller , sushmita sen done acting , dialogue delivery marvellous gripping story \nRajinder singh","label":0},{"review":"What a thriller movie. Super acting sushmita sen. In my review 4/5 stars of this movie. Pla guy's watch this movie avilable on u tube.","label":0},{"review":"Good film with natural performances and most of all, a gripping story.","label":0},{"review":"Amazing movie. Well thought and planned very well. 👍👍👍","label":0},{"review":"Best crime, mistry, thriller from Bollywood.\nI think the plot was taken from Seven.","label":0},{"review":"IN MOVIE SAMAY, MALVIKA \n'S DAUGHTER SHOULD NOT BE MURDERED. ITS'S A BAD ENDING!!","label":0},{"review":"Very nice and i can say about that.... This indicate one thing....","label":0},{"review":"A very good movie ...having great script #suspense#...must watch...👏👌","label":0},{"review":"One does not get bored  and remains with  movies","label":0},{"review":"Why Sushmita dint get best award for this movie after giving a extra ordinary performance","label":0},{"review":"Awesome movie super grip","label":0},{"review":"Great movie","label":0},{"review":"Good suspense","label":0},{"review":"Nice movie","label":0},{"review":"Very interesting film","label":0},{"review":"destroyed a classic movie like se7en ....by copying it...loosers","label":0},{"review":"Bakwas postingand not publickly","label":0}]