[{"review":"Whoof!! Sarkar has managed to break all the shackles spun around its release !. Heavy criticisms( promotions) from political parties 😁 . !! Third film in ARM VIJAY combo.\n\nThe plot is a well known fact among ppl even before its release !.Vijay , an NRI ( corporate criminal) comes to India to cast his  vote and finds that someone casted already .The usual cat and mouse drama starts here . Hey hey .but hold on wait !!  Except Its a political drama ! ! ..\n\nVijay anna 's earth shattering screen pre ...MORE","label":0},{"review":"Whoof!! Sarkar has managed to break all the shackles spun around its release !. Heavy criticisms( promotions) from political parties 😁 . !! Third film in ARM VIJAY combo.\n\nThe plot is a well known fact among ppl even before its release !.Vijay , an NRI ( corporate criminal) comes to India to cast his  vote and finds that someone casted already .The usual cat and mouse drama starts here . Hey hey .but hold on wait !!  Except Its a political drama ! ! ..\n\nVijay anna 's earth shattering screen presence holds this movie firmly. STYLE QUOTIENT 😍😍😍😍🤗 The way ARM unveils the knots spun around the plot is amazing ! Unlike the past 2 blockbusters , SARKAR looks a little different. Maturity in annan's acting and the way film progresses are the key points.  Clap worthy dialogues all around !!  ARM sir hats off for this script!! First half is racy and power packed with many paisa vasool scenes !! As a die hard fan , my throat went gaga over THALAPATHY'S mass moments!! 😍😍..\n\n         Second half is a rollercoaster ride with many political influenced moments which happened here( not willing to quote those scenes as these incidents are well known ) . The way in  which the interval block carries itself is a delight !! Cute body language transitions from ANNA ! A welcome change!! Most fav scene would be WHEN HE CHALLENGES RADHA RAVI SIR , UNGA THALIVAN BRAND EH EH KILI KILI NU KILICHU KAATREN followed by THALAPATHY 's sarcastic gestures !! 😍😍😍..\n\nARR sir😍. BGM'S top notch 😎. That too title card bgm ku i ll surrender myself 😍😍.. Girish brother hats off !! New dimensional cinematography 😍.Kollywood welcomes you with a red carpet! Stunt scenes ultimately steal the show ! High octane !😍.Ram lakshman!.😎.Varu sarathkumar mam😍.. Top notch performance. May her badass and terrifying performances continue!! . Karuppaih sir vera level 😍 Keerthy comes in just as a doll with no mere purpose !😑.but still commercial template to be followed !🙄..\n                 The film starts loosing  its grip from the audience in the second half slowly.  😶., but then somehow THALAPATHY manages to pull it back with grungy dialogues ! Logical loopholes😞!! At some point of time , as many tell its like a political launchpad for vijay ,the scenes just deviate much from their mother , SCRIPT which made me slightly glum 😖.. Nevertheless , SARKAR looks formidable with sharp social messages oozing out 😍😍. Tomato and hospital  scenes 😍😍 ARM nailed it 😍😍\n\n         Finally , to be honest  , SARKAR slightly misses out the X FACTOR of ARM vijay annan combo 😶,otherwise os a good and much needed film for everyone ! KELVI KEKNUM was the show stealer and I hope instigation of this thought into people's minds would be strong !! \n\nVerdict : Go and give it a watch for VIJAY  annan's charisma sandwiched strong social content( 49P) 😎😎 ( which we all need now to the maximum 🤗) \n\nMy rating ( as a die hard fan) : 9/10\nMy rating ( assuming a neutral audience) : KATHI THUPPAKI LEVEL ILLANAALUM ONE TIME WATCHABLE AAH IRUKU INDHA SARKAR 😊   : 7/10","label":0},{"review":"This is a detailed review after watching the movie on a weekday(15th Day after release) without any Fan crowd to bias me.\n\nSarkar is a socio-political drama which runs on the fulcrum of most of the current events in Tamil Nadu(Probably why audience in Kerala could not relate to the same). It is not a usual Kollywood Utopian Political Movie(Mainly made famous by Director Shankar's Mudhalvan) which promises the moon, has great theatre moments, has a sincere hero and a scintillating antagonist. Nei ...MORE","label":0},{"review":"This is a detailed review after watching the movie on a weekday(15th Day after release) without any Fan crowd to bias me.\n\nSarkar is a socio-political drama which runs on the fulcrum of most of the current events in Tamil Nadu(Probably why audience in Kerala could not relate to the same). It is not a usual Kollywood Utopian Political Movie(Mainly made famous by Director Shankar's Mudhalvan) which promises the moon, has great theatre moments, has a sincere hero and a scintillating antagonist. Neither will it match your expectations if you went in thinking of Vijay-ARM's previous Block-Busters-Thuppakki and Kathi which were cinematic delights with some social messages thrown on them. The movie is more on the lines of Director Mohan Raja's Social Drama Velaikkaran, if you definitely need a comparison although I would not want to bias you. \n\nContrary to most Online Reviewers and English Newspapers's Verdict, I never found the movie to be dull and in fact was quite surprised when the movie got over, with a run time of 2 Hours 43 Minutes. \n\nRegarding Technicalities, AR Rahman's Music and BGM is a huge Plus(Again Under-quoted in most of social media reviews), Girish's Cinematography is okayish(Simtaangaran could have been better). Ram-Laxman's Stunts slightly over on top. Choreography is a big let down(Does not match to the tunes for the most part- Shobi and Sridhar wasted good songs with Vijay's magical steps at their disposal). \n\nComing to Director ARM and Writer Jeyamohan(Whose contribution again under-quoted in most reviews), I would say Dialogues are razor-sharp and if you are someone connected to the ground realities of TN(That is Big If!),you will definitely feel as if they reflect your mind in most of the scenes. Regarding Screenplay, definitely the expectations of Thuppakki and Kathi play spoilsport as the 12-Terrorist Shoot-Out and Coin Fight are huge benchmarks for even the original director to match with. Again,here ARM has directed the movie as a common man rather than a director and probably the reason for the slackness here, if you go in only as a Cinema Lover. \n\nRegarding Production Values, Sun Pictures have pulled no stops with good Artwork in Songs and Fight Scenes only to be spoilt by insipid choreography as mentioned before. Appreciate them for having the spine and guts to take criticism of their own related political party in a movie produced by them. \n\nComing to Actor Vijay, Hatsoff to him for openly taking on Politicians including the Party connected to the Production Company. He has carried the movie on his shoulders and lived out the role. No other contemporary actor has dared to take up issues affecting TN and its people as Vijay has in most of his movies in the last 4 years and Sarkar is the pinnacle among them all. If there was one reason you should watch the movie, it is for Vijay.  \n\nConsidering it is a One-Man show due to Charismatic Vijay, having 3 antagonists makes it even more harder for any of them to match up to him. Lesson here for Atlee and future directors of Vijay Movie- Have that one strong Raguvaran-type villain to stand the might of Vijay rather than a multitude of them and end up them looking lesser.\n\nIn short,if you are a cool dude/dudette, take-a-chill-pill types, only alive in virtual world, sees movies to hang-out with boy/girl friends, better avoid Sarkar and do whatever you keep doing.\n\nOn the other hand, if you are someone who is connected to what are the chronic problems which are ailing TN and felt disgruntled, frustrated and angered at any point in the last 2 years and want to bring about a positive change for the better, you will definitely connect with the movie! Just dump the so-called mixed reviews and go for it!!\n\nAnd most importantly, wherever you are in this world, spare that one day every 3-5 years to vote in the elections. That is the only democratic tool we have and do not waste the same and keep mocking, memeing about Government when you see something bad and do nothing about it. That is the crux of this movie. Enna Nanba, Nanbi- Will you vote this time?","label":0},{"review":"Just watched SARKAR - Want to share the experience with everyone SPOILER FREE..\n\n Without wasting any time lets get in to the plot  Because thats how the movie is. And talking about the plot and story there is nothing new its very well know because of the controversy that the movie faced even before its release. But thats not affecting the movie at all because there are lot of other things in the movie which you can look into. First lets talk about Vijay.. OMG the 46 year old beast on screen..He ...MORE","label":0},{"review":"Just watched SARKAR - Want to share the experience with everyone SPOILER FREE..\n\n Without wasting any time lets get in to the plot  Because thats how the movie is. And talking about the plot and story there is nothing new its very well know because of the controversy that the movie faced even before its release. But thats not affecting the movie at all because there are lot of other things in the movie which you can look into. First lets talk about Vijay.. OMG the 46 year old beast on screen..He is very clear about presenting himself infront of the camera. The way that he behaves ,Walk ,smile and his mannerisms looks Super cool on the screen and according to me he is very apt for the character that he played the Corporate CEO with 99%Ego and 1% Social cause and he carries the movie in his shoulders completely simply saying Perfect match for the word \"Simtaangaran\" ..Talking about characters we also have to talk about Radha Ravi and  Varalakshmi Sarathkumar both played their roles well .We also have to talk about the technical things about the movie..on that note first we have to notice Girish Gangadharan the Cinematographer of the film who did an excellent work and the framing and movements that he handled in stunt sequences was brilliant and the production designin..i bet that Except Sun Pictures no one can made this movie this grand and genuine..Hats off to them on that..A.R.Rahman usually did his best and delivered what required for the movie...Actually i had a dream that \"How it will be?? When ARR do music for a Commercial Telugu movie..\" and this movie gave the answer for that..and also the Stunt Choreographers Ram and Laxmam simply awesome..and the next hero of the movie is gonna be Jeyamohan the dialogue writer of the movie nailed it and My favourite dialouge in the movie is a dialouge about my hometown Rameswaram..\n\nVerdict : A well known recipe from the hands of a Masterchef..✌✌","label":0},{"review":"SARKAR \n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though th ...MORE","label":0},{"review":"SARKAR \n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though they are in the opponent side. The expectations for this film was hyped and skyrocketed even before the release due to the controversy on who owns the rights for the original story. Also, there is no strong alternative films  released for this Diwali  which will aid this Magnum Opus to march towards the blockbuster list very easily. Thalapathy Vijay and AR Murugadoss joined again for the third time. Both Thuppakki and Kathi are dominant films in Vijay's film career but Sarkar will be an important film for his political career. It is quite obvious that Vijay was hunting for a political entry in Tamilnadu along with Rajnikant and Kamal and this film will set the right tone for his political hunch. There are numerous scenes where it directly implies the current ruling government. Pala Karuppaiah and Radha Ravi plays the CM and Deputy CM role in this film which will remind us the current CM and Deputy CM of Tamilnadu. None of the party members are spared including the Legendary Sasikala and other big names. Infact, the director used very similar names for the characters to add spice to the political meal. There are numerous scenes and dialogues which are so direct against the ruling government in TN. Sarkar's teaser and Vijay's speech during the audio launch clearly gave a headsup for the audience on the content of the film. Though there are wide scope for the twist and turns, AR Murugadoss adopted the preachy style of storytelling. Hence, Vijay talk more in screen than what is expected out of his role. Lengthy dialogues and long single take shots come back to back in the second half which will certainly test the patience of the neutral audience. AR Murugadoss is quite sharp in delivering the social message with the powerful dialogues but in Sarkar it worked out well only in few scenes and it is rather redundant in the second half.Though the plot and screenplay are very predictable the director tried his level best to maintain the gripping factor until the interval block. However, in the second half the momentum lost with slow phased screenplay and preachy approach. Varalakshmi Character is quite interesting to watch her on screen. Her encounter with Vijay is engaging and helps the audience to connect with the screenplay. Unfortunately, she had very little screen space in the second half. May be her role could have introduced much earlier in the first half. Keerthy Suresh is not required in this film at all. Even without her role Vijay could have easily handled this film without any lag in the screenplay. Radha Ravi and Pala Karuppaiah played their part well as antagonists but Varalakshmi steal the show with her attitude. Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his fans are not disappointed at any cost. There are sufficient mass element scenes and stunts for him to cater the needs of his fan base. As usual he gave his best for dance and fight sequence. Stunt Choreography really worked out well to elevate the mass elements. The dialogue delivery for Vijay was intentionally slow phased but punchy. The new salt and pepper stubble look is eye catching","label":0},{"review":"🎥MOVIE🎞️ REVIEW 🎬\n\n✒️SARKAR \n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong politi ...MORE","label":0},{"review":"🎥MOVIE🎞️ REVIEW 🎬\n\n✒️SARKAR \n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though they are in the opponent side. The expectations for this film was hyped and skyrocketed even before the release due to the controversy on who owns the rights for the original story. Also, there is no strong alternative films  released for this Diwali  which will aid this Magnum Opus to march towards the blockbuster list very easily. Thalapathy Vijay and AR Murugadoss joined again for the third time. Both Thuppakki and Kathi are dominant films in Vijay's film career but Sarkar will be an important film for his political career. It is quite obvious that Vijay was hunting for a political entry in Tamilnadu along with Rajnikant and Kamal and this film will set the right tone for his political hunch. There are numerous scenes where it directly implies the current ruling government. Pala Karuppaiah and Radha Ravi plays the CM and Deputy CM role in this film which will remind us the current CM and Deputy CM of Tamilnadu. None of the party members are spared including the Legendary Sasikala and other big names. Infact, the director used very similar names for the characters to add spice to the political meal. There are numerous scenes and dialogues which are so direct against the ruling government in TN. Sarkar's teaser and Vijay's speech during the audio launch clearly gave a headsup for the audience on the content of the film. Though there are wide scope for the twist and turns, AR Murugadoss adopted the preachy style of storytelling. Hence, Vijay talk more in screen than what is expected out of his role. Lengthy dialogues and long single take shots come back to back in the second half which will certainly test the patience of the neutral audience. AR Murugadoss is quite sharp in delivering the social message with the powerful dialogues but in Sarkar it worked out well only in few scenes and it is rather redundant in the second half.Though the plot and screenplay are very predictable the director tried his level best to maintain the gripping factor until the interval block. However, in the second half the momentum lost with slow phased screenplay and preachy approach. Varalakshmi Character is quite interesting to watch her on screen. Her encounter with Vijay is engaging and helps the audience to connect with the screenplay. Unfortunately, she had very little screen space in the second half. May be her role could have introduced much earlier in the first half. Keerthy Suresh is not required in this film at all. Even without her role Vijay could have easily handled this film without any lag in the screenplay. Radha Ravi and Pala Karuppaiah played their part well as antagonists but Varalakshmi steal the show with her attitude. Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his fans are not disappointed at any cost. There are sufficient mass element scenes and stunts for him to cater the needs of his fan base. As usual he gave his best for dance and fight sequence. Stunt Choreography really worked out well to elevate the mass elements. The dialogue delivery for Vijay was intentionally slow phased but punchy. The new salt and pepper stubble look is eye catching and goes well with the character. Music and Background score is not upto the mark of  AR Rahman standard. \nOverall, Sarkar is a political campaign for Vijay's entry into politics. Forget about the logics and believe in Vijay fearless stunts to enjoy the film.","label":0},{"review":"SARKAR \n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though th ...MORE","label":0},{"review":"SARKAR \n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though they are in the opponent side. The expectations for this film was hyped and skyrocketed even before the release due to the controversy on who owns the rights for the original story. Also, there is no strong alternative films  released for this Diwali  which will aid this Magnum Opus to march towards the blockbuster list very easily. Thalapathy Vijay and AR Murugadoss joined again for the third time. Both Thuppakki and Kathi are dominant films in Vijay's film career but Sarkar will be an important film for his political career. It is quite obvious that Vijay was hunting for a political entry in Tamilnadu along with Rajnikant and Kamal and this film will set the right tone for his political hunch. There are numerous scenes where it directly implies the current ruling government. Pala Karuppaiah and Radha Ravi plays the CM and Deputy CM role in this film which will remind us the current CM and Deputy CM of Tamilnadu. None of the party members are spared including the Legendary Sasikala and other big names. Infact, the director used very similar names for the characters to add spice to the political meal. There are numerous scenes and dialogues which are so direct against the ruling government in TN. Sarkar's teaser and Vijay's speech during the audio launch clearly gave a headsup for the audience on the content of the film. Though there are wide scope for the twist and turns, AR Murugadoss adopted the preachy style of storytelling. Hence, Vijay talk more in screen than what is expected out of his role. Lengthy dialogues and long single take shots come back to back in the second half which will certainly test the patience of the neutral audience. AR Murugadoss is quite sharp in delivering the social message with the powerful dialogues but in Sarkar it worked out well only in few scenes and it is rather redundant in the second half.Though the plot and screenplay are very predictable the director tried his level best to maintain the gripping factor until the interval block. However, in the second half the momentum lost with slow phased screenplay and preachy approach. Varalakshmi Character is quite interesting to watch her on screen. Her encounter with Vijay is engaging and helps the audience to connect with the screenplay. Unfortunately, she had very little screen space in the second half. May be her role could have introduced much earlier in the first half. Keerthy Suresh is not required in this film at all. Even without her role Vijay could have easily handled this film without any lag in the screenplay. Radha Ravi and Pala Karuppaiah played their part well as antagonists but Varalakshmi steal the show with her attitude. Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his fans are not disappointed at any cost. There are sufficient mass element scenes and stunts for him to cater the needs of his fan base. As usual he gave his best for dance and fight sequence. Stunt Choreography really worked out well to elevate the mass elements. The dialogue delivery for Vijay was intentionally slow phased but punchy. The new salt and pepper stubble look is eye catching and goes well with the character. Music and Background score is not upto the mark of  AR Rahman standard. \nOverall, Sarkar is a political campaign for Vijay's entry into politics. Forget about the logics and believe in Vijay fearless stunts to enjoy the film.","label":0},{"review":"--SARKAR\n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though t ...MORE","label":0},{"review":"--SARKAR\n\nPolitical thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though they are in the opponent side. The expectations for this film was hyped and skyrocketed even before the release due to the controversy on who owns the rights for the original story. Also, there is no strong alternative films  released for this Diwali  which will aid this Magnum Opus to march towards the blockbuster list very easily. Thalapathy Vijay and AR Murugadoss joined again for the third time. Both Thuppakki and Kathi are dominant films in Vijay's film career but Sarkar will be an important film for his political career. It is quite obvious that Vijay was hunting for a political entry in Tamilnadu along with Rajnikant and Kamal and this film will set the right tone for his political hunch. There are numerous scenes where it directly implies the current ruling government. Pala Karuppaiah and Radha Ravi plays the CM and Deputy CM role in this film which will remind us the current CM and Deputy CM of Tamilnadu. None of the party members are spared including the Legendary Sasikala and other big names. Infact, the director used very similar names for the characters to add spice to the political meal. There are numerous scenes and dialogues which are so direct against the ruling government in TN. Sarkar's teaser and Vijay's speech during the audio launch clearly gave a headsup for the audience on the content of the film. Though there are wide scope for the twist and turns, AR Murugadoss adopted the preachy style of storytelling. Hence, Vijay talk more in screen than what is expected out of his role. Lengthy dialogues and long single take shots come back to back in the second half which will certainly test the patience of the neutral audience. AR Murugadoss is quite sharp in delivering the social message with the powerful dialogues but in Sarkar it worked out well only in few scenes and it is rather redundant in the second half.Though the plot and screenplay are very predictable the director tried his level best to maintain the gripping factor until the interval block. However, in the second half the momentum lost with slow phased screenplay and preachy approach. Varalakshmi Character is quite interesting to watch her on screen. Her encounter with Vijay is engaging and helps the audience to connect with the screenplay. Unfortunately, she had very little screen space in the second half. May be her role could have introduced much earlier in the first half. Keerthy Suresh is not required in this film at all. Even without her role Vijay could have easily handled this film without any lag in the screenplay. Radha Ravi and Pala Karuppaiah played their part well as antagonists but Varalakshmi steal the show with her attitude. Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his fans are not disappointed at any cost. There are sufficient mass element scenes and stunts for him to cater the needs of his fan base. As usual he gave his best for dance and fight sequence. Stunt Choreography really worked out well to elevate the mass elements. The dialogue delivery for Vijay was intentionally slow phased but punchy. The new salt and pepper stubble look is eye catching and goes well with the character. Music and Background score is not upto the mark of  AR Rahman standard. \nOverall, Sarkar is a political campaign for Vijay's entry into politics. Forget about the logics and believe in Vijay fearless stunts to enjoy the film.","label":0},{"review":"Political thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though they are in ...MORE","label":0},{"review":"Political thrillers are quite interesting to watch when it is customised and tailor-made for a \"Larger than Life\" Hero-Vijay. Sarkar is an intense political thriller in the recent times which is specially made for Vijay to establish his political platform. AR Murugadoss should have real guts to adopt this script as the entire film is driven based on the current scenario in Tamilnadu Politics. Surprisingly, it was produced by Sun Pictures which got a strong political background though they are in the opponent side. The expectations for this film was hyped and skyrocketed even before the release due to the controversy on who owns the rights for the original story. Also, there is no strong alternative films  released for this Diwali  which will aid this Magnum Opus to march towards the blockbuster list very easily. Thalapathy Vijay and AR Murugadoss joined again for the third time. Both Thuppakki and Kathi are dominant films in Vijay's film career but Sarkar will be an important film for his political career. It is quite obvious that Vijay was hunting for a political entry in Tamilnadu along with Rajnikant and Kamal and this film will set the right tone for his political hunch. There are numerous scenes where it directly implies the current ruling government. Pala Karuppaiah and Radha Ravi plays the CM and Deputy CM role in this film which will remind us the current CM and Deputy CM of Tamilnadu. None of the party members are spared including the Legendary Sasikala and other big names. Infact, the director used very similar names for the characters to add spice to the political meal. There are numerous scenes and dialogues which are so direct against the ruling government in TN. Sarkar's teaser and Vijay's speech during the audio launch clearly gave a headsup for the audience on the content of the film. Though there are wide scope for the twist and turns, AR Murugadoss adopted the preachy style of storytelling. Hence, Vijay talk more in screen than what is expected out of his role. Lengthy dialogues and long single take shots come back to back in the second half which will certainly test the patience of the neutral audience. AR Murugadoss is quite sharp in delivering the social message with the powerful dialogues but in Sarkar it worked out well only in few scenes and it is rather redundant in the second half.Though the plot and screenplay are very predictable the director tried his level best to maintain the gripping factor until the interval block. However, in the second half the momentum lost with slow phased screenplay and preachy approach. Varalakshmi Character is quite interesting to watch her on screen. Her encounter with Vijay is engaging and helps the audience to connect with the screenplay. Unfortunately, she had very little screen space in the second half. May be her role could have introduced much earlier in the first half. Keerthy Suresh is not required in this film at all. Even without her role Vijay could have easily handled this film without any lag in the screenplay. Radha Ravi and Pala Karuppaiah played their part well as antagonists but Varalakshmi steal the show with her attitude. Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his fans are not disappointed at any cost. There are sufficient mass element scenes and stunts for him to cater the needs of his fan base. As usual he gave his best for dance and fight sequence. Stunt Choreography really worked out well to elevate the mass elements. The dialogue delivery for Vijay was intentionally slow phased but punchy. The new salt and pepper stubble look is eye catching and goes well with the character. Music and Background score is not upto the mark of  AR Rahman standard. \nOverall, Sarkar is a political campaign for Vijay's entry into politics. Forget about the logics and believe in Vijay fearless stunts to enjoy the film.","label":0},{"review":"Seems more impractical. Especially the way hero vandalizes the criminals - in stunt sequences. The base plot is okay i.e., to stress the importance of casting the vote and to not get money and vote thoughtlessly. Apart from this nothing is great! Some people say it takes lots of guts to show the current political scenario. Actually, it doesn't convey anything properly. Simply taking some real time topics and depicting in a movie and trying to make a big turn around in people's thought process is ...MORE","label":0},{"review":"Seems more impractical. Especially the way hero vandalizes the criminals - in stunt sequences. The base plot is okay i.e., to stress the importance of casting the vote and to not get money and vote thoughtlessly. Apart from this nothing is great! Some people say it takes lots of guts to show the current political scenario. Actually, it doesn't convey anything properly. Simply taking some real time topics and depicting in a movie and trying to make a big turn around in people's thought process is a far low attempt by such a giant who has given Ramana / Thuppaakki. Mixing everything (Jallikattu sentiment / Using Ramanathapuram ( similar to Rameswaram - birth place of beloved former President ) / visiting a victim of self immolation act by her father (similar to the protagonist's real life situation of visiting a victim of Thoothukudi proceedings), indirectly reminding of the current opposition party personalities ( # 2 character is similar to XXXXXMurugan & welcoming a lady at airport reminiscing XXXXMozhi ) and finally naming that lady character with XXXXVALLI similar to former CM real name and making that lady character assassinate her beloved (trying to draw parallel with suspicion behind former CM demise) --- ALL Making it JUST a MEDLEY!\n\nAm not sure why the ruling party is so overwhelmed by few scenes! Definitely - today's  mass are more enlightened than the one the director tries to show in the film and definitely PEOPLE will discard the OVERLY EXAGGERATED things and take the right essence. \n\nIt only shows the lack of substance with the acclaimed director after seeing and returning empty handed after SPYDER and this one!\n\nNo doubt - the protagonist has played his CHARACTER WELL. It's up to the director to make the film flawless!\n\nHope Jeyam Mohan Raja continues with his works such as Thani Oruvan / Vellaikkaaran which are less dubious and fill the void left by the erstwhile few giant directors! We still rely on ShankarJi & few other legends of course.\n\nAlso, one really wonders whether the real CEO of referred multinational company SMOKES cigarettes to this quantum & any CEO could engage in such stunt sequences and stay alive! \n\nLast but not the least, making the character of RadhaRavi so funny wherein he voluntarily issues loose talks and provocates the protagonist AND still showing his character as No.2  (next to CM)! To his standard in playing villain roles, this seems a real mockery!","label":0},{"review":"SARKAAR:\n\n\"Politics is the last resort of the scoundrels\", said George Bernard Shaw. Here is an NRI Guy Sundar, who calls himself a \"Corporate Criminal\" leaves his CEO job to take up Politics to clean up the system and solve people's problem by establishing an AAM AADMI's PARTY. How does SUND-AR-WIN THE fight clinically and digitally with the use of Twitter and Face Book's  CRAZY WALL is the rest of the story. \n\nSeems like AR Murugadoss has been inspired by  Shankar's SIVAAJI and MUDHALVAN in te ...MORE","label":0},{"review":"SARKAAR:\n\n\"Politics is the last resort of the scoundrels\", said George Bernard Shaw. Here is an NRI Guy Sundar, who calls himself a \"Corporate Criminal\" leaves his CEO job to take up Politics to clean up the system and solve people's problem by establishing an AAM AADMI's PARTY. How does SUND-AR-WIN THE fight clinically and digitally with the use of Twitter and Face Book's  CRAZY WALL is the rest of the story. \n\nSeems like AR Murugadoss has been inspired by  Shankar's SIVAAJI and MUDHALVAN in terms of the basic story line and AAPs success in getting the common people into politics. He has just aligned that into Tamil Nadu politics focusing on the need of the  change that he believes is required to remove the ruling government. This TOO, LEAVES the audience to relate that to TWO LEAVES.\n\nHowever, the tricks, political conspiracy and games which are used here are too old and predictable. But to make it authentic, relevant and modern, he has used plenty of Twitter, What's app, skype and Face book. \n\nVijay, playing an NRI and CEO of world's Number One company, come to India to cast his Vote. But, he gets to know that someone has already casted a proxy vote. His fight for justice ends with his entry in to active politics to solve people's problem and to CLEAN UP the system.  However he himself gets into all sorts of problem because of DIRTY politics. Needless to say, he plays smart and wins the contest. In the end the guy who said \"I AM WAITING\" before election, limits himself to \"JUST ASKING\" job and becomes a KING Maker.\n\nVijay is energetic and gets applause for the   Walks, Kicks, Jumps and Dialogues. However there is too much of gestures, mannerisms and  dramatic body language which could have been controlled. Kirti Suresh has been WASTED in a less important Role and Varalakshmi has INVESTED her talent in a POWERful Role. AR RehMANAGED to come up with a disappointing muSICK.  Except TOP Tucker song, rest all lets you DOWN. \n\nMurugaDOSS, DOES need a DOSE of Tonic to come up with new Ideas. The movie might become a blockbuster. But, being Murugadoss's ardent fan, expected something different better and unique.\n\nRating : **½","label":0},{"review":"I watched it 3 times\nAccording to me it was a best political thriller movie.. illayathalapathy vijay sir showed his best in this movie .. it was a great hit to all politicians .. no words to say about vijay sir acting he was very cool anyway he is a cool guy.. varalaxmi mam did the best negative role acted very well her body language her costume everything was the best... radha ravi sir to acted very well his dialogue too... yogi babu srir asusually best comedian did his best part ... keerthy su ...MORE","label":0},{"review":"I watched it 3 times\nAccording to me it was a best political thriller movie.. illayathalapathy vijay sir showed his best in this movie .. it was a great hit to all politicians .. no words to say about vijay sir acting he was very cool anyway he is a cool guy.. varalaxmi mam did the best negative role acted very well her body language her costume everything was the best... radha ravi sir to acted very well his dialogue too... yogi babu srir asusually best comedian did his best part ... keerthy suresh mam her reaction and all was pleasant dance in omg song i loved.. each and every song melted my heart rocking it was... oru viral purathchi lyrics emotionaly written... omg lyrics i loved... and other songs too best it was... one can watch fights again and again also took in slow motion .. one thing not to forget best message the movie gave about tamilnadu issues.. every one has the right to vote noone has the right to vote his or her vote ... and it is also clearly mention tat our Vijay sir soon gonna come in politics lets wait for it.... thankyou","label":0},{"review":"If you are a hardcore Vijay fan, movie is a treat, but story, screenplay and direction are far from expectations.\nVijay role as Sundar a top level CEO for multinational giant, who goes to maximum extent to cast his vote which was used for bogus voting and turn of events making him a plunge into politics makes the story.\nThe positives are dialogues which are emotional rather than pragmatic appeals to audience.\nThe biggest drawback is obvious exclusion of roles of Keerthi Suresh and Yogi Babu who  ...MORE","label":0},{"review":"If you are a hardcore Vijay fan, movie is a treat, but story, screenplay and direction are far from expectations.\nVijay role as Sundar a top level CEO for multinational giant, who goes to maximum extent to cast his vote which was used for bogus voting and turn of events making him a plunge into politics makes the story.\nThe positives are dialogues which are emotional rather than pragmatic appeals to audience.\nThe biggest drawback is obvious exclusion of roles of Keerthi Suresh and Yogi Babu who just have done roles of assistant and reminds us of junior artists.\nMurugadoss would have done a lot of homework but this film looks like a political compulsion\nUsual Vijay films have high levels of comedy, emotion, action and punch dialogues. In this comedy is fully absent.\nSongs except Simttangaran others are far from usual AR RAHMAN standards.\nGo watch this film.with least expectations.\nSurely one time watch.\nA strong villain is absent which makes Vijay occupying screen nearly 80%.\nSo it is Vijay Vijay Vijay.\n2/5\nMy request to director-There are other serious social issues which need your intervention. Politics can wait.","label":0},{"review":"Sarkar\n\nMost awaited movie Thalapathy Vijay Starring Sarkar released and broke many records.\n\nStill, comes with lots of mixed reviews. I just want to share my thoughts regarding the movie.\n\nMovie First half is excellent and very speed We understand the Indian Election law about 49-p\n\nThere are lots of exciting and goosebumps moments.\n\nDialogues are Sharp and New (Summa kathhi maari eranguthu) Thanks to Murugadoss and Jeyamohan.\n\nWhy should I see the movie?\n\n    Sarkar Film shows how important ev ...MORE","label":0},{"review":"Sarkar\n\nMost awaited movie Thalapathy Vijay Starring Sarkar released and broke many records.\n\nStill, comes with lots of mixed reviews. I just want to share my thoughts regarding the movie.\n\nMovie First half is excellent and very speed We understand the Indian Election law about 49-p\n\nThere are lots of exciting and goosebumps moments.\n\nDialogues are Sharp and New (Summa kathhi maari eranguthu) Thanks to Murugadoss and Jeyamohan.\n\nWhy should I see the movie?\n\n    Sarkar Film shows how important every vote is.\n\n    Vijay’s acting and its dynamic in all the sequences.\n\n    It recalls past events like family suicide in front of the collector office and it makes us think….\n\n    Casting a vote is the least patriotism one can show to show our India country and even if a person doesn't care to vote he/she is a thief/criminal\n\n        (For this dialogue you should see the film at least once)\n\n\nOnce the film completed I am sure 1 out of 10 people will cast their vote properly.\n\nI am not talking about the film or Vijay mass, entertainment…..\n\nWe should support this kind of movies not all the directors and writers have this kind of mentality.\n\nSo please watch this movie in theatres.","label":0},{"review":"In no particular sequence.... That is how the real sociopolitical events are strung up by murugadoss to create the picture of bad governance and how one man saves it all. A movie based on one man is saved from monotony by a r murugadoss script and direction. Apart from Vijay, no male character has any substantial role... Radha ravi is under utilised and varalaxmi has a better role than keerthi suresh who seems to be in the movie for songs alone. Two songs (simtagaran and omg ponnu) and two fight ...MORE","label":0},{"review":"In no particular sequence.... That is how the real sociopolitical events are strung up by murugadoss to create the picture of bad governance and how one man saves it all. A movie based on one man is saved from monotony by a r murugadoss script and direction. Apart from Vijay, no male character has any substantial role... Radha ravi is under utilised and varalaxmi has a better role than keerthi suresh who seems to be in the movie for songs alone. Two songs (simtagaran and omg ponnu) and two fights are thrust upon us like the unavoidable costly popcorn.. And there's no comedy to speak of either.. . And yet like the miracle we had at marina.. the director weaves a plot around real incidents and people.. And takes it from the realm of reality to fantasy.... Where every vote is cast and only the deserving win. It is only the clever turns of the plot and a strong performance by Vijay that hold the movie together. While it is a praise worthy vision of the future to aspire for, two questions arise, firstly, does the public always need a saviour or is it the demand of this format of storytelling and secondly given that these socioeconomic concerns have been around for a decade, could such a movie  been made 5 years back... under a different production house?? The answers are both yes and no.. In no particular sequence 😉😉","label":0},{"review":"Good story concept and  action packed story with importance of the Vote.\nAnd hands off to the team for the vote message but the presentation of the movie is average and acting of Vijay at some scenes where good but sometimes he forget to act and doing like a musically app...Keerthi Suresh has no idea why she isgoing with Vijay and suddenly proposing Vijay ,the main actress lead was from Varalaxmi Sarathkumar ,she done her role with pakka Mass. ARM previous movies where good but this one must be  ...MORE","label":0},{"review":"Good story concept and  action packed story with importance of the Vote.\nAnd hands off to the team for the vote message but the presentation of the movie is average and acting of Vijay at some scenes where good but sometimes he forget to act and doing like a musically app...Keerthi Suresh has no idea why she isgoing with Vijay and suddenly proposing Vijay ,the main actress lead was from Varalaxmi Sarathkumar ,she done her role with pakka Mass. ARM previous movies where good but this one must be more to be done better with a good concept in hand.\nFrom my opinion except Oru viral puratchi song is superb other songs where below average and ARR bgm was good but songs where 😑.\nA one time watchable for general audience and for fans it is a movie for festive mood like Diwali.\nMy rating 2.5/5","label":0},{"review":"I couldn't watch fdfs and I watched second show . after one year of Marana waiting watched thalapathy on big screen and I get a watch what I expected or more than it . an strong acting and silence burned character and a bonus script for him where any actor never can touch this lavish script. \n\nIn Bangalore it was not a fans show but family and movie goers makes it like that . and back 2 back goosebumps moment with hvy action scenes . \n\nAnd the minus - keerthi had no strong role and she unmatched ...MORE","label":0},{"review":"I couldn't watch fdfs and I watched second show . after one year of Marana waiting watched thalapathy on big screen and I get a watch what I expected or more than it . an strong acting and silence burned character and a bonus script for him where any actor never can touch this lavish script. \n\nIn Bangalore it was not a fans show but family and movie goers makes it like that . and back 2 back goosebumps moment with hvy action scenes . \n\nAnd the minus - keerthi had no strong role and she unmatched for that but she did her best...👍\n\n#Top_tucker #simtangaran 👏👏\n#Arrahman #Lyricsist_vivek well did\n\nImportant sub noticed that no one ever told #49P .\n\nMovies made not only for entertainment it should teach or u should earn from it . \n\n\n\nAnd u can watch this without any fear of worth...100% pakka diwali watch for all \n\nHappy SaRkar diwali \n\nWaiting for Thalapathy 63 \n\n@fb_Jinson Jo (Karnataka)","label":0},{"review":"1 time watch movie saying this as a Ilayathalapathy fan who adores his screen presence & it's not his absolutely amazing customes & looks that are so good to see in Sarkar that contradicts my opinion but it has to do with the screenwriting of the movie in the 2nd half which could've been focused better & executed by such a masterful crafter in murugadoss who unfortunately thought that he can insert few scenes that can be hyped or made masterful by Thalapathy, by which should've been his writing  ...MORE","label":0},{"review":"1 time watch movie saying this as a Ilayathalapathy fan who adores his screen presence & it's not his absolutely amazing customes & looks that are so good to see in Sarkar that contradicts my opinion but it has to do with the screenwriting of the movie in the 2nd half which could've been focused better & executed by such a masterful crafter in murugadoss who unfortunately thought that he can insert few scenes that can be hyped or made masterful by Thalapathy, by which should've been his writing & touch only  could've done justice to this interesting story as it felt short here. \n\nBut kudos for him bringing up about our voting rights and section 49p about the ballot vote for all the fake votes done to a party without our actual fingerprint. He's managed to bring a message regarding our voting rights but a better movie would've made the impact huge & would've delivered his best movie with Vijay in the trilogy they did, what disappointed is that he promised every scene is being scrutinized & well thought & written so as to fit Vijay as well the content which needs to reach the audience but sadly he could've done better. \n\nAR Rahman unfortunately missed out on the songs, be could've done better & the songs could've also been removed from movie especially the one in the 2nd half when the main story was the focus. \n\nOru viral puratchi could've been very strong if the screenwriting again was great but it's fine. \n\nWatch this once for the story & message & of course the magical Vijay.","label":0},{"review":"The political drama is the third collaboration of director AR Murugadoss and Vijay.Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his  people whose watching movie  are not disappointed at any cost.  \nPlot :Don’t skip voting Select the right people The above are told very clearly. Dialogues are very good - “ a ...MORE","label":0},{"review":"The political drama is the third collaboration of director AR Murugadoss and Vijay.Sarkar is purely an 'One Man Army' show by Vijay. We could never imagine any other seasoned actor other than Vijay to perform this role more effectively and efficiently. He single handedly carry this film on his shoulders to ensure that his  people whose watching movie  are not disappointed at any cost.  \nPlot :Don’t skip voting Select the right people The above are told very clearly. Dialogues are very good - “ as long as Gvt thinks there is no one to question them, they will behave like this only” Gvt thinks they have paid for the votes and would like to get more money back. Ruler thinks he is powerful for five years. But voters are powerful for a day - that’s Election Day. 49P is brought to notice of all. Don’t skip your voting right .... \nPlus: 1. Vijay’s terrific screen presence 2. Bold political dialogues 3. Few Interesting mass moments 4. Well utilised ‘Toptucker’ Bgm ar rahman. 5. Focussed narration (at most parts) Stunts Ram_Lakshman •DOP Grish •ARM \nMagnum Opus to march towards the blockbuster list very easily. Thalapathy Vijay and AR Murugadoss joined again for the third time. 😎😎😎","label":0},{"review":"SARKAR-Political/thriller\n\nIt is an average movie.Dont take kaththi or thuppaki on mind and go to watch this movie you will be disappointed.It is a social message movie .It tells us about the value of each vote .The story is slow in the first half unnecessary fights and some masala in the first half don't make us sleep but we feel bored.Entry of thalapathy was great and the interval scene was also great.\n\nThe second half is to tell us about the main need for voting of each and every person it do ...MORE","label":0},{"review":"SARKAR-Political/thriller\n\nIt is an average movie.Dont take kaththi or thuppaki on mind and go to watch this movie you will be disappointed.It is a social message movie .It tells us about the value of each vote .The story is slow in the first half unnecessary fights and some masala in the first half don't make us sleep but we feel bored.Entry of thalapathy was great and the interval scene was also great.\n\nThe second half is to tell us about the main need for voting of each and every person it doesn't make u feel bored . at places the dialogues are very good and make us feel it's impact.very good ending.\n\nActing of Thalapathy Vijay was great he has done a great job .varalaxmi also done a great job .Others haven't done a great job.As always there is no need for keerthi suresh (Samantha in kaththi and kajal in thuppaki) there is no need for her.Only CEO in the house is correctly placed other songs are misplaced.The actions scenes are good and camera also is very good .A one time watch\n\nMy rating-3/5","label":0},{"review":"Sarkar :A masala movie without logic or spice\n\nAny movie of highly rated actors or directors such as this one seems to be unrealistic and illogical and only people who relish watching such \"common sense defying plots \" should watch these type of films. Be it Kaala or Kabali and the upcoming Endhiran 2, all these kinds of movies of large than life heroes should be boycotted so that the viewing public is not taken for a ride while producers and actors take away big bucks at the viewers expense.Sar ...MORE","label":0},{"review":"Sarkar :A masala movie without logic or spice\n\nAny movie of highly rated actors or directors such as this one seems to be unrealistic and illogical and only people who relish watching such \"common sense defying plots \" should watch these type of films. Be it Kaala or Kabali and the upcoming Endhiran 2, all these kinds of movies of large than life heroes should be boycotted so that the viewing public is not taken for a ride while producers and actors take away big bucks at the viewers expense.Sarkar is a Tamil equivalent of a  Telugu masala Movie and only a brain dead person could believe the foolish story and plot and to add salt to the wound,the stunt choreography is an insult to the intelligence of the viewers. How could one person facing a gang of over 20 people thrash everyone of them to dust without himself getting a single hit. Too much to digest.I have decided to watch films of the likes of Vijay Sethupathy or Vishnu or Kathir. No more Rajini,Vijay, Surya or Ajith as they have nothing to offer anything artistically enhancing to their movies. Kamal is still an exception even if I am not such a great fan of his movies like Dasavatharam. He is the only top of the line actor whose movies has certain substance even if at times Kamal has a tendency to go overboard and become self indulgent.","label":0},{"review":"To start of, I'm a Vijay fan, and I'm a bangalorean, I don't watch more of Tamil movies, but I watch most of Vijay, Suriya and other actors movies.\n\nSarkar being a political thriller, is quite Good, the movie starts by Vijay being a successful CEO of a huge company, where he comes to his home town to vote for the coming elections. He finds out about how his vote has been canceled and how there are many people who make fake votes. \n\nThis movie shows a lot about the election process and the politi ...MORE","label":0},{"review":"To start of, I'm a Vijay fan, and I'm a bangalorean, I don't watch more of Tamil movies, but I watch most of Vijay, Suriya and other actors movies.\n\nSarkar being a political thriller, is quite Good, the movie starts by Vijay being a successful CEO of a huge company, where he comes to his home town to vote for the coming elections. He finds out about how his vote has been canceled and how there are many people who make fake votes. \n\nThis movie shows a lot about the election process and the political world in our country.\nThis movie even shows a lot about the Tamil Nadu government issues and the people of Tamil Nadu being totally dependent on the parties for various schemes and other things they get from. The government for votes. This clearly shows how people need to change and bring out new faces and why the youth should start playing an important role in the nation building.\n\nA major part of the county thinks that there is no difference that makes with just one vote that is not done, but this movie shows about the importance of the voting system and the changes that needs to be implemented to the people for a better society. \n\nThis is a total thriller, but the 1st  half of the movie is a bit boring . The real movie kicks starts after the intervals. \n\nWatching Vijay on the big screen is it self a pleasure. \n\nOne time watch for sure.","label":0},{"review":"Was that a Movie? That too from murugadoss? It looks like a movie with lot of gaps. The director has tried to make the movie look realistic, tried to include 'almost' real incidents in the movie, made Sundar pitchai as Sundar (Vijay), Google as GL, and a few more, but the movie looks far from being real. A hero is always supernatural, but trying to change things within 15days seems unbelievable, especially with gaps in the movie as big as a cave for elephants to escape.\nNo price for answering th ...MORE","label":0},{"review":"Was that a Movie? That too from murugadoss? It looks like a movie with lot of gaps. The director has tried to make the movie look realistic, tried to include 'almost' real incidents in the movie, made Sundar pitchai as Sundar (Vijay), Google as GL, and a few more, but the movie looks far from being real. A hero is always supernatural, but trying to change things within 15days seems unbelievable, especially with gaps in the movie as big as a cave for elephants to escape.\nNo price for answering this, but here is your question: what's the role of Keethi Suresh - this is a question that even she can't answer. What's the need to have a herione if she has nothing in that movie. If nayanthara can act without a hero, why can't our heros act without a pair if there is no role for her. May be vijay still lacks the courage to move away from typecast of a duet, fight, Ghana and romance.\n\nWith Rahman's music also letting us down, we feel Rahman was asked to match Vijay' s fan base than to stick to Rahman's ways. \n\nThough the director has tried to convey a very strong social and national message on the importance of voting, the story lacks the delivery. It somehow misses to grip the audience. And to top it All, it is said  that this was a story taken from a junior director... \n\nIf you watch the Movie, just ensure to carry home the message and vote in all elections. If you dont watch, still cast your votes and be happy that you saved 200 Rs.","label":0},{"review":"#Sarkar - 3/5\n\nPlus:\n1. Vijay’s terrific screen presence\n2. Bold political dialogues\n3. Few Interesting mass moments\n4. Well utilised ‘Toptucker’ Bgm\n5. Focussed narration (at most parts)\n6. Production value\n\nMinus:\n1. Less weightage to Keerthy suresh & Yogi babu characters\n2. Logic issues and cinematic liberties\n3. ‘Simtaangaran & Omg ponnu’ song placements \n4. Few forced scenes to provoke emotional connect (that doesn’t work well)\n5. Screenplay (last 45 mins) could have been packed with more b ...MORE","label":0},{"review":"#Sarkar - 3/5\n\nPlus:\n1. Vijay’s terrific screen presence\n2. Bold political dialogues\n3. Few Interesting mass moments\n4. Well utilised ‘Toptucker’ Bgm\n5. Focussed narration (at most parts)\n6. Production value\n\nMinus:\n1. Less weightage to Keerthy suresh & Yogi babu characters\n2. Logic issues and cinematic liberties\n3. ‘Simtaangaran & Omg ponnu’ song placements \n4. Few forced scenes to provoke emotional connect (that doesn’t work well)\n5. Screenplay (last 45 mins) could have been packed with more brilliant/intense moments \n\nBottomline: Though not a fresh plot (as 2018 already witnessed Bharat ane nenu & Nota), Sarkar is bit more convincing than those former flicks. \n\nVerdict: Not the best of Vijay-ARM combo, but still Sarkar is a clean watchable political entertainer.","label":0},{"review":"Jus now saw in Seef mall Bahrain.\nDefinitely treat for vijay fans. Dialogues as usual mass and I love fight sequence too in this movie.\nVijay looks are like in mid 30s in this film yet stylish..His attired are too good for him..Totally a new look \nKeerthi Suresh could have been more efficiently used in this film.\nSarkar Brings out as to current political situation of Tamilnadu as of now ...So definitely trending movie..\nOn the whole can’t be compared with thupakki and Kathi but this movie is goo ...MORE","label":0},{"review":"Jus now saw in Seef mall Bahrain.\nDefinitely treat for vijay fans. Dialogues as usual mass and I love fight sequence too in this movie.\nVijay looks are like in mid 30s in this film yet stylish..His attired are too good for him..Totally a new look \nKeerthi Suresh could have been more efficiently used in this film.\nSarkar Brings out as to current political situation of Tamilnadu as of now ...So definitely trending movie..\nOn the whole can’t be compared with thupakki and Kathi but this movie is good in its own \nTotally I would rate 4/5","label":0},{"review":"Read completely, \nThe film really has a good message in it.\nLet people not just complain about the concept been stolen. They first have to think of what the concept intend to tell us.\nEvery one should know the value of their vote. People have to realize that their collective votes can bring about a change.\nIn our every day Life we face a lot of problems relating to improper functioning of the government, say it be access to drinking water or improper roads leading to accidents or bribes and infi ...MORE","label":0},{"review":"Read completely, \nThe film really has a good message in it.\nLet people not just complain about the concept been stolen. They first have to think of what the concept intend to tell us.\nEvery one should know the value of their vote. People have to realize that their collective votes can bring about a change.\nIn our every day Life we face a lot of problems relating to improper functioning of the government, say it be access to drinking water or improper roads leading to accidents or bribes and infinitely more. \nMany just vote to get some lame money. But their entire life is doomed by doing so.\nThey don't realize the effect it brings on him though he is the one who suffers.\nYoung and good leaders must arise in the society. Our society needs a change to good. And everyone must support it.\nWe all know that the person whom we vote is bad and yet we don't hesitate to vote him because we don't have any choices. \nLet the forthcoming generations realize that their lives can be much much better and bring about a change in positive way to the society.","label":0}]