[{"review":"One of the best movies ever to be made. One of the most mature, sensible and thrilling movie ever. Filmed so realistically that it defied the usual jingoistic film making methods of that period. Maybe that's the reason for it not doing so well in the box office. It followed the pattern of Andaz Apna Apna which was again a box office failure but a cult movie these days. \n\nThe plot chosen, the acting and mannerism of each individual involved in this film is actually praise worthy. Hats off to a mo ...MORE","label":0},{"review":"One of the best movies ever to be made. One of the most mature, sensible and thrilling movie ever. Filmed so realistically that it defied the usual jingoistic film making methods of that period. Maybe that's the reason for it not doing so well in the box office. It followed the pattern of Andaz Apna Apna which was again a box office failure but a cult movie these days. \n\nThe plot chosen, the acting and mannerism of each individual involved in this film is actually praise worthy. Hats off to a movie like this.\n\nOne of my top all time movies.. can watch it as many times with the same interest as the first time.","label":0},{"review":"Fantastically well made and gripping tale of Police, bravery, tactics and deceit. Arshad warsi sets aside from his usual funny characters and dons the uniform of a no nonsense IPS officer. Sushant Singh was brilliant in his portrayal of the bad guy (cinematic portrayal of gangster Shriprakash Shukla). Pankaj Kapoor was brilliant as always in the role of Physics Professor. Absolutely no dull moments in the movie. I can still watch the movie over any present day movie.","label":0},{"review":"This is one of the best movies, Arshad and Sushant were fabulous and Pankaj sir as usual was superb. Mahima also has done justice to her role. Sad that it flopped but really a must watch movie due to the storyline, characters and above all the way its filmed, the storytelling is awesome. Sehar really deserved to had more success.","label":0},{"review":"One of the best movie in Arshad Warsi's career. Storyline and the closeness to reality makes it a masterpiece in my view. The way Pankaj Kapur acted and narrated the film, Sushant Rajput's character and all other good actors as police staff did commendable job.","label":0},{"review":"A gritty movie and an unexpected Arshad Warsi at his best. Movie keeps you engaged throughout its run time, Pankaj Kapur is also at his best and so was the rest of the cast. Narrative is crisp and runtime is optimised. Above all, this is the best crime movie from Bollywood after Satya.","label":0},{"review":"The movie is very well made.i have a copy of the movie in my cell keep watching it\nArshad Warsi has proven that he is a very versatile actor,he can other roles except comedy.pankaj Kapoor is one of the best actor of Indian cinema a jewel\nI think Arshad Warsi should explore his talent in other roles","label":0},{"review":"Though he has Made his impact or say acquired stardom in munna bhai mbbs,i prefer sehar is the best film as an actor.people may not made this a commercial hit,but critics will always gives a thumbs up to this seher.a must watch for film lovers who enjoy  films like...... A wednesday,special 26,jolly LLB........","label":0},{"review":"A fantastic movie which portrays true facts about organized crime spreaded in UP, Bihar, MP, Delhi....... It boost aspiration for IPS..... Bollywood needs movie like this..... Superb act by Arshad...","label":0},{"review":"One of the best movie made on crime in India. Very well made and looks very realistic. Excellent performance by Aarshad till today.","label":0},{"review":"Seeing this film, I am seeing the encounter of Gundaraj and police in Uttar Pradesh, Bihar, in real life.Arshad Sir, Sushant Sar has done a great job. Pankaj sir is absolutely magician.. 10/10","label":0},{"review":"Realistic one no funny drama no pyaar mohabbat drama only real facts with this movie I am greatful that I had watched this movie in the theatre. big thumbs up","label":0},{"review":"One of the soft best crime movies also pottaying UP Crime prevalence during the 90s..\n\nArshad Warsi top performances as a solo actor , a Must watch !","label":0},{"review":"One of the most underrated Hindi movie...This is a taut, gripping and realistic crime drama that fans of the genre or should I say, movies should not miss\n...highly recommended!!","label":0},{"review":"It's really a well made movie. All the actors have done justice to their roles. It can also be termed as motivational documentary for the administration.","label":0},{"review":"One of the best film ever made sushant singh is always best in bhai giri role arshad warsi was super b in this film best  story of uttar pradesh mafia good one sushant singh & arshad warsi these 2 rocks in this film 👍👍👍👍👍👍👍👍👍","label":0},{"review":"The message conveyed is very clear duty is priority and duty of police is zero corruption, end of crime. Arshad as SSP has played a very important role and at last left an inspirational message for us.","label":0},{"review":"Underrated piece of work\n\n\nArshad Warsi a name who is synonymous with comedies But in this film he proved he can excel in serious roles as well","label":0},{"review":"One of best crime dramas ever. Film is so rich in its content and with brilliant actors.","label":0},{"review":"One of the finest Indian movies..Arshad warsi's best performance till date.. One of my all time favourite..","label":0},{"review":"This movie is a must watch.\nVersatility of Arshad Warsi and amazing cast with great direction.\n\nRegards.","label":0},{"review":"one of the must watch bollywood movie that honestly tried to depict the working of organized crime in U.P., plus salute to arshad warsi for its evergreen acting.","label":0},{"review":"Very nice movie.\nI rate this movie 5 out 5.\nMany time I watch this movie.\nAll actor are good.","label":0},{"review":"One of the best movie of all time.\nLovely actors script story","label":0},{"review":"Awesome movie and most inspiration for young generation who wanted to do something for country.","label":0},{"review":"This is very nice but underrated movie.mustwatch.masterpiece of Arshad and Pankaj Kapur.","label":0}]