[{"review":"Very interesting horror movie and good story-line. This rich script definitely demanded top notch actors, and then movie would have had been a real blockbuster. \n\nNonetheless its still pretty decent. Especially the professors role was brilliant and engrossing...","label":0},{"review":"Shaapit is my one of the most favourite movie all time I really love this movie and really excited to watch it on tv specially.   and his characters specially ADITYA NARAYAN and professor.He is my favorite singer actor host","label":0},{"review":"It was really a pleasure watching a movie like shaapit and after seeig this i am in love with horror movies it just gave me goosebumps....must say aditya narayan is really a very talented person would love to see him in more movies........","label":0},{"review":"Shaapit is my one of the most favourite movie all time I really love this movie and his characters specially Aman (ADITYA NARAYAN) he is my favorite singer actor host he is so so so so so so cute i LOVE him  Adi","label":0},{"review":"It's amazing! Love the movie and script, Aditya's acting was too good. I wish if there's a chance of shaapit 2 with aditya","label":0},{"review":"Shaapit is really one of those movies who serves you the right supernatural stuffs...it gives you the horrors...\nP.S- was not able to sleep after watching this movie\nIf u want sleepless night the movie is worth a watch...go to hotstar or youtube and enjoy the 2010 vibes","label":0},{"review":"it's very nice and horror movie its songs are also good the role of each characters are played well by the actors and the story of shaapit is awesome ☺☺☺☺","label":0},{"review":"It,s amazing.....i watched it today and then i feel a attraction to paranormal activities.it,s a great movie to understand the mean and sacrifice for true love......☺☺","label":0},{"review":"Nice it is a cool picture and have a great story i like it very much in this movie combination of love and a adventure of horror","label":0},{"review":"It is the best horror movie I've ever seen.... Still it is my favorite because of Aditya Narayan.... 🖤","label":0},{"review":"One of the best horror movie I’ve ever seen. The cast was ok but the storyline was amazing.","label":0},{"review":"I watched this movie twice when it got released in theatres and again today I watched this after long time... Awesome movie mainly songs","label":0},{"review":"I just love this horror movie it was amazing... I have seen it more than 10 times..\nAnd songs... I love that more... 😍","label":0},{"review":"Shaapit is my one of the most favourite movie all time I really love this movie and really excited to watch I love this movie","label":0},{"review":"It is greatfull to watch such movies &it is my favourite movie  I have watched this movie for 6 times","label":0},{"review":"omg!!!!!!aditya naryan is soo good i just love his songs i love kkkhatra specially in that episode in wgich adi is there😉","label":0},{"review":"The finest and the most lovable horror movie i've ever seen in bollywood the story is extraordinary.","label":0},{"review":"Best ever horror movie mind blowing songs just can't stop listening to the songs just loved it5/5","label":0},{"review":"I liked Aditya Narayan acting and the movie song and story line and everything nothing to say now best movie 😂🤔","label":0},{"review":"I like this movie...the story of the movie is incridible.....its is clear in the story that love is important than life☺","label":0},{"review":"I absolutely loved the movie...it’s amazing one and I loved it and the actors as well especially Aditya","label":0},{"review":"This is very good movie because he got her love with great fight","label":0},{"review":"The face of the spirit is looking like a funny comic so it should have been designed well","label":0},{"review":"It's too osm and it's also show that the true love may do anything 😊","label":0},{"review":"This film is great....... \nI have seen this movie almost 115 times and now still counting...","label":0}]