[{"review":"Hats of to this great entertainer called Nana Patekar. Every movie of his is different from each other. Must see movie before dying. In the near future society will be same as shown in this movie. No trust. Absolutely nail biting end of the movie. I am not shocked that people don't don't admire brain teaser movie as this one. It is an eye opener to the coming future. Superb movie.","label":0},{"review":"Taken or rather inspired from the Hollywood movie 'Recruit', the movie doesn't evoke the emotions the way 'Ab Tak chhappan' did. Slightly above average at best. Needed crisp script and better director.","label":0},{"review":"Nic e movie but bad ending ....\nNana killed by an old man who  used to send money,,,,,\nbut he has shown winner as he took away all money and is left alive, he should also have been killed by nana patekar at last.","label":0},{"review":"If you are a fan of nana pateker then must watch this movie .\nFan nhi ho toh bhi must watch this movie . Movie dekhne k baad zarur fan ho jaoge","label":0},{"review":"The Direction, drama, actors are Fab.\nWorld needs more directors, actors, story writers and screenplay editors of this film.\nKudos!!!!","label":0},{"review":"very interesting movie, well narrated & good picturisation,, somewhere you feel the touch of the movie johnny gaddar.\nout of 5 / 3.8","label":0},{"review":"Great Movie . Nana is just Awesome .","label":0},{"review":"I wanted Nana Patekar to play a honest officer in this movie but it turned out to be complete opposite.","label":0},{"review":"BEST NANA PATEKAR MOVIE\nANURAG KASHYAP ACTING IS MINDBLOWING","label":0},{"review":"Superb movie with some outstanding performance and direction","label":0},{"review":"One of the best Indian cop movie in the last decade.","label":0},{"review":"Nice movie. Well done patekar bhauu","label":0},{"review":"Average movie far low than expectations being  Thigmanshu Dhulia's film and the stars cast including Nana Patkar.","label":0},{"review":"A GOOD MOVIES BY STAR CAST NANA PATEKAR","label":0},{"review":"MST bro .....very Niceლ(́◉◞౪◟◉‵ლ)neerajmansi","label":0},{"review":"Superb movie a must watch movie.","label":0},{"review":"Ultimate movie \nMust watch","label":0},{"review":"super movi nana love you","label":0},{"review":"Nice movie","label":0},{"review":"Worst film ever seen","label":0},{"review":"Hi dosto good morning","label":0},{"review":"very good movie","label":0},{"review":"Its good movie....","label":0},{"review":"very interested Movie","label":0},{"review":"Underrated Movie of Bollywood.","label":0}]