[{"review":"I am a big fan of thriller movies. Recently I heard that graduation's exams are postponed. I wanted some celebration of my kind like watching thriller cinema. I searched film on IMDB by rating and review..I watched. The plot, direction, acting,cast and topic everything was awesome about this movie. But....It's 2:20am and till 11:30 I was very happy.. Now m quiet disturbed. Movie just made me feel very uncomfortable Idk why but it made me..I really dislike this movie on the basis of entertainment ...MORE","label":0},{"review":"I am a big fan of thriller movies. Recently I heard that graduation's exams are postponed. I wanted some celebration of my kind like watching thriller cinema. I searched film on IMDB by rating and review..I watched. The plot, direction, acting,cast and topic everything was awesome about this movie. But....It's 2:20am and till 11:30 I was very happy.. Now m quiet disturbed. Movie just made me feel very uncomfortable Idk why but it made me..I really dislike this movie on the basis of entertainment. A cinema's primary aim is entertainment and all I got was the depression.","label":0},{"review":"Not everyone's cup of tea. Keep in mind its a psychological thriller and it proved itself. Don't expect more suspense in it, but story line is superb for a psycho-thriller. Acting, they just nailed it. Its weird, but you will love it.","label":0},{"review":"The real catch according to me is its direction. The way movie goes... Specially the contrasting background music of action scenes... Loved that..","label":0},{"review":"I had more expectations from this movie, there are many problems with the story I felt the makers tried to serve many things but failed doing so.","label":0},{"review":"Good movie.Not just a watchable one,I liked it and that's a rare thing.","label":0},{"review":"movie is worth watching. very similar to paanch. but none character matched luke morrision (kay kay menon).","label":0},{"review":"Very good especially Rajeev Khandelwal and Kalki, brilliant performance","label":0},{"review":"Very good movie","label":0},{"review":"Please tell me the heart attacking horror movie.","label":0},{"review":"Watchable one","label":0},{"review":"very bad Allah will kill saitaan","label":0},{"review":"One time watch..","label":0},{"review":"IT MADE ME CRY :'(","label":0}]