[{"review":"This movie is the scariest movie I've ever seen. Literally, it will give you goosebumps. In this movie, one will explore the rural & hooliganism part of India. This is one of the best movie ever done by Karishma Kapoor. Nana Patekar's acting is what one will love the most. A mother's struggle to flee from a war zone especially from her in-laws home after her husband's (Sanjay Kapoor) death is what the movie is all about. SRK's character is impressive even if it is for brief moment. All the chara ...MORE","label":0},{"review":"This movie is the scariest movie I've ever seen. Literally, it will give you goosebumps. In this movie, one will explore the rural & hooliganism part of India. This is one of the best movie ever done by Karishma Kapoor. Nana Patekar's acting is what one will love the most. A mother's struggle to flee from a war zone especially from her in-laws home after her husband's (Sanjay Kapoor) death is what the movie is all about. SRK's character is impressive even if it is for brief moment. All the characters are praise worthy as each of them have brilliantly acted and my God, the editing & the visuals are awesome. The director and script writer are the people we all should thank for brilliantly representing a deeply moving film.","label":0},{"review":"A very moving film... Though most of the film is about Nandini's struggle to flee, there is never a dull moment. She succeeds but fate had other plans for Jaisingh who helped Nandini a lot in her pursuit, and who like her always had a dream destination to reach, away from the village. Acting of all the characters elevates the content to a new height. A must watch film!","label":0},{"review":"IT IS REMAKE OF TELUGU FILM\n#ANTHAPURAM\nThis movie is Masterpiece(hard hitting drama)\n#Krishna vamsi sir is the director\n#Hindi version is not comparable to the original one which was blockbuster \n#Same director made hindi version too..\n#I SUGGEST YOU WATCH THE TELUGU VERSION and WATCH ALL KRISHNA VAMSI MOVIES which were later remade into hindi\n#HANDSOFF SIR\nWATCH #SINDOORAM MOVIE  for his ultimate creativeness.....","label":0},{"review":"One of the best movie, each role is awesome super. I have seen many times no boring. Mother love is nicely shown, every mother wants her son t be grown up in good atmosphere.","label":0},{"review":"One of the most terrifying movies!!\nNana patekar made me literally scared. I could feel the struggle and pain of karishma. And I would just pray while watching movie as if everything is going on in real in front of me and I couldn't do anything 😑","label":0},{"review":"Cool movie & every character's role was awesome especially Nana Patekar.... Lastly I felt bad for jaisingh aka srk but still love the movie as the ending will bring tears in your eyes....","label":0},{"review":"It's scary movie like in this movie shows the bond between mother and son and how she fight with everyone for herself and also tells that a women can also fight with everyone and last but not least it also tells reality of India somewhere somehow many people goes through between this specially in rural areas where our ancestors rules on us and don't want to hurt there own ego they think that they are always right no matter what","label":0},{"review":"Acting is most powerful weapon to Hero's and Villon, in this movie they acted superb","label":0},{"review":"I love shaharukh khan and his acting. Although I like karishma kapoor also from the very beginning.","label":0},{"review":"Top movies of Bollywood worth of watching many times super entertaining","label":0},{"review":"excellent performance of SRK.Amazing acting.mindblowing dialogue delivery.","label":0},{"review":"Shahrukh is the best in every role .","label":0},{"review":"I like the full movie of Shakti: The Power","label":0},{"review":"You can feel the actual life and worst moments...Very realistic movie","label":0},{"review":"Awesome movie","label":0},{"review":"SRK has captivated the movie from the moment he appeared !!","label":0},{"review":"Amazing performance by Karisma Kapoor!","label":0},{"review":"Very good movie","label":0},{"review":"That is good film","label":0},{"review":"Marvellous... Papa natekar","label":0},{"review":"Shakti the power nana pateker full movie \nOn show you tub","label":0},{"review":"I just like this movie","label":0},{"review":"Block buster movie best 😭😭😭","label":0},{"review":"not full movie official print on YouTube","label":0},{"review":"SEMI HIT MOVIE SRK SMALL ROLE","label":0}]