[{"review":"Amazing movie.. Top notch performance by all the actors.. At start the story line sounds like loose. But starts gripping over to its best slowly. A perfect blend of action, thrill, and political drama.. 5star to kalki, emraan and abhay.","label":0},{"review":"Brilliant acting by all the actors and actresses. The story is gripping and most of all it explores the dark side of Indian politics to which most of us turn a blind eye.","label":0},{"review":"One of the best movie I have ever watched. One can easily guess why this type of movie isn't produced much by seeing its gross profit.","label":0},{"review":"Great movie based on the reality of political leaders. The level of corruption going on which is supported by civil servants is shown here. Ending was satisfying.","label":0},{"review":"One of the best movie I'd watched..\nAn extraordinary movie with suppern acting. \nBest Political-Thriller❤️❤️","label":0},{"review":"good story,good acting ,good cast   it shows the  dark side of  us    ......we are just hungry for power ....hats off to abhay deol ,emran hashmi  all the actors","label":0},{"review":"The story line is really good....It explores the dark side of our politics...The actors do really well..But above all I really like the ending where the exploitation of rich on poor continues.","label":0},{"review":"Must watch movie ... \nShanghai...\nIs becoming soon.... that's the politics.... ofcourse we want .... It. ........ But whom we are asking...... This Indian politics leader.....it can happen soon.... But atlast Great movie...","label":0},{"review":"Good thiller..Talks abt how politicians play public for their advantage. And what an IAS officer can influence in Govt. functioning.","label":0},{"review":"One of the best Bollywood thrillers I have ever watched. Was glued to seat through out.","label":0},{"review":"One of the best movies if you really want to see how world of politics works.","label":0},{"review":"Movie about an true, honest, positive, real time, right, powerful and supreme intelligent IAS officer.","label":0},{"review":"I SAW THIS MOVIE \nOUTSTANDING ACTING \n\nABHAY & IMRAN HASMI ACTING NO 1","label":0},{"review":"Great dramatic and excellent performance by everyone...\nAbhay and imran done their job..","label":0},{"review":"One of the best movies I have watched till date.","label":0},{"review":"Best film I always wants to watch this movie","label":0},{"review":"Brilliant acting, story and direction. Mr. Emraan Hashmi, what a performance!!","label":0},{"review":"Awesome movie.Everyone must see.","label":0},{"review":"Brilliant acting by everyone","label":0},{"review":"This is how politicians grow rich n stops common man at rags","label":0},{"review":"Beautiful movie","label":0},{"review":"Nice movie to watch actually.","label":0},{"review":"Good movie","label":0},{"review":"A movie with a good story.","label":0},{"review":"Just pure love","label":0}]