[{"review":"I can never forget the climax, the very final scene from the movie, where Brigadier Rudra Pratap Singh, in the heat of the moment, confessess his part in the mishaps and how he blames of the horrible horrible things that one person did to his family to the whole community. But what struck me the most was when he got up and started behaving as if he said nothing, as if he did nothing wrong, as if didn't just confessed his wrong, rather told a story of his bravery and valour. It was unsettling and ...MORE","label":0},{"review":"I can never forget the climax, the very final scene from the movie, where Brigadier Rudra Pratap Singh, in the heat of the moment, confessess his part in the mishaps and how he blames of the horrible horrible things that one person did to his family to the whole community. But what struck me the most was when he got up and started behaving as if he said nothing, as if he did nothing wrong, as if didn't just confessed his wrong, rather told a story of his bravery and valour. It was unsettling and disturbing and yet I didn't feel anger, rather I felt sorry for the man, who once had a good enough heart to keep a 10year old orphan muslim guy in his home, was now untouched by the thought of killing a six year old muslim girl. The man who himself lost a daughter so brutally, got so cold that such a thought even didn't send chills down his spine. Everyone grows up and gets mature and wise but the day someone looses the last bit of innocence, nothing can be worse than that.","label":0},{"review":"Must say it's a one sided movie, wrong depiction of our Army. \nA fact - one section of people will surely love it, from the reviews you can figure out which one. The other section will be divided depending on the 'fake secularism/liberalism' he/she posseses.\nSuch a shame that they had to use our Army for their agenda.\nCan they make same movie by interchanging kk's character with dobriyal's? \nno, it wouldn't suit the agenda! \n\nThe makers have intentionally ignored the real situation of the 'area' ...MORE","label":0},{"review":"Must say it's a one sided movie, wrong depiction of our Army. \nA fact - one section of people will surely love it, from the reviews you can figure out which one. The other section will be divided depending on the 'fake secularism/liberalism' he/she posseses.\nSuch a shame that they had to use our Army for their agenda.\nCan they make same movie by interchanging kk's character with dobriyal's? \nno, it wouldn't suit the agenda! \n\nThe makers have intentionally ignored the real situation of the 'area', real reason of trouble in that 'area' instead shown some imaginary cooked story.","label":0},{"review":"The only good thing about the movie was Kay Kay Menon. Intense acting👌👌.\n\nNo offence but it was a one sided movie with the whole motive to prove Javed khan innocent(lazy writing). Poor storyline and also felt it was kind of trying to defame Indian Army with communalism-could have handled this much better!!!\n\nOverall-6/10.\nSongs-lame\nKashmir visuals- could have shown more but still breathtaking.\nStory line- average.","label":0},{"review":"A nice movie with good story! Must watch for every1! & please please don't miss the messages which are given just after climax scene! Those messages are given with reference and resources.\nI was just reading reviews & there are so many peoples who are saying this movie is one sided. Please people use your brain! how can this movie be one sided? Jameel and Javed both are muslims.   One is doomed & another is India's pride. Siddhant & Rudra Pratap both are hindus & Army Officers but one is very go ...MORE","label":0},{"review":"A nice movie with good story! Must watch for every1! & please please don't miss the messages which are given just after climax scene! Those messages are given with reference and resources.\nI was just reading reviews & there are so many peoples who are saying this movie is one sided. Please people use your brain! how can this movie be one sided? Jameel and Javed both are muslims.   One is doomed & another is India's pride. Siddhant & Rudra Pratap both are hindus & Army Officers but one is very good man and another one is criminal. Simple! \nJaiHind 🇮🇳","label":0},{"review":"This movie is complete nonsense made with the intention of showing Indian army officers in poor light. Our soldiers never kill innocent people. It is complete wrong depiction of Indian army. The personal feelings of an Indian army officer never interferes with his duty. This movie looks like a conspiracy by muslim extremists and Kashmiri separatists who want to to falsely claim human rights violation in the valley. They are the same people who falsely try to project hardcore terrorists pelting s ...MORE","label":0},{"review":"This movie is complete nonsense made with the intention of showing Indian army officers in poor light. Our soldiers never kill innocent people. It is complete wrong depiction of Indian army. The personal feelings of an Indian army officer never interferes with his duty. This movie looks like a conspiracy by muslim extremists and Kashmiri separatists who want to to falsely claim human rights violation in the valley. They are the same people who falsely try to project hardcore terrorists pelting stones at Indian army vehicles as misguided youth.","label":0},{"review":"The way in which Indian Army was depicted here, was a total insult to all of the people serving the nation. Not taking away from the fact that there may be chances of such officers serving in the army and we are not totally aware of the situation they go through on Indian border, but just ridiculing the Pride of them by showing them as mass murderers of people belonging to Muslim community, is totally wrong. Loved Kay Kay Menon and Rahul Bose in this.","label":0},{"review":"Apart from KK menon, the movie don't has much to offer by it's supporting caste. Deepak dobriyal is good in the limited and constrained role. Javed jafrie could have been replaced by a mature looking actor. Rahul Bose is not up to the expectations. The journalist is extremely annoying and bubbly type for such an area.\n2.5*/5","label":0},{"review":"Movie are realistic some time we can't judge officers likes Rathor . Indian education have to be sure learn our officers respect human being .If a group of people army tent in your town & different type of thinking person present in this group or they do something wrong we can't forget these moments & anger will come in local people .I think same are happen in Kashmir.","label":0},{"review":"Obviously deepak dobriyal did his job and that was brilliant. But I like this movie because of k.k. menon's act, specially the climax court room scene.  K.K. Menon and Deepak Dobriyal are superb, but rest of the main characters r not so charming.","label":0},{"review":"Superb.  K k Menon is incomparable. His skills as an actor are supreme    And Bose vid Minisha are also superb.  Dobriyal is so talented.   Fantastic storyline","label":0},{"review":"Such wacky picture it was.. I mean you guys do a full copy of a few good old men and them show us a poor class acting I'm really hurt dude.. The best part is onky Kay Kay menon acting and nothing else.","label":0},{"review":"very good movie ..great acting by kk menon  ...and i don’t think it’s a one sided movie ...evil is there in both side ...this is wat movie shows ... finally the is behind bars ..got goosebumps at last wen captain  javed salutes to major","label":0},{"review":"This movie is one of my best movie in india\nIt's brilliant movie I love this.\nBy seing this movie I want to be a INDIAN ARMY only coz it's my hobby n dream\nThts never will fulfill.","label":0},{"review":"It is good messaged movie...if u think k k menon is wrong then i must say u plzz think then say...sometimes we need not have to apply democracy everywhr becoz when democratic protocols were written at that time there were no any child who has AK-47 in their hand...but now things are changing society is developing in diffetent way....just think when that child with ak-47 (mooted by terrorists) is infront you ...will u just  think this is a child or will u defence or will u think abput ur democrac ...MORE","label":0},{"review":"It is good messaged movie...if u think k k menon is wrong then i must say u plzz think then say...sometimes we need not have to apply democracy everywhr becoz when democratic protocols were written at that time there were no any child who has AK-47 in their hand...but now things are changing society is developing in diffetent way....just think when that child with ak-47 (mooted by terrorists) is infront you ...will u just  think this is a child or will u defence or will u think abput ur democracy....that time people r different but now r different so we hav to just adapt...","label":0},{"review":"Totally one sided. Horribly biased and attempt to defame army.\n\nQuestion to ask is why is that always a Muslim is depicted as the most pious and honest person? Is Bollywood trying to send a message or attempting for subtle brainwashing?","label":0},{"review":"A good movie. Kay Kay Menon at his best. The other actors didnt quite suit to the army role. Better actors selection could have taken this movie to new heights.","label":0},{"review":"A Bollywood remake of 'A Few Good Men', with borrowed plot undertones from the Hindi play 'Court Martial'. Stellar acting by Deepak Dobriyal, some fine moments by Kay Kay Menon, and Rahul Bose. Definitely worth a watch.","label":0},{"review":"What a movie !\nThroughroly got moved and inspired,\nall BJP bhakths should watch this to get some humanity into their heads.\nNot only governace even the army should have ethics of human values !","label":0},{"review":"It's the fact. Phycological past affects present decisions. Stay clear, focused and unbiased. Excellent performance from there class actors. Kay Kay menon, Javed Jaffery and Rahul Bose.","label":0},{"review":"Awesome movie......Those who are saying that the story is biased and support only one aspect have not understood the message appropriately. The climax of the movie has a great message.","label":0},{"review":"Kay kay Menon embodies rage and hatred and intolerance. He makes you feel this till nerves. Great script,  great performances and climax is just brilliant","label":0},{"review":"BEST MOVIE TO KNOW WHAT EXACTLY GOES AROUND .BASED ON TRUE FACTS ..LOVED THE MOVIE .GRAND SALUTE TO ARMY FOR ACTING SO WELL TO SAVE OUR COUNTRY AND OUR FREEDOM","label":0},{"review":"The worst movie which allows a journalist in a sensual army camp and and releasing such movies when all the kashmiris throwing stone on Indian army. More over an officer of Indian army was charged for tying a young man in front of the jeep against stone throwing Mob","label":0},{"review":"I think it's a very good movie with great story. The acting of KK Menon is too good. Just loved it.","label":0},{"review":"An extremely poor copy of a Hollywood gem. \nThis movie is made in extremely poor taste and is rendered completely unwatchable by Bose's pathetic overacting.\nAm update uninspired attempt at copycatting. \nNot recommended.","label":0}]