[{"review":"I born in 1977 very happy person to know this Sai baba my favorite. Recently on my birthday unfortunately I was passing baba temple a priest called me and told to have Prasad kheer. Which my mom has to make kheer on my birthday after 11 yeras of gap Sai baba gave me on my birthday love him.","label":0},{"review":"First I Must Thank Manoj Kumarji His Selection of The Cast Ultimate Each and Every Actor Actress Have Performed The Role Well I Have Seen This Picture in TV Many Times When Ever I See This Picture I Feel That I am With Baba, I Once Again Thank Manoj Kumar Ji About Songs Every Songs Touched My Heart","label":0},{"review":"This movie shirdi ke sai baba 1977. I like very much. I have a deep faith in shirdi sai baba. I read sai satcharitra every thursday. And I have many experiences in my own life. I don't know how is god. But for me saibaba is my baba. Whom I can share anything. I love shirdi sai baba.","label":0},{"review":"I have faith in my gods only .a new God man  who was Muslim has been made popular by a deep conspiracy to distract us from our faith in our gods.This movie had  increased the devotees of sai baba.","label":0},{"review":"I keep watching this movie from time to time.It has done full justice to the life story and teachings of Sai Baba .The vibration of purity is also very much there.","label":0},{"review":"This movie is the best possible depiction of life of Baba, wherein the values of happy life are taught to all devotees in simple manner. My humble pranam to Sai, Om Sai Ram.","label":0},{"review":"Sudhirji Dalvi has portrayed the pious image of shree baba with so much devotion, there have been many movies but this movie is the best will be the best .\nJai sai ram!","label":0},{"review":"Very beautiful movie. I loved it, the whole star cast is amazing . Every person has to watch this movie.","label":0},{"review":"Great movie on saibaba and the songs are awesome I am great fan if it sainath Tere hazaro haath","label":0},{"review":"All Actors are great worked in this movie...Really Superb movie on biography of Saibaba I ever seen...\nOm Sai Ram..!!","label":0},{"review":"I like to much this movie\nSai baba is my love and life\nHis worshipping is aim of my life","label":0},{"review":"Excellently portrayed Sri Saibaba. I forget the world watching this movie. Sudhir Dalvi looked just like Baba.","label":0},{"review":"Superb film I was very small I and my brother used sing the songs whole day","label":0},{"review":"It is a divine movie and very touching.it is the best movie of all times.Hiralal Jethwani","label":0},{"review":"Super awesome movie...I always get inspire by the messages and quotes from the movie....seems real 😘","label":0},{"review":"This movie create faith in presense of God \n\nSuperb movie \n\nEvery person Must watch this movie","label":0},{"review":"Fantastic movie on Sai Baba. I like this movie very much. Jai Jai Sainath Avtar.","label":0},{"review":"Love my Sai Nath mere baba. Live this film too ❤️❤️","label":0},{"review":"Very beautiful movie of the time.  A must watch","label":0},{"review":"Great Movie...Great acting...after this movie everybody know about the Sai Baba..","label":0},{"review":"Watch when you want motivation, when you are feeling low, or when you are are excited, at all times this will guide you...\n\nOm Sai Ram","label":0},{"review":"Superb movie excellent performances by all the actors","label":0},{"review":"This film is released in 1977.but every time when ever I watch this movie I feel it is produced \"TODAY''","label":0},{"review":"Om Sai Ram. Can anybody send me the link to download this full movie along with songs.","label":0},{"review":"Great movie   knowledge of ghyan and sadguru","label":0}]