[{"review":"This movie is based on the true events. As the name suggests, it is the encounter killing that took place on Nov 16,1991 at lokhandwala complex, Mumbai.\nI remember the day I watched this movie, the theatre was full like anything. I still can think back every single dialogue, music, sequence, and that \"ganpat song\", one of the famous one of that time.\nIn this movie you see big starcast, big names, guns, bullets, blood, kills and all that. Performances from everyone is good. And the character you  ...MORE","label":0},{"review":"This movie is based on the true events. As the name suggests, it is the encounter killing that took place on Nov 16,1991 at lokhandwala complex, Mumbai.\nI remember the day I watched this movie, the theatre was full like anything. I still can think back every single dialogue, music, sequence, and that \"ganpat song\", one of the famous one of that time.\nIn this movie you see big starcast, big names, guns, bullets, blood, kills and all that. Performances from everyone is good. And the character you will enjoy the most is Maya Dolas (played by Vivek Oberoi). If you like action-crime drama, this movie is for you.","label":0},{"review":"Heard a lot about this movie but was completely led down weird acting worst casting even amitabh bacchan's acting was overrated.\nTushar kapoor as underworld seriously in the entire movie he looked like a tapori college student who gets beaten for no reason.\nVivek oberoi acted well but his character was not written well somewhere he is shown as if he has no feelings who kills anyone and then he talks so generously with sanjay dutt about not indulging families in berween\nMost funny scene was where ...MORE","label":0},{"review":"Heard a lot about this movie but was completely led down weird acting worst casting even amitabh bacchan's acting was overrated.\nTushar kapoor as underworld seriously in the entire movie he looked like a tapori college student who gets beaten for no reason.\nVivek oberoi acted well but his character was not written well somewhere he is shown as if he has no feelings who kills anyone and then he talks so generously with sanjay dutt about not indulging families in berween\nMost funny scene was where ded pasali tushar kapoor beating hatta katta cop sunil shetty \nI am not a john abraham fan but had to say that shootout at wadla was much better than this movie,it has some sort of story while in shootout at lokhandwala  no story he is don he is a tapori everything.","label":0},{"review":"The best action based bollywood movie. With best dialogues and songs. Sanjay Dutt, Sunil Shetty, Arbaz Khan, Tushar Kapoor, Amitabh Bachan and especially Vivek Oberoi have performed their best ever acting skills.","label":0},{"review":"A great movie.did not know it was based on a true story.this film shows the world of dons etc.and also do read on wikipedia you will learn more of it and the photos of the dons are available","label":0},{"review":"Watch this, search internet for facts... you will know that how a fact can be made such a fantastic realistic movie","label":0},{"review":"Overall movie is good, but action sequences/shootouts were quite lame. The extra police forces (junior actors) don't seems like professional policemen, and they breaks the \"suspension of Disbelief\".","label":0},{"review":"No one can ever perform the role what played by vivek oberoi he over shadowed Co actors sanjay sunil amitabh bacchan..  In this movie.. This movie all about vivek oberoi n his acting","label":0},{"review":"Yes based on a real story.Mumbai is cleaned\nlike this.Once a place of haftakhors; Murders&Gang wars.salutations to ATS\nShoot to kill.","label":0},{"review":"Great movie. Plots were best. Loved the acting and Gangster attitude of Vivek Oberoi.","label":0},{"review":"Great film! Full action pack performance. Wonderful to watch.","label":0},{"review":"It was a true incident which took place I like Maya dolis act i.e Vivek obroi awesome act","label":0},{"review":"Great movie I like and full\nfull entertainment this movie\nOn\nPublo\nPublic","label":0},{"review":"I just lovedd the film. Vivek oberoi at his best ❤","label":0},{"review":"I like this movie  really  my  heart  touching","label":0},{"review":"Best movie of my life....just gave me goosebumps","label":0},{"review":"I Love This Movie my favourite movie ❤","label":0},{"review":"Awesome movie lots of action loved it !!!","label":0},{"review":"vivek oberio best actor\nreal gangsta","label":0},{"review":"best movie ever i seen in bollywood 😊😊","label":0},{"review":"Best action movie of Bollywood.","label":0},{"review":"Vivek is paisa vasool action-man, Awesome...","label":0},{"review":"Superb movie","label":0},{"review":"superb faddu movie..my fav.😎","label":0},{"review":"Good movie","label":0},{"review":"best movie","label":0}]