[{"review":"One of the best movie of John Abraham and sonu sood. Manoj Vajpaaye looks like a badass don with his looks and killer dialogues. Anil Kapoor makes a remarkable comeback along with Ronit Roy. All actors in this movie did a fabulous job and their acting and screen presence will be remembered for ages. Dialogues of the movie written by Milap Zaveri were top notch. BGM by Amar Mohile was satisfactory. Songs in this movie were of same type and so I ignored some of the them.\nThe thing I didn't like wi ...MORE","label":0},{"review":"One of the best movie of John Abraham and sonu sood. Manoj Vajpaaye looks like a badass don with his looks and killer dialogues. Anil Kapoor makes a remarkable comeback along with Ronit Roy. All actors in this movie did a fabulous job and their acting and screen presence will be remembered for ages. Dialogues of the movie written by Milap Zaveri were top notch. BGM by Amar Mohile was satisfactory. Songs in this movie were of same type and so I ignored some of the them.\nThe thing I didn't like with this movie was forcefully inserted,excessive and cheap slang languages. This was simply irritating for some part. John Abraham could have stopped Director and Dialogue writer to avoid slang languages. Screenplay of the movie could have better with better editing. \nRatings:7/10.","label":0},{"review":"Story is good enough and all the actors have done a justice to their characters but the punching dialogues added the boost to the story line...\nI always watch this movie only-begotten the for the punching dialogues 😎😎😎\nOne of the best dialogue is here for you guys.\n\nManoj Bajpai : kaam kya kartha Hein?\nJohn: sareer mein 206 haddiyan Hein aur sammhidhan mein 217 Kanoon..\nHaddi se lekar Kanoon sabbthodtha hu\n\nThere are many more power full dialogues in each and every scenes of the movie so guys ...MORE","label":0},{"review":"Story is good enough and all the actors have done a justice to their characters but the punching dialogues added the boost to the story line...\nI always watch this movie only-begotten the for the punching dialogues 😎😎😎\nOne of the best dialogue is here for you guys.\n\nManoj Bajpai : kaam kya kartha Hein?\nJohn: sareer mein 206 haddiyan Hein aur sammhidhan mein 217 Kanoon..\nHaddi se lekar Kanoon sabbthodtha hu\n\nThere are many more power full dialogues in each and every scenes of the movie so guys enjoy it.","label":0},{"review":"ULTIMATE ROLE OF MR. JOHN ABRAHAM WHO DID FORCED BY HIS CIRCUMSTANCES ROLE OF PERSON MANYA SURVEY.\n\nCHEER UP,,,FOR HIM!!!!!\n\n\nDO MORE MOVIES LIKE THIS !!!!\n\n\nALL THE VERY BEST MR. JOHN !!!!","label":0},{"review":"What a movie a complete entertaining.. Every songs are good, dialogues outstanding, actions power packed. Climax  is little confusing.","label":0},{"review":"Very Good And Action Movie.\nAnd The Role Of Manya Surve By John Sir Is The Great And Non Comparable By Any Other","label":0},{"review":"A role of manya surve and zuber very well played by john and Manoj vajpayee respectively...Gripping film till end","label":0},{"review":"Mumbai police is influenced by western nations as the West promotes corruption in the developing nations of the Eastern side  of the globe. The tyranny of this reality is successfully portrayed in this real story of the courageous man Manya","label":0},{"review":"Extraordinary Dialogues and Music ..\nSpecific Action and REAL Story loved it john ❤️😘","label":0},{"review":"This movie is really amazing !!! All actors who plays role in this movie I just can't explain it","label":0},{"review":"My overall review is , Superb story + strong acting + great & strong dailouge + amazing songs + superb background music + great direction.\n🔥🔥🔥","label":0},{"review":"great movie. the role of john abraham is too good\"manya surve\"","label":0},{"review":"John abrahm performance mind blasting and anil Kapoor or Sonu sood acting is very very good","label":0},{"review":"Jon sir u are great.  I am your bigest fan.","label":0},{"review":"Superb concept, great dialogue deliveries and good character build. Still, a one time watch.","label":0},{"review":"It’s superb movie full of excitement from starting to till end ........every one performed full faad....","label":0},{"review":"A superb movie top roll manya survey a John Abraham very good performance","label":0},{"review":"I love the story of this movie. I like the charecters","label":0},{"review":"What a movie .I feel very good after seeing this movie.but in last  I feel very bad and sad because of john abraham death.","label":0},{"review":"Awesome movie, John totally fit into the role. Love the movie.","label":0},{"review":"J think this a ultimate hero of story is based on true events","label":0},{"review":"A good movie\nEspecially john is awesome","label":0},{"review":"Very good movie, one of the best movie of John Abraham","label":0},{"review":"Fantastic acting by all the Actors","label":0},{"review":"One of the best movie      john","label":0},{"review":"Super movie. Special Great role John Abraham....... Manya  surve","label":0}]