[{"review":"Very confused movie...I don't understand why people in present day India are using what happened 1000 years ago to claim benefits today. They are acting as if Brahmins of today had killed them in previous life . Moreover the movie claims Aryans invaded India a theory which is not get proved. Rakhigarhi excavation shows maybe Aryans were indigenous Indians.","label":0},{"review":"I think this Movie can change depressed class mind who doesn't know about their history that how much has been oppressed by brahmanas upon them and their ancestors.and now I appeal  our aboriginal our sc/st/OBC you have to be redical to break all  chain which is obstacle in our development . jai bhim","label":0},{"review":"Annakin movie is not confused but you are cos you can not decide wether you should appreciate the upper class people or to condemn them. And this movie is not for the kind of confused people but for those who have the direct aim to live life with dignity and honour.","label":0},{"review":"If viewers are mature enough, please do watch. However, acknowledge many others perspective and time frame. Also reforms are possible only by political means and change in oneshelf. Violence in any form in the society should be condemned and to be dealt with firm law.","label":0},{"review":"I appeal to Indian people to watch this movie .real picture of Indian history .this is very important document which place the real picture.thnks a lot to director Mr Sanjayji Jaiswal and all team members  who dare to make this movie......Vivek","label":0},{"review":"Superb acting and creations I suggest this movie to all indian people who don't know what is reality behind reservation .","label":0},{"review":"every indian should watch this movie to know our worst social system.. inhumanity .. caste system of ancient india","label":0},{"review":"A great movie describing the actual status of people before independence. Awesome!!!!","label":0},{"review":"All I think of is how can PPL b so inhuman.. literally tears rolled down o my cheeks.. afterall v all are same species...y so much hatredness n vulgurness","label":0},{"review":"still indian are indulging themselves in such a narrow minded caste system thinking.All human being are same..time to change this lower/upper caste thinking.","label":0},{"review":"Harsh reality depicted properly. Great movie.","label":0},{"review":"Very fine movie and kileyar cut","label":0},{"review":"This movie is fooling Hindus on castism PLZZ ignore this movie","label":0},{"review":"Really good movie","label":0},{"review":"Another way to widen the gap between the so called dalit and swarn","label":0},{"review":"Fake movoe","label":0},{"review":"Every Indian should know their past because INDIA is all about PAST.","label":0},{"review":"It's important to know History...","label":0},{"review":"It describes our past","label":0}]