[{"review":"Sixteen a movie epic in it's kind.\nThe movie is most beneficial for those kids which are coming to this age and more familiar for those who passed this age.\nTells about the mistakes we've done and gives the better ways of precautions in our coming life.\nI am a big fan of this movie and characters specially \"vikram\" in the movie.\nwatch it if you didn't.","label":0},{"review":"One of my favourite movie is sixteen. Because I am also sixteen and i can understand the problems faced by teenagers the stage of teenager was the best stage of life...😊😊😊","label":0},{"review":"Not really a nice film. Films like these doesn't cause any good to the society except creating a misogynistic idea. Over exaggeration is there. Teenagers have much more things to do than to just think about boys/girls or men/women.","label":0},{"review":"sixteen portrays the picture of lost innocence and teenager's percepective.\nits really a good movie and conveys a strong message to the society.\nloved this movie ......its really worth watching.","label":0},{"review":"This movie tell about what actually happens in teenage.And the mostly happened in every teenager's  life most off in higher school,But can say this its also prepare for future and its hard to describe.","label":0},{"review":"Idk if it's weird but I can relate with so many  characteristics of each 16teen years old in this movie.","label":0},{"review":"Its a very true moview based on thinking and living style and problems of class-11-12 students really liked it","label":0},{"review":"I just love this movie ... thank you to the director n script writers for the motivation ..😊","label":0},{"review":"The film has changed me completely my life this film\n\n\n\nThanks all of you","label":0},{"review":"This movie has great plot but story is a bit weak and direction is also not that good and sometimes fails to deliver the theme.","label":0},{"review":"I love this movie.....approx 25 time i watch this movie.....nd tanisa you are so cute....😆😆😆","label":0},{"review":"That was worth watching.. Picturised the whole teen scenario of this modern society..","label":0},{"review":"One of the finest acting, innocent, true to billions \nof sixteens out there!!","label":0},{"review":"The best movie I've ever watched!!  Gonna watch it again","label":0},{"review":"Its a nice movie good story overall very good","label":0},{"review":"After \"Days of tafree\" this movie is added to my hit-list.\nworth watching 😊","label":0},{"review":"A true and real movie...that actually represents true minds of we teens...","label":0},{"review":"Awesome! It's a sholey for teenagers.","label":0},{"review":"I love this movie","label":0},{"review":"is there any other movie like this? If yes then tell me please...","label":0},{"review":"Good movie","label":0},{"review":"Its amazing","label":0},{"review":"Really Good,","label":0},{"review":"Really nice movie .","label":0},{"review":"I think it somewhat touches the genuine","label":0}]