[{"review":"One of the nicest movies ever made. I just love it. The best part about it is that subtle inherent humor which can be perceived in almost each and every scene. Good work by the director and all actors.","label":0},{"review":"\"Socha Na Tha\", it came, it saw and it went away. Like me many of you would have missed it. Post-Jab We Met however rewrites the rules and I was persuaded to retrace my steps and take notice to Imtiaz Ali. Believe me - true to its title \"Socha Na Tha\" Imtiaz is a fine story teller indeed. Probably it was the timing of the release or perhaps it lacked the star-value owing to which it didn't get the recognition it deserved.","label":0},{"review":"Amazing movie. One of the best love story. Ayesha and Abhay are so adorable in the movie. Watched it today after 12 yrs. Still love the emotions and touching scenes of movie.","label":0},{"review":"Good movie with simple story having romance and comedy.Music is so so . Dialogues are good . Overall an entertaining film","label":0},{"review":"One of the finest movie done by any New Comers and also by Vijayata productions.\nChemistry and charm between Abhay and Ayesha is extremely realistic..","label":0},{"review":"Masterpiece by the master.. Imtiaz ali u rock.. So simppe n common story but still so new nd lovely presentation","label":0},{"review":"Good movie with new concept. Watched today after 14 years of release. Abhay and Ayesa looks adorable, with some good songs.","label":0},{"review":"The most underrated and romantic movie ever .\nThe Movie was was way ahead of it's time (2005). Music and lyrics are good too","label":0},{"review":"What a nice movie, Aaiyesha n Abhay impressed me, Dialogue Delivery was good, After long time very loving stor😊👍","label":0},{"review":"It's my favourite movie. Watched it so many times but still find it fresh and beautiful.","label":0},{"review":"Movie story and everything is ok..except that uncle hero..hero look like uncomfort to tis character..he was look like uncle n 2005 also.. then story concept also out dated.. it was on 2005 ..so thts ok ..\n    It's very very old concept story..","label":0},{"review":"I love this movie I watched many time even i don't know also how many time nice love story and family drama.....","label":0},{"review":"One of my most favorite Hindi romances. Simple, light and funny.","label":0},{"review":"One of the rare gems of Bollywood that is dreamy, yet sensible. This movie is all hearts!💖","label":0},{"review":"Never seen movie like this really great movie\nand nice song also specially meri koi nahi is very romantic song","label":0},{"review":"For that time ,a strange and for now a realistic love story. Imtiyaz wala taste.","label":0},{"review":"that was something  fresh & original \nLove every bit of it \nAwesome movie","label":0},{"review":"I just loved it 💕 one of the best movies of Bollywood","label":0},{"review":"It potrays love as it is, simple, natural and destiny driven.","label":0},{"review":"Somewhere this movie will connect you with your story....specially the song .....Mera Tumara...... a soulful song sung by Sandesh sandliya.","label":0},{"review":"Most touching human behavior sketch in this movie , Splendid","label":0},{"review":"One of the finest rom com of hindi cinema. ..... must watch","label":0},{"review":"Amazing beautiful simply crack love story of movie....","label":0},{"review":"Classic, it's worth the watch","label":0},{"review":"Lovely movie..watched this after a decade.","label":0}]