[{"review":"Awesome movie . Storyline direction is too good. Actors acting is superb speciallys Anupam Khers and Manoj bajpayee . They have given absolutely true message that 99 percent people are earning in black money example industrialist , politicans, film stars, police officers, prime minister's  ,.  President's etc. They are not proper tax payers. That's why they are leading luxurious life style  and getting protection from police and we public's are doing worship of them. They are hiding their money  ...MORE","label":0},{"review":"Awesome movie . Storyline direction is too good. Actors acting is superb speciallys Anupam Khers and Manoj bajpayee . They have given absolutely true message that 99 percent people are earning in black money example industrialist , politicans, film stars, police officers, prime minister's  ,.  President's etc. They are not proper tax payers. That's why they are leading luxurious life style  and getting protection from police and we public's are doing worship of them. They are hiding their money in house walls so that no one can notice that they have lots of money. These movie is based on real life incident","label":0},{"review":"So good!!  I never see such excellent acting as in Indian movies. The stars move like clockwork.  Of course that is due mainly to direction and choreography, but what a team!  With the exception of one that did not appeal to my taste, the eight I have seen have just about worn my brain out.  I'm a big fan of thrillers and mysteries and Special 26 doesn't disappoint. Bravo!!!","label":0},{"review":"Great movie... Now a days few movies are like this great... \nAnd MOST of the BOLLYWOOD movies are Just GARBAGES (Contain masala, songs, romance and family drama), it's better to watch TV serials... !!!!!\nThat's why nowadays i watch only very few selected good movies... like of Manoj Bajphayee, Irfhan khan, Nawazuddin siddique etc.","label":0},{"review":"This is movie is seriously extraordinary and really very smart one!!!! I never got a second to get bored while watching it as its thrilling story totally conquered me!!! The acting performances are also remarkable specially manoj bajpayee's","label":0},{"review":"Extraordinary movie which keeps us glued to the screen. Excellent screenplay. Till the climax we cannot guess what is going to happen. We'll made film by gathering the true incidents.","label":0},{"review":"A man who have a keen interest to join the RAW agency. But after giving so many interviews he was not successful. So he made a team and with this team he loot to a huge gold shop and most other crowded and famous places by informing intelligence before stealing.","label":0},{"review":"This film was the best thriller in 2013 and a hit which crossed 100cr. Mark . The film got great mix of thrill , comedy, action and interest akshay and anupam kher top performers in the movie","label":0},{"review":"Awesome movie..👌 Really good direction ,by, neeraj pandey, 👍story line to good 💘/akshay Kumar, manoj bajpai anupam kher, Jimmy shergil, all parfomence n acting. Brilliant 👐","label":0},{"review":"A very good movie, with a strong script and an appreciable direction. Based on the opera house heist, the movie tried to capture the beauty of the city in its whole grandiosity","label":0},{"review":"Movies like special 26 , A Wednesday were great at their times but now it can be interpreted as cringy/childish dialogues, too much dramatic music , short story & stretching it long.\nUgly, drishyam , gangs of wasseypur really surpassed the future & still watchable in 2019!","label":0},{"review":"The movie is really good. Keeps you on the edge and had the best turn of events. Hats off to the team of special 26","label":0},{"review":"Really this movie is one of the best movie based on CBI crime. So I think most interesting and funny type movie , I'm very enjoy in this movie.","label":0},{"review":"one heck of a movie. one of the rare gems that bollywood produce once or twice a year. acting,direction and storyline were top notch.absolute must watch.\nrtng 4/5","label":0},{"review":"The main highlight of the film is acting skill. Anupam ji, Akshay Kumar, Manoj was tremendous. Showing us the true issues of our country (black money). An awesome movie.","label":0},{"review":"I feel this is a film of right choice and released in right time.  Theme is excellent and script is superb. I give 4 and half stars.","label":0},{"review":"At times funny and at times serious, Special 26 is a well-crafted crime thriller that has some really surprising twist-and-turns that prove Neeraj Pandey is one of the greatest Bollywood directors.","label":0},{"review":"It's morning 2am n I felt that giving the review of this movie is important.. instead of sleeping I have to come to give u a review means u have to understand how good the movie is... Don't miss it..😊😊","label":0},{"review":"I like this movie very much all carector has perfectkly acted specialy anupam kher he look lie real office and othe also suaiteble for same and they work together like real scod","label":0},{"review":"One of the best movies. Great direction. Crisp, fast moving and no nonsense","label":0},{"review":"When you think in fantasy way this is good. But this type of movies is a big crime plot for criminals.","label":0},{"review":"Watched it today on Netflix.. can't believe Bollywood could make such a high standard movie ..great actors ..perfect twists and turns ..❤️🤗","label":0},{"review":"Special 26 is good movie,Thana serntha kootam (Tsk) remake is also really great\nBoth movie are owsm. Different story line\nSpecial 26- 4.2/5✌💖\nTsk            - 4.1/5👏💖","label":0},{"review":"Awsm story development but lengthy screen play...Akki and Manoj were too good... Over all it was nice..","label":0},{"review":"superb Movie. Akshaykumar sir doing a great job .The hittest and fittest Khiladi of Bollywood.⭐⭐⭐⭐⭐Five stars.","label":0},{"review":"Awesome movie depicting  theft in opera house  theft 1987 done by fake CBI officers remains unsolved Watch atleast once","label":0}]