[{"review":"Please stand by was a cute movie, dealing with the issues of autism as well as hitting a fan base Star Trek audience. I believe the movie did hit some points and issues that are dealt with in the world of MRDD families. Besides the whole movie plot and star trek fans, I feel the movie address the problems in MRDD families when it comes to caring for and including someone who has a disability or special need. It was heartbreaking to see a sister not try and be there for her sister with autism. I  ...MORE","label":0},{"review":"Please stand by was a cute movie, dealing with the issues of autism as well as hitting a fan base Star Trek audience. I believe the movie did hit some points and issues that are dealt with in the world of MRDD families. Besides the whole movie plot and star trek fans, I feel the movie address the problems in MRDD families when it comes to caring for and including someone who has a disability or special need. It was heartbreaking to see a sister not try and be there for her sister with autism. I understand people have life's and cannot care for the ones they love all the time, but to leave them in a home and not try is not a healthy relationship for either person. \nI would say the actress did a nice performance acting as an autistic person, I will say the spectrum is wide and hard to act as every level on the spectrum if you are not on it yourself. They did seem to get mains points such as social problems, lack of eye contact, noise and sight issues, and the interest/obsession in one particular hobby. I also respected how the officer handled and defused the situation. We need to have more people on the force like him. as well as, classes and programs to train officers on how to recognize and handles a situation with someone with MRDD. For people who are interested in the health care of MRDD people, I would say this a level 1 of what really happens in the world of MRDD families. This movie is informative with a cute and sad storyline. I will say the main character, as well as everyone else in the film, is a true winner at the end of the movie. \n\nMy rating overall is 7.5/10\n2 point for somewhat doing a nice performance portraying a person on the spectrum\n5.5 points for the storyline and adding a bit of comedy with the Star Trek.","label":0},{"review":"Was really surprised with this movie.  Never heard of it before, even though a big Dakota fan.  Looks like maybe Asperger’s syndrome.  But love the Star Trek reference and relationships to the whole move.  Great actors in it.  Love Pete.   People need to watch this.  Kinda bittersweet.  Wish more of a relationship with sister but true to most real life relationship.  Definitely needed a higher score","label":0},{"review":"Dakota is the best female actress in the world right now. I loved this awsome movie. The cast was picked perfect. Thank you for this.","label":0},{"review":"I'm surprised more people haven't watched this. Please Stand By is funny, charming, sad, and sweet if not a little stilted.\n\n7/10","label":0},{"review":"Nice feel good movie With one or two unrealistic elements","label":0},{"review":"Nice one,,a movie sense","label":0},{"review":"Good movie.","label":0},{"review":"thought provoking","label":0},{"review":"Didn't catch autism right.","label":0},{"review":"asian the asian","label":0}]