[{"review":"Non-Stop is a captivating action thriller that keeps you glued to the edge of your seats. No subplots, no slow parts, no unwanted stuff: just the main plot full of action and suspense. What else do you need? The film is in itself one big set piece with a sharp editing and brilliantly crafted tension. Liam Neeson is really amazing and delivers with sincerity, be it the action or the talkie parts. Despite of being set in a plane, the film's plot will not let you even think about lack of exotic loc ...MORE","label":0},{"review":"Non-Stop is a captivating action thriller that keeps you glued to the edge of your seats. No subplots, no slow parts, no unwanted stuff: just the main plot full of action and suspense. What else do you need? The film is in itself one big set piece with a sharp editing and brilliantly crafted tension. Liam Neeson is really amazing and delivers with sincerity, be it the action or the talkie parts. Despite of being set in a plane, the film's plot will not let you even think about lack of exotic locations. Fight scenes are outstanding and every action block brings a new turn to the story. In short, Non-Stop is an intense, thrill-a-minute action ride that won't let go of the grip it has on you till the end. Go ahead, watch it!\n\n10/10.","label":0},{"review":"Because of Liam Neeson's screen presence, this movie elevates. Though there are some pot holes in the screen play for example; the way co pilot is  killed is not very convincing . However, the narration is fast paced and other characters add flair to Neeson's dilemma in the story. Background score is worth mentioning. And of course, there is a typical Neeson film hand to hand combat sequence which is very well filmed. But Jaume Collet-Serra has given a very good film with Liam Neesan \" Run All N ...MORE","label":0},{"review":"Because of Liam Neeson's screen presence, this movie elevates. Though there are some pot holes in the screen play for example; the way co pilot is  killed is not very convincing . However, the narration is fast paced and other characters add flair to Neeson's dilemma in the story. Background score is worth mentioning. And of course, there is a typical Neeson film hand to hand combat sequence which is very well filmed. But Jaume Collet-Serra has given a very good film with Liam Neesan \" Run All Night \" and it unfortunately was underrated and didn't earn the laurels it deserved.","label":0},{"review":"Absolutely love this movie! This is exactly what I want to watch. Great thriller... I bet you can't predict the next moment in this movie! If you miss even a single moment, you gotta confused. Enjoying every bit of the movie! 'Non-stop' goosebumps 😁Highly recommended to those who are searching for a movie after watching Inception, Identity, knowing, Train to Busan kinda thrillers.","label":0},{"review":"Rate this film and Neeson highly, he is the perfect fit. Action packed, suspenseful.. so intense at the end it’s emotional. A good plot twist, throughout on the edge of my seat. 4 stars","label":0},{"review":"When you are not in a mood to watch a movie then watch this; Liam Neeson does again what he is best at, just like its title 'non stop' thrill is non stop in this movie. Simple narrative, cool cabin lights, sleek hero and yes suspense that's all makes it a fast paced thriller.","label":0},{"review":"This movie is so much fun . The whole time I watched it I was guessing who it was , and I couldn't have predicted it , this is a very good action thriller , with a great and interesting performance by Liam nesson","label":0},{"review":"Just watched the film on Netflix and honestly it's one of the best I've seen in a long time. Liam Neeson has got to be one of if not the best actor of our time! Highly recommended.","label":0},{"review":"It's like every single minute is full of suspense, you will be just guessing who the real culprit is through the whole movie but at the end you will be shocked to know who that person was. Best thriller movie, must watch!!","label":0},{"review":"Super editing.  Great performance by the actors. Liam Neeson ,surely one of my top favorites. Julian Moore is a bit wasted.","label":0},{"review":"This movie made my day,  This is really worth watching movie. And I think it's entered the list of my favourite movies. And certainly I would give it 5/5 stars.","label":0},{"review":"A brilliant movie; builds up suspense from the very beginning, and delivers ultimately. Flawless performance by Liam Neeson and co.\nA must-watch thriller.","label":0},{"review":"Highly recommended. if you skip just 30 seconds, you won't understand onwards. Not a single wasted minute. Full of mystery and suspense.","label":0},{"review":"Highly recommended. if you skip just 30 seconds, you won't understand onward. Not a single wasted minute. Full of mystery and suspense.","label":0},{"review":"just wow! and what i say about liam neeson? he is just made for such movies. it was like i am also flying in plane. this is the movie you should watch before you die","label":0},{"review":"Very good movie. Watch it if u liked \"speed\" \n. Must watch if you're into fast thrillers.\nAnd if u are a liam neeson fan","label":0},{"review":"I like the fact that its a movie you can watch with your family, no sexual acts and the story is nice","label":0},{"review":"Aaah! I can’t describe how this movie was. This movie was a suspenseful movie. I have ever seen.😅😄","label":0},{"review":"The story of this movie is quite engaging 🎬👍\nLiam Neeson is awesome in this action-thriller 👌👏😎","label":0},{"review":"Liam Neeson is a great actor. Highly recommended movie to watch","label":0},{"review":"This movie is full of interesting facts and wacthing is like a true life sceanRrio of air marshal life","label":0},{"review":"Non stop thriller. Captivating. Keeps you glued to your seat.","label":0},{"review":"Ever physically watched paint dry? No? Then this is a must watch... So bad.","label":0},{"review":"Very good movie.\nU will not regret.","label":0},{"review":"This movie  burn your brain!\nI love it.","label":0},{"review":"The Best Thriller movie I have ever seen My Favorite movie","label":0}]