[{"review":"At that time of release i understood why the film became a huge flop because of the weak concept, storyline and though it is a family movie it fails to entertain the people.there are huge flaws in this film from start to the end.\n\nAt first rekha plays sharman joshi's grandmother\nIf riya calls her bharti aunty then why mann will call her \"nani\" he should have called her mom.it clearly states that the film's name is a mistake.is should be\"super mom\".i think baghban is far far far beeter among many ...MORE","label":0},{"review":"At that time of release i understood why the film became a huge flop because of the weak concept, storyline and though it is a family movie it fails to entertain the people.there are huge flaws in this film from start to the end.\n\nAt first rekha plays sharman joshi's grandmother\nIf riya calls her bharti aunty then why mann will call her \"nani\" he should have called her mom.it clearly states that the film's name is a mistake.is should be\"super mom\".i think baghban is far far far beeter among many family movies.\nNever expected such a bad boring dissapointed film from them.it issurly a flop","label":0},{"review":"I loved the Movie. every Movie is not about box office or money. \nAunty is something we can call anyone. I can call my frnd's mother aunty, I can call my neighbour aunty. So there is no relationship jeopardy here. Also woman has been shown as the very loyal other half of her man. A woman is a human with feelings and talent both. It's awesome movie.","label":0},{"review":"One of the most important concept needed to be learned by our youth is beautifully put forth by this movie...Being a reasonable concept and a movie to be learned from... I'm really thankful to the whole movie team for blessing Bollywood with something sensible!!😊","label":0},{"review":"You have to be a 10 years old child to enjoy this movie. They show things utterly impossible to believe. Talented actors who wasted their talents on a weak story line. - Lt Col GR Rajendren","label":0},{"review":"The movieis truly hopeless.\nThe part when Nani's bahu gives the take the mistakes she makes are sooooo lame","label":0},{"review":"its a nice wholesome family entertainment movie. Rekha as always is the reason.","label":0},{"review":"It is a very good movie and I love this movie Thanks","label":0},{"review":"More is literally well with nice concept of empowering women","label":0},{"review":"It is a very good movie that tell importance of mother.","label":0},{"review":"Very nice and emotional movie","label":0},{"review":"Indian people with no logic end up flopping good cinemas","label":0},{"review":"It was very nice movie","label":0},{"review":"Very very very very..... Nice movie","label":0},{"review":"awesome movie....lovely story","label":0},{"review":"I liked it","label":0},{"review":"About of importance of common women and about nani","label":0},{"review":"Very sensitive movie","label":0},{"review":"Super flop","label":0},{"review":"Hi I am student","label":0},{"review":"Improve acting","label":0},{"review":"how to watch this movi","label":0}]