[{"review":"Just watched it. Loved it. Mahira Khan is a true SUPERSTAR. She looked exceptionally stunning throughout the movie. Her performance throughout the movie was phenomenal esp the frustration, utmost disappointment and sheer sense of betrayal at the scene where conversing with \"Chutki\" on the phone.\n\n The movie has no extra special Comical characters but the dialogues were short, crispy and meaningful and...funny too at times. Bilal Ashraf's acting was not super, but cool enough and complemented wit ...MORE","label":0},{"review":"Just watched it. Loved it. Mahira Khan is a true SUPERSTAR. She looked exceptionally stunning throughout the movie. Her performance throughout the movie was phenomenal esp the frustration, utmost disappointment and sheer sense of betrayal at the scene where conversing with \"Chutki\" on the phone.\n\n The movie has no extra special Comical characters but the dialogues were short, crispy and meaningful and...funny too at times. Bilal Ashraf's acting was not super, but cool enough and complemented with Mahira Khan very well. Ali Kazmi as always had done justice to his character. \n\nNot for a moment movie seemed boring or dragged like PHL. Every scene is pinned with the storyline and context. \n  A love story painted with stories of achieving/Shattered dreams, betrayal, friendship, sacrifices, selfishness, and patriotism too. But the story was not here and there. There was one focus of the movie which was \"not to forget your relationships or loved ones in pursuing your dreams\". In the chase of being at the top -of becoming a \"Superstar\",  first Sameer Khan lost his loved ones and then Noori. True dialogue that they were the two sides of the same story. \nIt was beautifully penned. I have become a fan of Mustafa Afridi writing after \"Sang e Mar Mar\" and \"Yeh raha Dil\". His witty dialogues always come out very well...even now in tv play \"Ehd e Wafa\". \n\nKudos to the director Ehteshamuddin- everything, every person, every costume and every detail was beautiful. The movie as a whole was \"Beautiful\". The tempo got a little slower at the other half but did not drag. You can imagine that I occasionally forgot munching my popcorns fearing to miss my dialogues. The second half makes you glued to seat and could not blink your eyes for a moment.\n\n In the end, hands automatically rise to applaud. WOW! Impressive! \nThank you \"Superstar\" team for giving us such a high standard quality work. A movie to stay in your memory for good.","label":0},{"review":"Absolutely loved the movie. The ending where Mahira and Bilal finally made up seemed a bit rushed but otherwise everything was absolutely perfect. The dialogues, the characters and above all, acting by the support cast (Ali Kazmi and actress playing Mahira's younger sister) were  amazing. Mahira carried the entire movie on her shoulders but even Bilal Ashraf has come a long way since Janan. Overall a must see movie you can compare to any Bollywood or Hollywood movie.\nI am not sure why people get ...MORE","label":0},{"review":"Absolutely loved the movie. The ending where Mahira and Bilal finally made up seemed a bit rushed but otherwise everything was absolutely perfect. The dialogues, the characters and above all, acting by the support cast (Ali Kazmi and actress playing Mahira's younger sister) were  amazing. Mahira carried the entire movie on her shoulders but even Bilal Ashraf has come a long way since Janan. Overall a must see movie you can compare to any Bollywood or Hollywood movie.\nI am not sure why people get happy with bashing Pakistani movies. This movie was very well scripted by Azan Same with no loop holes.","label":0},{"review":"To be honest the movie was average and what i liked the most was the songs especially Anjaana and “In dino” Atif Aslam’s voice is magical and powerful which gives the songs it’s strength. Regarding the Acting, i am tired of seeing the same expressions on Mahira’s face ! She is only a good looking actress and not more than that and there are many pakistani actresses who are better than her. Bilal Ashraf is given the role just because of his body and that dimple on his cheek. Somebody please tell  ...MORE","label":0},{"review":"To be honest the movie was average and what i liked the most was the songs especially Anjaana and “In dino” Atif Aslam’s voice is magical and powerful which gives the songs it’s strength. Regarding the Acting, i am tired of seeing the same expressions on Mahira’s face ! She is only a good looking actress and not more than that and there are many pakistani actresses who are better than her. Bilal Ashraf is given the role just because of his body and that dimple on his cheek. Somebody please tell the director and producer it is not necessary to have a good body to be a superhero ! \nThe story line could be even better than that","label":0},{"review":"After watching that movie, I’ve decided I’ll never watch any Pakistani movie. It has no start, no end. No romance. No Drama. Concept and idea copied from Ashiquie 2. I left the movie after 15 minutes. Then forced by cousins to watch after interval. But I was chatting with my friend. Mahira Khan is worst actress. Bilal Ashraf’s entry song was Bollywood copy. Why the ratings is 8.5. Is that Quentin Terintino’s movie? Will Smith and other great Hollywood actors will kill themselves. I must say Paki ...MORE","label":0},{"review":"After watching that movie, I’ve decided I’ll never watch any Pakistani movie. It has no start, no end. No romance. No Drama. Concept and idea copied from Ashiquie 2. I left the movie after 15 minutes. Then forced by cousins to watch after interval. But I was chatting with my friend. Mahira Khan is worst actress. Bilal Ashraf’s entry song was Bollywood copy. Why the ratings is 8.5. Is that Quentin Terintino’s movie? Will Smith and other great Hollywood actors will kill themselves. I must say Pakistani’s should post true and honest  remarks.","label":0},{"review":"I don't know why at this point I make myself watch Pakistani movies and why I expect it to be good. I should know better at this point. The beginning of the movie, before the interval, was good. They were setting up the back story very well and then all of sudden it went downhill. After the interval, you were just left confused. It was a scene after another scene and then after another scene. The timeline didn't make sense. The viewer doesn't know how much time has passed, oh and the non sensica ...MORE","label":0},{"review":"I don't know why at this point I make myself watch Pakistani movies and why I expect it to be good. I should know better at this point. The beginning of the movie, before the interval, was good. They were setting up the back story very well and then all of sudden it went downhill. After the interval, you were just left confused. It was a scene after another scene and then after another scene. The timeline didn't make sense. The viewer doesn't know how much time has passed, oh and the non sensical Indian vs. Pakistani scene. What was the point of it, just to have the main lead return back? They could've used the Pandit actor as more of a villain. The ending was horrible, Noor is angry at Sameer for breaking his heart and she doesn't understand why her Agha Jaan would try to help him. They exchange a few lines and that's it?! They make up just like that ?!?! All I would say at this point is, don't watch the movie. Spend your money on something good.","label":0},{"review":"I wouldn't call it a bad film. The acting of Mahira, Bilal, Ali Kazmi, Nadeem Baig and the other actors was amazing. Music and cinematography was also great. However, there were some loopholes in the script. For me, it was difficult to understand what was the theme of the movie. Was it the struggle of Mahira or was romance the main purpose of the movie? Uptil the interval, the movie was great but afterwards things were rushed. We saw and felt how Noori felt, but it was not the same with Bilal's  ...MORE","label":0},{"review":"I wouldn't call it a bad film. The acting of Mahira, Bilal, Ali Kazmi, Nadeem Baig and the other actors was amazing. Music and cinematography was also great. However, there were some loopholes in the script. For me, it was difficult to understand what was the theme of the movie. Was it the struggle of Mahira or was romance the main purpose of the movie? Uptil the interval, the movie was great but afterwards things were rushed. We saw and felt how Noori felt, but it was not the same with Bilal's character. Maybe the movie makers should've given us an insight of his feelings and emotions as well. There were many things left unexplained after the interval, which I believe are the downsides of the movie. Other than that, it was a good one-time watch movie.","label":0},{"review":"Idk why people are saying that the movie is over-dramatic!? It’s NOT. It’s a perfecttt blend of everything and Mahirah and Bilal weren’t the only legendary performers here. Every single actor performed to his best. Be it Mahirah or even the sweeper. Suits well on the big screen and is full of perfection. There’s nothing negative to even think about it. I feel bad for those who went for the colors in “Parey Hut Love” and presumed that Superstar wasn’t upto the mark. Wow.","label":0},{"review":"Well a great treat to watch our superstar mahira khan she is looking absolutely gorgeous and the chemistry between bilal and mahira is amazing. Music is Superb no copy... but the story was average not twisted. But everyone should watch atleast once and support our own content. <3 if u support the pakistani cinema it will grow better and better","label":0},{"review":"After watching this film one can say that Pakistan came with a great revival in cinema. Its a great film to watch. There is no point where you get bored. It has drama,comedy,music and Romance. Superstar is a full Package. I loved chemistry between Mahira and Bilal. Y'all should go and watch this movie. Don't miss it.","label":0},{"review":"Honestly, it was such a waste of time and money.\nTruly I love watching movies and Drama of Mahira Khan but the script for her in this movie was not up to her talents. \nEmotional balance for roles were not even thematic. At one point Mahira is leaving Theatre and became SuperStar, All of a sudden when Bilal Ashraf comes in place, her attachment shoots up. This attachment of Theatre and Mahira was not focused before and in just 3 lines at end she reacted out of the way...\nSeriously theme less","label":0},{"review":"Strongly disagree with someone saying that never to watch Pakistani movie again. In fact I'll only watch Pakistani movie from now on. Glad to see they're gradually progressing. The quality is getting better in relation to past. I think not only in drama but in movies as well we don't need to import entertainment from another country","label":0},{"review":"Superstar is a super movie in terms of acting,  songs, dance, drama etc. Chemistry between mahira and Bilal was amazing. Loved the whole cast especially Nadeem sahib ,ever charming made for the film screen , must watch","label":0},{"review":"All Songs are copy from Bollywood especially Ranveer Singh's songs. Once a time, when India copied us. After watching this movie, I wanna go to the hypnotist to purge my memory. I'm very very disappointed. Item's Songs and dance were introduced by Bollywood. Both this things are belong to the Bollywood. We need to discover our originals.","label":0},{"review":"To be honest its an average movie , lollywood can deliver better than this in terms of acting, mahira is just getting edge and of her pretty face, acting is beyond the facial beauty, bilal ashraf needs to improve much much more regards acting. Ending was sudden, story was so so, but here i would say we should appreciate the effort, directors must listen carefully the viewers, we support our industry but industry must improve till perfection","label":0},{"review":"Fantastic. Must watch . Bilal ashraf improved him alot in acting and the eye contact was fab. Mahira done great job . It seems she just delve in her character. Nadeem baigs dialouges were superb. Great job.","label":0},{"review":"There are few movies in recent times that Pakistani cinema can be proud of. This is definitely one of those movies. It’s surprising to see negative criticism on web. If we can not promote such a good movie then not sure how Pakistani cinema can get self confidence and compete at International stage.","label":0},{"review":"Its time to watch this movie even you can watch with your family.\nI strongly disagree with haters...\nIt is a wonderful/perfect movie among today's (Bollywood-Lollywood) movies \n\nCast (10/10)\nStroy (10/10)\nDirection (9/10)\n\nYou never feel regret after watching the movie. \nMark my words Bollywood will copy this plot...","label":0},{"review":"Most disappointing film ever. A waste of time and money. I want to support the Pakistani film industry but after watching this movie I will think twice before watching another. Mahira Khan‘s performance was unbelievably poor. I used to be a fan but after watching this movie will never watch a film in which she is the lead actress. Bilal Ashraf has the look of a hero but he fails to convey any real emotions. Overall I have to say this is the worst Pakistani film I have ever seen.","label":0},{"review":"It was really a pathetic experience. The story was plagiarized by ashique 2.  In fact hero and heroine failed to collaborate each other.it is difficult to determine as its genre  is a love and romantic movie? Bz there is no love.the plot is very loose. Actually the writer is failed to determine the philosophy of story into picturization. Melodrama was so out of context. Please don't waste our time n money by watching it.","label":0},{"review":"Can do better there are many loop\nholes too many actors and only given one screen shot.  Support group actor still was not at all good. Maria khan we need something different, your dukhi scenes reminded me of Humsafer.  \nChoreography needs to improve a lot.  \nNothing beats load wedding.","label":0},{"review":"Total Waste of time! I expected the movie wud at the least be as good as our dramas but it was NOT... unfortunately!\nThe only thing likeable in the movie was Mahira’s wardrobe!\n1 thing is absolutely crucial for a movie:  \n                A STORY!🤷🏻‍♀️\n N it was absent! There was no anticipation, no breath holding or awww moments...! Not worth a watch!","label":0},{"review":"I liked this movie 50% not too much more but in this film there's a track of mahira khan (Noori) performing that is 100% not 1000% liked it so much I love this track performance soul to freeze it .... This songis better than this movie that's my best review for this ....","label":0},{"review":"I don't know how we manage to produce such pathetic and substandard movies. A total waste. And now they will expect support just because this was a pakistani production. The hell with your industry if u carry on like this.","label":0},{"review":"A good movie. Didn't drag, very romantic and sweet. Great acting by and excellent chemistry between mahira and bilal ashraf. Better than a lot of Indian movies.","label":0},{"review":"Unbelievably terrible movie, with such hype created, nothing was to be watched in this Movie. Where it started and where it ended, could not be understood. Even the people came to watch, were absolutely disappointed and distraught by the inferior quality of the Movie. Alas! we wasted our money.","label":0}]