[{"review":"I saw it in 2007 for the first time and since then it is undoubtedly one of my favorite movie. Ashutosh sir never miss a chance to give us the best of movies. All the actors have done a great job in it. Be it Mohan Bhargav (my favorite character superbly performed) or Geeta (beautiful and simple girl) or Kaveri Amma. The story beautifully conveys the messages leaving you speechless with emotions and tears.\nThere are several instances where you can feel the powerful acting. One of my favorite is  ...MORE","label":0},{"review":"I saw it in 2007 for the first time and since then it is undoubtedly one of my favorite movie. Ashutosh sir never miss a chance to give us the best of movies. All the actors have done a great job in it. Be it Mohan Bhargav (my favorite character superbly performed) or Geeta (beautiful and simple girl) or Kaveri Amma. The story beautifully conveys the messages leaving you speechless with emotions and tears.\nThere are several instances where you can feel the powerful acting. One of my favorite is when Mohan visits Haridasji and while coming back seeing a small boy selling water in kulhad decides to buy a glass from him despite being an NRI. Another favorite one is while everyone sitting at school location on Dusshra on being asked about the conditions in the U.S. how meticulously Mohan explains that one can't judge the country on the basis of varied culture and traditions. Bullseye!!","label":0},{"review":"Mind blowing movie. Easily one of my favorites. I like that slight dab of patriotism in this movie along with the will to progress our nation (countryside). I'm falling short of words just to describe how good this movie is. Brought tears to my eyes. And just to show how much I 💕  this film, let me tell you that this tops @ 1 among my all-time favorite Bollywood movies. This is a cult classic movie \nand a must watch for all the Indians. Great job by Ashutosh and the whole cast and crew who dedi ...MORE","label":0},{"review":"Mind blowing movie. Easily one of my favorites. I like that slight dab of patriotism in this movie along with the will to progress our nation (countryside). I'm falling short of words just to describe how good this movie is. Brought tears to my eyes. And just to show how much I 💕  this film, let me tell you that this tops @ 1 among my all-time favorite Bollywood movies. This is a cult classic movie \nand a must watch for all the Indians. Great job by Ashutosh and the whole cast and crew who dedicated their time to this movie 👌👍💯","label":0},{"review":"This movie is the best patriotism movie of India ever made and will be ever seen. Nothing ever can replace it. Every Indian must watch this movie. This movie has the possibility to bring a fundamental change in one's mind.\n\n Ashutosh sir did an outstanding job by making this film and starring SRK, Gayatri Joshi and every other casting actor. This was SRK's first time playing a different role other than a mad psychotic lover or masala comedian, and he excelled in his job. This movie is one of the ...MORE","label":0},{"review":"This movie is the best patriotism movie of India ever made and will be ever seen. Nothing ever can replace it. Every Indian must watch this movie. This movie has the possibility to bring a fundamental change in one's mind.\n\n Ashutosh sir did an outstanding job by making this film and starring SRK, Gayatri Joshi and every other casting actor. This was SRK's first time playing a different role other than a mad psychotic lover or masala comedian, and he excelled in his job. This movie is one of the best Indian films ever to be made.\n\nIf you haven't watched this, go to Netflix or in another movie website and watch it! I guarantee you you will love this masterpiece.","label":0},{"review":"Look on what day I re-watched this outstanding movie. Swades is a film that every Indian should watch no matter what. Patriotic movies generally, ask you to respect your land by showing facts and figures or may be our achievements but this particular movie persuades and convinces you to love India even after considering all its flaws. Extraordinary story, brilliant piece of direction by Gowarikar, simply great performance by SRK (one of his most admired performances) and a heartfelt album by Rah ...MORE","label":0},{"review":"Look on what day I re-watched this outstanding movie. Swades is a film that every Indian should watch no matter what. Patriotic movies generally, ask you to respect your land by showing facts and figures or may be our achievements but this particular movie persuades and convinces you to love India even after considering all its flaws. Extraordinary story, brilliant piece of direction by Gowarikar, simply great performance by SRK (one of his most admired performances) and a heartfelt album by Rahman makes this film a must-watch for all age groups. It will surely leave a wide smile on your face as it ends. RATING: 4.25/5 !!","label":0},{"review":"one of the best film SRK has ever done..doesn’t matter how many time i warch it..it keeps on giving me goosebumps everytime I see it. It’s something which bollywood has stop producing now a days..it teaches what meaning of true patriotism is..it traches to get up and try to find solutions for problems around you by yourself instead of looking at govt or someone else. Decade old movie but still relevant and I think it will always be. I expect bollywood to make more movies like this.","label":0},{"review":"There are movies and then there is Swades! I guess am too biased since i have watched it innumerable times😊 \n\nSRK never like this before or after.  Every person who graces the screen adds.  Be ready to get ur tear buds streaming.. And also enjoy the feel good which the movie gets one into.\n\nMusic is another of its stars.  Each song bettr than the previous. \n\nSalute u director ji. Wat a piece of art.","label":0},{"review":"This film stands right there at the apex of excellence for Indian cinema. It is so beautifully crafted piece of artwork that the viewer falls short of words to describe it. The film is a journey of self discovery and finding the love that was lost amidst all the chaos and also a taste of patriotism that hits the right vein. \nAll in one, everything is perfect about this movie.","label":0},{"review":"It's one of my favourite movie. Actors acting were too good. Dialogues were motivational . Social message was there . I have seen this movie 234 times I will watch again and again  . Because there is always respect of good things . Storyline presentation direction was very good . I have seen many people that when they settled in abroad . When they come in India they show too much of tantrum and attitude as if they are not Indians . I have seen my realatives I don't care of that dam. They are als ...MORE","label":0},{"review":"It's one of my favourite movie. Actors acting were too good. Dialogues were motivational . Social message was there . I have seen this movie 234 times I will watch again and again  . Because there is always respect of good things . Storyline presentation direction was very good . I have seen many people that when they settled in abroad . When they come in India they show too much of tantrum and attitude as if they are not Indians . I have seen my realatives I don't care of that dam. They are also indian after all.  They are going to abroad only because for extra income purpose . For dollars and in pounds income purpose .","label":0},{"review":"This is a simple yet a great movie. It has colours of patriotism along with the harsh truth and reality. How much I like that he was successful in producing electricity in that village but in reality can’t be that simple. Apart from that everything is well panned out and any and everyone will love this movie. Highly recommended.\nCheers\nS","label":0},{"review":"This is a cinematic masterpiece. It is a jewel of Indian cinema. The best work done by Shah Rukh Khan till date. The acting, cinematography, music everything of this movie was spot on. Very thought provoking story line backed by sheer patriotism. If you haven't watched it yet, do it right now!!","label":0},{"review":"The movie is based on an emotional connect fused with some heart touching melodies. It is inspiring yet falls short of catching the pulse. The actors stood out, espl the actor playing Kaveri Amma’s character. A romanticized setting dotted with a bunch of good actors and the reverberating music bring one close to the sense of being Swadesi.","label":0},{"review":"Wow! \nGave this movie yours 3hr30min .l promise ,you feel happy. Movie addressing various social , economical , infrastructural ,climatical,and political issues that one can find in most of Indian village . But movie also present solution towards that problem . All actors and actress act very well . Movie is quite long but worth to watch , so must watch","label":0},{"review":"My favourite movie. A feel-good movie. I like to watch this movie often it gives me a good feel. Srks acting is superb. The song YEH JO DES HAI TERE gives me goosebumps when hearing. The characters in this movie were not acting they were living through out the movie. The background music also makes us emotional. A must must must watch movie. When someone ask me about a film to watch i always refer swades to them.","label":0},{"review":"This movie is really Inspirational. Love the patriotism showed in this film potrayed by SRK as Mohan Bhargava. He is absolutely a phenomenal actor for no doubt. Gayatri Joshi did very well. Wonderful film.One of my most favourite film of SRK.","label":0},{"review":"Swadeshi movie I loved it. It shiwed the reality and positivity that India have talent and power to show to world. It was simple with small true love story and completly full of emotions. It showed the true India which today itself exists. Srk best mivue . Watched over 15 times.","label":0},{"review":"Truly splendid!!\nThis film fantastically depicts the beauty of Indian cinema and encourages the youth to develop a sense of patriotism along with the will to progress.It also highlights the social evils that somewhere restricts our society to look on the bright side.A must watch film💕\n\nIt is the right of every citizen to be educated and it is the responsibility of every educated citizen to make others educated.","label":0},{"review":"It’s a feeling. My all time favourite movie. All the actors have done brilliant work. BGM and songs are awesome. Hats off to srk for such an effortless and natural acting. Kaveri Amma and Geeta also stands out.","label":0},{"review":"The best film I have watched till date...tied with taare zameen par as my favourite....a classic in its own right, I am highly inspired and I appreciate the work put in this movie. Also, it showcases the exact feelings NRI's have about India.\nI have watched it a whopping 42 times and yet want to watch it at least once every month.... can't get enough of it.","label":0},{"review":"I like so many movies and it's often difficult to say which one is my favorite but if and if at all I have to zero down to one, I will choose Swades. Yes it is my most and most favorite movie out of all movies ever made. There is so much to watch and grasp in Swades. I am so so glad that a movie like Swades is made. It overwhelms me always.","label":0},{"review":"I have watch this movie for more than 1000 times ....    ❤️literally .. Heart touching movie . All characters in the film has acted so well that it takes this movie to an another level. It feels sad that bollywood no longer produces such milestones . Swades an indian tribute ...jai hind🇮🇳","label":0},{"review":"Only One Word - Masterpiece.\nThe Movie is a way ahead of its time.\nOne SRK's Finest Performances to date.\nAshutosh Gowariker's Best Work.\nAR Rahman has given the Best Soulful Music...\nOne of a Kind Movie and a Must Must Watch.","label":0},{"review":"One of the best film i have ever seen and i can go on viewing this movie forever without getting bored . Undoubtly one of the best ever performance like srk and gayatri joshi . Kudos to ashutosh gowariker","label":0},{"review":"THE MOST BEAUTIFUL MOVIE EVER MADE IN BOLLYWOOD. AN OUTSTANDING AMOUNT OF SIMPLICITY IN THE MOVIE, IT CONNECTS EACH AND EVERY ONE OF OUR HEARTS. MIND BLOWING MOVIE! HATS OFF TO THE STORY WRITER AND THE CAST. SAD THAT IT DIDNT DO WELL IN THE BOX OFFICE :-(","label":0},{"review":"A movie that has remained etched in my heart. One of SRK's best performances. I have watched it almost 20 times till now. But people donot talk about it. They only see SRK in highly commercial movies. Most have forgotten or perhaps have not watched Swades. This is sad.","label":0},{"review":"If I have power, the least I could do for this movie is giving away Dadasaheb phalke award to 3 people i.e., Asutosh Gowarikar, Shahrukh Khan and AR Rehman.\n\nThe best movie I have have ever watched. \n\nWay ahead of its time. The low IQ audience then could not connect to it. It needs rerelease.","label":0}]