[{"review":"This movie has always been close to my heart & shall remain to be so for the whole of my life. Whenever I watch it , tears start rolling down my eyes uncontrollably....\n Actually, I have been through a rough patch in my life , that  strikingly resembles this movie. When we all had watched it for the first time, we all were taken aback ! \n I congratulate the whole team of the makers of this movie .\n   The message is --  \"one should never give up , because when the going gets tough, the tough get  ...MORE","label":0},{"review":"This movie has always been close to my heart & shall remain to be so for the whole of my life. Whenever I watch it , tears start rolling down my eyes uncontrollably....\n Actually, I have been through a rough patch in my life , that  strikingly resembles this movie. When we all had watched it for the first time, we all were taken aback ! \n I congratulate the whole team of the makers of this movie .\n   The message is --  \"one should never give up , because when the going gets tough, the tough get going !\n Simply love this movie to the core of my heart .\nIt's music is \"icing on the cake\"..\nHats off !!!","label":0},{"review":"Watched it way back when it came out and I was just 10 years old and it has stuck with me.\nI don't care about the ratings, this is a beautiful movie. \nIt's a really emotional movie. Shows the ups and downs of life. \nHas great performances especially from the cute kids. And all of the songs are amazing.","label":0},{"review":"this movie is one of my favorites because it touches deep inside the aspect of human beings. its what is happening in reality. we should always stand up for love no matter what condition we find ourselves in. love cant be bought. and also its contains some of my favorites songs most especially hey shona. kudus to the team behind this movie","label":0},{"review":"The best movie ever!! I love this movie way too much!! Such incredible message and real good screenplay!! Heart it forever!! Rani and Saif both were amazingly superb and Princess and Champ I love you!!💕💯😇","label":0},{"review":"this movie reminds me of my childhood days.Kids would love this movie.Saif,rani and the two children were brilliant in this movie. It's my favourite movie of all time. must watch guys","label":0},{"review":"It brings memories of joy and sorrow tingled with feelings of eternity. The story might be straight but the strings of the guitar was so we'll played that memories and memories have been there and will be there all the life!","label":0},{"review":"I really love this movie this is the one of the most beautiful and \ngood movie. \nThank youto you who made this movie i found this movie helpful for my future.\nThank you everyone\nTHANK YOU!","label":0},{"review":"I love this film a lot this is the best movie ever that I had seen in my life I saw this film when I was 5 years old I love SAIF ALI KHAN a lot he is my first crush 🥰😍😘🤗","label":0},{"review":"It's 2019 but I still love to watch this movie 👌👍 inspiring & motivating story and dialogues 👌. lovely songs and background music 👌","label":0},{"review":"I dont care about its rating... i loved this movie when I watched it in theatre in my childhood. I still find it entertaining.","label":0},{"review":"It is my favorite movie but it has an error that all the school have no fees till collage but I still like this movie and it was wonderful","label":0},{"review":"This movie is filled with racing and a good story.\n\nThis is one of my favourite Bollywood movies ever!\n\n7.5/10","label":0},{"review":"It is the best film in the world. When I saw it first time I was really impressed by the film","label":0},{"review":"This is one of the first movies that I went to watch in a cinema hall. I was so young that time. Loved the film!","label":0},{"review":"This movie mix up of all  things in a every life like up and downs u need  to be good work and to sustain the happiness of human life.","label":0},{"review":"It’s really nice movie. It gives positive message of overcoming problem. And any problem can sort if there is family support.","label":0},{"review":"My Fevorate movie with Fevorate stars both of said Ali and Rani Mukherjee.Nice story and Direction is too good.","label":0},{"review":"best movie everrr!!!! it always makes me cry everytime i watch it superbbb everyone should wtch it!!!!","label":0},{"review":"Best movie and great concept at that time\nLovely songs \nEverything is good about this movie","label":0},{"review":"one of the most under rated movie in bollywood... one word for the movie - \"beautiful\"\none can learn a lot from this movie about life... \nhard luck yrf.","label":0},{"review":"Need more movies like this❤️So touching and  a very good family movie","label":0},{"review":"The the best movie ever in my life my CD stuck seeing the movie back to back love this movie","label":0},{"review":"The best movie Ta Ra Rum Pum in 2007","label":0},{"review":"It's a great film,want to see many times","label":0},{"review":"best movie..best thing is that...they play role like \"Life is beautiful\"..😊👍","label":0}]