[{"review":"This movie was depicted to be a children's movie which will teach them some nice things but once you start watching the movie all that happens in the movie are murders total(5) , and if that's not enough a soul comes down from heaven or whatever to drive the car and avenge his death himself by crushing his enemies under the wheels , burning them , drowning them and because of all this his son has to suffer and the son rebuilds that car his father built even better than him eventhough his father  ...MORE","label":0},{"review":"This movie was depicted to be a children's movie which will teach them some nice things but once you start watching the movie all that happens in the movie are murders total(5) , and if that's not enough a soul comes down from heaven or whatever to drive the car and avenge his death himself by crushing his enemies under the wheels , burning them , drowning them and because of all this his son has to suffer and the son rebuilds that car his father built even better than him eventhough his father was an Automobile engineer and he is just a pervert college student who keeps on looking at girl's thighs and waists.Now such type of guys end up in the toilet but he hooks up with her just because its a Bollywood film .No doubt this film lost double than its budget a total bogus film,plz dont watch it.","label":0},{"review":"One of my favourite movies of childhood. For those who don't know, this movie was made to promote this car. But the movie got below average rating and didn't do well on box office, so the makers of car were a bit worried about the future of car, thus the car was never put on production line.","label":0},{"review":"Extremely superb mind blowing movie ... I personally don't know how many times I have seen this wonderful movie...,,## beautiful acting by all the actors... wonderful design of car... thanks Abbas nd mustan for giving us this entertainment...love u all**","label":0},{"review":"It's a wonderful movie it is very interesting I  don't know myself how many times I have seen the movie . The best is vatsal (raj) I just love him and the roles he plays in his series and this movie is one of them.","label":0},{"review":"I like the movie verry much I my self don 't no how many times I have seen it and I like the car verry much plz don't  throw it looks very cool pls don't  scrap it plz plz ......:##,.It was a amazing car designed by DC .All the chratares in the film was ossum. And plz all people see this movie and like it .It is for those who not seen it","label":0},{"review":"When I was 5years old I watched this movie and this movie is my favourite this movie always touch my heart and pls make its second part I want to see you taarzan again pls come back taarzan I love you so much my dream car","label":0},{"review":"This movie is good.I think it should be the next part Taarzan the wonder car 2.The car is found near the local area in waste. I request to make it once more. like in movie. The most likely scene I like that last scene. I like the car most. I Like the movie Thanx for movie.","label":0},{"review":"I love this movie. This movie is my childhood memory.i have seen this movie 1st time when i am 12 year old and now i am 24 year.i suggest all to watch this movie atleast 1 time.","label":0},{"review":"Please guys don't throw the car in the scrap please re New it plz plz plz plz plz I request u if u don't use the car then keep it In the museum plz guys it's my request especially to Abbas Mustan Ji Because it's my dream car Thank You!","label":0},{"review":"This is actually my fav. Movie of all time...\nI have seen this movie more than 20 times...I love the tarzan car vet much...but now it is in bad condition...I just want to buy this car any how....","label":0},{"review":"Its look like that in future like this car will invented\n This car is very assom  and thank you for showing interest film of Tarzan the wonder car                                                                           this car is looking like any Robert car is there I love this car very very very much","label":0},{"review":"The said movie is my favourite movie. I don't know how many times i have seen it. Now I am waiting for Tarzan 2 and I expected that Mr Khan and Aisha Takia will do our demand.","label":0},{"review":"The movie is really good. I have seen the movie 6-8 times and I can see it many times as it is very interesting.  I love it.","label":0},{"review":"The movie is JUST HORRIBLE. I'd rather watch Green Lantern than this movie with immature graphics. Although the logic of this film is meant for kids who see cars as \"Vrooom Vrooom\", but why the inappropriate scenes?","label":0},{"review":"Really this car is very beautiful looking and I have liked it very much. Everybody will want to buy this beautiful looking car \n\"TAARZAN \" The Wonder Car","label":0},{"review":"Can anyone tell the car model? Nice movie, nice acting by all. Specially, the car and dance by Seth is really awesome.","label":0},{"review":"I have watched it countless times ... during my childhood days it was the car of my dreams ...LoL it was a fresh story in an era of crappy romantic movies...","label":0},{"review":"First of all I didn't like it . Because only negativity and evilness is there a lot. Actors acting were not so good.","label":0},{"review":"Amazing movie of  my childhood times....superb concept n superb performance by Vatsal seth...watched 100times still love to watch every time","label":0},{"review":"This movie and even the car is awesome. At least renew this car back as it was and sell it for the price of honda city.","label":0},{"review":"Nice and entertaining movie, but please dont take out the movie outcome or consequence result to such a awesome car","label":0},{"review":"This movie is good.I think it should be the next part Taarzan the wonder car 2.The car is found near the local area in ...","label":0},{"review":"Beautiful love story with. Amazing revenge.  Block buster film for ever for me","label":0},{"review":"I like it that movie so.... I very happy watching before.... Good movie.. My best movie of life.","label":0},{"review":"This is very good movie please renew the car is very cool when tarzan 2 come after this car famous","label":0}]