[{"review":"Description\nRATINGS\n8.4/10\nIMDb\n91%\nRotten Tomatoes\nTOP VOTED TAGS\nMust Watch · Touching · Inspiring · Realistic · Heart-Warming · Good Message · Kid-Friendly · + 3 more…\nWhat did you think of the film? Help others decide by voting on tags that best describe the film.\nAUDIENCE REVIEWS\n\nMD STYLE\nPosting publicly.\nWhat do you think about this film?\nReview menu icon\n\nPriyanka Routray\na year ago\nEvery child is special. Really touched my bottom of heart . I ' ve played both the character Ishan & Niku ...MORE","label":0},{"review":"Description\nRATINGS\n8.4/10\nIMDb\n91%\nRotten Tomatoes\nTOP VOTED TAGS\nMust Watch · Touching · Inspiring · Realistic · Heart-Warming · Good Message · Kid-Friendly · + 3 more…\nWhat did you think of the film? Help others decide by voting on tags that best describe the film.\nAUDIENCE REVIEWS\n\nMD STYLE\nPosting publicly.\nWhat do you think about this film?\nReview menu icon\n\nPriyanka Routray\na year ago\nEvery child is special. Really touched my bottom of heart . I ' ve played both the character Ishan & Nikumbh in my real life as well.That's why I clearly could understand the plot sequence of Tzp.\nNikumbh finally discovered Dyslexia in a slowmover different academically poor student of 8/ 9 yrs. Now a days even the time already has come 2 us for doing the right way .That's responsibily of each parent student teacher is must. Tzp 4 all age groups. Nice msg 2 our social life .\nPunishment  is very bad for students inner mind . Parents rebuke rude behaviour  makes  child very upset  worst physically  and mental growth.  Love ur child is the best medicine  4 ur children's  all progress This movie tought us  how 2 behave with well manner  with ur child.\nIt is very  sad  we ve no Nikumv with us in our childhood days or school life.  Kaash aisa ho paata. I was an abnormal  child  means silent shy less talker  ,but well with language literature  . Parents couldn't   observe  me like my teachers .All made me as a fun subject  ; they treated  me badly  rough word .my mind hurted deeply .After watching movies of Aamirsaab  I could deposite courage 2 face society  and ofcourse  I succeeded  at my efforts.  FURTHER I BECAME A TUTOR AND MADE LIFE OF  3 CHILDREN'S. And made myself as a writer poet,  social  activist,  Astrologist  palmist  psychologist   slow and  steady. Something  satisfaction  turned aside into  my life   .3 teachers told me ( 11 age) seriously due to my soft nature \" I can't get  never any profession/ identification  in my whole life\"   Nikumbh sir identified a painter within Ishaan;that's called a Real Teacher,who has no limit to educate . TZP is 1st film  ,I watched on a plot related festive occasions  (on Teachers day ) .\n When I watched it in 2k7  I enchanted  subjugated  ..I could  see clearly  myself in Ishaan ( Darsheel saffary ) ..Thank u the entire  team of Tzp .  Till date  more than  20 times   watched ..found very heart touching  sensitive reality .\nSo meanwhile  it's our families  all tym fvt . Song maa and title  song so warmth soft mind blowing ..Especially  title song whenever  usually  i would  watch   l loss myself and tears flows deeply .everything wet ..   Tzp is n't  only a movie but very powerful  lesson oriented picture  for all time all age groupers , Whoever will watch or already has watched definitely  must a good people ...THIS IS THE ACUTE  EFFECT  OF THIS MOVIE ... Directorial  debut of Aamirkhan  sir  . Wonderful creation  of Aamirkhan  sir as a parents  (producer  director)   of this child ( Tzp movie) . Every child teacher guardian people  should watch  this  outstanding  movie  .Every answer lies within  .so  my friends don't  late . If no , immediately  watch it . Trust  on my opinion   Taare zameen par is a beautiful  movie non comparable.           \n Aamir khan's acting is very perfect with minute observations  herein , this outstanding movie is  true certificate  .He managed very well  to bring the living touch to the character named RAM SHANKAR NIKUMBH  Art teacher psychologist  motivator. That's why he wanted to be replaced in exchange of Painter Amol Gupte .His strong faith believe dedication   for this factor as a debutant director .well managed and won the Heart of all.\nNamaste .may God bless all viewers.  Love.a","label":0},{"review":"Every child is special. Really touched my bottom of heart . I ' ve played both the character Ishan & Nikumbh in my real life as well.That's why I clearly could understand the plot sequence of Tzp.\nNikumbh finally discovered Dyslexia in a slowmover different academically poor student of 8/ 9 yrs. Now a days even the time already has come 2 us for doing the right way .That's responsibily of each parent student teacher is must. Tzp 4 all age groups. Nice msg 2 our social life .\nPunishment  is very  ...MORE","label":0},{"review":"Every child is special. Really touched my bottom of heart . I ' ve played both the character Ishan & Nikumbh in my real life as well.That's why I clearly could understand the plot sequence of Tzp.\nNikumbh finally discovered Dyslexia in a slowmover different academically poor student of 8/ 9 yrs. Now a days even the time already has come 2 us for doing the right way .That's responsibily of each parent student teacher is must. Tzp 4 all age groups. Nice msg 2 our social life .\nPunishment  is very bad for students inner mind . Parents rebuke rude behaviour  makes  child very upset  worst physically  and mental growth.  Love ur child is the best medicine  4 ur children's  all progress This movie tought us  how 2 behave with well manner  with ur child.\nIt is very  sad  we ve no Nikumv with us in our childhood days or school life.  Kaash aisa ho paata. I was an abnormal  child  means silent shy less talker  ,but well with language literature  . Parents couldn't   observe  me like my teachers .All made me as a fun subject  ; they treated  me badly  rough word .my mind hurted deeply .After watching movies of Aamirsaab  I could deposite courage 2 face society  and ofcourse  I succeeded  at my efforts.  FURTHER I BECAME A TUTOR AND MADE LIFE OF  3 CHILDREN'S. And made myself as a writer poet,  social  activist,  Astrologist  palmist  psychologist   slow and  steady. Something  satisfaction  turned aside into  my life   .3 teachers told me ( 11 age) seriously due to my soft nature \" I can't get  never any profession/ identification  in my whole life\"   Nikumbh sir identified a painter within Ishaan;that's called a Real Teacher,who has no limit to educate . TZP is 1st film  ,I watched on a plot related festive occasions  (on Teachers day ) .\n When I watched it in 2k7  I enchanted  subjugated  ..I could  see clearly  myself in Ishaan ( Darsheel saffary ) ..Thank u the entire  team of Tzp .  Till date  more than  20 times   watched ..found very heart touching  sensitive reality .\nSo meanwhile  it's our families  all tym fvt . Song maa and title  song so warmth soft mind blowing ..Especially  title song whenever  usually  i would  watch   l loss myself and tears flows deeply .everything wet ..   Tzp is n't  only a movie but very powerful  lesson oriented picture  for all time all age groupers , Whoever will watch or already has watched definitely  must a good people ...THIS IS THE ACUTE  EFFECT  OF THIS MOVIE ... Directorial  debut of Aamirkhan  sir  . Wonderful creation  of Aamirkhan  sir as a parents  (producer  director)   of this child ( Tzp movie) . Every child teacher guardian people  should watch  this  outstanding  movie  .Every answer lies within  .so  my friends don't  late . If no , immediately  watch it . Trust  on my opinion   Taare zameen par is a beautiful  movie non comparable.           \n Aamir khan's acting is very perfect with minute observations  herein , this outstanding movie is  true certificate  .He managed very well  to bring the living touch to the character named RAM SHANKAR NIKUMBH  Art teacher psychologist  motivator. That's why he wanted to be replaced in exchange of Painter Amol Gupte .His strong faith believe dedication   for this factor as a debutant director .well managed and won the Heart of all.\nNamaste .may God bless all viewers.  Love.a.✍","label":0},{"review":"An inspirational story that is as emotive as it is entertaining.\n What uplifts this film is the way it moves you deeply with its sterling performances. \nAll in all, it is a magical film about the magnificent abilities children have, even when all the odds are against them. Luckily, most of the Bollywood clichés actually enhance the film experience. Being such an integral part of the story, the soundtrack and score complement the film wonderfully. Each song aligning nicely with the film's dramati ...MORE","label":0},{"review":"An inspirational story that is as emotive as it is entertaining.\n What uplifts this film is the way it moves you deeply with its sterling performances. \nAll in all, it is a magical film about the magnificent abilities children have, even when all the odds are against them. Luckily, most of the Bollywood clichés actually enhance the film experience. Being such an integral part of the story, the soundtrack and score complement the film wonderfully. Each song aligning nicely with the film's dramatic but hopeful tone. \n\n\"There have been such gems amongst us, who changed the course of the world because they could look at the world differently. Their thinking was unique and not everyone understood them. They were opposed, yet they emerged winners and the world was amazed.\"\n\n Aamir Khan has captured these emotions perfectly near the end of  Taare Zameen Par (a.k.a Like Stars on Earth). I don't think I'll ever get the image of Ishaan's father breaking down into tears out of my head. There's some really powerful stuff here.\nThis brilliant movie, in my books, is nothing short of being \nOne of the most Powerful movies you will ever come across.","label":0},{"review":"TAARE ZAMEEN PAR\n\nAs long as I saw the movie I got lost because I got so well connected to the situation therein that, most of the times I found myself in it.  I got deeply involved as I saw Ishaan (portrayed by Darsheel Safary) in the film.\n\nThe film brings out the ground reality of how the world looks at children who suffer from dyslexia.  The way Amir Khan (the Director and Producer) has brought out a clear message to the world (not to ignore the simple joys and pleasures of Kids and not to r ...MORE","label":0},{"review":"TAARE ZAMEEN PAR\n\nAs long as I saw the movie I got lost because I got so well connected to the situation therein that, most of the times I found myself in it.  I got deeply involved as I saw Ishaan (portrayed by Darsheel Safary) in the film.\n\nThe film brings out the ground reality of how the world looks at children who suffer from dyslexia.  The way Amir Khan (the Director and Producer) has brought out a clear message to the world (not to ignore the simple joys and pleasures of Kids and not to rob them of their childhood life) is simply amazing.  The 8 year old kid Ishaan is good at art but is a slow learner and poor in academics.  \n\nLike any usual and normal parents, Ishaan’s parents too always prioritise homework, marks and neatness. Ishaan on the other hand always dreams of colours, fish, kites and dogs etc. He spends most days punished outside class letting his imagination go around the world.  At home, he is always seen mixing colours, painting away instead of doing his homework.  While his elder brother is very good at studies and sports, Ishaan is quite opposite.  His poor scores in academics becomes a cause of concern to the parents.  Unaware of the reason behind of his weakness, his parents admit him to a boarding school for disciplining him.  Here, the art teacher (Nikumbh) identifies the problem and rises to the occasion to help him to overcome his disability.  Amir Khan, who has cast the Art Teacher’s role has excelled in his role play.\n\nThe film has been well edited by Deepa Bhatia.  The Lyrics of the songs are written by Prasoon Joshi, which are too good.  The picturisation of the entire film and especially the song sequences are exceptionally so good that even rock hearted people who would not drop tears would be moved and experience emotions. The title song is fascinating. Maa and Jame Raho combine talents in all respects- music, words and voice. The production design is superb. Not even for a moment you feel anything is fake. \n\nThe picturisation of school sequences is so good. To make things as natural as possible, the Editor has worked hard.  He has involved in a few of the real students of the school.   In fact, a share in the success of the film can be credited to these students too who have justified their involvement in the film.\nBogged down by the routine action films which hardly make any impact on our lives, I would rate this film with a 4.5 score out of 5 and would strongly recommend to film lovers that this is a NOT TO BE MISSED MOVIE.  Let me also add “DO NOT BE CARRIED AWAY BY A FEW POSTERS AND THINK THAT THIS IS A CHILDREN’S FILM.  NO IT IS NOT.  IF YOU HAVENT SEEN IT SO FAR DO IT NOW”.","label":0},{"review":"This movie is a masterpiece. Each and every plot in the movie is touchy and stikes me deep into my heart.The unconditionally Love between ishaan and Mrs avasthi is Divine. Everytime when I watch or by chance listen the movie songs I go goosebumps and start rolling down tears and call back to my Mom such kinda emotional connection this movie has. An the relationship between ishaan and ram Shankar is heart rending one.India culture is perfectly reflects in the film. Every student has a dream to ha ...MORE","label":0},{"review":"This movie is a masterpiece. Each and every plot in the movie is touchy and stikes me deep into my heart.The unconditionally Love between ishaan and Mrs avasthi is Divine. Everytime when I watch or by chance listen the movie songs I go goosebumps and start rolling down tears and call back to my Mom such kinda emotional connection this movie has. An the relationship between ishaan and ram Shankar is heart rending one.India culture is perfectly reflects in the film. Every student has a dream to have such kinda teacher to guide, be there and believe on them. Thanks to my State government education board(Andhra Pradesh) made this movie context as a Hindi lesson for secondary School. This movie is the most favorite movie till date (2018).","label":0},{"review":"Every Child is Special has inspired me to never give up, it inspired me by helping me improve on my school work and my personal life it also gives me ideas on when and what to draw, I just imagine the movie and draw ^^!\n      My first time watching this is when I was 6 years old, it has always inspired me since it helped me find my way out of my comfort zone and also made my artwork improve.!\n  This movie gives a deep message that I hope people would find out and also never give up on your dream ...MORE","label":0},{"review":"Every Child is Special has inspired me to never give up, it inspired me by helping me improve on my school work and my personal life it also gives me ideas on when and what to draw, I just imagine the movie and draw ^^!\n      My first time watching this is when I was 6 years old, it has always inspired me since it helped me find my way out of my comfort zone and also made my artwork improve.!\n  This movie gives a deep message that I hope people would find out and also never give up on your dreams just like what Ishaan did.\n             This must be the best movie I’ve ever watched and I suggest that people to watch this!\n\n Thank you for making this movie it has bee in my life ever since I was 6 I hope you all found your dreams!\n                                                    -Beah, Ilagan","label":0},{"review":"Amazing and emotion movie. Really they have given true message that world is comparative . Now a days students suffer from mental depression main cause is education pressure.  People think in society that if we don't become doctor engineer or pilot nobody is going to give us respect. Our Indians mentality is very bad. Infact now a days schools teachers humiliate a lot specially of weak students they never deiscuss them about there problems. They will use humiliating words to those weak students  ...MORE","label":0},{"review":"Amazing and emotion movie. Really they have given true message that world is comparative . Now a days students suffer from mental depression main cause is education pressure.  People think in society that if we don't become doctor engineer or pilot nobody is going to give us respect. Our Indians mentality is very bad. Infact now a days schools teachers humiliate a lot specially of weak students they never deiscuss them about there problems. They will use humiliating words to those weak students like useless huamn being cowdung . And classmates will make fun of him .  So it's better to study  at home only. Iast scene was very emotional when he was crying  that chid name is darshal safari his character name was Ishan Avasthi. These is known as hardwork willpower dedication. Really education system in India is bad. I don't that why school authority give jobs like these kinds of ill-mannered teacher's that don't have humanity self respect on other's dosnt have feelings. They should be thrown out from schools. I really hate these kinds of Teachers. I don't respect them.","label":0},{"review":"Taare Zameen Par is one of the best movies ever! It is emotional, fun and relays an important message that 'Every child is special in their own way'. I have already watched it plenty of times but this is one movie you never get bored of. It portrays the pressure many children in our country are put under to excel in everything very well and also shows how we can help them  achieve success instead of pressurizing them. It is an eye opening and enjoyable film and is a must watch. I believe that th ...MORE","label":0},{"review":"Taare Zameen Par is one of the best movies ever! It is emotional, fun and relays an important message that 'Every child is special in their own way'. I have already watched it plenty of times but this is one movie you never get bored of. It portrays the pressure many children in our country are put under to excel in everything very well and also shows how we can help them  achieve success instead of pressurizing them. It is an eye opening and enjoyable film and is a must watch. I believe that the beauty of this movie can never be matched.","label":0},{"review":"Today I watched first time this movie means after eleven years of its releasing. It has been released in 2007 when I was eleven year old and was in 8th standard. Then I wasn't even know about movies.\nThis movie is my new favourite and will be always.\nToday It’s like I'm seeing myself in mirror after many of years.\nDarshil has done amazing acting in that small age and Amir is phenomenal. First time I love amir this much, as firstly liked his three idiots. Today I just fall for him and his acting. ...MORE","label":0},{"review":"Today I watched first time this movie means after eleven years of its releasing. It has been released in 2007 when I was eleven year old and was in 8th standard. Then I wasn't even know about movies.\nThis movie is my new favourite and will be always.\nToday It’s like I'm seeing myself in mirror after many of years.\nDarshil has done amazing acting in that small age and Amir is phenomenal. First time I love amir this much, as firstly liked his three idiots. Today I just fall for him and his acting. Whole day I was praising him and his acting. \nMusic is just so enchanting and exceptional. Love all songs. \nNow here why this movie touch my heart so hardly and make a place in the depth.\nIshaan and Amir both were part of a single character that I've been played in my life.\nIshaan was my childhood who had face so much difficulties especially in study and going school. So today if I see a child as reflection of mine then I get attached or over think and sometimes worried about them.\nOur misfortune is we called extraordinary as abnormal. Whom needs inspiration, appreciation they get only anger, hate and sometimes sympathy. \nOur misfortune is we don't have teachers like Nikumbh in reality. We do struggle and fight all with our own from the world full of normality. But even the biggest supporters can be their families or parents.","label":0},{"review":"In every heart there is a universe with a zameen(earth) and a 'tara' (star). But as we are wearing a dark spectacle of modernity, competitive life,apparent smartness, we just remain sticked to an earth of five senses but we can't find the star in ourselves. Even when a true star falls among us and shines , due to the blindness of apparent perfection we actually ignore its light initially. Indeed, we need a mentor to show us the light. In the film,\" Taare Zameen Par\" Sir Nikumbh guides  marks-hun ...MORE","label":0},{"review":"In every heart there is a universe with a zameen(earth) and a 'tara' (star). But as we are wearing a dark spectacle of modernity, competitive life,apparent smartness, we just remain sticked to an earth of five senses but we can't find the star in ourselves. Even when a true star falls among us and shines , due to the blindness of apparent perfection we actually ignore its light initially. Indeed, we need a mentor to show us the light. In the film,\" Taare Zameen Par\" Sir Nikumbh guides  marks-hungering parents and teachers to see the light within Ishaan, the star. Similarly the film \" Taare Zameen Par\" itself plays the role of star-mentor to us that makes us feel that Ishaan like children are not children with special needs, rather we the \"hollow men\" of modern age have a great need of light, radiated from a star like Ishaan. Thanks for the light, thanks for the illumination, thanks a lot for the Tara that you have brought to our Zameen, \"Taare Zameen Par\". A great salute to you and wish for your immortal shining in the world film industry.","label":0},{"review":"Undoubtedly, Like Stars On Earth is the worst movie ever! This movie may as be listed in the genre horror because it is painful to watch and be MA15+ because young children would be scarred for life. Blood scenes would scare young children and abuse scenes are frightening. Also a very depressing movie and bad camera movements.\n\nCountless physical abuse and blood scenes would cripple the mind and destroy your childhood. Especially injustice of the father belting Ishaan across the face like a dera ...MORE","label":0},{"review":"Undoubtedly, Like Stars On Earth is the worst movie ever! This movie may as be listed in the genre horror because it is painful to watch and be MA15+ because young children would be scarred for life. Blood scenes would scare young children and abuse scenes are frightening. Also a very depressing movie and bad camera movements.\n\nCountless physical abuse and blood scenes would cripple the mind and destroy your childhood. Especially injustice of the father belting Ishaan across the face like a deranged psychopath. It will spread abuse before you know it. Not an ideal movie for kids at all! \n\nThis abhorrent movie features a depressed boy who won’t be happy no matter how many people try to cheer him up, he is just a sad person in general. It made everybody sad and glum. Never did you see Him smile till the end, about time! These days the boy who played him is as ugly as a troll.\n\nYes, this movie features a boy that has dyslexia which just showcases the dark and sad side of the world. Also, the camera angles and camera movement would cause dyslexia! The movie must’ve been filmed it on an iPhone it was so bad! No wonder Hollywood earns more money than the humiliation Bollywood.\n\nWho should we feel sorrier for, the director or the cast, oh wait both because not only did the director have to watch this nightmare but experience it as a cast member! This movie only earned 800 million which was beaten by other movies in less than a day. This is a disgrace to call a movie and must be banned immediately!","label":0},{"review":"This is a movie but the characters, the story, the message and the lessons are real. This is very helpful to SPED teachers and for parents having children with special and unique needs. Every time I watched this together with my class, i cannot hold my tears rolling down, am emotionally touched with the situation of Ishan in his growing years. However, am glad that one passionate teacher met him and his world gets better and brighter. In here, I can say that  teachers play an important role, eit ...MORE","label":0},{"review":"This is a movie but the characters, the story, the message and the lessons are real. This is very helpful to SPED teachers and for parents having children with special and unique needs. Every time I watched this together with my class, i cannot hold my tears rolling down, am emotionally touched with the situation of Ishan in his growing years. However, am glad that one passionate teacher met him and his world gets better and brighter. In here, I can say that  teachers play an important role, either to break or make our students \"shine as stars\".","label":0},{"review":"Every child should be treated equally god has given equal talent to everyone no one is less than anyone a poor and slow learner child can also do the best and be a topper. I have watched this film many times. I never get bored by watching this movie this film is inspirational, motivational, emotional but one thing is three it's too much appreciative\nOne can see many changes in himself by watching this movie.\nSo everyone must watch it.\nThank you\n\nIs it helpful","label":0},{"review":"This movie is substantially a great way of showing people that everyone has potential. When I watched this film in school, I wasn't interested into the plot nor the message, but as I payed more and more attention to the character backgrounds, it showed me how special everyone is and how everybody has a purpose. I highly recommend this film to anyone looking for an inspirational story on growth and a good heart warming story.","label":0},{"review":"This is one of the best movies i,ve ever watched. A really touching yet educational story. I got to learn about dyslexia and would wish the whole world would watch this and understand. The whole movie was well directed, amazing acting and most of all a really beautiful story. I cried here and there and even the even the happy ending got me shedding tears of joy. I,d highly recommend this movie to everyone.","label":0},{"review":"This movie made me realized that a child that has a disorder must be threaten very well by means of giving them an attention and guidance. They all deserves to be respected and of course they needs a person that could help them build or fight against their impairments. \n This movie is very nice because it reflects me of the things that I've done; it's so werd. But as a human being we all have different characteristics that needs to be shown to others.😂😘","label":0},{"review":"Who else will relate better than me, who is having son having concern of dyslexia. Just like the boy in the movie, my child having difficulty in studies, but we couldn't find the reasons behind it. We used to bit him so hard. Now I feel ashamed of it. Thankfully before the movie comes we could found the reason. But the scars are still there in his heart. But he is such a lovely and sorted guy of his age. Love you my child so much.","label":0},{"review":"My all time favorite movie made me to think how wonderful is childhood dreams and passion. But today's education system has entirely killed the childhood of every individual. Even i had also been affected by the education system. The nikumbh teacher character can be reel, but the real nikumbh are seems to be so rare. This movie and aamir khan character as well, had made a very big impact in my life. Hats off to aamir khan 👍👍...and i can't stop crying at every important elements of this movie � ...MORE","label":0},{"review":"My all time favorite movie made me to think how wonderful is childhood dreams and passion. But today's education system has entirely killed the childhood of every individual. Even i had also been affected by the education system. The nikumbh teacher character can be reel, but the real nikumbh are seems to be so rare. This movie and aamir khan character as well, had made a very big impact in my life. Hats off to aamir khan 👍👍...and i can't stop crying at every important elements of this movie 😭","label":0},{"review":"Saw this again after many years! I was surfing channels when I got a glimpse of this, and then watched it to the end. It still left a lump in my throat and tears in my eyes. Such a wonderful film, so well acted and directed. The little boy was just superb. Thank you Amir, such films are very necessary for our young parents today.","label":0},{"review":"This movie is very touchy. Amir Khan is no less than a God for that child. We all crave for such teachers in our life but sadly we get very few because they are so rare. Work of teacher is to bring out the best in a student, recognize what he do not know about himself and make him believe in himself. We talk a lot about failure of students and criticize them but cannot see elders failing as teachers. Exceptional movie.","label":0},{"review":"This movie is such a masterpiece, it really taught that every child is special and unique in their own way. It encourages parents to discover and promote their children's talent and be proud of them.\nI actually got emotional at almost every scene of this movie.\na movie i don't get tired to watch.\nGreat work.","label":0},{"review":"2007 - I was in school class 8th - Movie released - I watched it - Learnt many things+enjoyed+cried+not able to understand still many things.\n\n2019 - I am adult - Watched it again - Still have the same feeling of 12years ago - Still that same emotion - Now learnt those things - Cried on ending.\n\nBest film. Awesome. Excellent.","label":0},{"review":"This movie was well ahead of its time. It is a piece of great art. This movie changed the way we see a child. TZP gave a whole new approach to handle the children. Things which look easy for us can be a damn big complex things for children. We need to step down to their level to understand their problem, we have to see from their perspective. I am sure many parents have benefitted themselves from this movie and the greatest benefiters are the children who can be understood now by their parents.","label":0},{"review":"Inspirational Brilliant Directon from Aamir Sir.This was First Hindi Film I Watched Brilliant act from Darshal Saffary. Bad thing they should not  highlight the deficit. Climax is awesome.   Songs and BGM are  Outstanding. Inspiring Movie.","label":0},{"review":"It's one of the most educative, informative and inspirational films I've ever watched. I think parents (especially fathers) and families must endeavour to help their children realize their talents and help them build upon them. Parental care, love, attention and guidance are extremely important in the welfare of the children. Thank you","label":0}]