[{"review":"I bet you will love this movie.\nThe movie holds you till the end and the best is that a very strong and great presentation is delivered in minimum time. \nKudos to Paresh Rawal....man! what a masterpiece he has as Mr. Khan. I actually get scared of him many times in the movie.\nAll actors are good with their roles. \nIn conclusion,I'll say that this movie a must watch. It's a perfect and one of the finest Thrillers ever made in Indian Cinema. \nI'll give this movie 4/5 stars.\nGo and watch. \nThanks f ...MORE","label":0},{"review":"I bet you will love this movie.\nThe movie holds you till the end and the best is that a very strong and great presentation is delivered in minimum time. \nKudos to Paresh Rawal....man! what a masterpiece he has as Mr. Khan. I actually get scared of him many times in the movie.\nAll actors are good with their roles. \nIn conclusion,I'll say that this movie a must watch. It's a perfect and one of the finest Thrillers ever made in Indian Cinema. \nI'll give this movie 4/5 stars.\nGo and watch. \nThanks for reading.","label":0},{"review":"It is the best movie about ragging\nI loved it also because of the star cast Rajeev Khandelwal ,Tina Desai and Paresh sir.\nTnx for making such a beautiful movie.\nOne of ots admirable point is about its story telling. That was in a great way that it was easily understandable by the audience. It is going to be one my favorite movie and Rajeev sor my favorite hero.😊😊","label":0},{"review":"RATING - ⭐⭐⭐⭐⭐( five star deserving movie)\n\nI feel this is a MUST WATCH kind of a movie. The movie is basically about a game to complete challenges for money. It takes on its pace quickly but when the climax hits you, you are gonna be blown off as u would understand why this whole game was basically being played for. AWESOME CLIMAX .its emotional, sympathetic, entertaining. Watch it, thank me later.","label":0},{"review":"I have watched the movie today and I have liked it. What ever we do in the past returns to us as a punishment in future that is why we should be good and never harm anyone, we never know when it will hit us again.\nRagging was bad and the punishment they got was good, till the end i felt sorry for them but seeing their flashbacks i did not.\nGood movie i liked it","label":0},{"review":"Table no.21 is an outstanding movie..Rajeev and paresh was awesome.its was really diffrnt from other thriller movies..in the climax they show a great msg to the youth about ragging..but its sad that the movie didnt get much collection in the box office.\n\nA very beautiful movie but at the same time dark too ....it portrays beautifully the consequences of ragging ..even though most of the seniors thinks that ragging is a small thing ...but in reality it is not ..i think this movie is way too under ...MORE","label":0},{"review":"Table no.21 is an outstanding movie..Rajeev and paresh was awesome.its was really diffrnt from other thriller movies..in the climax they show a great msg to the youth about ragging..but its sad that the movie didnt get much collection in the box office.\n\nA very beautiful movie but at the same time dark too ....it portrays beautifully the consequences of ragging ..even though most of the seniors thinks that ragging is a small thing ...but in reality it is not ..i think this movie is way too underrated","label":0},{"review":"Its an awesome movie, with great fresh story based on novel, must watch movie, i dont understand the reason why this movie perform less than avg on box office. It has a oscar winning plot. Also the acting performance of all the actors are greatly appreciable. A must watch movie. \n\nFrom my opinion- 🌟 🌟 🌟 🌟 🌟","label":0},{"review":"Table no.21 is an outstanding movie..Rajeev and paresh was awesome.its was really diffrnt from other thriller movies..in the climax they show a great msg to the youth about ragging..but its sad that the movie didnt get much collection in the box office..Mann mera song is still my fvrt..","label":0},{"review":"This is awesome movie and a message for youth who indulge in the ragging.\nThey should also think that any other person can do the same thing with him. \nSo overall excellent movie...\n      🌟 🌟 🌟 🌟 out of, 5","label":0},{"review":"This movie is underrated but the best. I mean, such good level of suspense. Just wow. I loved this movie, and especially the acting of rajeev khandelwal! Awesome movie.❤♥♡~♥~","label":0},{"review":"Paresh Rawal one of the finest actor in Bollywood. Just speechless his acting and movie super script  and directions. The best part is last 15 mins will totally change your mindset.","label":0},{"review":"Best film I have watched in last 15 days. Never thought it would give this heart wrenching feelings. 1st 1hour it was a thriller to me, but last 15 minutes have given me the teary eyes. Every people should watch this.","label":0},{"review":"An extremely gripping movie. Will make you dead with suspense. Emotional. A truth telling story, after you watch it will change you. Highly recommendable that students that are about to join college or in college watch it.","label":0},{"review":"Its very learning movie and everyone should must watch this because not only college students but most of the people make joke of another in thought that its only fun...but sometimes it affects their relationship or life","label":0},{"review":"I have no words to describe. I'm really proud of the makers of this film.\nYou did a great job.\nJust FANTASTIC","label":0},{"review":"A deadly take on the iconic event of ragging in colleges. A cruel yet smart way to make realized how bad ragging is. Not all audience would enjoy this movie as it caters to something very serious.","label":0},{"review":"Wonderful movie.  This movie tries to express the school views about students who have hard life at there schools thats why I love this movie","label":0},{"review":"It's really a great film and one of the best underrated movie in Bollywood.  Please do watch it and it also delivers a great message in the end.","label":0},{"review":"A very beautiful movie but at the same time dark too ....it portrays beautifully the consequences of ragging ..even though most of the seniors thinks that ragging is a small thing ...but in reality it is not ..i think this movie is way too underrated","label":0},{"review":"Perhaps one of the best suspense thriller movie with a great message to give and outstanding performances...!!\nIt's definitely worth a watch!","label":0},{"review":"i think this movie will be 1 of my favorite .the subject of this movie will be totaly diffrent . ithink ragging is a \nbig crime . this is the  right topic to prove to all seniors  ragging is a crime\n\n\n          ȚĂBĽĒ ňõ 21 \n\n\n\n🌟🌟🌟🌟🌟 out of 5","label":0},{"review":"This movie was amazing..it was full of suspense..and acting was amazing by all the actors..i would recommend this movie to everyone..n also i would recommend it to all the parents..and i also wanna know just for the small reason he made this huge game??..i mean i didn't get it..","label":0},{"review":"It has given us an extremely super message about the ragging and it tells us that what u do in your life, u will be treated same for that matter.","label":0},{"review":"Movies like this are depleting from Bollywood.\nActing of all actors is admirable. \nOne of the best movies of Bollywood","label":0},{"review":"Outstanding thought. Brilliant directed and script is super. It's must watch","label":0},{"review":"In my life this is the first movie. Which make me cry this movie song maan mera my one n only favorite song","label":0}]