[{"review":"best movie in entire year 2015\nsuceeded by the part tanu weds manu 2011\nwaiting for the 3rd part..... all might also who have watched it.\ni recommend u to see this movie🥰","label":0},{"review":"One of the best movie this decade . Best actress and actors  of our time . Best music adds more fun.","label":0},{"review":"One of the best movie.sara chij hi movie me yar comedy drama scene of UP traditional marriage environment and  a lot of new turns.","label":0},{"review":"Ths is also a movie worth watching.... here also the best dialogues u get ..raja awasthi and kanpuria accent is nailed by actors...😀😀😇","label":0},{"review":"Excellent movie, you have to watch Next Part too for full story and entertainment Tanu Weds Manu Returns","label":0},{"review":"First Indian  movie I think whose squeal got higher rating ... And this one is also fabulous","label":0},{"review":"This is authentic india romance and the journey from arrange marriage to love marriage, 5 out of 5, amazing movie","label":0},{"review":"Thid is just for fun. Watch my videos and enjoy it and subscribe my channel for more videos.","label":0},{"review":"superb movie.👌 kangana's acting is soo good . I loved It😘","label":0},{"review":"Marbulous movie.. I hv seen so many times it is my favouratest movie.. I really like Sharma ji urf Manu ji..","label":0},{"review":"Must watch movie . Kangna is awesome and movie locations are very good","label":0},{"review":"A worth watching movie. Bhaiyo kangna is here. What more we can want","label":0},{"review":"Superb movie..  Big fan. Kangna ranout","label":0},{"review":"Bad movie. Nothing is good except r madhavan. Even his character is somewhat unreasonable.","label":0},{"review":"beautiful simple and sobar movie acting by r madhvan is great","label":0},{"review":"See more than movie \nFantastic so nice","label":0},{"review":"I love this movie full paisa basool","label":0},{"review":"Awesome movie.. nd song is really too good👌👌👌","label":0},{"review":"Must watch movie. Atleast twice in a life time. \nWorth Watching","label":0},{"review":"perfect movie i have ever seen","label":0},{"review":"Very romantic and comedy movie","label":0},{"review":"Entertaining","label":0},{"review":"This film filling of the dramas and imotionally that good","label":0},{"review":"R.madvan is simply outstanding","label":0},{"review":"Great experience watching it.","label":0}]