[{"review":"If you feel down, just watch this movie. Great message delivered with some class leading acting & direction. Very gripping movie. Can’t do anything before completing the full movie once started watching.","label":0},{"review":"Beautiful movie with situational comedy punches. All the cast has performed amazingly well. Not even a second is dull in this movie and its an unusual coming of age movie.","label":0},{"review":"i think this film was one of the best movie of that year. Acting,character as well as story was very good imean aswm. How the critical condiyion change the human and creat huminity.well done nana sir and john abhrahim","label":0},{"review":"This movie make me happy and teach something, that what happen in our life\nHow time can change in 1 second.in 1 incident\nAbout movie \nI like this movie and all actors special nana patekar, John sir \n Thy next part kabe realise hoga 😎","label":0},{"review":"One of the classic movies of Bollywood. Hilarious as well as delivers a strong message. The acting is great too. I miss these type of movies.","label":0},{"review":"Best movie perfect direction. story line and their presentation very good. john and nana patekar acting superb. Climax scene Priyanka Chopra cameo nice.","label":0},{"review":"This a must watch movie which teaches that what you have in your life is very precious and you should respect it every single time and the people who are with you in your toughest time are your friends (jewels).","label":0},{"review":"One of the best movies in Bollywood. Combination of Nana and John is really good. Story and direction is very good. A total comedy movie.","label":0},{"review":"This movie teach us that ego can distrory every thing but love make your life happy and joyful so keep loving and speed positivity 💓","label":0},{"review":"Evergreen movie. Genuine acting skills. Sanjay dutt as Guest appearance is also good. Fabulous movie.","label":0},{"review":"Why does this movie not appear in any channel ?\nI have been eagerly waiting for it for years.","label":0},{"review":"Masterpiece from Bollywood must watch acting of Nana Patekar. and guest appearance of Priyanka Chopra is also good.","label":0},{"review":"awesome movie keeps u engaged. No boring scene.Can watch n number of times","label":0},{"review":"Amazing move. Must watch. Superb acting by John sir as well as Nana Patekar sir.","label":0},{"review":"I love the beautiful life lesson it taught...nd  Nana Patekar  nd John  Abhraham's acting make it worth watching a thousand times!","label":0},{"review":"Still love this movie. One of the masterpieces on life!","label":0},{"review":"I lost count how many times i watch this movie specially Nana Patekar. Simply superb movie.","label":0},{"review":"One of the best thriller movie of Bollywood ever made hats off to Nana sir","label":0},{"review":"Love the song \"aazmaale aazmaale\". awesome 👌, Must watch movie","label":0},{"review":"Very good of that year the acting of both nana patekar and john was real.","label":0},{"review":"Power packed performance by none other than Nana Patekar , nice story ...with unexpected climax...must watch...","label":0},{"review":"Yes.i.like this Cinema, the.story, Acting of all\nCharacters, very nice, .","label":0},{"review":"Nice star cast with commendable performances from the entire lot! 👌","label":0},{"review":"Best movie Nana and John had done excellent acting.hats off.","label":0},{"review":"Beacoues this is a one of the most popular and romantic movie.","label":0}]