[{"review":"This is a movie for the ages. This movie has everything that makes you wonder what the hell Farah, the idiot was thinking while making it? It had scenes that make you puke in the middle of the screening. But if you are one of those people who just want to watch a movie, with no other desire in life. Even then, this movie will make you question your reasoning ability to the maximum. This movie should be played as warning in Bollywood museum on what happens if you have no directorial sense, if scr ...MORE","label":0},{"review":"This is a movie for the ages. This movie has everything that makes you wonder what the hell Farah, the idiot was thinking while making it? It had scenes that make you puke in the middle of the screening. But if you are one of those people who just want to watch a movie, with no other desire in life. Even then, this movie will make you question your reasoning ability to the maximum. This movie should be played as warning in Bollywood museum on what happens if you have no directorial sense, if script written by class Five kids during lunch break, and bad acting could do.","label":0},{"review":"Best movie..if you attached emotionally. However this film looks boring in first half...but if you like acting of Akshay Kumar & Akshay khanna -outstanding. & Songs are superb!! Title song as well \" bade dilwala\"..","label":0},{"review":"Worst movie in the history of Bollywood.  The worst song in the history of Bollywood is -\"Sheila ki Jawani \" . Overacting , weak script and bad dialogues ruined this movie. Never expected such cheap comedy from Akshay Kumar . Those who liked this movie need a mental treatment.","label":0},{"review":"Boaring and faltu movie I have never seen. Thirdclass movie . Wastage of money. When salman Khan enterd in that camio scene people were shouting inside . Thirdclass movie. Only for getting 10 carore ruppeess they select this kinds of movies. And I didn't accept this from akshay Kumar. Rubbish movie.","label":0},{"review":"Koi kuch bhi Kahe.... But this is my favourite movie... Dil se dekho... Full entertainment...n dilougs... Day ho.... Oscar... Bade dilwala...... I m very good sencs of movies... This was not great movie but very funny.    I love this movie.","label":0},{"review":"घटिया फिल्म,Disgusting film , this film don't have story all actors did poor acting.Akshay Kumar's acting is disgusting in this film he have to apologise to audience for making this worst movie.Farah Khan is well known for directing this kind of disgusting films Happy New year was the second installment of his poor film directing skills.","label":0},{"review":"i love akshay kumar and i love your big eyes and your small mouth.\nfrom Nazia zadarn i am 10 year old girl.\nand my favourite colour is blue and pink and tell to me which one is your favourite colour.","label":0},{"review":"This is not worst movie if u think this movie is worst  then why did you watching this movie don't comment worst comment if u wanna write worst comment then don't watch and don't say negative thing if u wanna say worst movie in History of Bollywood. Thank \n                                                                                     You","label":0},{"review":"I enjoyed watching this movie!\nI also met Raghuram years after watching this film, comedy and story is great!","label":0},{"review":"Super movie. I like it. I was previously a huge fan of him but I still like Akshay Kumar. Also I am a huge fan of this actress Katrina Kaif","label":0},{"review":"Hilarious! You should watch this movie if you are in need of a good laugh.","label":0},{"review":"SUCH a good movie! But ofc, you need good taste to enjoy this","label":0},{"review":"It was amazing. Direction was not that good but overall It was amazing.","label":0},{"review":"Loved watching it. It was an entertaining movie.","label":0},{"review":"My favorite movie. The best movie in Chicago","label":0},{"review":"World best and comedy movie and that song my name is shell best song","label":0},{"review":"Movie. Is.  Awsome...in. Comedy.  Its. Super hit 9/10","label":0},{"review":"Those guys who don't like this movie are hopeless creatures and I can't say anything more for them....","label":0},{"review":"Though  the  content  was  rubbish  but  the  film1 was  enjoyable  and  comedy","label":0},{"review":"I think this might be a one time watch. Defintely not a classic.","label":0},{"review":"Over acting of Katrina Kaif...in last scene while looting tresure ...her dialogue was \" bachao mujhe ...bachao mujhe \" till last","label":0},{"review":"I LOVE IT SO FUNNY","label":0},{"review":"Overall good movie one time watch","label":0},{"review":"great movie, it is very funny","label":0},{"review":"BELOW AVERAGE BUT STILL A GOOD TIME PASS!","label":0}]