[{"review":"The name of the film should be\n\"GUIDE TO SELF DESTRUCTION\".👈👈\n\nIt is a tragic love story of an IMMORAL (or UNETHICAL) man.\n\nThis is the BEST film ever made...which shows the CONSEQUENCES OF NOT LISTENING TO THE ADVISE OF ELDERS 😂  ... And doing everything independently... according to your own IMMATURE mind.\n...As if... nobody is superior to you... and YOU NEED NOT LEARN ANYTHING FROM ANYONE...!!!\n\n\nThe HIGHLIGHT of the film is -->\n\nThe film maker has done a very challenging job... of showing ...MORE","label":0},{"review":"The name of the film should be\n\"GUIDE TO SELF DESTRUCTION\".👈👈\n\nIt is a tragic love story of an IMMORAL (or UNETHICAL) man.\n\nThis is the BEST film ever made...which shows the CONSEQUENCES OF NOT LISTENING TO THE ADVISE OF ELDERS 😂  ... And doing everything independently... according to your own IMMATURE mind.\n...As if... nobody is superior to you... and YOU NEED NOT LEARN ANYTHING FROM ANYONE...!!!\n\n\nThe HIGHLIGHT of the film is -->\n\nThe film maker has done a very challenging job... of showing a MORALLY INCORRECT man as a RIGHT & LEGITIMATE one...!!! ...thereby making him acceptable to the society (audience).\n\nIt is like.... Serving the poison to the Audience...by playing melodious background songs.\n... And making sure... that the Audience eating the poison...is FEELING HAPPY to eat it...!!!\n\nBelieve it or not.... But it is the truth of the CONTENT of the film.\n\nThe HERO's mentality in the film shows that there is NO need of any rules [ DO's & DON'Ts ] ... in the society.\n....and Anything can be done by anyone.\n....and Nobody should be answerable to anyone in the society.\n\nJust do whatever you like..!!\n\nThroughout the film, the hero NEVER LISTENS to anybody....\nEven his own family members and friends are worthless for him....till the end..!!\n\nHe is shown as ALWAYS READY TO FIGHT with BOTH  his enemy and even his OWN FRIENDS 👎  👎  \n\nThe Hero USES his family....  as a means of fulfilling his \"DRINKING & SMOKING\" Needs.\n\nAnd he USES his friends....  to show his power and influence in the LOCALITY.\n\n\nWhatever he believes and thinks...is the ONLY THING that matters in the whole film.\nThe Hero is CLEVERLY portrayed by the film maker as -- \"ALWAYS RIGHT\" in the movie.👎  👎  👎  \n....and his every NON SENSE act and deed is GLORIFIED by melodious background tunes and songs.\n\n\nThe \"HERO\" of the film shows that it is perfectly normal if you roam around all the day like a Street-dog with your friends...without doing any work.\n....And it is also OK if you feel NO RESPONSIBILITY towards your parents, your work, even your own self...!!\n\n\nThis film shows that --\nIf you don't get the BOY or GIRL of your choice,   then ---\nYou should either Kill Yourself (COMMIT SUICIDE).\nAs the heroine did in the film.\n\n.....Or you should CONSCIOUSLY go to a mental asylum and spend there the rest of your life INSPITE OF KNOWING THAT YOU ARE PERFECTLY NORMAL !!!\nAs the hero did in the film.\n\n\nIt is difficult to understand whether the lead actor is playing the role of a HERO or a VILLIAN....!!!\nBecause in the end....he ultimately does everything WRONG with himself...!!\n\n\nThe film gives a VERY TOUCHING LESSON that --->\n\nWhen a person gets ILLUSIONED by the storm of UNCONTROLLED DESIRES arising in his mind... then the person ---\n---forgets his/her own primary care\n---loses emotional and mental balance\n---throws away all the MORAL VALUES into the Dust-bin\n---and starts doing the things which leads him/ her towards SELF DESTRUCTION.\n\nIn other words, when SELF DEVELOPMENT \nleaves behind all the MORAL VALUES....... and goes hand-in-hand with UNCONTROLLED DESIRES ....... then it leads to SELF DESTRUCTION.\n\nBut the film justifies the hero's and heroine's every nonsense & irresponsible act ....by playing melodious background tunes and songs..... and showing that EVERYTHING IS FAIR IN LOVE\n... (even self-destruction).👎  👎  \n\nTHE MAIN THING that makes this (MORALLY RUBBISH)  film a 'HIT'.... is that   the film maker has successfully been able to SHOW & GLORIFY... the hero's every \" MORALLY WRONG ACT\" .... as the \"RIGHT & LEGITIMATE\" one.\n\nAnother thing making the film a \"HIT\" is the songs.\n\n\nWe MUST REMEMBER that -->\n\n1. Self care is NOT Selfish.\n2. Self destruction is NOT Love.\n3. Self development is our FOREMOST DUTY.\n4. MORAL VALUES is not something which is possessed by the fools.... But it is the JEWEL OF THE GENTLEMEN.","label":0},{"review":"Everything about the movie is great. Be it acting, editing, direction. It's such a beautiful movie and is emotional as well. Salman Khan's acting is just great. It is one of the best bollywood movies made. It has lived up to the standards set by Sethu- the original version. Bhoomika Chawla is just apt for the role. Her innocent looks make her perfect for the role of Nirjara. She is worth the award she won for her debut role. The music is just soothing. \nThe movie is perfect","label":0},{"review":"Mr. Yash Yug. U told, u r the bigest fan of Salman Khan, I respect your choice. Tere Naam is a very good movie for me. Salman Khan did awesome job.  At first u should know, it was a remake of Chiyan Vikram's Sethu. Bt i think u didn't watch romantic/love story related films of other actors like Irfaan Khan, Rajkumar Rao, Shahrukh Khan, Uttam Kumar, Chiyaan,  and u must watch their films. There r more better actors in India..........","label":0},{"review":"Awesome movie I have ever seen Tere naam is one of my favourite movie what an acting of😍 salmakhan as radhe I'm in love with his character he makes me crying when I watched this movie full of action movie I just love it to much 😘😘😘ND nirjara was so nice all songs are really very nice 🤗 Blockbuster movie of salmankhan.he is doing great job in Tere naam.one of my most ❤️ heart touching movie forever.lots of love for Salman ND bhumi.","label":0},{"review":"Awesome movie. Very emotional, touchy and  fantastic story. Mind blowing acting by Salman Khan and Bhoomika Chawla.lovely pair andcutest couple.Just loved it.Huge and biggest fan of Salman khan. God Bless you SALMAN ji. Must watch movie.","label":0},{"review":"My favourite movie... I fall in love with this movie in the age of 4 months......   it's really touch my heart 💝💝.. n it fits on my mind..from that time to now i just mad for this movie.... i have never bored to watch this...☺☺☺I really loved it.... I am so mad for this movie that my neighbours n relative's call me \"tare naam\"....","label":0},{"review":"This movie is really great... With a lot ki expressions and the kind of acting both have done is really amazing .. No words for the film and the songs are too good..  I love each of the song... There's a lot of pain in udit ji's voice...","label":0},{"review":"It's one of the best movie of Bollywood (India). Mature acting by the lead roles. It is the best movie of Salman Khan and also the first and the last movie in which his character role is so serious towards love that he remained mad till his death. The movie became so much super-Dooper hit that A new hair style adapts that's called 'Tere Naam Hair Style' .\n\n*****/*****","label":0},{"review":"One of greatest movie. And my all time best of Salman khan...bhumika chawla's role is admirable, appreciable..and Salman khan gives 💯... Very emotion, incredible love story...and take a bow...I just cry after watching..and want 2nd part too","label":0},{"review":"This is best movie. I suggest you to watch this movie. I have watched this movie many times but I am not get bored. I love this movie also I remember my previous days. This is best movie of a nice love story. The songs are very best of this movie.","label":0},{"review":"it's amazing and amazing.. salman's performance is totally unbelievable.After  seeing this movie i always used to ask myself why bhumika did not accepting salman's proposal at an early stage.people say that wanted is the salman's u turns in industry but i will definitely say it's tere naam.. it will remain as one of the best movie ever..","label":0},{"review":"No words just awesome. Best movie by Salman Khan ever it has action, intense emotions, love..... Everything\nAnd songs are just awesome and I you haven't watched this movie give it a try.","label":0},{"review":"No words can describe this movie . It's Salman best movie of all time . Filled with love emotions and sacrifice. Songs made me literally cry. Best romantic movie than aashiqui 2","label":0},{"review":"One of the finest movie of Salman till now. Watched again and again but still not got bored. The best I can feel about this movie is all the songs and specially \"kyu kisi ko wafa k badle\".....","label":0},{"review":"The meaning of God..... Love transcends man's atheistic tendencies and theistic perversities..... Radhe Mohan symbolizes Lord Krishna.....the Supreme Godhead of Universe Who comprises everything in nature....  Big hands for marvellous movie....","label":0},{"review":"It is amazing movie and I love salman's hair style and heroine is also a perfect choice I have cried a lot at the title track tere naam song I have seen this movie 50 times and this love story is very from other love stories so keep it up 👍👍👍","label":0},{"review":"Watched it today after 16years of its release...  It's really heart breaking movie.. Too emotional..  Very good Acting..direction.. I m not Salman's fan but this movie made me his fan...  Songs are awsome..","label":0},{"review":"As I think it is one of the best movie of salman khan. We can categorize it in top 3 of all time movies of salman khan. Last scene makes me cry. Finest art ever","label":0},{"review":"Trust me, the impression of Salman Khan will change for you(his haters) after watching this movie. NO DOUBT THE MOST ICONIC PERFORMANCE BY SALMAN KHAN. AND ONE OF THE GREATEST PERFORMANCES EVER IN BOLLYWOOD HISTORY.Overall,I was a SRK fan now I am a SRK and Salman Fan.","label":0},{"review":"No can deny this is the best salman khan movie in romantic genre. This is one of the best romantic movie showing realistic love life. You will be become fan of salman khan to watching this film.","label":0},{"review":"I would like to appreciate the Director Satish Kaushik . Because my family just saw him as comedian with Punkaj Kapoor(Nonie and Neetu) and the singers made this whole movie a perfect package for viewers.","label":0},{"review":"This film is very emotional n tragic love story n starters how Radhe Mohan (Salman Khan) was madly in love with Neerjra (Bhumika Chawla). A true love Story and very close to 💓","label":0},{"review":"The film Tere Naam is one of the superhit film of Salman Khan, which I ever watched 5 times... The best part of is feeling love, emotions, drama and last tragic scenes.... Excellent Movie..","label":0},{"review":"This movie is really imotional 😢😭😭 I always cry during this movie and the story of this movie in very good and emotional and Salman sir and the heroine did a great and first time when I saw this movie I didn't expect the ending will be so emotional really they did a great job well done 👍👌","label":0},{"review":"A marvelous movie, everyone who want to know what is love must watch this. Salman khan acting was great and every character played their role very well.","label":0}]