[{"review":"As far as I am concerned, Mangal Pandey fails to live upto the expectations. The movie with its excessive exposure of female anatomy and a weak display of the seriousness of the situation does not prove to be intense or touching. The movie would have been much more nail-biting and at the same time, inspiring, if only the gravity of the circumstances had been given a little more importance than mere entertainment. A poor show by Amir Khan and Ketan Mehta, surprisingly, when both of are considered ...MORE","label":0},{"review":"As far as I am concerned, Mangal Pandey fails to live upto the expectations. The movie with its excessive exposure of female anatomy and a weak display of the seriousness of the situation does not prove to be intense or touching. The movie would have been much more nail-biting and at the same time, inspiring, if only the gravity of the circumstances had been given a little more importance than mere entertainment. A poor show by Amir Khan and Ketan Mehta, surprisingly, when both of are considered icons in the world of Indian cinema.","label":0},{"review":"Truly awesome movie\nAamir khan did his role excellently. \nThe movie tells on how Mangal Pandey uplifted other Indian soldiers against British rule beginning the Sepoy mutiny and the first for freedom.\nWatch the movie for sure and u will learn many things. It will surely inspire you to do something for your nation.","label":0},{"review":"We Salute to our legend freedom fighters.\nMangal Pandey is proud of our country.\nWe will never forget Mangal Pandey and all \nthosefreedom fighters who gave their lives only and only for us.....\n\nAwesome movie.....\nAmir khan's acting was really Supper👌\n(4.9/5)","label":0},{"review":"Best movie to remember the nationalism .\nHats off Aamir khan.\nProud to be Indian.\nThis movie will surely uplift u from religious , caste , colour discrimination  and make you feel united .","label":0},{"review":"Proud to be in the country where legends like mangal pandey were born btw wonderful movie as usual aamir khan was exceptional and thanks for letting us know the story of such great legend...","label":0},{"review":"A movie that will lit patriotism.....inside every Indian....truly the 1st freedom struggle..... Ideal personality...mangal pandey .with  exceptional courage\n...!!!","label":0},{"review":"Watched it now. Very good. Aamir was exceptional.","label":0},{"review":"Excellent absolutely brilliant must watched movie for every Indian 🇮🇳","label":0},{"review":"I love this movie please make mangal pandey the rising part 2","label":0},{"review":"Amir sir done  a fantastic role  and big fan of 3idiots.","label":0},{"review":"I love it...\nIts wonderful!!","label":0},{"review":"Many things to learn.... We all should do something for our nation.🇮🇳","label":0},{"review":"best film in life time.jai hind","label":0},{"review":"Great great great","label":0},{"review":"Superb movie","label":0},{"review":"Great movies feeling proud.","label":0},{"review":"Just awesome","label":0},{"review":"Best from mr perfectionist","label":0},{"review":"Good movie","label":0},{"review":"Story narration is super","label":0},{"review":"nice movie","label":0},{"review":"Nice movie.","label":0},{"review":"Good. My.\n\nDo","label":0},{"review":"Potatoes taste like lettuce","label":0},{"review":"Mangal pandey was from ballia up isint it💪💪💪💪💪","label":0}]