[{"review":"Lunch box  movie review\n-yogikrishnan pillai\n\n\n\nHave you ever seen a movie and after watching it you just need some time to process what are you feeling or what do you want from life,this movie made me do that,\nThis movie pulls each and every string of your heart.I procrastinated this movie for a very long time but now I regret it, I wish I had seen it before.\nThis movie was directorial debut of Ritesh Batra.The screenplay and this magnificent story was written by the same person.\nThe story feel ...MORE","label":0},{"review":"Lunch box  movie review\n-yogikrishnan pillai\n\n\n\nHave you ever seen a movie and after watching it you just need some time to process what are you feeling or what do you want from life,this movie made me do that,\nThis movie pulls each and every string of your heart.I procrastinated this movie for a very long time but now I regret it, I wish I had seen it before.\nThis movie was directorial debut of Ritesh Batra.The screenplay and this magnificent story was written by the same person.\nThe story feels authentic like it could happen with anyone that we see on daily basis. The thing that holds everything was the story...though there was not too much to play with but Ritesh Batra has spun this story so well that everyone can somehow connect to this story.While watching you will realize one thing that you will be anticipating the arrival of the lunchbox more then the characters.One thing I can assure that you will root for two of the main characters to come together,when you get so invested in a story thats when you know the screenplay work is on point.\nNow lets talk about the acting work which is absolutely beautiful and awe- inspiring.Irfan khan who plays the role of sajaan who is almost more then 50 yrs old or less then that but he is old who is about to retire from his job and he has only few weeks,but there enters or another character shaikh played by Nawazuddin siddque the new age actor who has done the best he can do with his character. Shaikh is the new replacement for sajaans job.Our other lead Nimrat kaur who plays the character Illa with absolute ease and poise,she plays the role of a housewife who is desperately trying to get her husbands attention for a very long time but is unsuccessful in doing so but is guided by a lady Mrs Deshpande who lives upstairs,there isnt any scene in the movie showing this character played by Bharti Archrekar,somehow the two communicate with each other from their windows and help each other out.So the story isnt gripping or some kind of thriller its just a simple story of how we as humans need to connect with people,how we constantly need someone to hold us and tell us that everything will be alright.The characters are written so beautifully that u forget that its fictional characters ...you root for them somehow get invested in their story. The dialogues like “sometimes wrong trains lead to right paths” or “I think we forget things if we have no one to tell them to” is so alluring.the dialogues written feel so true to nature that if i was in their positions i would have said the same thing..it is really amazing how with so little to work on they create.. which is Indian cinemas best dialogues.Nothing is wrong with this movie everything is perfect the background ,lights are so damn good that you feel like its happening in reality.The background scores fill your heart with emotions.\nThe nuances and subtle human nature is captured with so much perfection that it feels like too good to be true.This movie is fantastic and I guess everyone in some or the other way can connect to this movie it captures how vulnerable humans can be when they dont have anyone.One thing I like about the opening sequence is how the director plays with your mind I really liked ,I thought it was innovative. Im sure everyone will appreciate this movie as I do. Do watch it with your friends and family. Indain cinema still has hope kudos to Ritesh batra. See we as audience do not just want slapstick comedy or action sometimes we need a story to it all together.I believe that a movie can work with the masses even is the lack action and comedy.After all life is just story of everyone which is yet to be discovered.\non a scale of one to ten\n9.6/10","label":0},{"review":"Watched the movie on a Saturday a bit through streaming Netflix on television and the remaining on the mobile .. such an engaging movie.\nSuperb screenplay. \nNimrat is believable and her mom's conversation with her on the day of her husband's death, a revelation.\nIrfan has gotten into the charecter beautifully. So many little details in the movie are endearing..like when he's seen walking to his home in Nasik with an old vip suitcase; a question by the children playing on the streets as to why is ...MORE","label":0},{"review":"Watched the movie on a Saturday a bit through streaming Netflix on television and the remaining on the mobile .. such an engaging movie.\nSuperb screenplay. \nNimrat is believable and her mom's conversation with her on the day of her husband's death, a revelation.\nIrfan has gotten into the charecter beautifully. So many little details in the movie are endearing..like when he's seen walking to his home in Nasik with an old vip suitcase; a question by the children playing on the streets as to why is he here now; the choice of Nimrat's wardrobe..the details are many.\nRefreshing movie and watchable many times because of the depth in screenplay.","label":0},{"review":"Delightful and revealing story of life in Mumbai. The lunchbox service is transported to that of intrigue with gastronomic and tender exchanges. Getting old, ill and retiring with still so much to offer, more skills than those coming up behind you. The wife reflects many young beautiful women whose husband rejects them for lust. This feeling of being unwanted and trying to entice the husband back aligns with the older man feeling unattractive . Beautiful film","label":0},{"review":"Lunchbox is one of the few rare gems in today's Bollywood Industry when the mainstream films are busy making \"what sells\" with their cloying motifs. \nLunchbox with its cinematography, direction, screenplay and almost every other element paints a truly vibrant story with palpable emotions that transcends through the screen and imprints onto one's heart. Watching this movie was an immensely satisfying experience.","label":0},{"review":"Sophisticated cinema! You needn't hide behind bright lightings, magnificient buglows, huge casting and a forced glamour  when you have a powerful content. The lunchbox proves it. This is a story of bottled up emotions that find their way to ears eager to listen through a lunchbox delivered mistakenly. This story of Ela and sajaan is simple yet powerful to its best. Worth it anytime!","label":0},{"review":"First time i saw a romance movie without a single song from bollywood & this is really amazing. The roal of Irfan khan, nawazuddin siddiqui & nimrat kaur always keeps u engaged that doesn't creates a pace for song. This is really an Art movie from home of bollywood.\nThis is obviously a must watch movie before you die !","label":0},{"review":"Just superbly done n acted.  What a plot n so well executed. U just can't take ur eyes off coz u expect things to happen every time a dialogue is said.\n\nLuvd this one. And the ending👌","label":0},{"review":"Amazing Masterpiece,,Apart from Bollywood drama ..\nif you want something simple to see then must watch..\nLunchbox is totally based on lunchbox where everything is revolving around the box,,\nyou can't go your eyes off when you watching this movie..\nAmazing dialogues","label":0},{"review":"One of the finest lovestories I have ever seen .Love nd emotions between two persons who have never met.\nNice and simple but powerful storyline.Brilliant ,remarkable portray of lead characters by Irfan and Nimrat.Charming,warm feast for heart.","label":0},{"review":"Good movie as compared to other Bollywood exaggerated dramas. The beauty of this movie lies in it's simplicity. Every single detail has been focused with care. There's a different ending to this movie which leaves upto your perspective.","label":0},{"review":"The quintessential search for happiness which\nIs missing in many Indian house holds where\nOverton expression of affection is taboo due\nTo societal pressures and seeking happiness\nIn 'choti choti' baat  has been well brought\nOut by superb direction and both the male lead\nWho is in the general of Naseeruddin shah and\nA total make over from a chocolate girl to \nAn innocent house wife by Miss Nimrat kaur is like a  breath of fresh air in Indian Cinema\n\nH","label":0},{"review":"A wonderful reflection of humanity and how we deal with life's daily challenges. It shows the importance of the people that surround us. \n\nWe are all connected in some way even though we are not physically or geographically close.\n\n9/10","label":0},{"review":"This film was so moving, comical with great acting. I could taste the food. A must watch with that unforgettable line:\n“Sometimes the wrong train will take you to the right station”\nI badly want that stainless steel lunch tin set now!","label":0},{"review":"One of the finest films of Bollywood industry. The types of emotions and feelings given by the lead roles are the biggest asset for the film...and asusual nawajuddin siddiqui did a terrific job. A must watch film.","label":0},{"review":"I wanted to watch it from a long time but couldn't watch it. I watched it today on Netflix. Something that you cannot express in words. You need to watch it and feel that love that gets lost in this chaotic, busy life. 5 stars from me.","label":0},{"review":"Irfan,s acting is the soul of a simple script becoming so effective.watch difference in his reaction when same Tiffin box comes to his table day after day.difference in his glance and inquisitive ness in opening of box says all.anticipation,anxiety depicted by excellent expression underlines his great talent.","label":0},{"review":"Just finished watching this movie. Great!!! Loved it. I was a bit surprised by the ending, a bit abrupt as I was expecting something different. Quite realistic on many levels.","label":0},{"review":"It touched my soul. \nThe loneliness of the 2 principals and how the lunchbox switch and resulting letters start transforming their lives. It’s a story of reality as well  as hope, detachment as well as human connection, the mundane and the unexpected.\nA delightful tale that remained unfinished.","label":0},{"review":"I loved watching this movie\nI felt throughout the movie like m reading a novel \nTwo persons unknown to each other and how they share their life and emotions through a piece of paper simply amazing yaar","label":0},{"review":"The characters draw you into their lives from the beginning its been so relaxing and illuminating to watch this film. Absolutely recommend this must see movie.","label":0},{"review":"Although I don't usually watch romance movies flicking thru SBS on a lazy afternoon I stumbled across this one and being intrested by Indian culture decided to watch it and I actually enjoyed it as the story line and premise behind the tryst was different from the usual romantic boy meets girl stuff","label":0},{"review":"it's a very good concept of the film, #irrfan and #nimrat had done a great job portraying their characters and over all this is a must watch movie.\nlove @irrfank\na.","label":0},{"review":"A very well conceptualized and interesting movie. Loved it all the way until the end. Brings out the emotion of unexpected love.","label":0},{"review":"The movie is a very touching one indeed.And its all about two persons living amidst loneliness, in thier own terms, finding solace through a misdelivered lunchbox.","label":0},{"review":"Extraordinarily deep and beautiful in every sense.\nThe class of Acting is beyond imagination.\nMasterpiece 👌🏻👌🏻","label":0}]