[{"review":"Vey good movie. Its grt to learn how to communicate without dialogue. It also makes one think in a different tangent as they are married though apart. If you think of it or shld b shown to every youth to teach them the true meaning of love and making them believe that one will need to go to extreem conditions on marriage (like sandhya comes home whom is a widow) . However one must resist all distractions and come out faithful like bose.","label":0},{"review":"It's a sweet platonic movie revolving around three super shy characters. As the endearing little child says Kaku ane japa bahu ane bongla bahu. If you don't apply the real world and it's logics, the story is nice, though had this been a period movie, many logics would have been more apt. Movie's made in old style romantic format, with sometimes long drawn scenes, which could have done with better editing. Bose managed the bongenglish fairly well, though for me, his character could have done with ...MORE","label":0},{"review":"It's a sweet platonic movie revolving around three super shy characters. As the endearing little child says Kaku ane japa bahu ane bongla bahu. If you don't apply the real world and it's logics, the story is nice, though had this been a period movie, many logics would have been more apt. Movie's made in old style romantic format, with sometimes long drawn scenes, which could have done with better editing. Bose managed the bongenglish fairly well, though for me, his character could have done with a deeper thought process; not his fault. Reema-  eyes, face, stance, body language - super acting- the character was well rounded too. In fact among the three hers was the most believable. Japanese wife didn't get any expedited at all, didn't blend into the story at any point.","label":0},{"review":"This is a very endearing movie, it made me really happy from the inside, it tugs at your heart strings, in a way that is not explananble. The actors, the story line, the simplicity--it deserves 10 stars if i can give it. Truly a great watch---Wish we had more such movies. It summarizes one thing for sure--LOVE is a universal language.","label":0},{"review":"movie is all about the divine love no matter where you get it from. They surrendered each other to love, a beautiful affection created by god and even that matters when one of them is not along with them any more, the divine/pure love will always be remain in there heart.","label":0},{"review":"I enjoyed this unrealistic movie. It is possible for people to feel what the couple felt despite the distance, but it is not sustainable in this day and age. The movie did drag in some areas, but overall, it is a beautiful story of love that you rarely find in today's world.","label":0},{"review":"One of those movies where you rather enjoy the languorous pace.  Great cinematography, greater background score.  Raima's eyes convey a lot in places.  A definite must-watch for lovers of good cinema....","label":0},{"review":"Story of eternal love beautifully narrated by the letters between the two . Everything about this movie is an awe and you can feel scene by scene that you are reading a good old hidden book instead of a movie .","label":0},{"review":"In this Tinder fast food type relationships on order world, movies like these show that people can be geographically apart yet emotionally and spiritually connected.","label":0},{"review":"Movie is really interesting marks on universality of love. Love is an ever fixed mark divine, pure...","label":0},{"review":"One of the best romantic movies I have watched lately.\n\nHighly recommended","label":0},{"review":"Very good movie. Good entertaining, also heart touching. YOU must watch","label":0},{"review":"I don't know Bangla.  But i think i can tell meaning of every dialogue .\n\nSuperb !!!","label":0},{"review":"Unusual story line and brilliant performance by Rahul Bose and Moushmi Chatterji. Touches your soul deep down","label":0},{"review":"a  beautiful, simple & subtle love story...though it lacks pace it is still worth watching..","label":0},{"review":"aparna sen's best movie evermade in his life,grt movie,rahul bose is a grt actr","label":0},{"review":"I completely loved this movie.. Intense emotions .. Master piece","label":0},{"review":"A very good movie . A must watch for movie lovers.","label":0},{"review":"Liked the movie.. emotional indeed. Love, Trust, Care depicted well...","label":0},{"review":"I am eager to see the film again and again. It is the best film-story, acting, location, .....all.","label":0},{"review":"AWSOME Movie Very Touching.Depicts what true love is all about.","label":0},{"review":"This is really a master piece from Aparna Seen, and a spellbound performance from Rahul Bose... #hatsoff","label":0},{"review":"It's a must watch movie, slow paced, offbeat but tremendous.....\nRatings- 3.5/5","label":0},{"review":"awesome movie and rahul is excellent","label":0},{"review":"This movie shows us that Rahul Bise is a great actor","label":0},{"review":"Its almost like true story.... i knw someone who live same life.....","label":0}]