[{"review":"Pros:\nVery good movie. \nCrisp runtime. \nExceptional performances from lead actors. \nSurprising twists.\nA murder mystery should keep you hooked till end & this movie does achieves it.\n\nCons:\nLogic loopholes (Like what did the police department do when 5 murders had happened. Whom was kedar suspecting? Did he or the department investigate or not?) \nThe decoy plot (except for an explanation in the end, was not well used)\nExcept for Sanjay and Satam all other policemen were shown in poor light.\n\nGiv ...MORE","label":0},{"review":"Pros:\nVery good movie. \nCrisp runtime. \nExceptional performances from lead actors. \nSurprising twists.\nA murder mystery should keep you hooked till end & this movie does achieves it.\n\nCons:\nLogic loopholes (Like what did the police department do when 5 murders had happened. Whom was kedar suspecting? Did he or the department investigate or not?) \nThe decoy plot (except for an explanation in the end, was not well used)\nExcept for Sanjay and Satam all other policemen were shown in poor light.\n\nGiven the shorter runtime & performance of Sanjay (KK Menon), this movie is definitely worth watching!!","label":0},{"review":"Very good. The plot, the acting and the cinematography were superb. K K menon never fails to deliver. He is one of India's best thespians. If one did not know, it could easily be mistaken for a top grade Hollywood movie! First class. Congratulations to all!","label":0},{"review":"Excellent Movie. Everybody acted very well in the movie. Songs and BGM in the movie were not so good. The movie was so interesting and thrilling. Not even a single scene was boring. The movie was not so lengthy and lagging which was a main highlight of the movie. There were no unwanted scenes and the movie concentrated more on thrilling and investigating scenes that made the movie more interesting and thrilling. The movie was not boring at all. The lead actors rocked the movie by their performan ...MORE","label":0},{"review":"Excellent Movie. Everybody acted very well in the movie. Songs and BGM in the movie were not so good. The movie was so interesting and thrilling. Not even a single scene was boring. The movie was not so lengthy and lagging which was a main highlight of the movie. There were no unwanted scenes and the movie concentrated more on thrilling and investigating scenes that made the movie more interesting and thrilling. The movie was not boring at all. The lead actors rocked the movie by their performance. One of the best thriller movies. Excellent Movie.","label":0},{"review":"Movie is unpopular and underrated like other movies of K K Menon. Rahasya was also a good movie like this. It's a suspense film and based on true events. It could be a little better. I give 7/10.","label":0},{"review":"Perhaps the best ever thriller underrated movie. I wish there would be more movies like this one in the future.","label":0},{"review":"Seat edge thriller Movie....\nEach scene will create tension definitely\nSuspence carried till end of the movie\nMy rating 4/5","label":0},{"review":"A must watch with an unpredictable twist, amazing screenplay and KK Menon is cherry on the cake :)","label":0},{"review":"It's d most underrated murder mystery movie....Superb acting by Menon....Guess we'll never know d Actual killer","label":0},{"review":"I think this film was the best Indian murder based movie.I wish more films are made in this manner.","label":0},{"review":"One of the Best suspense thriller films...\nAmazing Kay kay Menon...!!!\nMust watch...!!!","label":0},{"review":"One of the best crime thriller movies.\nLoved it👍","label":0},{"review":"Super movie... Crime-thriller-Mystery...\nScreenplay direction good.\nKay Kay Menon acting super 😍😍😍❤️👌","label":0},{"review":"Best thriller movie ever.... Kay kay Menon is awesome....","label":0},{"review":"Very good movie must watch..i dont know why the film is not hit....","label":0},{"review":"One the best thriller movie I have watched","label":0},{"review":"Absolutely stunning, way ahead of it's time.","label":0},{"review":"Best thriller suspense movie! Worth watching.","label":0},{"review":"I worked in this movie , great thriller !👍","label":0},{"review":"Best Mystery movie i have ever seen","label":0},{"review":"Best suspense movie.must watch","label":0},{"review":"Best bollywood serial killer movie","label":0},{"review":"Amazing movie.... suspence till the end... keeps u glued!!","label":0},{"review":"K k menon sir outstanding 5 star","label":0},{"review":"Best serial killing movie","label":0},{"review":"Nice movie I like it","label":0}]