[{"review":"One of the best movies I have ever seen in my entire life. The following film has made a large impact on the way I think and do things...this movie has successfully killed a majority of my brain cells. I recommend everyone to watch this master piece...you will want to kill yourself at first but believe me that slowly your pain will start numbing due to your brain slowly melting in your head. In conclusion good fun...","label":0},{"review":"Awesome movie 👌 must watch. It will replenish and refresh your mind. I mean it. Your brain neurons and cells will die watching this movie allowing new fresh cells to grow purifying your brain. But don't do it more than once or you may end up brain dead. I wonder why this wasn't sent to Oscars 😆","label":0},{"review":"kuch nahi hai haunted place sab bakwas hai . there is nothing to fear to go to bangarh place . bangarh is a beutiful place .","label":0},{"review":"One of the worst film i have ever seen. The license of all cast and director of this film should be cancelled forever.","label":0},{"review":"Literally waste of time. No cinema sense, no acting, nothing to like in it. Simply you'll waste your time.","label":0},{"review":"It was utter rubbish. For a thriller there was nothing thrilling and there was no suspense in the plot of the movie.","label":0},{"review":"If anyone wanted to view movies of this kind,please see the reviews first otherwise it becomes suicidal.","label":0},{"review":"The most irritating movie ever seen of Bollywood. Zero rating 0","label":0},{"review":"Worst movie, if you want to waste your time then watch it","label":0},{"review":"Worst movie ever. Not recommended to watch. Wastage of time","label":0},{"review":"So spooky!  The direction made me shat in my pants.","label":0},{"review":"Extremely low budget movie with a weak script, acting and direction skills.","label":0},{"review":"Total waste of time","label":0},{"review":"Worst movie ever","label":0},{"review":"Faltu movie, waste of time.","label":0},{"review":"Successfully wasted 2 hours. Ekdum ghatia movie..","label":0},{"review":"Crappiest movie ever!","label":0},{"review":"Waste of time.. No fun drama","label":0},{"review":"Average Film","label":0}]