[{"review":"Mustwatch.. beautiful..Unique... mesmerizing..a whole dictionary seems to be helpless to describe this particular movie.TUM BIN  clearly shows that how decently a love story can be said without any melodramatic conversations.No extra emotion,no overacting,no flirt,no kiss,no wink..even in the whole movie, there is hardly any scene where Sekhar and Priya touch themselves..just imagine!!..so strange!!! Yet the chemistry between them has been grown so beautifully that it forms spiritual bonding bet ...MORE","label":0},{"review":"Mustwatch.. beautiful..Unique... mesmerizing..a whole dictionary seems to be helpless to describe this particular movie.TUM BIN  clearly shows that how decently a love story can be said without any melodramatic conversations.No extra emotion,no overacting,no flirt,no kiss,no wink..even in the whole movie, there is hardly any scene where Sekhar and Priya touch themselves..just imagine!!..so strange!!! Yet the chemistry between them has been grown so beautifully that it forms spiritual bonding between them.Songs are amazing and perfectly placed.The locations are eye pleasing.Title bgm along with koi Fariyad tune are just haunting,ear pleasing as well as heart warming.All the actors have done full Justice to their characters.They are the reasons why each moment is so lovely as well as lively.\nFor me , \n#TUMBIN# is the ULTIMATE...ONCE IN LIFE TIME..so don't miss.","label":0},{"review":"The best movie in Bollywood....a real life basic emotions and full of love...😍😍😍it has the speciality to attract people..I know most people want to watch their favorite characters like srk or salman khan etc.This movie may not have those actors and also doesn't have those romantic scenes and unfortunately people want those things.\nMay be that's why this movie did not collect more ratings but for me it is 11 out of 10.101 out of 100...This is a movie that everyone can watch with their family m ...MORE","label":0},{"review":"The best movie in Bollywood....a real life basic emotions and full of love...😍😍😍it has the speciality to attract people..I know most people want to watch their favorite characters like srk or salman khan etc.This movie may not have those actors and also doesn't have those romantic scenes and unfortunately people want those things.\nMay be that's why this movie did not collect more ratings but for me it is 11 out of 10.101 out of 100...This is a movie that everyone can watch with their family members even it is a love story..This movie is a star and it is so much much much special for me... Always loving it from my heart..😍😍❤️❤️","label":0},{"review":"Millions of childhood memories with this movie. Truly amazing and I loved the soundtrack. Jagjit ji and Sonu ji were so peaceful to listen. I truly wish the actors to make a reprise edition of the film together so that many like me can be nostalgic oncd again:)","label":0},{"review":"LOVE- that's unconditional - unintentional and unbiased. It always finds it's way to everyone life.\nThis movie is true gem in-terms of story - feelings- emotions of love and after all mind blowing MUSIC of all time.\nDon't miss if you love emotional and romantic movies with good script.","label":0},{"review":"A movie beyond words to describe what actually LOVE is..what emotions do value in love....so much unsaid emotions related to it of mine...watched 95 times still never bored.. speechless for the heart warming songs location emotions unconditional love story each n everything every bit of it is speechless that straightly touches to the soul giving me goosebumps everytime i watch it...one n only this is my movie for this lifetime..till m alive m gonna watch it..i live in this movie","label":0},{"review":"Story was interesting and Best ever combination of songs.\nI love this movie one of my favourite,the songs,the cast,the scenes,shooting spots,acting,story everything is just perfect......\nn every thing is so beautiful emotional romantic and actors are also too good .everybody should watch this movie.","label":0},{"review":"I have some lovely memories with Tum Bin....\nwhich I never forget.. the hero of this movie \njust fascinating specially his voice I liked a lot the song Koi Fariyad all time the best song. Many times I have watched this movie but every time it made me so romantic.\n\nThanks & Love Tum Bin......","label":0},{"review":"Awesome  music compose by nikhil vinay still listenig espcially choti choti raten.good story line actors are so good and a emotional romantic movie bu anubhav sinha ever.everybody should wathc this movie once.but i watch this movie many more times and still waching from 2001","label":0},{"review":"WHAT A LOVE STORY\nWAW AMAZING\nSPEECHLESS\nSPEECHLESS\nSPEECHLESS\nSPEECHLESS\nSPEECHLESS\n\n\nWHAT A MIND BLOWING MOVIE\n\n10 OUT OF 10\n\nAGAIN SPEECHLESS\n\nI HAVE LOT OF WORDS\n\nWONDERFUL\n\nOUTSTANDING\n\nAMAZING\n\nNICE LOVESTORY\n\nEXCELLENT\n\nBEAUTIFUL\n\nNO WORD\n\n10/10\n\nMUST WATCH PLZ\n\nDONT KNOW WHY THEY ARE NOT EARN MORE \n\nBUT ONE UNIQUE AMAZING INCREDIBLE MOVIE\n\nTHANKS","label":0},{"review":"It's a very different kind of a love story & has amazing songs. It's rare to find tum bin songs playing on tv channels, so I bought myself the dvd of this movie.","label":0},{"review":"a must-watch movie. filled with reality. every actor in the film has done their job extremely well. film doesn't go out of track for a moment. this movie is the seal of perfection.","label":0},{"review":"One of my fav movies. Priyanshu at his best. All the songs are wonderful. Can see this movie anytime, again and again !!","label":0},{"review":"It taught me that what actually love is.2 songs are boring but its content touch me lot.Really must watch movies.songs which are play with drama are heart filling.","label":0},{"review":"This is a movie which I looking for in romantic genre. Movie is a bit of slow but awesome music make it interesting & lovable.","label":0},{"review":"Awesome movie,I just love it. every thing is so beautiful emotional romantic and actors are also too good I just love love this movie","label":0},{"review":"Story was interesting and Best ever combination of songs and some of the  songs were incredibly sung##\nNOT EVERYONE CAN SING LIKE##\nTRUE KNOWLEDGE OF MUSIC##@SONGS OFTHISFILM","label":0},{"review":"It was a really good film with real life situations and a roller coaster of emotions I definitely recommend watching this movie!","label":0},{"review":"Amazing Movie. Everything is great. Be it the songs, cast , script, direction. all things are awesome.","label":0},{"review":"Tum bin  is very clean movie I had never seen before the other movie like that after all  its love based,  thank you .","label":0},{"review":"Songs in this movie are so good that they really match with story and such a beautiful and pure love shown in this movie, hats off","label":0},{"review":"One of my best movie I have ever seen...\nMusic - Nikhil Vinay outstanding\nStory - Outstanding\nActing - Outstanding","label":0},{"review":"One of the best movie of my life and very heartouching movie...I want 2 part of this movie....jaha tk end hui hai ..Wahi se continue kre movie (2 part me )....","label":0},{"review":"I love you guys i can watch this movie any time now, after decade but i will get the same feeling... masterpiece..","label":0},{"review":"Tum bin is a good movie for all age guys. All songs is perfect for movie scene and cast.","label":0},{"review":"Awesome work by star cast with fabulous music and also ....Mr priyanshu chatterjjee ,u hv done an exceptional work yr really","label":0}]