[{"review":"The problem with our audience is any movie without any of the 3 Khans or Akshay Kumar will not be appreciated. This movie has great performances by Nana Patekar and Dimple Kapadia. The number of songs could have been curtailed.","label":0},{"review":"Good Simple movie... No violence or obnoxious language etc... Ofcrse needless to say as always Nana Patekar n Dimple were too good... Liked it! :)","label":0},{"review":"Movie has a good story but screenplay is really bad its a conflict between 3 in screenplay Nana patekar rohit shetty and the army guy if the director or editor could increase the oenth and put some more depth of each character and gave some better court time and into heritage examples but it jumped into the conclusion which I hated","label":0},{"review":"The movie is very short and sweet I really enjoyed it few moments in movie was heart touching title song is very good.","label":0},{"review":"Watched it only for Nana Patekar. Rest of the story is dull and mundane. Direction and screenplay could have been a lot better.","label":0},{"review":"Suberb movie i like dimple mam acting very cool..\nNana patekar acting is awesome...","label":0},{"review":"Very clean and sensible movie,,,, Nana ND dimpu rocks","label":0},{"review":"One of the first 'music'-al movies of India! Loved it","label":0},{"review":"Nana Patekar Rocks. Nice Social Movie.","label":0},{"review":"Watch only for god father of bollywood NANA PATEKAR and the story was quite interested.","label":0},{"review":"Emotional, comedy, heart touching.","label":0},{"review":"Good movie","label":0},{"review":"Nana patekar always awesome actor....😀😁😁😁","label":0},{"review":"Very nice movie","label":0},{"review":"Nice movie.","label":0},{"review":"Big headache hearing the repeated words Dilshad and cafe cafe cafe","label":0},{"review":"fantastic  ...!","label":0},{"review":"awesome nana .....","label":0},{"review":"Old type of story but entertaining","label":0},{"review":"Nana is matchless","label":0},{"review":"Watch only for Nana","label":0}]