[{"review":"I love this movie so much because it shows how two people can forget everything but not the love that bonds them. Truly remarkable performance. Kajol is so natural at acting while Ajay is just fantastic. This movie makes me emotional every time I watch it...","label":0},{"review":"One of the real good things in this film and this film learn everyone human beings are alive together with love...   Ajay devgan sir is doing best direction..in future you can give good films in your directions...","label":0},{"review":"It is perfect movie... \nAjay was fabulous and kajol was fantastic... \nI don't understand how it did not work on box office","label":0},{"review":"Movie was so good that I slept off between the movie, if you’re turning insomniac.... this movie is for you. The acting is so good that you’ll get to know the difference between acting and over acting, when it comes to the cameraman..he snorted horlicks before shooting this movie I guess.","label":0},{"review":"I like kajol natural acting the way she act is too realistic and ajay was among best natural actor who can handle the situation very easily bravely","label":0},{"review":"All time favorite... All time... Just amazing movie... And song.. U me aur hum..ek duje par apan haq to kabza na\n.. Just amazing...","label":0},{"review":"Ajol's  great chemistry on screen as well as off screen and this movie is just awesome, fab, fantastic and superb.It's perfect visual treat.","label":0},{"review":"Ajay's acting is fabulous.No overacting,I would rather say perfect acting.,and kajol is always best in delivering,what the role demands.","label":0},{"review":"I cried during the film. I really really liked the movie. The story is amazing.","label":0},{"review":"One of the best movie in Bollywood, outstanding performance by Ajay & Kajol.","label":0},{"review":"I like all movies of a jay with kajol than other actor","label":0},{"review":"I couldn't see this movie  twice because of its realistic acting and I keep forgetting small things an scared","label":0},{"review":"Movi good but ajay acting is not good because over acting and camera not a perfect not bad but nice movi","label":0},{"review":"Excellent practical movie.","label":0},{"review":"Handsome sir","label":0},{"review":"Nice movie","label":0},{"review":"Great movie❣","label":0},{"review":"Nice movie forever...","label":0},{"review":"Plz anyone can send movie link where full movie is available","label":0},{"review":"Copy of  notebook","label":0}]