[{"review":"The credibility of a film maker mostly depends on how the story is transformed on the big canvas, captivating the audience. \n\n  Traditionally, when the story is simple our directors sugarcoat it with scenic backdrops and spice it up with melodrama. Similarly, when the content is powerful, we have seen filmmakers down play either Music or screenplay or something that reminds us that we are watching a movie. Udaan is one of those rare movies which keeps you glued even when you already guessed the  ...MORE","label":0},{"review":"The credibility of a film maker mostly depends on how the story is transformed on the big canvas, captivating the audience. \n\n  Traditionally, when the story is simple our directors sugarcoat it with scenic backdrops and spice it up with melodrama. Similarly, when the content is powerful, we have seen filmmakers down play either Music or screenplay or something that reminds us that we are watching a movie. Udaan is one of those rare movies which keeps you glued even when you already guessed the end of the movie in the first 30 minutes. \n\nThat's Captivating ! \nProbably, the first film set in jamshedpur, this film is not about any social message on child abuse. This film is more about how to explore creative freedom, break barriers and explore freedom. Great direction, great acting and fantastic music too. Must watch...\n\nInshort, It is a visual poem about poems :)","label":0},{"review":"Get out of the nutshell even if it's been created by your parents itself. live your life to the fullest. Ram Kapoor and rohan character played actor did wonderful. The climax made me \"think\". Bollywood has the potential to do such films amazed me. Vikramaditya directorial is awesome. Anurag Kashyag is a morale booster. Super movie please please watch. I'm regretting that I was very late to watch since the day I downloaded it.","label":0},{"review":"I waited and waited till the end to find what inspired the protagonist to break away from an abusive father and become a writer. Finally it turned out to that the abuse itself was the inspiration. There is no message in this movie other than not to tolerate parental abuse. At best it will motivate kids to run away from abusive parents \nThat said, the performances of  the characters are outstanding.Ronit Roy simply rocks as the abusive single father.The movie is worth a dekho, nothing more","label":0},{"review":"It was an outstanding movie and very emotional movie. I always crie in last scene  when those two children leaving their house but that is good decision if those kinds of father not treating their children as an human being if that father is always treating like their children as animal it's better to leave house. But in india this kinds of problem are still happening . Child labour is crime in law. Actors acting were mindblowing storyline direction was very good.","label":0},{"review":"A Phenomenal Movie. Casting, Screenplay, Acting, Music Is Top Class. Storyline Of The Movie Is Also Immersive. This movie Tells You To Think Out Of The Box And Achieve Your Dreams. As One Of It's Song Lyrics Is As Follow - \" WO DIL KI KARE NA DARE\" Means Listen To Your Heart And Don't Be Afraid Of Anything.","label":0},{"review":"There is no motivation to the protagonist in the movie at all. There is nothing in this movie to be rated high except for the acting which is very good. At least it can be directed as if father realizes his mistakes and send his son to pursue his passion to become a writer. The story can be written better than this.\nAudience will only think about the parental abuse but not about the interests of the children. Movie highlights more on abuse which is not a good motivation to viewers of below teena ...MORE","label":0},{"review":"There is no motivation to the protagonist in the movie at all. There is nothing in this movie to be rated high except for the acting which is very good. At least it can be directed as if father realizes his mistakes and send his son to pursue his passion to become a writer. The story can be written better than this.\nAudience will only think about the parental abuse but not about the interests of the children. Movie highlights more on abuse which is not a good motivation to viewers of below teenage.","label":0},{"review":"It is 1 of the best Bollywood films I have seen,,, based on a teenage boy who fight for his dreams with his father...\nWithout any emotional drama (like Bollywood usually have) \nI'm also sad because it didn't earn much in box office... \nWe people must support the real talent in our country Rathee than those filmy faces.","label":0},{"review":"Think it's a Great movie. Nothing like the sterieotypical Bollywood movie. Rajat & Ronit both did a wonderful job. The picture quality is so natural. Hope that Bollywood can actually do better","label":0},{"review":"I liked the acting of Ronit Roy rather than other actors. The film shows the character of Rohan so helpless. Concept is good but the story is the same old bollywood stereotype. The movie could be better if the leaving home of Rohan should be included in the movie earlier rather than at the climax. One time movie for me.","label":0},{"review":"Suggested by a friend, I was hesitant to watch this at. First. I don't watch much Bollywood, but,  this movie is a jewel. The direction is spotless, the music is soothing and the story is inspiring. It breaks my heart that this movie was a box office flop.","label":0},{"review":"i have watched it more than ten times and story has touched me from inside. Most guys in their adolescence will relate to it. Every thing about this movie is simply amazing.","label":0},{"review":"It was an amazing experience to watch the movie till the very ending...\nThe acting from all the characters was awesome and so was the poem. The way the main character recites the poem is great.","label":0},{"review":"This is one of the best movie of the Bollywood ever and for the serious kind of niche audience. \nNot to be missed at all. All kudos for this ultimate experience.","label":0},{"review":"I just read about it on Wikipedia, and I found that sadly, it was declared a box office flop. How the jeez? Movies like Judwa 2 and Tiger Zinda hain are hits, and masterpieces like Udaan and Akaash Vani are flops?","label":0},{"review":"Finally,\"PARENTAL ABUSE\"Is Being Talked About.I Find 90s Bollywoodish Family-Movies Stupid.No Family Is Ideal.Bt Guess What,\"CULTURE\"Ruled Those Times.Bt This Movie Is Really Refreshing In Family-Film Category.It's So Soothing To Hv Real Infotainment😊☺️","label":0},{"review":"\"Your life has value as well as your choices, so have the courage to fight for it and break free when the world shackles you down.\" This movie is worth your time!","label":0},{"review":"Who are the most important characters in the film?\nWhat is the story about ?\nWhat group of a people you think would like this movie?\nDid you like this movie why or why not ? \nAll movies teaching lessons what did you learn from this one?\nWho are the important characters in the film?\nwould you change the ending of the movie and what it would be if yes then elaborate?","label":0},{"review":"Great movie...Hats to director vikramaditya motwani .. Awesome direction..Stellar powerhouse performances by Rajat & ronit roy ...Proud to have such a talented actor &  director..","label":0},{"review":"I pity my fate for not watching this movie for seven years after release. Such a gem movie bollywood has given. Audience should appreciate such great movie","label":0},{"review":"A must-watch movie. This movie ends with a great message and a gives a chance to imagine what happens next. Really enjoyed every moment of the film","label":0},{"review":"It is an awesome movie with Good performances but I loved most is the poem, it describes the emotions so well.  Hard to see such movies in Bollywood.","label":0},{"review":"Being a Jamshedpur citizen this film holds a special place in my heart.Awesome movie and wonderful acting by Ram Kapoor and specially Ronit Roy.😍😍","label":0},{"review":"It's my fav movie..it gives u strength to break those shackles of expectations n take Udaan for ur dreams.. absolute Masterpiece!","label":0},{"review":"I hate this show.I dont know why is it stretching a lot.I am waiting for this show to end as my sister loves a lot but this show is wasting time.Also it does not allow another shows especially recent shows to get another time eg Shani","label":0},{"review":"A very interesting and new kind of movie about reality. Every actor has done his job Very well.","label":0}]