[{"review":"A very nice period film with excellent music. Rekha looks convincing and others have also acted well. Muzaffar Ali comes out as a competent director. After seeing the film on its primier show, I offered Muzaffar a feature film based on the history of cane cooperative movement in UP. He accepted the offer which was produced by a PSU Of Cane department UP. The film AAGMAN had my story, Faiz Ahmed Faiz wrote the lyrics and Ustad Ghulam Mustafa Khan provided the music","label":0},{"review":"Gem of Hindi cinema. Ultimate creation of Muzzafar Ali Saheb. Fantastic picturization  of lucknow during 1840s.  Composition of Khayyam Saheb along with lyrics of shehayar makes this movie unforgettable.....we are very fortunate that we are having such kind of film in our bollywood bucket.\n\nMany salutes to such creators of Indian cinema.","label":0},{"review":"One of the finest,poignant,romantic films ever made. The performance of the beautiful Rekha is beyond any superlatives. The story telling, music and dance sequences,lyrics and Hindustani classical based tunes and above all the rendition by Asha Bhonsle , makes it an unforgetable experience.","label":0},{"review":"It's an awesome movie ... Rekha's acting was superb ... Luved it ... The dressing and the jewellery was so good and suites to the characters... Songs are very nice..","label":0},{"review":"Totally perfect picture. Great performance by all actors. Great Asha Bhosle, great khayyam. Excellent even after three decades. No comparables.","label":0},{"review":"One of the rare classics of Indian cinema. Beautifully directed film with outstanding music, poetry, dialogues,costumes, sets, lighting, cinematography and acting performances.","label":0},{"review":"I think about that poor lady who was staying with her family happily......but due to some revenges her life become complicated and miserable........movie is beautifully directed and produced with the help of a gem.....our loving gorgeous and sweet Rekha ji","label":0},{"review":"One of the finest hindi movies with exemplary talent in direction, store telling, music and cinematography. There will be never another umrao jaan for sure","label":0},{"review":"Evergreen movie of all time and mnd blowing songs lyrics and musical melody.the contribution to the movie by each and everyone is remarkable.","label":0},{"review":"It's a wonderful Creation. Story, direction, great acting and melodious songs. Its a milestone.","label":0},{"review":"Extraordinary performance. Outstanding meaningful songs & expressions by Rekha Ji is unparalleled.","label":0},{"review":"One of the best film I have ever seen \nRekha at her best tremendous acting never forgetable","label":0},{"review":"Excellent movie. All songs nicely composed by Khaiyaam and sung by Ashaji","label":0},{"review":"Great movie..  Rekha.. Khayyam and direction all of were best\n Loved it","label":0},{"review":"Enjoyed the classic . God Bless the makers and full team !","label":0},{"review":"Amazing movie.touch the heart.very nice.and fantastic roal of rekha mam.","label":0},{"review":"To be seen slowly repeatedly by understanding the word as well meaninngs and theem in particular situations\nTHIS FILM EXPLAINS STORY OF DANCER TAVAYAF I THINK","label":0},{"review":"Umrao jan is such a film which can not be compared with others. \nI think, everybody should  watch such movie","label":0},{"review":"Very nice movie role of the actors are very heart touching","label":0},{"review":"One of the finest picture that Bollywood have has ever produced","label":0},{"review":"I think this movie is super  this song and music is heart tuch","label":0},{"review":"Superb every one should watch this film onetime in life","label":0},{"review":"Heart conquir this movie.never forget it.a wonderful classic ever.","label":0},{"review":"A classic in its genre. Loved it","label":0},{"review":"Rare gem and all time classic must watch movie","label":0}]