[{"review":"The actors did a good job with the script but there should have been a better storyline. Julia's fiance has so many similarities with my ex, and crazy Tessa has my ex husband's personality. My dil believes his b.s. stories from his prison cell. Even though this movie could have been a little better, it definitely brings the reality of domestic violence to the forefront.","label":0},{"review":"I never review movies but... this one was particularly frustrating and felt disrespectful towards women. Great actresses who I think did the best they could with these bizarre roles. The whole time I just kept thinking the fiancé was a jerk, their relationship made me cringe!","label":0},{"review":"\"You're not on Facebook or Twitter; you basically don't exist.\"\n\nSo...\"Unforgettable\"\n\nI can easily make a joke about this, but you already did. It's a fact.\n\nOh and I can't believe the 'Lifetime Channel Cinematic Universe' actually exist now. This is cinema.","label":0},{"review":"I hope it was worth it for Katherine Heigl to play this role.  I now dislike her and you couldn't pay me to see another movie she is featured in.  Sometimes it behooves an actor/actress to say no to a role.","label":0},{"review":"As close to reality as this movie is, it's not very life-like. The way the film ends suggests that there is going to be a sequel. Come on, it's not worth it, make a different film.","label":0},{"review":"I liked the movie, kept my attention throughout. Scary because this is another example of human nature,\nAnd a woman scorned.","label":0},{"review":"Love this movie and setting! Amazing acting and music is on point! 👌","label":0},{"review":"I love unforgettable it’s show you about a woman who have obsession since a teenager never got  therapy when she became a woman her obsession got worst and worst","label":0},{"review":"I ironically and truthfully forgot all about \"Unforgettable\" less than a week after viewing it.","label":0},{"review":"Why didnt she called the police from her mobile??????? Thats all i wanna say","label":0},{"review":"I loved it!!-hehe.","label":0},{"review":"the movie is better than the tv show","label":0},{"review":"Its alright","label":0}]