[{"review":"Meih ishq uska woh aashiqui hai meri woh ladki nahi zindagi hai meri...\nTeri kurti sexy lagti re.. \nRumi jaffery had written this movie. \nIts a love triangle movie. \nZaheed Khan loves ameesha but due to some circumstances she marries Arjun but still she meets Zaheed after her marriage also and one day Arjun looses his eyes and goes to foreign for his eyes surgery and when he comes back he seems ameesha with Zaheed Khan and pretends to be blind. \nHere ameesha comes to know that her husband had ca ...MORE","label":0},{"review":"Meih ishq uska woh aashiqui hai meri woh ladki nahi zindagi hai meri...\nTeri kurti sexy lagti re.. \nRumi jaffery had written this movie. \nIts a love triangle movie. \nZaheed Khan loves ameesha but due to some circumstances she marries Arjun but still she meets Zaheed after her marriage also and one day Arjun looses his eyes and goes to foreign for his eyes surgery and when he comes back he seems ameesha with Zaheed Khan and pretends to be blind. \nHere ameesha comes to know that her husband had came to know about her and Zaheed Khan relationship so she commits suicide so Arjun rampal plans to con Zaheed Khan for murder  of his wife though it was a suicide..\n18/06 /19","label":0},{"review":"A good movie. All actors performed professionally.  Arjun Rampal is too good in his character and he is very goodlooking too! But   Amisha Patel doesn't look that beautiful as she looks in her other movies.  Storyline is quite good. Most of the songs are nice but I didn't like the female voice in the song 'Teri kurti saxy'.","label":0},{"review":"A must watching movie....what a story...!!!Very strong content with beautifull songs....I really dont know why IMDB gives low rating to this movie....It is a 9.2/4 movie in my view....All actors are very good with their role mainly zayed khan with his role obessive lover....Afterall  main insq uska woh zindagi hain meri♥️","label":0},{"review":"I can't believe this movie was a flop at box office this movie should be a mega hit ,such an amazing story with good performances especially Zayed khan playing a grey character Karan \nThis movie has so many twists...I recommend it to everyone to watch it","label":0},{"review":"Very nice movie and strong storyline even if people say it's copy then I also I don't care because performance of all stars where outstanding especially Zaheed khan and the movie was beautifully edited .\n\nI recommed everybody to watch this movie...","label":0},{"review":"This was such a great movie. I love it.\nVery emotional and loving movie.","label":0},{"review":"This is really awesome movie\nAnd songs are really very good\nMain isaq uska \nVaada hai ye \n\nBest movie 😀","label":0},{"review":"This movei is awesome.  Arjun rampal performance is really really good","label":0},{"review":"This was my favourite movie for so long for its song story is also good.","label":0},{"review":"I can tell you thate this movie and songs are awesome.","label":0},{"review":"This movie great I'm impress on amisha patel","label":0},{"review":"This movie is awesome. Well perfomed by Arjun Rampal..","label":0},{"review":"Nice movie.This movie emotionally touch my heart....","label":0},{"review":"I like this movie songs and Zayed Khan acting like Obsessive lover.  I like this movie.","label":0},{"review":"I love this song very much.","label":0},{"review":"I love you vaada movies","label":0},{"review":"Best movie","label":0},{"review":"Best movie","label":0},{"review":"Love movie","label":0},{"review":"wo ladki nhi zindagi hai meri that's words touch my heart","label":0},{"review":"Songs r good...overall film good","label":0},{"review":"Good movie","label":0},{"review":"I love you so much....","label":0},{"review":"I like songs this mo.","label":0},{"review":"this movie is west","label":0}]