[{"review":"I like this movie very much. The music is good, and the biggest reason l like this movie is because l love history and historical movies and video games are my hobby. The songs are heart touching.It is one of my favorite movies.","label":0},{"review":"Bad film, not a good story, actiling is poor, screenplay, dialogue also not good. The filmmaker isn't researched properly before making this film you will feel when you watch this film, the film makers are telling story before India's Indipedence era but the costumes doesn't look alike what actually people weare at that time, this film is very poorly written, directed.","label":0},{"review":"One off the best movie which i have seen in the world but in the end of movie salman khan as veer dies , so there is no logic at the end of story otherwise it was fantastic movie","label":0},{"review":"Best movie I’ve watched lovely music and beautiful story line accept ending when veer does otherthan that I give 11/10😊","label":0},{"review":"Awesome movie. Unusual story.Mindblowing acting by Salman Bhai and Mithun Daa.Great actors.","label":0},{"review":"Tha best record irecting because of which the movie could not do well otherwise Salman Khan was good and the best thing in the movie is the amazing music","label":0},{"review":"Worst movie, absolutely rape of history,pindaris were Muslim plundres and looters ,film has depicted them as rajpoots which is absolutely breaching of history, worst acting","label":0},{"review":"Underrated, tried something new at that time. Decent movie. Songs are good","label":0},{"review":"The movie was good but it was just poor directing because of which the movie could not do well otherwise Salman Khan was good and the best thing in the movie is the amazing music","label":0},{"review":"Best movie ever seen. songs are Awesome.","label":0},{"review":"Best movie as Salman is there and also zareen played a important and excellent role","label":0},{"review":"I like this movie bcz tha content is very good 👍☺️😍","label":0},{"review":"This is best movei in the word and my fevorite movei ...i liie, t","label":0},{"review":"In my opinion it is most powerful move-in the world","label":0},{"review":"I want to watch veer movie but not foun your website how to i get your web","label":0},{"review":"Very nice movie.. megastar Salman Khan as a veer Jai Hind Jai Bharat India 🇮🇳","label":0},{"review":"This movie is the best and superb","label":0},{"review":"Very very nice movie ND best story 😍","label":0},{"review":"Cringy (bruh), unsophiscated (bruh), didn't features TentacionXXX because i heard was people crying over ritardandoed Markiplier instead (bruh), etc.","label":0},{"review":"best movie ever i have seen","label":0},{"review":"Nice film i like this story","label":0},{"review":"I like this movie veer and my fevaret movie","label":0},{"review":"It was the worst film I have ever seen","label":0},{"review":"Amazing movie.....nothing better then this movie","label":0},{"review":"This is very good movie","label":0}]