[{"review":"A boy in his 20s taken unseriously to become a man with a positive influence of his new roommate. If you are stuck in your life, especially as a college student, this might be the movie for you. \n\nNot the best in terms of Ranbir's thought provoking choice of stories but it does make one wonder about where they are in their life. I think it was an average movie of the time(2009). Believable, up to date and fun.\n\nPS: Konkona had a powerful aura as an independent goal driven woman.","label":0},{"review":"This is movie is just great !!! It makes you realise what actually you are doing in life . Is life all about lust and ambition ?  This movie stand apart from basic bollywood love story plots and touches the chords of emotions one feels in real life . You will at some point or will relate yourself to the protagonist.  It will make you a bit more optimistic and happy . Do watch it . \nIts a 8 / 10","label":0},{"review":"This is the only movie I've watched multiple times without getting bored. The most amazing movie ever. I can't define the beauty of the movie ... amazing story , sensible and realistic narrative , awesome simple realistic acting ,  Nariman point, mumbai rains, sea ... wow the list goes on and on. To add to this are the  beautiful  songs.... my heart beats fast when I see this movie every time.","label":0},{"review":"The most amazing movie !!! .I watch this movie before every exam as it reminds me that life is not only about studies and work ,its about the small experiences -with your friends,family etc .The songs were amazing ,actually everything was. Ranbir's best film .The movie also shows that there is always time to change your attitude towards life.\n\n5/5","label":0},{"review":"I love this movie  😍 a lot. It's lot of fun and also gives an idea of doing what you really like in life which makes you happy. Loved Ranbir in this film.He's such a free spirit and Konkona is so lovely and her character in this film tells you how it's important to be independent.Loved the duo Ranbir-Konkona.","label":0},{"review":"One of the best coming of age movies in bollywood. Konkona Sen Sharma is at her very best as usual with her subtle acting skills and Ranbir too pulls of a brilliant performance. Soulful songs and awesome dialogues make this movie even better.A must watch for sure","label":0},{"review":"Such a colorful bright movie that I have ever seen. I loved this movie because of the so many lights, home decor, natural veiw and off course the value of love. I love to see it again & again. Wish I could ever stay that room where they redecorated in a yellow color <3","label":0},{"review":"This movie has change my life first I am also like Sid enjoy with friends no goals but after watching this I set my life goals.\nYou can learn lots of things from this movie like your goals, friendship relations, respect your parents etc.\nR.K. (Ranbir Kapoor) & Koko (Konkana Sen Sharma) chemistry was excellent.\n10/10","label":0},{"review":"Very motivational movie.. Ranbir is so charming in this film and konkana is too good with her expressions . The movie is relatable to everyone's life. We should just be happy with whatever we do.","label":0},{"review":"I think Wake up Sid is the best film of Ranbeer Kapoor, and Kankana is just amazing... Her stunning look, Innocence of Ranbeer, and the nature of Mumbai city , specially the seasonal variation makes this film great !! And, it is the best film of Ayan Mukherjee till now also.","label":0},{"review":"This movie is a must watch. You'll learn something from it. Maybe you'll look at life from a different perspective after watching it. The actors have done justice to their roles and they all have given brilliant performances. It will make you emotional at times. This movie really spoke to me.","label":0},{"review":"Box office collections are not the true indicators of a film's richness. This film proves that. It touches the deepest emotions of your heart. Each and every bit of the film is breathtaking. Go for it if you haven't watched a good film in a while. 👍","label":0},{"review":"Such a beautiful and fresh movie to watch. It gives you inspiration to take a moment from fast moving life and think about yourself. Such fine actors both Ranbir and Konkana are. Loved it.","label":0},{"review":"One of the best movies  based for youth.... amazing performances by Ranbir Kapoor and Konkana Sen Sharma movie was a little ahead of it's time.... superb direction.... A great concept.... A must Watch for today's generation...","label":0},{"review":"I watched this today on Netflix. The next thing I did was spring clean my messy room and braid my unkept long hair. The movie is sure to remind you of many people in your life, especially those from your college. Personally, the relatability factor for this movie was 9.26/10.","label":0},{"review":"I was in 8th standard when this movie was released... Beautiful music... A timeless classic...Well writing this review after 10 years being a 22 year old, I don't even remember how many times I have watched it. It just makes me happy. ❤️","label":0},{"review":"Why do I feel like such a loner after watching this movie? XD\nIt was hands down a beautiful movie with a gorgeous cast and amazing story line.\nSlightly philosophical but real and raw.\nDefinitely deserves a watch.","label":0},{"review":"If you are not looking for the same old romance...\nAs a woman if you want to be independent....\nIf you like photography...\nIf you like to live on your own...\nIf you searching for a diff female voice...iktara song is great\n\nAnd most importantly if you are in college or just finished ur college..\n\nThen watch this movie.....","label":0},{"review":"One of the most lovable things about this movie is that,you find it relatable at some point or the other, that's where it strikes the right chord of the audiences' hearts.Lastly always loved you RK and will continue to love you.","label":0},{"review":"This film is awesome. Do not really watch Bollywood films, but this is a  great film for any college students wondering what they want to do in life. R Kapoor's acting is great in this film","label":0},{"review":"My all time favourite movie...you can relate it to your life..if you are a student this movie is a must watch and if you have completed that student phase of your life then also it's a must watch..this movie is like real life memories which we can cherish throughout our life.....","label":0},{"review":"The more i watch, the more i love it. absolute perfection in creating this movie. It gives hope that study is not everything in life, it's just a part of life.","label":0},{"review":"Story of a boy who becomes a man. \nAmazing storyline and concept. Loved the movie. More importantly conveys that work hard and play hard. Ranbir Kapoor nailed his role.","label":0},{"review":"This movie shows the importance  of career and responsibility in life. I am a student so this movie helps me to clear my thoughts. A Must watch movie for everyone.","label":0},{"review":"One of the best movies I have ever seen. Along with the importance of love, friendship, etc.. it teaches how to enjoy life to the fullest.","label":0}]