[{"review":"This movie is undoubtedly the most entertaining movie of 2009. A film that changed Salman's career forever\n\nHats off to Salman Khan. He definitely looks like a ferocious lion. The pace of the movie is the important thing to notice about. It will make you to watch the movie for more times.\n\nThis movie is definitely meant for the masses with cool dialogs. Style of the movie is excellent.\n\nLast 30 minutes of the movie will make you go wild.\n\nSalman khan excels in this role.\n\nApart from him, look ou ...MORE","label":0},{"review":"This movie is undoubtedly the most entertaining movie of 2009. A film that changed Salman's career forever\n\nHats off to Salman Khan. He definitely looks like a ferocious lion. The pace of the movie is the important thing to notice about. It will make you to watch the movie for more times.\n\nThis movie is definitely meant for the masses with cool dialogs. Style of the movie is excellent.\n\nLast 30 minutes of the movie will make you go wild.\n\nSalman khan excels in this role.\n\nApart from him, look out for Prakash Raj. He has done 200% justice to the villain's role.","label":0},{"review":"Salman Khan is unstoppable !! Best action movie ever made in Bollywood !! Salman Khan is my most favorite actor. I became his greatest fan after watching wanted. Salman Khan rocks !! Wanted is the best thing an action movie lover could get. It's an unbelievably outstanding movie made by prabhudheva. The climax was boiling hot !! It's a volcanic erruption !! Shirtless Salman Khan was DOPE !! Watch this movie or just DIE...","label":0},{"review":"For me this is like amazing Salman sir the greatest Bollywood actor...the way he does his acting with his other co-star brings water into one's mouth ...if I were to say about this film then this movie shows about the reality about what's happening in underworld..of India... Salman sir u r the greatest...u r incomparable...","label":0},{"review":"Its a great movie ilike it very much .and also salman sir is my favourit actor from childhood .story of film is about real world not reel world.and its comedy also .salman sirs entry is fabulous .my favourite movie all the time .","label":0},{"review":"It is the best movie to spend your weekend or any holiday it is well directed comparing to telugu version and vijay has done really well so finally I would say it's a good entertainment on weekend","label":0},{"review":"i did watch this movie in  ashok nagar chennai, udhayam complex. \n\nAsin portrayal was ugly. \n\nVadivelu scores well .\n\nVijay's Action and dance are outstanding \n\nNapoleon's Scope should be extended \n\nPlease don't copy Paste Telugu Pokkiri . \n\nI shall rate \n\n******\n3.5/5\n******","label":0},{"review":"Hi busy day today with the girls you know what I can see you in my room for me too baby girl is a good day at work now but it out W Bush administration and the Two Strings and I have a good time to go","label":0},{"review":"it is a nice movie to spend our vacation. every one acted well in the movie. no words to say about thalapathy in this movie. vadivelu acting was superb.","label":0},{"review":"Though I'm a Shahrukh fan but Salman just nailed in this movie...each actor was mind-blowing...inder,prakash vinod khanna, Aisha takiya...all...what a story nd what an action but the fighting scene is bit exaggerated but all total wanted is an awesome movie","label":0},{"review":"Much needed hit for Salman Khan back in that era. Proved to be a turnaround in his career.\nGood acting. Good entertainment. \nRating: 3/5.","label":0},{"review":"Salman Khan Bhaijaan is a nice looking and good person.... I like to watch his movies.... Not only action all types of movies that Salman Bhai has done.... Stay Blessed.","label":0},{"review":"This is the Film directed by Sri Prabhu Deva and starring Vijai Asin etc. My likes of Vijai :s action Movie the first one I started liking action m0vies. My one of the Fav. MivieS!","label":0},{"review":"Prabhu Deva won the Heart.. \nFabulous Direction and presentation.. \n\nUsed Salman Khan in better way.... \nSongs.. Dialogue.... Story... \nEverything was good.. \n\n\nSalaam to you... 👍","label":0},{"review":"Telugu one by Mahesh babu is the best... 50% of that is Vijay's tamil pokkiri. Hindi 'Wanted' by Salman Khan is the worst of all","label":0},{"review":"The movie was not good. Nobody acted good in the movie. Only the fight scenes and Vadivelu's Comedy was good in the movie. Songs and BGM were good in the movie.","label":0},{"review":"Blockbuster thriller, strong acting I liked this film very much,  🙏💕thanks salman sir and prabhu deva sir for making this film","label":0},{"review":"i did not like this movie \ndon't waste the time friends for watching this movie it was one of the worst remaked movie of pokkiri in tamil starred by actor vijay","label":0},{"review":"The movie about an brave, tactful, honest, positive & funny undercover IPS officer. Positive movie for IPS Aspirant.","label":0},{"review":"An excellent action film with a lot of whisle-worthy lines mouthed by Salman Khan. Brilliant!!!","label":0},{"review":"It is a good entertainer with good acting ,songs and dance sequences. That is what I like in a movie !!","label":0},{"review":"I loveeee this movie❤❤..the action is at next level... Vijay sir is my favourite💓","label":0},{"review":"It is a great full one man army.I see the movie 10 times and Salman Khan is acting so so great.","label":0},{"review":"Thalapathi's natural act is always wonderful. Love to see his movies.","label":0},{"review":"This is one of the best movie with a great combination of action, comedy and thrill.","label":0},{"review":"very boring movie....dont try to watch.......unnecessary moka fighting scens.....moka dialogues and over acting of vijay.....only vadivelu comedy is good...he is the hero of this mokka movie","label":0}]