[{"review":"Waqt the race against time.... and finally the race wins.... a kind of race being run in almost each and every family.... the film portrays father-son relationship in such a manner and so vividly that one is bound to sit on the seat and watch the movie till the end.... the only two human beings who are proud on your success and feels happy - Father and Mother... none other...Kudos to the director and the whole team... a must watch....","label":0},{"review":"This movie shows that every single parent loves their children. Sometimes they take hushed decision for us but it will help us in future. Amitabh sir acting was makes me cry every single time I watch this movie. Really super duper movie. I love this movie.","label":0},{"review":"Very good film. I liked akshay's acting\nAnd priyanka chopra is superb in this one. My favourite song in this film is do me a favour let's play holi","label":0},{"review":"Every child should watch this movie... I loved it... Now I hv understood my responsibilities nd now I respect my parents more than before..","label":0},{"review":"Acted and directed so well that fascinates ones mind to love your family. Loved it.","label":0},{"review":"Best movie depicting the relationship of a father and  a son. I cried after watching it.","label":0},{"review":"Incredibly perfect.....after watching this movie if u don't cry then consult an eye specialist","label":0},{"review":"Lakshman comedy scenes are awesome and this is completely family entertainer movie very good movie","label":0},{"review":"The movie teach us a lot\nSuperb acting by the actors and actresses.","label":0},{"review":"Excellent movie with a lot of emotions involved between parents and child.","label":0},{"review":"Very nice movie.\nThere are several meaning in this movie to learn.","label":0},{"review":"A father is always be good friend like Amit sir, this script change my interior views ..","label":0},{"review":"Akshay kumar is my favourite actor because of his action ,comedy .","label":0},{"review":"Awesome Movie Akshay kumar fantástic actor","label":0},{"review":"this film is the best film","label":0},{"review":"Watching live UTV Movies\nNice","label":0},{"review":"Great movie.. full with emotion 😊","label":0},{"review":"Very good movie","label":0},{"review":"Awesome movie.","label":0},{"review":"Nice movies","label":0},{"review":"Very nice movie","label":0},{"review":"Very nice movie","label":0},{"review":"Waqt is nice movie","label":0},{"review":"Very good👍","label":0},{"review":"This should be banned","label":0}]