[{"review":"Beautifully throws light on some major issues in our country without making it monotonous to watch. Perfect combination of funny and practicality based social message giving movie.  Moreover the acting is wonderful. The characters portrayed are really convincing. Overall this movie should be watched atleast once in a life time.","label":0},{"review":"Brilliant acting by all characters. One of the best village based movies. Well researched and feels so real.","label":0},{"review":"One of the best movies i have ever experienced.... Movie doesnot let you go away from itself for a single moment","label":0},{"review":"Excellent  movie  which  shows  the India  culture  and civilization of village .it's very risky  to make such  movies  now  a days.","label":0},{"review":"Very rare movie based on real fact of Sajjanpur at Satna district, Madhya Pradesh.\nI have visited this village on the way to Rewa from Satna, Madhya Pradesh and spent sometime to get the real feel of the movie","label":0},{"review":"It is lovely   esp the song   Sita Ram Sita Ram  which is high octane   & Munni ka turn   --   hilarious madcap","label":0},{"review":"My all time favorite director ....great job this  film link of suraj ka sastaan ghodha","label":0},{"review":"Very beautiful movie. Very realistic and well written.","label":0},{"review":"Excellent cinematography\n\nTell public about the backwardness of rural ares","label":0},{"review":"Very good acting all actors but shreyas Sir always wonderful","label":0},{"review":"One of the best Bollywood movie I ever seen","label":0},{"review":"Great movie with satire on the system and society.","label":0},{"review":"Awesome comedy  movie to see with family","label":0},{"review":"Beautiful.. Superb direction","label":0},{"review":"Good movie with lots of humour  !","label":0},{"review":"Very nice movie by Shyam Benegal sir","label":0},{"review":"BEST MOVIE   MUST WATCH","label":0},{"review":"Best movie","label":0},{"review":"Great & beautiful cinema","label":0},{"review":"Superb movie..must watch","label":0},{"review":"Nice movie","label":0},{"review":"Nice movie","label":0},{"review":"Such a nice movie","label":0},{"review":"top the movi my village sajjanpur","label":0},{"review":"super movie","label":0}]