[{"review":"I think this movie is underrated. Harman and Priyanka were absolutely great in terms of acting. Priyanka did very good in her each character. Storyline was great and intriguing. They kept suspense very well till the end. Of course screen time is very long and songs in every 15 min interval may irritate sometimes but overall it is a great movie to watch. Fresh script, nice portrayal of characters.... it's a treat to watch. Do not miss this movie.","label":0},{"review":"One of the most underrated Bollywood Romcoms!It is the modern day musical,anthology movie,romcom all rolled in one.Priyanka Chopra gave superb performance(s) and should have won awards for this.Harman baweja was also good.The music was superb throughout.Do watch it if you can..","label":0},{"review":"I think this is the best movie I have ever seen.  Contains all the emotions. Great acting by Harman Baweja and the pretty Priyanka Chopra.\nLoved the movie.\nQuite an entertainer.","label":0},{"review":"people need to appreciate the hard work and dedication of the moviemakers of this movie. thank god for this movie's existence, I really love the performance of Harman and Priyanka.. also all songs are so beautifully written and composed.","label":0},{"review":"I loved the movie . It is one of the underrated movies of Bollywood . I loved Herman baweja's acting . If the boy was like him I would get married 😂. Priyanka Chopra is the best 💕.","label":0},{"review":"Hate to admit it but kinda liked it a bit. The film is an experiment and has its flaws but overall it was quite underrated.","label":0},{"review":"why people judge a movie so quickly..\nits one of the best movie of PC & Harman..i just loved it..","label":0},{"review":"Block buster I just love it best romantic comedy movie I am a very big fan of harman baweja ihave seen all his movies I have  talked with him 😊😊😊😊😊😊😊😊😊😊😊😊🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗","label":0},{"review":"Superb Movie \nPriyanka Chopra did fantastic acting in this movie in every character","label":0},{"review":"This movie is really good spacial Harman baweja","label":0},{"review":"Love its song what's your rashee","label":0},{"review":"I watched it when I was in school and I believe that it was a way to forward for the Indian audience.","label":0},{"review":"Good Movie and Songs also.","label":0},{"review":"I love this film very much..","label":0},{"review":"Songs is very good","label":0},{"review":"Superb NYC entertaining","label":0},{"review":"really a nice movie","label":0},{"review":"nice movie","label":0},{"review":"bad movie lol","label":0},{"review":"this is a bad movie!!!!!!!!!!!!!!!","label":0}]