[{"review":"I am or I should say I was not a fan of Kangana Ranaut but this film has changed that thought. \n\nShiney Ahuja, great actor. \n\nThis film is so good that I am really unable to describe. \nThis film is a great tribute to Late. Parveen Babi in the most beautiful way possible. This film has all the elements that make it perfect :\nGreat script\nGreat actors who have beautifully justified their roles\nGreat music \n\nThis film is destined to be perfect because it came right from the heart, each and every pi ...MORE","label":0},{"review":"I am or I should say I was not a fan of Kangana Ranaut but this film has changed that thought. \n\nShiney Ahuja, great actor. \n\nThis film is so good that I am really unable to describe. \nThis film is a great tribute to Late. Parveen Babi in the most beautiful way possible. This film has all the elements that make it perfect :\nGreat script\nGreat actors who have beautifully justified their roles\nGreat music \n\nThis film is destined to be perfect because it came right from the heart, each and every piece falls into the right slot and connects. Mohit Suri has done exceptional job.\n\n#Underrated","label":0},{"review":"One of the most underrated Bollywood romantic movie i have ever seen, this movie will make you fall in love with the character 'aditya', both the lead actors have done there job extremely well, the feeling of pain in the eyes of aditya for sana is the thing that makes me very emotional every time,at the climax this movie will definitely make you feel the emotion of aditya's character,this movie will definitely show you how to love a person at any situation at any cost. \n\nI will definitely recomm ...MORE","label":0},{"review":"One of the most underrated Bollywood romantic movie i have ever seen, this movie will make you fall in love with the character 'aditya', both the lead actors have done there job extremely well, the feeling of pain in the eyes of aditya for sana is the thing that makes me very emotional every time,at the climax this movie will definitely make you feel the emotion of aditya's character,this movie will definitely show you how to love a person at any situation at any cost. \n\nI will definitely recommend you this movie for its great direction, screenplay, acting & its great songs.","label":0},{"review":"One of the best movies ever seen....  Kangana Ranaut played a very great role in this movie... This is actually biography of famous actress of 70s and 80s Parveen Babi... Great work...","label":0},{"review":"My best movie and really my favorite 💕 ❤️ song sad 😭 song jab b sad hoti tho I listened to that song tu Jo nhyi hai tho kuch b nhyi hai","label":0},{"review":"Nice movie. Very beautiful.. soulful..loving song'bin tera kya ha jeena' by jadev Ahmed","label":0},{"review":"Wo lamhe that's a great mve it make us understandable that in life we need a right companion to move a life headd. ...","label":0},{"review":"One word more than outstanding and kangana performance beyond thought a wonderful film worth watching.","label":0},{"review":"Very nice story... Aswm movie of mohit suri..","label":0},{"review":"❤True Love❤  There is no  other words to describe movie..","label":0},{"review":"Sweet film. Sometimes we can not help d sickness.","label":0},{"review":"No words. Very touching movie.","label":0},{"review":"Very nice Song my fevrt","label":0},{"review":"se is very cool","label":0},{"review":"fall in love with the music....","label":0},{"review":"Only songs are good. Movie is terrible!!","label":0},{"review":"Nice movie but over act","label":0},{"review":"It's very heating song","label":0},{"review":"Voice of atif👌👌👌","label":0}]