[{"review":"Watch it over & over again when I was a little girl. The soundtracks are gold! The kind of music you can't get these days. The chemistry between the leads was charming. Jackie Shroff did his role really well in so many parts. Subash Ghai could have pulled this off yet there are so many flaws you can't overlook. \n\nThe story. \nWikipedia says it's inspired by Jane Austen's Pride & Prejudice. Say what?\nThere's no link whatsoever except the poor & rich status parts where the rich relatives belittles  ...MORE","label":0},{"review":"Watch it over & over again when I was a little girl. The soundtracks are gold! The kind of music you can't get these days. The chemistry between the leads was charming. Jackie Shroff did his role really well in so many parts. Subash Ghai could have pulled this off yet there are so many flaws you can't overlook. \n\nThe story. \nWikipedia says it's inspired by Jane Austen's Pride & Prejudice. Say what?\nThere's no link whatsoever except the poor & rich status parts where the rich relatives belittles the poor girl's father. \nThe logic. \nThere's a concept of poor & rich in the movie which blows my mind in a wrong way. The rich NRIs are shown as billionaires in abroad having the same fortune as Trump those days. Okay, I'll buy that. But the poor ones. Isha & her family owns a house in India and abroad where they are wearing designer clothings be it Indian traditional dresses or for normal wears. Most of them have jobs or it's better to say they all have qualifications to get a high paid jobs. Somehow we supposed to believe they are poor at abroad. Poor enough for Ronit's family to look down to them even if they all were good old friends.\nThe acting. \nThe actors got too excited and gave an over enthusiastic performance that made the scenes looks & feels fake. From the heroin crying so falsely that I could still feel the shivering of cringeness over me. And to the hero's over zealous acting. He was hot but that's about it. The hero was just an eye candy and he may have tried his best. But he obviously wasn't so good in grasping the right amount of emotions and at the right moment at the early stage of his career. \nAnd the others. It's best not speak about it. I mean you could have hired better actors who could actually act with that amount of budget.\nThe Bollywoodness.\nI swear, it's the same cheezy romantic story tagline that every movie has until to date. Girl meets boy. They fall in love. Then got some high voltage unnecessary drama. And at the ending, somehow it got worse or get solved where they either live happily until the end credits or end up dead. Boring. \nConclusion. I kind of get it why this movie flunked so bad.","label":0},{"review":"hrithik is the best. he is my idol. yes i agree i remember my childhood. you cant get this music again. love u hrtihik","label":0},{"review":"Definitely one of the best movies i have ever seen in my life and will watch it a thousands times cause its such an amazing movie","label":0},{"review":"woww what a nice songs of this movie. i loved it.\n hrithik roshan always the superb.... i remember my childhood when i listen yadaain's songs........\n\n\nmind blowing................................","label":0},{"review":"Yes this is one of the best films saw in childhood, still love to watch it, don't know why it didn't work at box office!","label":0},{"review":"Fabulous, fantastic, lovely, lovable love story, friends story. I love this movie.","label":0},{"review":"I love this movie, and the title song yaadein is so good","label":0},{"review":"Wonderful lyrics and one of the good movie from Hrthik Roshan.","label":0},{"review":"I luv the title song of this movie ,its so meaningful....","label":0},{"review":"just an amazing movie and specially title song ....love it","label":0},{"review":"I love this movie song jab dil mile","label":0},{"review":"Excellent Movie & Better Character Hrithik Roshan","label":0},{"review":"Nice Old Classic Movie, one of its type.\nMust Watch.","label":0},{"review":"Nice movie and all songs","label":0},{"review":"I love this movie a lot... 😍😘","label":0},{"review":"Nice movie 8 out of 10","label":0},{"review":"Best movie i watch","label":0},{"review":"Awesome movie","label":0},{"review":"Amazing song","label":0},{"review":"YAADEIN IS THE BEST MOVIE.","label":0},{"review":"I love this movie","label":0},{"review":"Very nice move roshan bhaai","label":0},{"review":"Very Nice song","label":0},{"review":"Best Movie\n\n.","label":0},{"review":"A good movie","label":0}]