[{"review":"Itz a fantastic film in this film others don't know but for me   everything is perfect like acting romantic scenes emotional and Ec.....I just wanna tell that I love this movie 😍😍😍😍","label":0},{"review":">♀It's really a romantic and fantastic film...about others I don't know but I really loved this film...songs are amazing especially baarish and allah sadiyan👌👌💝💝","label":0},{"review":"Rakul preet his. Happy new year. 24.good very well and that is a good day for the first time in total","label":0},{"review":"I just love this movie. This movie was shot in my school that too in front of me. I am happy it was a successful movie.","label":0},{"review":"it was amazing movie because it's so sad movie that's why, i like this movie and i really like wariya song this song is my love for ever \nsuper hit movie","label":0},{"review":"this is a good movie because it shows the friendship and mother son love i like this movie but i gave 6 out of 10","label":0},{"review":"It was nice,bcs I m from Sikkim in future maybe shouting coming soon other movies also Sikkim is actually piece full States in our country.....","label":0},{"review":"I really love to watch this movie..... cause it's all about college life,friendship,competetion,guard on ones college's honour.....n many more...","label":0},{"review":"Very nice movie and the emotional also but some time very romantic like there is one seen in library that lollypop one...............","label":0},{"review":"It's an amazing film and very nice friendship oriented film. Inspirational film to youth","label":0},{"review":"I saw it on star select gold movie channel. Very nice indeed. Different subject.","label":0},{"review":"best best best! please watch it if you love romance if you love comedy and if you love your India😀❤","label":0},{"review":"I really love to watch this movie, it's really lovely and fantastic, or romantic film .","label":0},{"review":"Such a awesome movie and I loved it so much","label":0},{"review":"Completely illogical movie. I dont know what the creators wanted to show their audience.","label":0},{"review":"Its good for entertainment  but no perticular msg delivered.....!!! Yeah teens can enjoy....","label":0},{"review":"Absolutely no logic in the whole movie, from the start to the ending race. How can anyone watch it?!!","label":0},{"review":"This is a wonderfull movie but y the ratings is 2.7 i dont know","label":0},{"review":"Good Song's only.... Acting and Story not up to the Mark.","label":0},{"review":"I love this movie, nd all the actors nd actress","label":0},{"review":"It's a wonderful movie watching full enjoyed","label":0},{"review":"This movie is nice and songs are osum","label":0},{"review":"Bad acting, cringe , waste of time. DIVYA KHOSLA is worst DIRECTOR ever.","label":0},{"review":"Watching the movie will ruin the concept of romcoms for you.Don't watch it.","label":0},{"review":"The songs of this movie are ossum..😍😘😘","label":0}]