[{"review":"Suddenly it came to my mind that aaj ye movie dekhunga. Its 22 Sep. 2019.\nSo i just watched it. I watched it first time when i was in school and 12th paas kiye 14 saal ho gye, us se bhi pehle dekhi thi.\nI liked this movie at that time very much. Because its funny. Acting was also good. Mahima Chaudhary was one of my favorite. She is beautiful. And the most favorite scene of the movie was that last scene where Sunil shetty indirectly propose mahima to marry him and live all together. I watched it ...MORE","label":0},{"review":"Suddenly it came to my mind that aaj ye movie dekhunga. Its 22 Sep. 2019.\nSo i just watched it. I watched it first time when i was in school and 12th paas kiye 14 saal ho gye, us se bhi pehle dekhi thi.\nI liked this movie at that time very much. Because its funny. Acting was also good. Mahima Chaudhary was one of my favorite. She is beautiful. And the most favorite scene of the movie was that last scene where Sunil shetty indirectly propose mahima to marry him and live all together. I watched it this movie just one time. And second time today. But every scene and dialogue was like saved in my mind. And i was waiting for the last scene. Jab pehli baar movie dekh rha tha to soch rha tha ke ye dono sath sath kyo nahi reh jate. Lad kyo rhe hai. And at last in the end they did it and i was so so so happy. I literally cried that time and i cried even today when i watched it. So beautiful. All is well that ends well.","label":0},{"review":"miss family movies like these,,ohh my dear lord,,,,,,kha gye bollywood wale jo aisi movies bnate the??? beshak in filmo ne jyada kamaya na ho,,pr hum hi jante hein ki inhi movies ke andar lakho memories hein bachpan ki :( and what would i not do to go back again in front of that old tv and watch  all the childhood movies?? including yeh tera ghar ye mera ghar,,,,sunil da u rock!!!","label":0},{"review":"One of the best movie of Sunil Shetty, best performance, I think Khattamitha is duplicate of this movie.  Great Work by Sunil Shetty. We think Sunil Shetty Should back to Bollywood with hollywood type action movie and ofcourse with a strong director. Then there will be no chance to flop the movie. Come Back Soon Sir.","label":0},{"review":"Imdb rates this movie less than 6! It is a reflection of imdb's intellectual poverty. I love this movie. Must watch.","label":0},{"review":"Wonderful song....maine bhe es song gaaya apne utube channel pe....pl like an share my ides.....FAISAL NASEEM....","label":0},{"review":"Nice Movie for Entertainment and Same as Khatta Meetha (2010) Movie thank you so much all stars and Priyadarshan Sir","label":0},{"review":"Nice lite entertainer, struggle of normal middle-class indians for accommodation shown in euphemistic comedy drama","label":0},{"review":"It's nostalgic as I was in School then...What a feeling of those old days...","label":0},{"review":"Lovely film.repeatdly you can see.","label":0}]