[{"review":"Wow this is the one of my favorite movie I'm one of the lucky watching this movie in Theatre in 2002 it was fantastic movie really love this movie and super hit songs i love Kumar Sanu and Nadeen Shravan music I'm 15 year old that time 😍😍😍😍 i also crush with the heroin jividha in that time","label":0},{"review":"The songs of this movie are my favorite and I remember the actor and actress of this movie, after this movie i couldn't see them anywhere.Music is very good! Kumar Sanu is My Favorite Singer.","label":0},{"review":"This movie is very good and The songs of this movie are my favorite and I remember the actor and actress of this movie, after this movie i couldn't see them anywhere.Music is very good! Kumar Sanu is My Favorite Singer.","label":0},{"review":"This is my firstheart touch move and I enjoyed very much it,itis very nice move and it is very interesting that one always increase me to again and again,i would to salute that move actor and actors and also like to thank director and other that move guy's and all total fans,thank you very much,","label":0},{"review":"Nice movie. Love the story. Music is very sweet. Jodi is superb. Amazing love story. A true love should always be like this.","label":0},{"review":"Nice story. Music is very very sweet. The actors r superb. Most of all the performance of the supercute jodi is just amazing...","label":0},{"review":"M house wife \n   I so happy my life \n       So beautiful my family......?\nThanks for good this all avlable you have any questions you for mi.","label":0},{"review":"Lucky to watch this movie in theatre at that time. We were the last generation who witnessed good movies with lovely melodies.","label":0},{"review":"I watched this movie 12 years ago and some how I found this movie on YouTube today.i still remember how much I loved this movie and songs of this movie.one of the best.","label":0},{"review":"u r very luck  see in theatre . modern days  bollywoood  film is not good in this days.  good only in  yearly  1 or 3 movie .  not romantic  gud musc songs not found in this days","label":0},{"review":"Love this movie its romance specially its songs. All are best...  Nadeem shravan's luv them..","label":0},{"review":"Saw this film 10 years ago.\nStill remember how nice this movie was then.\nWill watch it again after my exams ;)","label":0},{"review":"One of my favorite movies. Nice love story.  I liked this movie alot.","label":0},{"review":"Still one of my fav movies...Music was excellent...Only 90's kids will know the importance of music in film..","label":0},{"review":"This film is a singing and love story favorite design , sine picture wonderful carrying successful as well as good and great pictures.....","label":0},{"review":"Yeh dil ashiqana is one of my all time favourite movie because in this movie my favourite hero karan nath I love this movie","label":0},{"review":"This movie is really 2 good and I like this movie specialily karan I really love u .this is my fvrt movie and songs really good love uu krn","label":0},{"review":"I love this movie, this movie is very romantic and action full and  every songs of this is most beautiful i love karan and pooja also of this movie","label":0},{"review":"Awesome movie. Nice songs. Action packed with nice story line.","label":0},{"review":"You're fantastic wonderful amazing beautiful movie superhit lovely& romantic movie,you are awesome mind bowling movie Guy's💕","label":0},{"review":"It was good movie I hope if part 3 will release than it will be seen by literate person .","label":0},{"review":"This movie is very interesting and it is so good that yesterday only I downloaded it and I watched the movie","label":0},{"review":"I loved this movie. I am watching again and again it. Songs are so nice.","label":0},{"review":"Yaa this movie is nice and also best fight against terijam \nI love it","label":0},{"review":"I love it i am big fane..\n in this generation we never see like this movie","label":0}]