[{"review":"Nice comedy, family film. Lots of gags to laugh at. Like \"Uncle Sawaal Dus Crore ka kyu band ho gya?\" or when Raj (Salman) teaches Bunty (Ajay Nagrath) to compose a copy of \"Karz\" song to secretly mock Rajesh (Rishi Kapoor). \n\nMusic is fantastic thanks to Himesh Reshammiya and Aadesh Srivastav.\n\nSalman is nice, Rishi, Anupam, are excellent! Ameesha Patel is just supporting actor...nothing much to do here for her.","label":0},{"review":"Wow so emotional and great movie ...I like the star casting of father and son  ie. Salman Khan & Rishi Kapoor . I loved that movie.","label":0},{"review":"I love this film bus especially the music directed and composed by Himesh Reshammiya","label":0},{"review":"This movie is fun, entertaining and li'l bit drama too.Very nice songs.","label":0},{"review":"Awesome movie and song is to good","label":0},{"review":"This film is very nice film.t his story is very good story.","label":0},{"review":"Awesome movie. Luv you Salman Bhai.","label":0},{"review":"What a movie!!!!!! If i get a chancr to watch a movie before dying i ll watch this.... If i get a chance to watch two movies before dying i ll watch this twice.....","label":0},{"review":"Nice movie.. It's interesting movie...","label":0},{"review":"Only she has  nack to carry herself very good when she wears micro skirts..","label":0},{"review":"Wah ...super.  And best","label":0},{"review":"Nice movie nd love you salman khan","label":0},{"review":"Sweet film evokes nostalgia","label":0},{"review":"I just love the music","label":0},{"review":"Nice song carbon copy I like this song","label":0},{"review":"Nice Movie salman khan","label":0},{"review":"Underrated movie not satisfied with the ratings on IMDB its an cult movie.","label":0},{"review":"I love my movie","label":0},{"review":"One of the Suprb movie of sallu bhai","label":0},{"review":"I love is because is salman khan","label":0},{"review":"So\n\nSo.beutiful movie.. kyon  ..ki","label":0},{"review":"I like this move and i love Salman Khan 😍😍😍","label":0},{"review":"I like this movie","label":0},{"review":"I watch this film becz of Salman Khan","label":0},{"review":"Based On Reality","label":0}]