[{"review":"My Review (28th Movies Review):\n\nVerdict - Hit\nStoryline - The main plot of this movie is about terrorist who apparently attacks mosque and temple, perhaps they kill innocent people, however the army has an task to arrest them, but the main charge of this mission is ajay devgan, however they only managed to arrest one person who was locked up in jail, but 6 months later, there is still other terrorist left who was part of the group of this person who was arrested 6 months ago, however these peop ...MORE","label":0},{"review":"My Review (28th Movies Review):\n\nVerdict - Hit\nStoryline - The main plot of this movie is about terrorist who apparently attacks mosque and temple, perhaps they kill innocent people, however the army has an task to arrest them, but the main charge of this mission is ajay devgan, however they only managed to arrest one person who was locked up in jail, but 6 months later, there is still other terrorist left who was part of the group of this person who was arrested 6 months ago, however these people make an plan to do something big, perhaps an attack in india if I say in this way, however in this movie, you will see that terrorism crossed the border from Pakistan to india in order to get to this country and they make an plan with other people who is involved with this mission to do something big like attack, however in india, there is another person who is police officer which is Abhishek Bachan, however he is engaged to bipasha basu who was closer to his family since childhood, but she does an job of flight supervisor, however the police are investigating the terrorism and they are also contact with the army, however they know that some people in this country are doing wrong stuff and they are probably terrorism, however soon they do start to work with army to investigate this problem which turns out to be mission because they want them to be found and locked in jail, however their plans did fail, but soon ajay devan comes to india and two people work together, but we also find out that from past life of Abhishek Bachan that he used be army, but did the job wrong, this is why he got kicked out by ajay devgan, but he need to prove himself in order not to be coward, soon they managed to find them, but failed to get them whereas these terrorism managed to get on an aircraft whereas bipasha basu is working there and they hijacked this aircraft, but all of these were done plans even-tough you will see that terrorism will have problem of escaping from police and making sure that their plan work because their is police who is looking for them, but these people has hijacked the aircraft because they want the army and the police to release the person from jail who is part of their group from 6 months ago which this event happened, however the police and army did make an plan to get all passengers out of the aircraft even-tough few people got killed, but at the end, they killed these terrorism, but in the movie, you will see that bipasha basu does get married to Abhishek bachan, however in this movie, you will learn that these people are wrong and muslim should not do wrong stuff, also attacking these religious place is not accepted.\nSongs - The beginning song was okay, but other songs was wasted in this movie and not interesting to watch for this movie.\nType of Movie - It is action movie and it is an movie which is like an mission with lots of drama taking place,but this movie does not engage you throughout, it is better to watch this daytime, but it is the movie of which you need to follow these mission, but there is not really an romantic, comedy and proper thriller in this movie.\nExtra Information - There is other people in this movie who are involved in terrorism of which you may not tell in this movie, but this is what you call this conspiracy.\nPerformances - All actors did okay for this movie, but ajay devgan did tried his best for this movie, this is all I can say.","label":0},{"review":"A very good movie done by rohit shetty but still I don't get the reason that why zameen became flop. Whenever I see this movie believe me I always have goosebumps","label":0},{"review":"Movie is well written, directed with good dilogues delivery. Ajay Devan  Abhishek bachchan played well matured role. Film had good continuing in the story.","label":0},{"review":"It is my favorite movie it is good movie\nI salute to those people who makes our lives safe ( soldiers, police officers)","label":0},{"review":"Zameen Is good movie of Abhishek in which he plays a mature role and also supported by Ajay","label":0},{"review":"Out of the movies which Ajay Devgan and Bipasha Basu had acted, I think this is the best Ajay Devgan and Bipasha Basu movie ever.","label":0},{"review":"I have seen this because of Himesh Reshammiya music.\nHimesh sir is always great music.","label":0},{"review":"Zameen movie is really a nice movie.\nI personally suggest ppl who didn't watch yet .. plzz watch...","label":0},{"review":"What a movie ajay Devgan is awesome . really look like the colonel","label":0},{"review":"It was a good movie,when ever the movie was shown on tv i always seen,but i dont know why the movie was not clicked.","label":0},{"review":"Super movie nice chemistry between Abhishek Bachchan and Ajay Devgan.","label":0},{"review":"It is the best \nI like this movie","label":0},{"review":"Very good movie \nAjay has done good acting.","label":0},{"review":"One of the best movies of Abhishek Bachchan.","label":0},{"review":"well made and very gripping","label":0},{"review":"Good for me both of them","label":0},{"review":"It is a stylish movie","label":0},{"review":"During for Indian army para sf \nWill be proud \nI am Indian","label":0},{"review":"Good movie 10/10 rating good rohit","label":0},{"review":"A brilliant movie by Rohit Shetty!\nGoosebumps! Goosebumps! And Goosebumps....","label":0},{"review":"Very good movie to watch.","label":0},{"review":"Simply superb","label":0},{"review":"Superb movie","label":0},{"review":"best movie by  ajay  and abhi","label":0},{"review":"Great movie.jai hind","label":0}]