[{"review":"Prakash mehra a great director who make amitabh bacchan angry young man. Ajit, pran sahab both are great actor. This combination make this film all time great. This is start to finish movie. Every frame of this movie result of hard work, brilliant mind of a director","label":0},{"review":"I am deeply impressed by old movies of Amitabh Bachan & Dharminder , as whenever I become sad or want to fresh myself , I start watching their super hit movies, no doubt people nowadays have the same thinking & that is why people have started watching the old movies on there TV etc.","label":0},{"review":"Film is useful for all!but now modern due to computer networking  in local area gram for example here Gokarna 581326 computer networking location ,in scientific way they must take a permission of printing press and call centres www's way all companies also co-optation with their condition due to Education of primary,secondary,higher secondary for future event'ual  television DD-1 Government and all companies television owners also co-operat with Hospitals because of main Vaidya Ayurvedic, Doctor ...MORE","label":0},{"review":"Film is useful for all!but now modern due to computer networking  in local area gram for example here Gokarna 581326 computer networking location ,in scientific way they must take a permission of printing press and call centres www's way all companies also co-optation with their condition due to Education of primary,secondary,higher secondary for future event'ual  television DD-1 Government and all companies television owners also co-operat with Hospitals because of main Vaidya Ayurvedic, Doctors Allopathic and homeopathic  patients,it is possible when we support first film actress actors male female  websites missunderstanding","label":0},{"review":"it's an awesome film.. i don't know why imdb rated it 3.4 only.. ram charan spoke hindi so fluently and in acting u r rocking #rc","label":0},{"review":"The Best film in Amitabh Bachchan,s career.The talent he has shown in film what He is & would be through out his carrier.Trend setter of angry young Man.","label":0},{"review":"Superb Movie. Awesome acting of Amitabh & Pran. A very good story.","label":0},{"review":"Great movie \nAngry young man #_Amitabh bachan(Insp Vijay khanna)\n#_Pran (Sher Khan ) and Ajith Khan ( Teja) \n    All characters are superb","label":0},{"review":"Big B 's acting excellent. Really he is Bollywood's father.\nGod bless him.","label":0},{"review":"Great movie, superb performance by Bacchan sahab and Pran Sahab , watched it more than 100times,","label":0},{"review":"One of the best movies of the time. Awesome acting. \n#Amitabh_era_begins","label":0},{"review":"Superb movie.excellent dialogues by amitabh and pran and also v good fight scenes.","label":0},{"review":"What a actor Bachchan sahab ! Living legend ! God always bless him","label":0},{"review":"Very pacing movie. It has equal proportion of romance, friendship, duniyadari and action","label":0},{"review":"The first hit of amitab angry style movie is great film","label":0},{"review":"Pathbreaking action movie with super dialogue and music also taut direction","label":0},{"review":"Awesome movie amitabh bacchan sir great 👍 movie sir salute u🤘🙏👌👌👌👌👌","label":0},{"review":"Very good movie and good acting of mr. Amitabh Bachchan","label":0},{"review":"GAwesome movie and great acting by the actors","label":0},{"review":"One of the best action movie","label":0},{"review":"V Nice  movie  & great  actors","label":0},{"review":"One of my favorite movies","label":0},{"review":"Great and landmark movie","label":0},{"review":"Good Movie because it depicts spirit to fight against Corruption supported by unconcerned leaders","label":0},{"review":"Great ashet of my life.","label":0},{"review":"Superb movie","label":0}]