[{"review":"I watched Zed Plus a few days ago on PrimeVideo.  Even though it is a few years old, it is quite relevant now with the elections coming up.\n\nOverall, this is an enjoyable watch with really good dialogues and a healthy dose of humour.  The acting is super, the cinematography and sets great.  \n\nA good movie.","label":0},{"review":"The movie is all about how the life of a common man changes due to politics.\nThere is a tussle between two parties and to create supremity one party plays minority game by giving Z plus security to a Muslim. And they plan as per their wish. But the common man's life becomes a burden to himself as his privacy has been affected seriously.\nAt last he decides to speak the truth and confess his own guilty but again he wins in election and again he was given z plus security.\nMovie is ok type not great","label":0},{"review":"This movie is awesome. I dint stop laughing for a single second. And aslam character was fabulous.sanjay mishra and mukesh tiwari was cherry on top for this movie.","label":0},{"review":"Hilarious movie with never a dull moment. The entire cast has performed brilliantly. Never mind the critic review. Just sit back and enjoy!!!","label":0},{"review":"Movie is Good, Characters shown are very Good, Things happening in the Movie are quite relatable in our society, but did not like the way it is justified that he was having an extra marital affair","label":0},{"review":"It is no doubt indeed that the concept of this movie is some thing new. I have liked it. Every body has contributed as per their expectation.","label":0},{"review":"Awesome experience, must watch, a comedy of errors shows indian social and political and family issues also. Quality acting, different storyline and brave direction.","label":0},{"review":"Every Muslim must watch this movie. An awesome way to show the reality of minority appeasement by political parties... Rather I would say, every Indian must watch this movie.","label":0},{"review":"Good movie...shows how life of common man changes after a simple incident...but the image of prime minister showed doesn't fit..as he can't understand hindi.All this aside,a good movie to watch,relevant to politics in country.","label":0},{"review":"It's a great movie. The satirical tone couldn't have been better. It's a must watch for indie movie lovers.","label":0},{"review":"Very good satire on politics. Each and every actor has done justice to the character. Can watch it again.","label":0},{"review":"An excellent satire on the malady afflicting the Indians in general, and politicians in particular-\"BLAME THY NEIGHBOUR\" for all ills plaguing the country","label":0},{"review":"My feedback is only that I could relate to this movie with my personal life and experience. 😃😃😃😃","label":0},{"review":"Really Nice Movie...\nStory is awesome and casting is also great.\nWorth watching...","label":0},{"review":"Really worth watching to understand how politicians use common people for their political gains and spread hatred in the society to win election","label":0},{"review":"Loved it. More satorical films depicting reality  like these should be made.","label":0},{"review":"Good movie to watch and decent comedy and create thrill","label":0},{"review":"Awsome movie","label":0},{"review":"Awesome movie","label":0},{"review":"Awesome movie","label":0},{"review":"Fantastic movie","label":0},{"review":"Mast movie showing the creation of use of security  with help of powerd ppl, and not getting genuine ppl","label":0},{"review":"Nice comedy","label":0},{"review":"Good movie","label":0},{"review":"Nice movie","label":0}]