[{"review":"A must watch movie if you are Emraan Hashmi fan (or even if you aren't). Plot and script is marvellous. Every character has justified their role beautifully. Superb suspense with a tremendous climax. You must go through the movie rather than reading the comments.","label":0},{"review":"Very interesting movie specially on the second half. Emraan just rock the actresses done a fare job. Mohit Suri proves us many times that he is one of the best director in Bollywood.","label":0},{"review":"It's a so much Fantastic Movie. in this movie, angry look of Emraan Hashmi looking so Fabulous. Everyone should watch this Fantastic Movie.","label":0},{"review":"Emraan hashmi rocked with his performance as Siddharth Mehra..\nShamita shetty also acted very good as Sonia Mehra..The plot, Music,cast  all were at top.. this movie was very engaging thriller and a good message of relationship between husband and wife...","label":0},{"review":"Awesome Experience And Thrilling Movie With Great Songs And Fantastic Acting By Shamita Shetty And Emraan Hashmi. A Must Watch For Me Anytime And For Everyone","label":0},{"review":"Amazing story with amazing screenplay. Some wont understand ever what's called a great screenplay. Songs are lingering melodies.","label":0},{"review":"Songs are very good in this movie. Story ending was not perfect. Average story but emran hasmi performed very good in this movie.","label":0},{"review":"This movie in 2005 and a movie year before that in 2004 as Murder both are blockbuster thrillers by Emran Hashmi.One must watch as these are moralable..","label":0},{"review":"I think this movie is very much better. I see this movie 50 time. And about this movie is fantastic entertaining. This movie is seen always new. This is perfect movie well done work by Emran hashmi ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤☺☺☺☺☺☺","label":0},{"review":"Nice Movie, I Like This Movie Songs So Much. \nMy Favorite Song *(Wo Lamhe, Wo Batain, Koi Na Jane)*","label":0},{"review":"I love this movie so much & Songs too, specially Agar Tum mil jao.","label":0},{"review":"'Agar tum mil jao' song & lyrics is so nice . 👌💞🎙️🎶🎶","label":0},{"review":"My best movie of all time I give 8/10 for this movie","label":0},{"review":"School memories ❤💜💗This is my first movie 🎬watching in theater..","label":0},{"review":"imran hasmi movies are always good....best natural actor in bollwood","label":0},{"review":"Very nice  song  is so cute and sweet","label":0},{"review":"I see this movie 60tym very nice movie I like it","label":0},{"review":"Agar tum mil jao it's very very beautiful song","label":0},{"review":"Romantic and awesome songs in  movie","label":0},{"review":"An awesome movie till date for me","label":0},{"review":"Songs are very good in this movie","label":0},{"review":"Very very nice songs this movie","label":0},{"review":"Wo lamhe song is the X-Factor of this film.....  That one song is enough to watch the film","label":0},{"review":"Songs are just mind blowing","label":0},{"review":"Awesome movie","label":0}]