[{"review":"One of my \"Must Like\" movies, this movie holds a very special meaning for me. I am lucky to have a few very important people in my life and I cherish every moment with them.\n\nThis movie is all about that. Its about friendship, falling in love, healing old wounds and facing our darkest fears. \n\nThe main characters have amazing chemistry, Javed Akhtar Sir's amazing lines and really chill music make this Road trip film one of the very best there is. And Hrithik and Katrina are bomb together!\n\nWatch ...MORE","label":0},{"review":"One of my \"Must Like\" movies, this movie holds a very special meaning for me. I am lucky to have a few very important people in my life and I cherish every moment with them.\n\nThis movie is all about that. Its about friendship, falling in love, healing old wounds and facing our darkest fears. \n\nThe main characters have amazing chemistry, Javed Akhtar Sir's amazing lines and really chill music make this Road trip film one of the very best there is. And Hrithik and Katrina are bomb together!\n\nWatch it and I can promise you you will love it!!","label":0},{"review":"Splendid! What an amazing work by JOYA AKHTAR!! This movie can definitely be enlisted in 10 best masterpieces of bollywood.**This movie has emotion,friendship,love,thrill and most importantly ADVENTURES!!!** Few scenes will give a chill thrill in your spine!!You are about to make the best decision of your life if you are thinking to watch this movie.Do watch it!! If you are not a bollywood fan this movie will eventually change your point of view. Have a life changing experience  :)\nLast but not  ...MORE","label":0},{"review":"Splendid! What an amazing work by JOYA AKHTAR!! This movie can definitely be enlisted in 10 best masterpieces of bollywood.**This movie has emotion,friendship,love,thrill and most importantly ADVENTURES!!!** Few scenes will give a chill thrill in your spine!!You are about to make the best decision of your life if you are thinking to watch this movie.Do watch it!! If you are not a bollywood fan this movie will eventually change your point of view. Have a life changing experience  :)\nLast but not the least 6 to 60 everyone can enjoy this movie and learn at least something.","label":0},{"review":"This movie spoke to my heart. The dialogue where Katrina Kaif said diving is like meditation, I felt it.\n\n Whenever you are doing something as life thrilling as sky diving or scuba diving, you are living in that moment alone. Between life and death, you do not care about your past or future, just that moment. \n\nThe movie teaches you so many amazing lessons. I would highly recommend it to those who lack the quality of appreciating what they have in the \"now\", yes it's for you guys!\n\nKudos to the  ...MORE","label":0},{"review":"This movie spoke to my heart. The dialogue where Katrina Kaif said diving is like meditation, I felt it.\n\n Whenever you are doing something as life thrilling as sky diving or scuba diving, you are living in that moment alone. Between life and death, you do not care about your past or future, just that moment. \n\nThe movie teaches you so many amazing lessons. I would highly recommend it to those who lack the quality of appreciating what they have in the \"now\", yes it's for you guys!\n\nKudos to the entire production team❤️❤️","label":0},{"review":"This movie is on top of my fav muvis list. Seen this muvi countless no. of times in this 7 yrs and i still love to watch it. Simple yet one of the most beautiful muvi based on friendship. Superb direction, acting, locations and background score. Hoping that Zoya Akhtar would come up with another iconic muvi like this but its tough bcz ZNMD has set a very high standard for her.","label":0},{"review":"Hey! I don't know where to start. I can't praise how good this movie is. It's been almost 8 years I am watching this movie. Mostly every Saturday night when I get the time I watch this movie to inspire and aspire myself. And I am not bored of it. This movie just give a rise to a real me inside me. You know what this is the best movie ever made about friends. This movie shows what real life friendship is. The acting in the movie is authentic. The locations were just awesome. I am so desperate to  ...MORE","label":0},{"review":"Hey! I don't know where to start. I can't praise how good this movie is. It's been almost 8 years I am watching this movie. Mostly every Saturday night when I get the time I watch this movie to inspire and aspire myself. And I am not bored of it. This movie just give a rise to a real me inside me. You know what this is the best movie ever made about friends. This movie shows what real life friendship is. The acting in the movie is authentic. The locations were just awesome. I am so desperate to go to Spain after watching this movie. The songs are very enjoying. And this  movie has every aspect of what a viewer is wanting in a good movie. This has drama, comedy, fun activities and mnay other things. I am a die hard fan of Hrithik Roshan. But without Farhaan and Abhay, the movie could not be any better. This is a must watch movie.","label":0},{"review":"I have watched this film more than 100 times. It's one of the best truly inspiring movie in Bollywood like others. It's should get a life time inspiring, meditating award. Whenever I am depressed just start the movie in my mobile and energised myself.\nEagerly awaiting the next one with the same cast and similar kinda story or may different but the friendship flavor should be there.\nBest wishes ZNMD.","label":0},{"review":"I've lost count of how many times I've watched this movie. The movie portrays about friendship, love, travel, forgiveness and to live life in real. Everyone played their respective role brilliantly. The quotes told by Farhan Akhtar in the movie in some particular scenarios are amazing! If this movie doesn't make you stand up for yourself and make you live life like you want to, I don't know what will. A must watch movie!","label":0},{"review":"\"Dilon mein tum apni betabiyan leke chal rahe ho toh zinda ho tum.\"\nThis is my all time favorite movie. I have watched this movie 100 times and still not bored. Whenever i fell low on life this movie motivates me to live life to the fullest. All the characters are my favorite but the bond between the three friends. Songs, dialogues and locations everything is perfect.","label":0},{"review":"I watch this film every time when it's played on TV as well as on my smartphone via jio tv. It's that kind of a unique film which is so cool and kind of different. It's not any stupid action film but a feeling that we all have went through, like a journey of laughter to emotions and happiness Brilliant movie, from music, the background score to songs and specially the acting in the background of Beautiful Spain was fantastic!!","label":0},{"review":"What a movie guys not movie life actually!\nA must watch movie.\nEach and every actors exactly depicted the behaviour,act...of the character throughout the movie indeed very realistic.\nThe place they go, the people they meet everything is amazing.\nThose language movements everthng between frnds are so much realistic.\nThis movie changed my perspective of life.\nInspires us to move out and make a change in.","label":0},{"review":"ZINDEGI NA MILEGI DOBARA \n(drama/romance)\nIts everything an adventure film needs to be with added bonus of romance and a little bit drama.\nThe direction is perfect.\nThe cast is fantastic, acting excellent.\nThe story has everything balanced, everything in the right amount.Feel good ×5\nOverall very good \nMy rating 4","label":0},{"review":"One of my all time favourite movies. Have lost the count of how many times I have watched this movie.\n\nKudos to Zoya Akhtar for making such a wonderful coming of age movie. I don't think there would be ever a road movie made like this again in Bollywood.. \n\nCan't even imagine how difficult it would have been to conceptualize and translate this story on screen. Hats off once again to the entire cast and crew and the director..","label":0},{"review":"This movie has an unique charm that you can't ignore.Tell me , what is missing in there? Love? Friendship?Betrayal?Sadness? No..it's all in there, all perfectly fused in a harmony that makes you forget how many  times you've watched this. Kudos to Zoya Akhter .I don't know what other people say but I'm gonna watch this movie atleast once every year","label":0},{"review":"It's an amazing movie . One of my favourite movie of all time. Actors acting were too good and too funny. Dialogues were motivational . Songs were real good . That comedy scene was very good specially when that man was in washroom and those three youngsters were doing prank with that man and that man got angry it was too funny. I was laughfing continuously. Too good. This good family drama","label":0},{"review":"This movie is really a masterpiece movie.The ways Zoya Akhtar presents the friendship bond between the 3 friends and their own  personal problems was outstanding . Comedy scenes were really good. Cinematography was also awesome and the locations were very colourful and gorgeous. This movie really deserves 10/10 stars.","label":0},{"review":"Beauuuuutiful movie.... One of my all time favourites.... All of them have portrayed their characters very life like. Even a small role of Naseeruddin Shah ji was so important & the main thing in the movie which I loved is say sorry when you mean it & comes from the heart.... The other person can see the apology in your eyes... Words & the way you say.... A small word but when said with meaning... Effective.... Have seen the movie umpteen number of times & plan to do so again & again & again...  ...MORE","label":0},{"review":"Beauuuuutiful movie.... One of my all time favourites.... All of them have portrayed their characters very life like. Even a small role of Naseeruddin Shah ji was so important & the main thing in the movie which I loved is say sorry when you mean it & comes from the heart.... The other person can see the apology in your eyes... Words & the way you say.... A small word but when said with meaning... Effective.... Have seen the movie umpteen number of times & plan to do so again & again & again... Coz.... Zindagi naa milegi dobara... 💞💞💞👍👍👌👌👌💞💞😍😍😍😍😍😍😍😍😍😍 Aur haan..... Ye bhi likha hua hai....!!! Suuuupppleeeerrrrrr movie... Awaiting your next Zoya.....!!","label":0},{"review":"Ya.Love this movie. And the comic punches that is given in between the scenes suddenly throughout the film.  Whenever the movie scenes going to describe the sad scenes then a comic punch appears to entertain. And its a movie that is based on reality and real life scenario. It teaches a lot .life is you will get once so enjoy it.    Dont mess work with your life.. 3 guys and their 3 stories","label":0},{"review":"U wnt beleive me.. But i watched this movie 17-18 times, honestly.. Really m nt joking ... Its one of the best bollywood movie i can say!... I really recommend u this!... U will love this.. Not love actually, if there is a better word than love.. Thn it is!..the main theme of the story is really good n each n every character put full efforts to make you feel.  Try this out.","label":0},{"review":"Every scene in this movie has its own beauty. This movie is made with full love and fun. when the cast shoot their scenes for the movie they really don't realize that there is a camera in front of them. That is what i love about this movie . Every scene is just perfect..","label":0},{"review":"only movie which completely describes about.. problems.. friendship..  life.. love.. money.. family.. this is the best movie for everyone.. for the one who is sad or depressed should definitely watch dis movie your face will automatically get a smile.. 😊 .. i watched this movie more than 50 times.. if u doesn't like this movie u really have to work over your maturity u don't knew about life if u ignore this.. must watch guys.. atleast once..","label":0},{"review":"Everything is awesome but what I liked most is being with friends in one of the most beautiful places on Earth, Spain, A dream come true for me, I can't live that life but seeing that just feels my heart with happiness of a lifetime, a truly inspiring movie, a movie done right, no complaints, perfect in every single way, thank you three musketeers 🖖","label":0},{"review":"It was a really nice film I would say. It teaches  people to enjoy each and every walk of their life in a fun filled way.Infact it is the best movie taken in order to eliminate fear so hence I would recommend other people also to watch this film \nseriously you'll learn a lot from life.","label":0},{"review":"This movie throws light on many aspects... But for me, the catch is Friendship!! We can breath love, trust, reliability, ability, independence in friendship is what this movie has made me realised..\nThanks to Zoya Akhtar and team to bring such a beautiful piece in our lives.","label":0},{"review":"Such  an amazing movie , one of my favourite movies . In simple words , this story is our story , I mean our young generation's story . A story of friendship, fighting, love, fear and most a story about life .  Every character is perfect and great 🙂 . Best movie 🙂🙂","label":0},{"review":"One of the best movies I have seen in my entire life. Both fun and so deep at the same time.  Actors' performances are outstanding and the plot is genius.  Absolutely loved it!","label":0}]