[{"review":"I like this film.this film is very inspiring consider me.and hope that peoples get connected to this film.and get some inspiration from this film.so,yaa i love to share my point of view.thax for reading my review.","label":0},{"review":"one of my most favorite films,its the story of a free spirited woman and what a free spirited woman has to face just because she had choices and she did not act as the society believes a woman should...for me zubeidaa at least tried to live a life of her choice ..no matter what it led to..lovely character ...always brings tears to my eyes...must watch movie!!","label":0},{"review":"I don't understand why didnt Karisma get National Award or any award which is bigger than National film award??? Anyways Karisma's work in the movie is like a Sky nobody can touch it nor reach it!! All the awards goes sink in front of her work!!!","label":0},{"review":"Loved the movie... specially the song so gae hain. The character played by Karishma is worth loving her decency touched my heart.","label":0},{"review":"Zubeida killed herself and her husband too, she was madly in love with raja victor!\nFavorite movie since 2006.","label":0},{"review":"The song so Gaye hain really heart touching song. Whenever I listen this song automaticly tears come in my eyes, so emotional music given by rahman sir.","label":0},{"review":"Beautifully crafted and Karishma Kapoor' s best movie till date!!! Loved all the characters especially Mandira Devi","label":0},{"review":"Zubeida character matches  with me I still think she should have refused to kings marriage proposal. Coz though he gave her happiness out of the world but later causing Misery wiped away everything!!!","label":0},{"review":"I have seen the most beautiful karishma in this movie as well as her awsm active must watch movie","label":0},{"review":"It is a beautiful emotional film. I liked all the characters. I will watch it again and again.","label":0},{"review":"I just loved this movie.....it's simply shows a emotional journey in many roles of a girl or woman.....but she don't get satisfied.......God DNT give this emotional pain to enemy also🙏","label":0},{"review":"Excee\nExcellent movie. Nice Acting by karishma","label":0},{"review":"Very nice movie. N also so गये है song is my fav","label":0},{"review":"One of the finest film of Indian film industry... A must watch","label":0},{"review":"One of the best movie of my most loved actress Karisma.","label":0},{"review":"Great movie an underrated gem of the indian cinema.","label":0},{"review":"The  song  in  this  mehandi  hai  Rachne  wali  is  so  good  so","label":0},{"review":"The story is incredibly awesome","label":0},{"review":"manoj bajpayee is the best actor in the world","label":0},{"review":"I have seen the movie so many times...Still can't get enough of it","label":0},{"review":"Awesome movie","label":0},{"review":"Searching this movie. Not getting anywhere","label":0},{"review":"its a beautiful movie...not like todays senseless movies","label":0}]